[
	{
		"id": 657,
		"title": "Keen 1 mod",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-18T13:23:37.000Z",
		"content": "I am planning on making a Keen 1 modification with Adis, to get her back into the mood of things.<br /><br />However, I have absolutely no idea what I'm doing at all and Adis is all mopey. Therefore I am asking you forumers as a whole for some tips on... well, everything, as well as suggestions for what you want to see in a mod.<br /><br />I leave the floor open to any and all suggestions.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 16840,
		"title": "ideas",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-18T17:21:44.000Z",
		"content": "just two quick suggestions, then I have to get back to my homework [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <br /><br />If you dont have any ideas yet for the story, it's always cool to see a story based around something mentioned in the original keen stories. Some that have already been used are: what happened to the vorticon mothership (levelords christmas mod), why the oracle council owed keen a favor (dont remember which one this was in), what happened to the shikadi after they left their korath base (perilous pursuit).<br /><br />Another good thing to see would be a mix of scenery; some indoor levels, some outdoor levels, some other kind of levels. And use lots of colors! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 16841,
		"title": "ooh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-10-18T22:13:14.000Z",
		"content": "Tzen mod!  <br /><br />Or, y'know, something else involving Vorticons.  They're awesome.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />Maybe use the palette-changing patches to work with Orange, Sky-Blue, and Forest Green.  A deeper Purple, too."
	},
	{
		"id": 16842,
		"title": "Re: ooh",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-10-19T04:20:57.000Z",
		"content": "Two things I suggest you focus on that are often overlooked are:<br /><br /><b>Interesting story</b><br />Take care with the storyline, but keep it simple and include elements of Keenish humour. Don't make it too deep and dark, but don't let it become too mindless and lighthearted either. Sprinkle sarcasm and puns with care, and remember Keen's cocky attitude.<br /><br />As says Xky, something with a Vorticon protagonist would be great. I look forward to what you come up with in this area.<br /><br /><b>Scenery</b><br /><br />A major downfall of many mods (including my own beta of Monky Business) is that the items are often the only form of decoration, and once they're gone there's nothing there to make the level feel alive and thus the game feels barren and uninteresting. Make the place feel like it has a purpose besides obstructing the player from his/her goal.<br /><br />Try to make things modular, so that you don't just end up with a chunk of tiles that always appear in the same order."
	},
	{
		"id": 16843,
		"title": "Tzen, eleven, twelve...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-19T17:00:28.000Z",
		"content": "I have a storyline partially constructed, it will be a single level mod, using a palette of Adis's and Tzen, which will mean extensive sprite deign. It shall have a halloween-guy fawkesish theme, just because.<br /><br />Thanks for the tips everyone!"
	}
]
