[
	{
		"id": 864,
		"title": "10,000 Days",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-21T05:13:04.000Z",
		"content": "<center><br />Listen to the tales and romanticize<br />How we follow the path of the hero<br />Boast about the day when the rivers overrun<br />How we rised to the height of our halo<br /><br />Listen to the tales as we all rationalize<br />Our way into the arms of the savior<br />Fading all the trials and the tribulations<br />None of us have actually been there<br />Not like you<br /><br />Ignorant fibbers in the congregation<br />Gather around spewing sympathy<br />Spare me<br />None of them can even hold a candle up to you<br />blinded by choices hippocrites won't seek<br /><br />But nothing but the collective judas'<br />Who could deny you were the one who would have made it<br />You'll have a piece of the divine<br /><br />This little light of mine<br />The gift you passed onto me<br />I'll let it shine<br />To guide you safely on your way<br />Your way home<br /><br />What are they going to do when the lights go down<br />Without you to guide them home to zion<br />What are they going to do when the river is overrun<br />Other than tremble incessantly<br /><br />High as a wave but i'll rise on up on the ground<br />You are a light, and a way, that they will only read about<br />I only pray, heaven knows when to lift you out<br />Ten thousand days in the fire is long enough<br />You're going home<br /><br />You're the only one who can hold your head up high<br />Shake your fist at the gates saying:<br /><br />I have come home now<br />Fetch me the spirit<br />The Son, and The Father<br />Tell them their pillar of faith has ascended<br />It's time now, my time now<br />Give me my, give me my, wings<br /><br />You are a light, a way<br />That they will only read about<br /><br />Set as i am in my ways and my arrogance<br />You were my witness<br />My eyes, my evidence<br />Judith Marie, unconditional one<br /><br />Daylight dims<br />Leaving cold flouresence<br />Difficult to see you in this light<br />Please forgive this bold suggestion<br />Should you see your maker's face tonight<br />Look Him in the eye<br />Look Him in the eye, and tell Him<br />I never lived a lie, never took a life<br />But surely saved one, hallelujah<br />It's time for you to bring me home<br /></center><br /><br /><br />[hr]<br /><br />[center][url=http://www.amazon.com/gp/product/B000EULJLU/sr=8-1/qid=1145596183/ref=pd_bbs_1/102-9471249-7562515?%5Fencoding=UTF8]May 2nd[/url][/center]"
	},
	{
		"id": 21704,
		"title": "Re: 10,000 Days",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-21T06:43:38.000Z",
		"content": "Spam-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 21705,
		"title": "Re: 10,000 Days",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-04-21T06:45:45.000Z",
		"content": "Indeed. Elitist spam, no less.<br /><br />To the Theater, O Great Admin.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]"
	},
	{
		"id": 21706,
		"title": "Re: 10,000 Days",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-21T12:14:50.000Z",
		"content": "Aaargh, it's stuck! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  Can I move it?3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21707,
		"title": "Re: 10,000 Days",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-21T13:08:40.000Z",
		"content": "Well the the first post challenge to discuss anything related to Tool so I think deleting would be better like we do with all worthless spam. EK can try it again in Theater if he's able to create 'a normal topic' without a sticky.-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 21708,
		"title": "Re: 10,000 Days",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-22T00:01:48.000Z",
		"content": "I agree, this certainly doesn't belong on the same page as the post \"I'm Hot?\"<br /><br />I see this as a piece of poetry, and since the album's not out, how can it be discussed? It doesn't fit in the Theatre.<br /><br />Considering all the silly and useless posts that proliferate this board, it seems a bit hypocritical to single out good lyrics as spam. Of course, I know why you did it, because I posted it, and you guys don't like me, but I would hope that next time you give something a bit more thought before jumping the gun and branding it spam. I was expecting comments about how good/bad the poetry is. I obviously expected too much from you guys.<br /><br />So here's my question: Do you guys think I'm hot?"
	},
	{
		"id": 21709,
		"title": "Re: 10,000 Days",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-04-22T00:17:19.000Z",
		"content": "Can't wait for this one.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21710,
		"title": "Re: 10,000 Days",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-22T02:12:56.000Z",
		"content": "Come to #keeners and wait no more [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 21718,
		"title": "Re: 10,000 Days",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-04-22T02:34:15.000Z",
		"content": "I didn't feel like reading the poetry. You see most poetry is pretty much \"emo\" and really... stupid. So now whenever I see something in verse my antiemo field raises and I usually skip it.<br /><br />Well not true... it's either \"emo\" or very poorly written. Now I am not saying your poem is poorly written OR emo at all. I am just saying I didn't read it and I had no idea what this thread was even about because I mostly skipped it.<br /><br />If it is that important to you I will read through it and give you my honest opinion on the piece.<br />And yes... yes you are one SEXY piece of MAN MEAT! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  Mmmm.... Maaan meat!-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://img360.imageshack.us/img360/548/blegdandsmeegnewbanner2wf.png[/img][/url]"
	},
	{
		"id": 21711,
		"title": "Uhuh.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-04-22T02:36:47.000Z",
		"content": "[hr]<b>eK</b> Of course, I know why you did it, because I posted it, and you guys don't like me<br />[hr]Actually, I singled it out because you made it a sticky, a blatant \"My Grand Opinion\" gesture. Now that it's just a regular post, I have no problem with it.<br /><br />I've not listened to much Tool previously. This sounds interesting, so perhaps it's time I investigate."
	},
	{
		"id": 21712,
		"title": "Re: Uhuh.",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-22T03:10:16.000Z",
		"content": "I stickied it just to temporarily move it up to the top of the stack for a day."
	},
	{
		"id": 21713,
		"title": "Re: Uhuh.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-22T08:18:23.000Z",
		"content": "Ek is t3h hots!<br /><br />But not really poetic.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21714,
		"title": "Re: Uhuh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-22T10:14:04.000Z",
		"content": "Well, I don't know what's poetry or not, and I mostly dislike whatever's called poetry.<br />Perhaps these lyrics are good for those who like this stuff, but personally I didn't like them (not only because I don't like poetry). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  I hate repeating like this: \"Give me my, give me my, wings\". I just don't like this song.<br /><br />Is this Gospel music? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21715,
		"title": "Re: Uhuh.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-22T17:16:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Of course, I know why you did it, because I posted it, and you guys don't like me, but I would hope that next time you give something a bit more thought before jumping the gun and branding it spam. [hr][/quote]<br />Booohoo. Hey eK, do you cut your arms?<br /><br />[quote]<b><i>Quote:</i></b>[hr]I was expecting comments about how good/bad the poetry is. I obviously expected too much from you guys.[hr][/quote]<br />Yes ofcourse, instead of looking at yourself you're pointing with yet again with your finger at us. Seriously, what did you expect? Your opening a topic out of nowhere in the wrong subforum. You give no information only a link where you could buy some cd. And your even so arrogant to make it sticky like we are all suddenly going to buy that cd from Amazon. If I was a Tool fan I would pay them much more respect with a better topic. <br /><br />[quote]<b><i>Quote:</i></b>[hr]I see this as a piece of poetry, and since the album's not out, how can it be discussed? It doesn't fit in the Theatre.[hr][/quote]<br />I don't see why it can't be discussed there since it will be out eventually and the Theatre was once meaned to discuss literature and poetry.<br /><br />[quote]<b><i>Quote:</i></b>[hr]stickied it just to temporarily move it up to the top of the stack for a day.[hr][/quote]<br />Now that's what I call a great excuse.<br /><br />[quote]<b><i>Quote:</i></b>[hr]So here's my question: Do you guys think I'm hot?[hr][/quote]<br />Well you really sound if like you feel fucked, so I'd say probably. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Is this Gospel music? [hr][/quote]<br />I don't think you're hot Keenrush but I do love you for this comment.-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 21716,
		"title": "Re: Uhuh.",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-22T18:30:16.000Z",
		"content": "I never get your posts Djaser....<br /><br />\"Booohoo. Hey eK, do you cut your arms?\"<br /><br />That's probably the most disturbing thing I've ever heard from you. It's a serious problem that some people have. I'm not going to justify your post with a reply, but I suggest you learn to tone down your hostilitity a bit and perhaps think before you say things.<br /><br />As for the lyrics, they're from the song 10,000 Days (Wings pt 2) and are about the death of the lead singer's mother, who was a devout christian."
	},
	{
		"id": 21717,
		"title": "Re: Uhuh.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-22T18:39:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]That's probably the most disturbing thing I've ever heard from you. It's a serious problem that some people have. I'm not going to justify your post with a reply, but I suggest you learn to tone down your hostilitity a bit and perhaps think before you say things.[hr][/quote]<br /><br />Yes some people have problems. Some people drink and smoke to much. Do you drink or smoke eK? I know that some people have serious problems with that beyond their help, but that doesn't count for all people. If that disturbs you, so be it but then you are easy to. <br /><br />Calling me hostile might be true but it's also very hypocrite from your side. Still I'm willing to tone it down if you try to post better topics.-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 21719,
		"title": "...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-04-22T19:13:48.000Z",
		"content": "Those lyrics read as if they're trying very hard to convey a message, but are so caught up in trying to dance around the irony and hypocrisy involved in communicating such a message that their overall effectiveness is diminished.<br /><br />The gist I got from it was that \"organized religion is full of lies and cannot save you // but this song can, because it speaks the truth.\"  That's a proud, arrogant statement.  Perhaps the music makes it better?"
	},
	{
		"id": 21720,
		"title": "Re: ...",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-04-23T03:26:22.000Z",
		"content": "The gist I got is that while many people may tell themselves that they're good Christians, but not be, his mother was actually quite devout. Evidently, he feels that she \"saved\" him, and wonders what everyone else will do without her to \"save\" them as well when the shit hits the fan. He also feels that she deserves to be in Heaven now.<br /><br />I think Tool must be better when you don't know what he's singing.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21721,
		"title": "Re: ...",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-23T06:00:29.000Z",
		"content": "wow Lemur, you nailed it, congrats. (seriously)<br /><br />it's much more powerful with the music though, very passionate."
	},
	{
		"id": 21722,
		"title": "Re: ...",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-04-24T04:09:04.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]wow Lemur, you nailed it, congrats. (seriously)<br /><br />it's much more powerful with the music though, very passionate.[hr][/quote]<br />Thanks. I've always liked Tool's sound, but they've never really made a big impression on me.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21723,
		"title": "Re: ...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-25T02:14:20.000Z",
		"content": "Meh, I don't like modern music and yrics, there's just so much crap out there you can't see the occasional glimpses of insight. I think the Rammstein, Knorkator, Queen [for a bit] and Savage garden put some meaning at least into their songs, and I've seen quite a few less popular bands, but so much music is so much white noise.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21724,
		"title": "Re: ...",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-04-25T03:49:00.000Z",
		"content": "Here's another one:<br /><br /><center><br />Eye on the TV<br />'Cause tragedy thrills me<br />Whatever flavour<br />It happens to be like;<br />Killed by the husband<br />Drowned by the ocean<br />Shot by his own son<br />She used the poison in his tea<br />and kissed him goodbye<br />That's my kinda story<br />It's no fun 'til someone dies<br /><br />Don't look at me like<br />I am a monster<br />Frown out your one face<br />but with the other<br />Stare like a junkie<br />into the tv<br />Stare like a zombie<br />While the mother<br />Holds her child<br />Watches him die<br />Hands to the sky crying<br />Why, oh why?<br /><br />'Cause I need to watch things die<br />From a distance<br /><br />Vicariously I, live while the whole world dies<br />You all need it too, don't lie<br /><br />Why can't we just admit it?<br /><br />We won't give pause until the blood is flowing<br />Neither the brave nor bold<br />The writers of stories sold<br />We won't give pause until the blood is flowing<br /><br />I need to watch things die<br />From a good safe distance<br />Vicariously I, live while the whole world dies<br />You all feel the same so<br />Why can't we just admit it?<br /><br />Blood like rain come down<br />Drawn on grave and ground<br /><br />Part vampire<br />Part warrior<br />Carnivore and voyeur<br />Stare at the transmitter<br />Sing to the death rattle<br /><br />Lie<br /><br />Incredulous at best your desire to believe in<br />Angels in the hearts of men<br />Pull your head on out<br />Your head believes it give a listen<br />Shouldn't have to say it all again<br />The universe is hostile<br />So impersonal<br />Devour to survive, so it is<br />So it's always been<br /><br />We all feed on tragedy<br />It's like bood to a vampire<br /><br />Vicariously I, live while the whole world dies<br />Much better you than I</center><br /><br /><br />This is the first single, which is actually on the radio now. Pretty political for them."
	}
]
