[
	{
		"id": 432,
		"title": "Announcing Keencast. Podcasting, Keen style",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2006-01-16T22:31:36.000Z",
		"content": "Ever since the Keen community newsletter was running I felt it was a great way to interact with the community as a whole. Now since the newsletter is gone (or maybe coming back, not sure) I want to take it to the next level. As you are not/are aware, podcasting is currently becoming the next big hit over the internet. In basic terms its like an internet radio show about anything. I then thought that since the newsletter is gone, this would be a great way to interact with the Keen community and just have fun. <br /><br />This podcast will deal with:<br />-community news<br />-interviews with other Keeners<br />-Fan creation of the week<br />-Email questions <br />-And Games for Keeners (other games that people might like to try)<br /><br />I'll be working with my friend who's fun to hang out with but doesnt really know much about Keen but I'll be training him no doubt [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]    <br /><br />I'm aiming for one episode to be released every two weeks and for the first episode we wont be doing any email questions. First episode is currently aimed for recording this friday if things turn out ok and hopefully it will be released this weekend if I'm lucky.<br /><br />So any comments?Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 12731,
		"title": "Re: Announcing Keencast. Podcasting, Keen style",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-01-16T23:00:36.000Z",
		"content": "I thought about this a LONG time ago but never said anything because I thought it would be rejected. But I am pessimistic that way.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]  Actually what you thought of is pretty much <b>exactly</b> what I had in mind. (Even the name) I gave it a lot of thought and came to this conclusion.<br /><br />I figured there wouldn't be enough support within the community to start a podcast. Also there isn't enough news happening to warrant a podcast. If you were to make one it would have be once a month or so to actually have enough content and not be empty junk. There simply just isn't enough happening to make one every week. (Unless it is very short)<br /><br />But hey if you put this together I wouldn't mind helping. Having a friend that doesn't know about Keen probably won't be good as a co host. You should get someone from the community to help you out. You should hook up with someone via Skype or some such program and record it like that. That was how I was going to do it.<br /><br />I am interested as to how you are going to be recording and distributing. Are you going to have a direct download or are you going to set up torrents? And how are you going to post them? Do you have enough bandwidth to allow many downloads of the Keencast? What bitrate and format are you putting them in? <br /><br />Sorry I am a little excited about this though.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] -----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 12732,
		"title": "Re: Announcing Keencast. Podcasting, Keen style",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2006-01-16T23:08:54.000Z",
		"content": "I thought about for the first few episodes putting it on my website then later maybe finding like another webhost or something (geocities really sucks). I did think that having a friend who didnt know much about keen would not be a good idea but then later thought it would be easier since it could be a twist to the pod cast, training some one to get into the keen craze or something. I would rather do it with someone from the Keen boards but I simply dont have the tools to do so. Besides my friend is a good enough gamer anyways and hes loves old school games. As for the lack of new news problem I dont think its gonna effect us much since its not only a news show and I'm aiming for each episode to be a half hour- an hour long ala diggnation (another great podcast). This is my first time trying a podcast so I hope it goes wellCheck out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 12733,
		"title": "Re: Announcing Keencast. Podcasting, Keen style",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-01-16T23:52:10.000Z",
		"content": "I just got one of those \"all-you-can-eat\" Dreamhost accounts on special offer, so I have plenty of space and bandwidth to throw at people. Email me at grafix5000 at gmail dot com if you want some space.[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 12734,
		"title": "Multimedia Cross-Platform Keenage",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-01-17T01:50:57.000Z",
		"content": "Interesting concept. I'm not sure whether there is enough to actually talk about to warrant anything more frequent than a monthly issue, though. Then again we do find some interesting stuff to talk about on MSN so perhaps you're onto something. I say definitely give it a shot. If it's still going once I've got a decent connection I'll contribute to the conversation.<br /><br />Seems there are alot of ideas floating around about how to replace/evolve the Keen newsletter. Last month I was working on a Keen diskmag which would basically be a multimedia version of the newsletter.<br /><br />There'd be a main menu with links to the various articles, and any MOD remixes of the Keen songs people might contribute along the way (I steer clear of MP3 for this sort of thing to keep the file size down). It would also be cross-platform, able to be compiled for DOS, Windows, *nix, BeOS and MacOS.<br /><br />Initially the idea was to compile fan fiction/art, info about current projects, tutorials about modding or creating fangames using various tools, and all sorts of other nifty stuff.<br /><br />I got to [url=http://jimsoft.spatang.com/keen/kdm/kdm22Dec05.zip]this[/url] point and sorta lost interest when I started thinking a website would probably be more convenient as far as accessibility is concerned, and that the font was too big for the watch screen (or the screen to small for the font).<br /><br />TmsT suggested covering fictional news about the different planets in the Keen universe, weather reports, etc. It would be a classy idea, and if anyone wants to write something along these lines, and convince me an offline diskmag (perhaps with the ability to download new content automatically) is more useful/classy than a website, I'll put in the effort to get the mag to a functional state and publish an issue.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 12735,
		"title": "Re: Multimedia Cross-Platform Keenage",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-17T06:11:23.000Z",
		"content": "Yeah, this is pretty cool idea! My voice sucks so I can't contribute to that, I'm sorry. It'll be interesting to hear, at least.<br /><br />And Spleen, I really like the diskmag idea, perhaps you could release at least one issue sometime. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I can try to help with the material.<b>Eat your veggies!</b>"
	},
	{
		"id": 12736,
		"title": "Re: Multimedia Cross-Platform Keenage",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2006-01-20T22:43:25.000Z",
		"content": "Update: The recording has been pushed back to tues/wed due due to my friend having to go to work tonight so to make up for it I'll try to have a special surprise up this weekend concerning a prequel to a certain story [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 12737,
		"title": "Re: Multimedia Cross-Platform Keenage",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-21T01:39:35.000Z",
		"content": "Yays!<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12738,
		"title": "Re: Multimedia Cross-Platform Keenage",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2006-01-27T05:06:19.000Z",
		"content": "Sorry for not updating soon. Couldnt record the podcast this week so far since I have exams at the moment and I've also caught a nasty cold. I rethought the whole release timetable and thought that maybe an episode a month sounds like a better idea due to the lack of news so far. As for the special surprise? Its all writen up on paper but have yet to type it up. Blame my addiction to Prince of persia: Two throne for the cause of the delay of the surprise [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  Anyways expect the first episode of keencast at least before the end of this month.Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	}
]
