[
	{
		"id": 234,
		"title": "Episode 2 and 3: Hard Mode?",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-03-14T07:11:13.000Z",
		"content": "Hey there, I've been away from the Keen community long enough that I'm a newbie again, so apologies for any potential breaks of etiquette.<br /><br />Anyway, I was just playing through The Earth Explodes, and the quandry of Keen's weapon hit me.  Having upgraded his old blaster to a stronger weapon capable of taking out a single Vorticon Grunt in one shot, we can probably estimate that his gun in these games is at least four times as powerful as in his first game, yes?<br /><br />So I was wondering if anyone had contemplated creating a \"hard mode\" of those games where Keen's old gun was used.  Grunts would return to requiring four hits to destroy, Vorticon Elite could take up to twelve shots to kill, and Vortininjas would require fifteen!<br /><br />I did a quick look around and couldn't find anything, and I also realize that this type of change would constitute more than a simple \"mod\" as it would fundamentally alter the attributes of most enemies in the games (and who knows what adjustments would need to be made as far as adding more ammo just to make it a fair fight).  Since I couldn't find it, and since it would be a pretty big coding job without a very noticeable difference to the game, I doubt anyone's tackled it yet.<br /><br />But if someone HAD then it'd be something that I'd be interested in.  Anyone know of such a thing?"
	},
	{
		"id": 6067,
		"title": "well",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-03-14T08:38:28.000Z",
		"content": "It'd be pretty easy to accomplish with a single patch, and I'm pretty sure LevelLord could create such a patch in about 30 minutes, given proper motivation.  :-)"
	},
	{
		"id": 6068,
		"title": "Re: well",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-14T08:44:02.000Z",
		"content": "I finished Keen 2 only two weeks ago for the first time so I don't think that I could play it.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 6069,
		"title": "Re: well",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-03-14T15:45:09.000Z",
		"content": "cool idea[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 6070,
		"title": "Re: well",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-14T19:24:59.000Z",
		"content": "Surprisingly many properties are pretty easy to change in Keens. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   All this can be done by changing only one value per enemy. There are patches for all these made, and should be found from Keen: Modding forums.<br />But making the foobs or vortikids require more than one shot isn't that simple, but not really even required in this kind of things IMKO, since they're pretty weak afterall.<br /><br />Oh, and welcome back, although I've never seen you, I guess.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 6071,
		"title": "Re: well",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-03-15T05:32:00.000Z",
		"content": "Thanks, but I was always pretty much a lurker.  I don't expect to be remembered.<br /><br />I guess I'd never really thought little variable changes were easipossible.  Last time I heard a mod pretty much used the exact same engine, but with different graphics."
	},
	{
		"id": 6072,
		"title": "Re: well",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-15T11:09:56.000Z",
		"content": "\"Last time I heard a mod pretty much used the exact same engine, but with different graphics.\"<br />Heh, that time is far behind. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 6073,
		"title": "Raygun Owns all!!!1",
		"author_id": 1486838,
		"author_name": "Captainkeen",
		"timestamp": "2006-06-17T21:02:22.000Z",
		"content": "I disagree, the ray gun in keen 1 is the strongest weapon in the game along with the pistol's in keen 2 and keen 3 which are equally strong. In keen 4-6 he has this loser monster-friendly stun ray gun [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  that can't even harm monsters stronger than a slug. The reason grunt in keen 2 only take one shot is because they are weaker than the grunts in keen1. I remember a description somewhere about them being less tough because of the luxury on the space ship,Also they aren't scout's like vorticons on mars but just average vorticons."
	},
	{
		"id": 6074,
		"title": "Re: Raygun Owns all!!!1",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-06-17T23:37:21.000Z",
		"content": "jeez you reply'd on a 3 month old topic [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]   just to say you hate keens stunner[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 6075,
		"title": "Re: Raygun Owns all!!!1",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-06-19T17:46:42.000Z",
		"content": "I'd tend to think that his gun in Keen 2 was an upgrade, not that he was fighting less powerful aliens.  If it wasn't a more powerful weapon, then why'd he bother switching guns at all?<br /><br />I'd also think that the neural stunner is an upgrade to his weapons in the original trilogy.  He doesn't actually have to overcome whatever resistances an alien has to be killed, just shuffle a few synapses around a bit.  Just as effective in the long run (except against arachnuts and birds and stuff), but less time consuming against the hard enemies."
	},
	{
		"id": 6076,
		"title": "Re: Raygun Owns all!!!1",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-06-19T20:26:02.000Z",
		"content": "Since this topic is back, I might as well weigh in.<br /><br />I always figured that the grunts were weaker than the Vorticons in Keen 1. I also assumed that he build his first raygun and found the second on the ship, but what if he just uses whatever is handy? Maybe the red gun is a Martian gun? The second is a Vorticon Hyperpistol, of course. The third is probably something he found on Vorticon VI. Notice that the ammo scattered around is specific to his gun, which would suggest that the guns are specific to the location he is in.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 6077,
		"title": "Re: Raygun Owns all!!!1",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-06-20T19:55:44.000Z",
		"content": "Memsys stop whining, this topic is 'only' a few months old.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 6078,
		"title": "Guns don't shoot people; I shoot people... I mean pictures",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-20T21:40:28.000Z",
		"content": "What L821 said.<br />Exactly what he said, actually.<br /><br />A raygun is relatively violent, and since Tom Hall wanted (wants) the Keen series to be child friendly, for Dreams and the later \"trilogy\" a more peaceful methods of disabling enemies was introduced.<br />The squishing of flying bugs is still pretty violent, but those are only bugs.<br /><br />There's a difference between killing a bug or a horse or a human for instance.<br />Usually killing bugs doesn't matter, killing horses or dogs is OK if they can't earn a living anymore in the case of horses, or in the case of dogs if they act like a regular dog instead of the men's-best-friend-version with most natural tendencies bred out, but for humans it's pretty much never OK, even if they can't earn a living either, or have rabies and hurt other people, or are criminals, or rape children, or if you just don't like them.<br />I'm getting slightly off topic here.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 6079,
		"title": "Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-21T11:19:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It'd be pretty easy to accomplish with a single patch, and I'm pretty sure LevelLord could create such a patch in about 30 minutes, given proper motivation. :-)[hr][/quote]<br /><br />Nope, like KR said, this'd be a sprite by sprite patching.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I'd tend to think that his gun in Keen 2 was an upgrade, not that he was fighting less powerful aliens. If it wasn't a more powerful weapon, then why'd he bother switching guns at all?[hr][/quote]<br /><br />Correct, while he has a blaster in Keen 1, it mentions in Keen Dreams that in Keen 2 and 3 he aquired a vorticon hyperpistol.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I'd also think that the neural stunner is an upgrade to his weapons in the original trilogy. He doesn't actually have to overcome whatever resistances an alien has to be killed, just shuffle a few synapses around a bit. Just as effective in the long run (except against arachnuts and birds and stuff), but less time consuming against the hard enemies.[hr][/quote]<br /><br />Keen Dreams also mentions the pistol has several settings, from 'stun' to 'disrupt' to 'fry to a golden brown' He uses the latter setting on two tater troopers.<br /><br />Now then, I've recently done an overview of the Keen 3 sprite properties; so...<br /><br /><i>#Make the Keen 3 enemies 4 times stronger:<br />#Strengths<br />%patch $3C58 $04 $00 #Vorticon<br />%patch $3D1C $20 $00 #Vortimom<br />%patch $3D84 $16 $00 #Meep<br />%patch $3DE6 $20 $00 #Vortninja<br />#Give other enemies Vort death and thus strength:<br />%patch $3CB5 $D0 $42 #Vortikid<br />%patch $3E43 $D0 $42 #Foob No longer dies when touched!</i><br /><br />*checks* Sadly Keen 2 hasn't as many strengths, but here:<br /><br /><i>#Keen 2 vorts are strong again!<br />%patch $3C22 $04 $00 #Vorticon</i><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6080,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1486838,
		"author_name": "Captainkeen",
		"timestamp": "2006-06-23T12:41:19.000Z",
		"content": "Correct, while he has a blaster in Keen 1, it mentions in Keen Dreams that in Keen 2 and 3 he aquired a vorticon hyperpistol.<br /><br />So just because it's mentioned in keen dreams means it's stronger? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  Vorticon VI whas also mentioned in keen dreams, thats means it's stronger to? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]"
	},
	{
		"id": 6081,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1486713,
		"author_name": "Eazyjay",
		"timestamp": "2006-06-30T22:27:53.000Z",
		"content": "People people why are we discussing this? I thought we were all Keen experts here? Obviously Captainkeen and Retodon are right, as it clearly says in the manual of the games: <br /><br />[quote]<b><i>Quote:</i></b>[hr]Episode 1:<br />Vorticons: The Vorticons on Mars are members of a Mars outpost and are really on the bottom rung of the Vorticon social ladder. Being on an outpost has made them kind of tough. <br /><br />Episode 2:<br />Grunts: These are the Vorticons from Episode One, but they have led a more posh lifestyle, so they are weaker.[hr][/quote] <br /><br />Oh and neural stunners are for wimps[img]http://img.villagephotos.com/p/2004-8/801878/Ezlogo2.jpg[/img]"
	},
	{
		"id": 6082,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-07-01T14:15:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]So just because it's mentioned in keen dreams means it's stronger? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  Vorticon VI whas also mentioned in keen dreams, thats means it's stronger to?[hr][/quote]<br /><br />No, but we can assume an advanced alien hyperpistol is more advanced and powerful than those Keen found on Mars. [I mean look at the state or martian robotics!]<br /><br />I like EazyJay's explaination though.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6083,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-08-10T21:12:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Anyway, I was just playing through The Earth Explodes, and the quandry of Keen's weapon hit me. Having upgraded his old blaster to a stronger weapon capable of taking out a single Vorticon Grunt in one shot, we can probably estimate that his gun in these games is at least four times as powerful as in his first game, yes?<br />[hr][/quote]<br /><br />Actually, this is wrong.<br /><br />That's the difference between Grunts and Vorticons.<br /><br />The blue Vorticons are stronger because they <i>are</i> physically stronger than the others.<br /><br />How do you think the Vorticon Master in CK1 was created?  By eating milk and cookies?<br /><br /><br />The blue ones are the Vorticons traders and soldiers.<br /><br />(It even says so in one of the Keen1-3 games, I thought)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 6084,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-11T08:32:56.000Z",
		"content": "Hey, don't pish-posh milk and cookies; Vorticons had never had milk and cookies before, it did them a world of good.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6085,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-11T11:01:59.000Z",
		"content": "Vorticons are mammals, or so it seems, so they were probably breast-fed when they were young.<br />Milk generally isn't healthy for adult animals, although some humans seem to have mutated and are able to process it.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 6086,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-08-11T17:57:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Milk generally isn't healthy for adult animals, although some humans seem to have mutated and are able to process it.[hr][/quote]<br />Not me... I find milk to be rather... nasty...<br /><br />Sure I can drink it but I would rather not.<br /><br />It's so... icky.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 6087,
		"title": "haha",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-08-11T19:36:16.000Z",
		"content": "The colder, the better.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  I love frosty-chilled whole milk."
	},
	{
		"id": 6088,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-08-11T21:50:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Milk generally isn't healthy for adult animals, although some humans seem to have mutated and are able to process it.[hr][/quote]<br />Isn't that fascinating? I was just reading about it the other day. Apparently in areas where cattle herding was important, the people adapted to continue producing lactase all their lives rather than stopping at weaning age, allowing them to continue digesting milk.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 6089,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-12T09:06:04.000Z",
		"content": "Indeed. Lactose intolerance is actually most likely to have been the origional human condition, although the fact that many native populations that were never exposed to milk also have high lactose tolerance throws doubt on how prevalent it was.<br /><br />Note however that we have no proof that vorticons are mammals, we merely assume they are. From the vortimoms we can assume that its *possible* they were breastfed. However Vortiocns have never been exposed to cow mik, nor the nutritious snack known as 'cookies' Exposure to these two superfoods causes a great increase in strength and endurance for them, and even today nobody is allowed to import either snackfood during any athletic event.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6090,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-08-12T19:40:34.000Z",
		"content": "Two things about that, LL:<br /><br />One, Vorticons women have breats.<br /><br />Two, why would something have boobies unless they lactate?<br /><br /><br />They obviously don't hatch their young, LOL.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 6091,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-12T20:37:47.000Z",
		"content": "Lactose intolerance is an akward name for it.<br />I read it being called a food allergy too, but it has nothing to do with allergies.<br />You don't say people are posion intolerant, and people aren't allergic to acid either, they're simply not intended to feed on some things.<br />Try feeding an adult mammal milk, use their mother's if you want to, even their own, and you'll find they won't be able to handle it.<br /><br />Babies aren't really the same creatures as their adult versions, they are built for a different purpose.<br />Once someone/thing is an adult, there's no need to grow anymore, so they change physically, and one of those changes is losing the ability to process milk.<br /><br />I understand it's mostly Caucasians (another word that makes little sense for what it is) who evolved to process milk.<br />It's the same group who introduced blond hair, another genetic mutation, so maybe they just like change a lot. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 6092,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-13T01:27:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]One, Vorticons women have breats.<br /><br />Two, why would something have boobies unless they lactate?[hr][/quote]<br /><br />Noting that prominent breasts are a feature only of humans and a few other species, also noting that others have prominent breasts during lactation only.<br /><br />We cannot assume evolutionary wise that just because breasts here have evolved for lactation that a totally unrelated alien race will have evolved them for the same purpose. They may be for example glands of fat storage. Possibly something to do with the ability to breather fire, since males cannot apparently do this.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You don't say people are posion intolerant, and people aren't allergic to acid either, they're simply not intended to feed on some things.<br />Try feeding an adult mammal milk, use their mother's if you want to, even their own, and you'll find they won't be able to handle it.[hr][/quote]<br /><br />On the contrary, while poisons cause negative effects on metabolism, by say, interupting an enzyme, lactose *intolerance* is merely the inability to metabolize lactose, much like we cannot metabolize celulose. Thus it remains in the gut and is consumed by bacteria and *this* is what causes the negative symptoms. Thus it is a true intolerance, and not a poison.<br /><br />There is an enzyme avalible you can mix with your milk to make it drinkable by these people.<br />[quote]<b><i>Quote:</i></b>[hr]<br />I understand it's mostly Caucasians (another word that makes little sense for what it is) who evolved to process milk.[hr][/quote]<br /><br />Incorrect, the origin of them lactose tolernace mutations were 'black' Also many noncaucasian races are lactose tolerant, and also many that have not been exposed to agriculture, which raises interesting questions.<br /><br />[quote]<b><i>Quote:</i></b>[hr]It's the same group who introduced blond hair, another genetic mutation, so maybe they just like change a lot.[hr][/quote]<br /><br />On the contrary *again* Blond hair has beena round a long time. Black hair is also a 'mutation' albeit longer lasting than blond. [Few chi,ps are black] Blond hair helps an individual aquire vitamin D, like pale skin [Otherwise we'd all be black]<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6093,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-13T16:34:57.000Z",
		"content": "About your metabolization cmment:<br />I thought about comparing to eating sand or something, couldn't find a decent example, but on second thought it would've been better than poison.<br /><br />About blond hair, \"a long time\" is relative obviously, as for black hair being a mutation... then what is the original hair colour?<br />I suppose hair itself is a mutation (from my perspective, this is too much of a stretch for creationists to agree with I think), so perhaps my question is moot.<br /><br />As for the rest, I'll take your word for it, at least until I do some more research, which I really don't feel like doing right now. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 6094,
		"title": "Re: Rayguns don't kill people, falling of levels does!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-15T06:10:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I thought about comparing to eating sand or something, couldn't find a decent example, but on second thought it would've been better than poison.[hr][/quote]<br /><br />Indeed, there are four basic classes [in NZ legislation] Food [provides nutritional benefit] supplement [no vital nutritional benefit, but still at least possibly beneficial] filler [no nutritional benefit, no negative effects, e.g sand, cellulose binder] and toxin [negative effects] In this milk is generally a food, but *can* be a toxin.<br /><br />[quote]<b><i>Quote:</i></b>[hr]About blond hair, \"a long time\" is relative obviously, as for black hair being a mutation... then what is the original hair colour?[hr][/quote]<br /><br />Brown. Thus black, blond and red are 'mutations' with red being oldest [Oldest to become established in a population rather than a freak occurence]<br /><br />[quote]<b><i>Quote:</i></b>[hr]I suppose hair itself is a mutation (from my perspective, this is too much of a stretch for creationists to agree with I think), so perhaps my question is moot.[hr][/quote]<br /><br />Well, I dunno; humans are hairy all over, just like most mammals. Longer hair in places isn't really that new.<br /><br />[quote]<b><i>Quote:</i></b>[hr]As for the rest, I'll take your word for it, at least until I do some more research, which I really don't feel like doing right now.[hr][/quote]<br /><br />Aaah, lazyness, the wroking girl's best friend!A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6095,
		"title": "Falling of levels does not, hinds does!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-15T15:23:00.000Z",
		"content": "Brown before black?<br />OK, if you say so. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />Black hair is just brown anyway, black as a colour doesn't exist, because that'd mean all the light was absorbed, and we wouldn't be able to actually see the hair.<br /><br />With the \"hair itself is a mutation\" I was referring to more than just humans or mammals.<br />Life didn't start out like that, things only got hairy after a while.<br /><br />And uhm, I'm not a working girl, if you were implying that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />I am however laz... efficient, or I try to be.<br /><br />I only just noticed the subject you made, but... falling of levels doesn't kill people, at least not in Keen.<br />It does stun Nosespikes, but only them.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 6096,
		"title": "Placing an uncahched sprite doesn't kill people, I do!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-16T08:05:32.000Z",
		"content": "Indeed, brown before black; quite distinct *from* black. Apparently this is due to camoflage. Given how badly humans stick out, I can't quite see how this works myself.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Black hair is just brown anyway, black as a colour doesn't exist, because that'd mean all the light was absorbed, and we wouldn't be able to actually see the hair.[hr][/quote]<br /><br />Incorrect, there has been developed a substance called nightlight, its nickel powder on nickel and it absorbes 99% of all light. We can see something that reflects no light; our eyes register no reception, and thus we see an object by its 'absence' After all, do we see dark black paper less well than a white sheet?<br /><br />On the other hand, if it had a pattern apon it, it was a 3D object; it would be haed to see it as it'd all be black, not shaded like normal things. We'd still see its outline though.<br /><br />[quote]<b><i>Quote:</i></b>[hr]With the \"hair itself is a mutation\" I was referring to more than just humans or mammals.<br />Life didn't start out like that, things only got hairy after a while.[hr][/quote]<br /><br />Actually, as single cellled life, it did. Also, many fish have 'hairs' of various forms and uses. Hair has a long history.<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
