[
	{
		"id": 998,
		"title": "10000 posts + \"Goodbye!\"",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-29T19:52:06.000Z",
		"content": "..is something I will never say! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  Hahaha..<br /><br />Anyways, I've reached one milestone on the path to 100000 posts. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] <br /><br />Here's small speech I made up:<br /><br /><br /><br />Greetings Keeners.<br /><br />I just opened my profile and looked at the date I joined this board. March 16, 2002. Some time before that I had thought about searching if there's anything Commander Keen related in the internet. I found some fan site, can't remember what it was, and was amazed that there are other people that remember this classic! Soon I found about Commander Keen Newsletter site, and these forums. I was totally amazed; wow, Keen lives! First I decided to browse around the forums, which I did. Originally my plan was to be a lurker. I hadn't much experience of forums, and at that time I didn't even like them much.<br />But then, I remembered my life long dream of editing Keen. I downloaded a level editor, an ASCII based DOS editor. Too bad I don't have my first level anywhere, but it was awesome to start Keen, and see the modified level. That was something like a dream come true.<br />Then I started to search for a way to modify the graphics. I searched all over the sites and forum, but found nothing. So, I had only one option left: To join the board and ask if there's such tools.<br />I started to register an account. What could I call myself? I had no idea. I thought something with 'Keen' in it could be nice. I was really eager to get rid of the registering form and post my question. I added 'Rush' to the name. Ok, complete..<br />Then, posted my first post and asked if there's any tools for editing the graphics. If I remember adurdin said something \"not yet\", then someone said something like \"working on something, andy?\", then adurdin said something like he might get something done and so on. I replied something like \"that'd be awesome\". Soon was modkeen's first version out. It could only handle the tile graphics, and didn't work with Keen 1 yet. Can't remember what it was called, but I think I still got it on the old computer's drive. Not long after the modkeen capable of editing the sprites and tiles appeared. N-i-c-e!<br />I started immediately the work on some project. It was a Blade mod. After some time I thought that maybe I won't get the Blade movie feeling into Keen that easily, and started to work on something other. Maybe even Yorphius II. During all these years I've had very big bunch of projects, most of them stopped and deleted.<br />At some point I started Yorphius II, even finished it, and it was the world's first Keen mod. I was proud of it at that time.. Naturally Keeners liked more Xky's awesome work (XkyKeen1). If I remember correct people said Yorphius II was hard. After that my skills have developed on graphics and level design, as well as the Keening skills, and I've done a bit more difficult stuff..<br />At some point of time I wanted to open my own Keen site. It was called \"Commander Keen Vault\". I've done several redesigns for it, although it has never looked very professional.. At some point I wanted to get a domain and some bigger site, and bought keengrid.net. I just paid my third bill for the hosting, so the third year of the Grid is about to start soon. Yeah, I should update it soon, I'm lazy as a garg..<br />Anyways, I've done allkinds of Keen related during my time here, and will do in the future as well. I'm happy I've been able to be here and play the cool mods, help in Newsletter, be a moderator etc..<br />The forum has been important part of my life. I've cheked it daily, and if someone could read all my posts he/she would know me almost as well as I know myself.<br />I hope all the good for the community. I want to see more awesome stuff! Keep up the good work.<br /><br />Let's Keen on! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />And just to make sure if someone didn't get it: I am NOT going to leave, the title was just a joke and a way to get your attention and make you first think I'm leaving. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23728,
		"title": "wow",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-10-29T20:14:47.000Z",
		"content": "Holy crap, KeenRush, you're huge now!  *looks at KR blimp in the sky*<br /><br />:-) Congrats on 10k, dude.  That's awesome.  I remember Yorphius II vividly, because it came out as I was putting the finishing touches on XkyKeen1, and I said to myself \"Oh, crap, this is really good--I have to add something to my mod!\" and I added the Mortimer on the title screen.  Hahaha<br /><br />I liked Yorphius II, because it had floating deathtiles which were very easy to distinguish--a lot of deathtiles in other mods are ambiguous, or don't take up their full square, so a player can die by touching mid-air.  Yorphius II really let us know when something would kill us.  Thanks for that... because I did die a lot going through it. ;-)  But you had excellent scene changes throughout it--the pillars and ruins, the lush greenery, the big pools... it was well balanced, and had a good feeling to it.<br /><br />And you totally forgot to mention episode Smile on your list!  You've started and stopped countless mods, for whatever reason, but you finally managed to squeeze out Smile.  I think EzJay and LevelLord were the only two who could beat the whole package without cheating, but damn man--that's something to be proud of.  You not only found the full potential of evil jump traps and cruel level design, but you streteched the poor color green to its limit.  :-)  Thanks for doing this.<br /><br />Congrats again on 10k, and I hope you stick around for a long while.  [img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 23729,
		"title": "Re: wow",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2005-10-29T20:33:12.000Z",
		"content": "sigh, ill never get that far!<br />oh well, keen lives![img]http://www.greenftechn.com/brandon/mecpwk.swf[/img]"
	},
	{
		"id": 23730,
		"title": "Re: wow",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-29T22:17:05.000Z",
		"content": "I'll get to 10000 eventuly...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]    (unless KR kills me.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  )<br /><br />Nice job at getting 10000, KR![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 23731,
		"title": "Re: wow",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-30T00:11:49.000Z",
		"content": "Awesome. I wish I was as dedicated as you.  Meh, I've only been loyal to one forum in my entire life and I got a maximum of I think 2,300 posts.  (Which I quit last October and that's why I've come here).~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23732,
		"title": "Re: wow",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-10-30T00:26:45.000Z",
		"content": "Woo! Gargs for everyone! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />Congratulations, KeenRush. Maybe in 20 years I'll have as many posts as you. Too bad we don't have your very first post to look back on anymore.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 23733,
		"title": "Re: 10000 posts + \"Goodbye!\"",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-30T01:11:31.000Z",
		"content": "Damn KR, you did get me with the \"Goodbye\" bit - your posts are always worth reading, it'd be a great loss to this forum if you did ever decide to go...!<br /><br />On a more cheerful note, I remember your first post!  It's a shame we can't look it up in the archives any more.  I remember thinking at the time how you sounded like you were quite new to the forum thing, being extra polite and all.  You were always thankful whenever someone replied to a post you'd made, like you were surprised they'd taken the time to answer you!  Something that's obviously done you some good, working your way up to being a moderator now, and a damn good one at that!<br /><br />Congrats on 10K, and I look forward to seeing you reach 20K! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 23734,
		"title": "RUSH ON!!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-30T03:25:29.000Z",
		"content": "Happy 10K!<br /><br />March 16, 2002? That's like 3000 posts a year. You're like ten members in one. This forum would definitely be alot emptier without ye. Go team!<br /><br />You almost had me too on the title.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Nice one. Here's to the next few years and the next 10,000 posts, some of which will hopefully be used to comment on the release of the Keen source code! *raises glass of Everclear*<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23735,
		"title": "Re: RUSH ON!!",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-30T04:38:17.000Z",
		"content": "Cheers![url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23736,
		"title": "Re: RUSH ON!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-30T06:42:21.000Z",
		"content": "Holy Keen!!!<br /><br />That, \"I want to just get done with this registration screen\" stunt really created a Name all keeners look up to!!!<br /><br />KeenRush!!!<br /><br />RUSH ON!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]I added the Mortimer on the title screen. Hahaha[hr][/quote]<br /><br />And thus you became Morts Right-Hand Man?<br /><br />[quote]<b><i>Quote:</i></b>[hr]I'll get to 10000 eventuly...<br /><br />(unless KR kills me.  )[hr][/quote]<br /><br />Well... just don't make 10k your lifes mission!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]March 16, 2002? That's like 3000 posts a year. You're like ten members in one. This forum would definitely be alot emptier without ye. Go team![hr][/quote]<br /><br />Or one Harvey [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]On a more cheerful note, I remember your first post! It's a shame we can't look it up in the archives any more. I remember thinking at the time how you sounded like you were quite new to the forum thing, being extra polite and all. You were always thankful whenever someone replied to a post you'd made, like you were surprised they'd taken the time to answer you! Something that's obviously done you some good, working your way up to being a moderator now, and a damn good one at that! [hr][/quote]<br /><br />Then there is hope for me. I used to be like that, but when I relized I was in the midst of a huge community with a huge range of belifes, and all of them were being hotly debated, I threw off Mr. Nice Guy, and put on my pink shirt!!!Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23737,
		"title": "Re: RUSH ON!!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-30T09:04:14.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Thanks everyone!<br />*drinks a bit Everclear*<br />It's cool that someone actually remembers (or has even seen) my first post. Nice. Too bad we can't see the old messages, I'd like to see the original Yorphius II beta topic etc..<br />I hope to do some more work on Grid this year.. It's just annoying because I can't get stuff designed, can't decide anything! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23738,
		"title": "Re: 10000 posts + \"Goodbye!\"",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-30T09:30:04.000Z",
		"content": "I hope ezboards won't crash when you'll reach the 100.000 posts. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23739,
		"title": "Re: 10000 posts + \"Goodbye!\"",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-30T09:44:16.000Z",
		"content": "Yeah, but thats at least 3 years away yet.<br /><br />I've hardly reached a third of your posting KR, but dammit, I'll get there eventually!A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
