[
	{
		"id": 6250,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6251,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6252,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6253,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6254,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6255,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6256,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6257,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6258,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 6259,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 245,
		"title": "XkyKeen4 discussion thread",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-01-03T19:59:57.000Z",
		"content": "Hmm.  It's a new year, time for resolutions.  I've got to think long and hard about this XkyKeen4 thing.  First things first: <i>I am going to make it.</i>  I know I will.  I'm thoroughly committed to this community and want to share my vision of Keen with you all.  However.  <i>I'm not sure now is the right time for it.</i>  I don't feel like I'm doing the right thing here.  <br /><br />When I made my Keen1 mod, it was something new and exciting, a Pandora's Box of possibilities and rampant expectations.  I'd say my first mod was little more than a level pack with some graphical refinements.  XkyKeen2 on the other hand is what I consider a <b>real *mod.* </b> Start to finish I did my best to present a complete episode of Keen as it played in my head... I'm extremely proud of it, and hope you all enjoyed playing it as much as I did creating it.  <br /><br />XkyKeen3, on the other hand, I'm not quite as proud of.  Rather than being a <i>complete episode and vision</i> of Keen, it feels to me that it's nothing more than an elaborate gimmick or two stitched together in a loose framework.  The \"beat the level fast\" idea was neat, the \"all environment tiles without the color back\" idea was neat, the \"mosaic'ed sky\" idea was neat, and the way I modded each enemy made a reasonable amount of sense (to me)... but the whole episode feels a bit <i>off</i>.  Keen collecting <i>money</i>?  Galactic <i>gameshows</i>?  Changed point values?  I don't know.  It all feels rushed and incomplete to me; as if the whole thing was a foggy day.<br /><br />When I first modkeen -e'ed Keen4, I'm not really sure what I was thinking.  Rather than say \"here's where the episode begins, here's the trail Keen needs to achieve, here are the difficulties he'll face, and here's where the episode ends\" I found myself wondering \"What the Billy Blazes am I gonna do to replace this freakin' Arachnut?  The son of a gun's got just 4 frames that need to work for moving both left AND right!\"  Rather than wonder what kind of story involves 8 go-fetch trials, I was quagmired in the realization that I didn't have a story to tell <i>at all</i> this time.  I've run dry.<br /><br />So I'm asking you, the Keen Community... where do <i>you</i> guys get the inspirations for your mods?  What do you do when you get stuck?  How do you fight the jealously and jaw-dropping <b>despair</b> that comes whenever another Keener releases a fantastic new mod?  (Benvolilord's Christmas mod blew my mind today)...<br /><br />I'm thinkin' I need to take a break from my modding folder.  Not that I've done much in there lately anyway (my pogo frames are a flippin' <i>disaster</i> right now, and I've revised them 9 times already) but I didn't want to just drop my mod without telling anybody anything... So as of right now, XkyKeen4 is on the back burner... <i>but</i>:<br /><br />My new year's resolution for 2005 is to complete XkyKeen4 by 2006, <i>and</i> for it to be of the same quality as XkyKeen2.  Wish me luck; I'm a procrastinater.  :-)<br /><br />--Xky[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 6231,
		"title": "Re: XkyKeen4 discussion thread",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-01-03T20:09:58.000Z",
		"content": "I have so many ideas for mods that play out nicely in my head, but turning them into mods is hard. I can't really draw well, so I end up sitting down looking at other people's mods and asking myself \"How do they do it?\"<br /><br />From what I understand, modding Keen Galaxy and Aliens is more of a challenge than Vorticons. Since the graphics, sprites and levels of Vorticons are simpler to start off with, this makes them better for modding.<br /><br />Sad to hear that XkyKeen4 is on the back burner, but better to have a good, finished mod and wait for it rather than a bad mod quickly.<font color=\"BLACK\"><br />My [url=http://kevan.org/brain.cgi?grafix5000]MindBending Power[/url] is 5.43 points.<br />Go to [url=http://www.toxicsheep.com]www.toxicsheep.com[/url] to see my site!<br /></font><br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 6232,
		"title": "Re: XkyKeen4 discussion thread",
		"author_id": 1486686,
		"author_name": "DasBrot",
		"timestamp": "2005-01-03T20:17:54.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What do you do when you get stuck?[hr][/quote] When i stucked on my keen4 mod (well, i think i can't really help you, because i haven't released any mod yet) i started another mod. Sounds crazy, but when i am working at a new mod, i become new ideas and use they for my first keen4 mod. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  <br /><br />[quote]<b><i>Quote:</i></b>[hr]How do you fight the jealously and jaw-dropping despair that comes whenever another Keener releases a fantastic new mod? (Benvolilord's Christmas mod blew my mind today)...[hr][/quote] Thats not a competition for me. I'm working on a keen4 mod, other keeners release fantastic keen1-3 mods. But not a fantastic keen4 mod.<br /><br />[quote]<b><i>Quote:</i></b>[hr]What the Billy Blazes am I gonna do to replace this freakin' Arachnut?[hr][/quote] Well, thats a good question. I replaced it with an kind of octopus, but i may change that. Maybe you can make a car or something like that?<br /><br />[quote]<b><i>Quote:</i></b>[hr]My new year's resolution for 2005 is to complete XkyKeen4 by 2006, and for it to be of the same quality as XkyKeen2.[hr][/quote] The same quality as XkyKeen2? That would be great! I think XkyKeen2 was the best mod ever released. I also liked XkyKeen3 but not as much as i liked XkyKeen2. -&gt;DasBrot&lt;-"
	},
	{
		"id": 6233,
		"title": "Re: XkyKeen4 discussion thread",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-01-03T20:28:18.000Z",
		"content": "I don't know much about mod making and I don't know much about anything Keen related, just that I love that game like anyone else here [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   It's not easy to give other people inspiration and I won't try to do it now. I guess I know how to create something and I think I know what you feel right now.<br />Are you trying to make that mod so you'll have a full collection of mods? If so, stop making it for \"fame\" (I don't think you do it for the fame) and start to look at the creative side. Don't end up like matrix 2 did after the first movie. It was made for money and it was sh*t.<br /><br />Whatever you make the mod for, start dreaming about it instead of thinking about it's technical side. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />Maybe I'm interpreting this wrong... sorry for that<br /><br />*EDIT* just removed some unnecessary commas"
	},
	{
		"id": 6234,
		"title": "bingo",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-01-03T21:42:59.000Z",
		"content": "No, you're completely correct z-1... the whole point of this post was me trying to find the words to say exactly that: I don't want to make XkyKeen4 right now, because if I did it right now, it'd be \"for the fame\" and not \"for the Keen.\"  I wanna wait until I've got a good idea for a mod, and not just do 4 because it's 4.  :-) Thanks for explaining that.<br /><br />--Xky"
	},
	{
		"id": 6235,
		"title": "Me is smart. Me help.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-03T22:51:46.000Z",
		"content": "For the Arachnuts, try someone that hovers around and can only face foward. Or just don't use it at all.<br /><br />For the pogo, just keep trying.<br /><br />As for the story and stuff, I have no idea. If i come up with a good one, chances are i'll use it myself, unless it fits in perfectly with your series. How about keen going to find the council members so they can help him?<br /><br />Btw, i procrastinate too, and i'm also impatient. They don't go together very well. [img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6236,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-01-03T23:06:40.000Z",
		"content": "That's an original storyline [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <font color=\"BLACK\"><br />My [url=http://kevan.org/brain.cgi?grafix5000]MindBending Power[/url] is 5.43 points.<br />Go to [url=http://www.toxicsheep.com]www.toxicsheep.com[/url] to see my site!<br /></font><br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 6260,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-01-03T23:14:12.000Z",
		"content": "The only advice I can give you is forget what you CAN do with Keen 4 and with any enemies in it and try to pretend you can do ANYTHING. Just play with the idea like children, sorry, young people pretend to be an astronaut. You can do anything if you forget that you can't. This is the best method that works for me [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 6237,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-03T23:16:43.000Z",
		"content": "Let me rephrase it.<br /><br />Keen finds out Mortimer wasn't watching the gameshow(who would have expected that?) so he goes to Gnosticus IV to find the 8 Council Members (and maybe the janitor.) so he can use thier magic to communicate with MM. However, when he goes to the Council HQ, he finds that they are out on official buisiness in 8 seperate areas, maybe looking for something, like magic crystals? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  So he has to go to those places and find them.<br /><br />Still not original?[img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6238,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1486686,
		"author_name": "DasBrot",
		"timestamp": "2005-01-03T23:22:23.000Z",
		"content": "Why 8? Look at Keen:Modding (or in the birdman patch4.pat) and you will find a patch that changes the number of council members needed to end up the game.-&gt;DasBrot&lt;-"
	},
	{
		"id": 6239,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-03T23:46:46.000Z",
		"content": "Doesn't matter. It wouldn't really change much in the story exept one number.[img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6240,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1486154,
		"author_name": "thenewmoonsidianX",
		"timestamp": "2005-01-03T23:58:39.000Z",
		"content": "XkyRauh, this may surprise you, but I look up to your mods as the best mods ever.  Ever.  The graphics, Keen's sprite, level design, everything - they're all bloody brilliant.  I have to admit, the Keen3 mod felt a bit different and \"away\" from that Keenish feel, but it was still awesome nonetheless.  <br /><br />I envy your ability to know how to change each tile in a Keen game so it doesn't look like it did before but still fit in a level, or look beyond the original tiles to something completely different, or to be able to come up with a variety of new tiles by putting a bunch of old unused ones together (like the trees in Keen3).  I wish I knew how to successfully do all this stuff in a Keen mod.  I know all I need to do is to practice with mods more, but I get intimidated by the high quality of everyone else's.  <br /><br />Look at it this way - the more you practice at something, the better you get.  It never fails.  Practice with modding Keen4-6 more and more and you'll get better.  What I recommend is you make some private mods for your own viewing that aren't very good but exercise your modding skills.  That's what I'm doing with Keen1 right now, and I'll eventually please myself enough with the quality to release a mod....<br /><br />When I get stuck for a story on a game, I take a break from it until I have a brainstorm.  For instance, when I was doing <i>Tentacles Ate My Babysitter</i> back in 2002, my ideas ran completely dry when I had to return to the story of Bernard in the Shadowlands for the second time.  But I just took a break from it for awhile until I thought, \"Hey, it would be really funny if the Lifewater Oasis was a toxic swamp for no reason!\"  And then I thought of the cult in the pyramid, spoofing Earthbound, and all this other stuff that motivated me to continue.  Ideas are always better when they come by themselves instead of you having to force them out so that they come immediately.  So just wait on it, and your brain will give you something good."
	},
	{
		"id": 6241,
		"title": "Re: Me is smart. Me help.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-01-04T00:13:20.000Z",
		"content": "\"So I'm asking you, the Keen Community... where do you guys get the inspirations for your mods?\"<br />Ehh.. The Keen 2 mod (that is still unreleased) I got idea from a biology book. Some cells. Though, I think the mod has nothing else to do with them than colours.<br /><br />\"What do you do when you get stuck?\"<br />I often stop, press shift + delete. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />\"How do you fight the jealously and jaw-dropping despair that comes whenever another Keener releases a fantastic new mod? (Benvolilord's Christmas mod blew my mind today)...\"<br />Well, I just face it: they're better and I suck! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />Anyways, your work is the best mod work around Xky. Good luck with the fourth one, when you have time and ideas. Until then, just keep playing other mods. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  (And write cool stuff about moddin'!)<b>Life.. It's worth of 20000 points!</b>"
	},
	{
		"id": 6242,
		"title": "I Agree!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-04T00:26:58.000Z",
		"content": "Yes, Xky did some of the best Modding ever. Maybe you don't think you did, but most of the other fans would agree that they were the best![img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6243,
		"title": "Re: I Agree!",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-01-04T00:55:58.000Z",
		"content": "I don't think Xky has doubts about his abilities. At least not more than what is healthy. He just wants some motivation."
	},
	{
		"id": 6244,
		"title": "Re: I Agree!",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-01-04T05:46:01.000Z",
		"content": "so where are the screenies?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke.gif[/img] ----------------------<br />Please, call me Lex."
	},
	{
		"id": 6245,
		"title": "Re: I Agree!",
		"author_id": 1485611,
		"author_name": "BBalazs",
		"timestamp": "2005-01-04T16:52:58.000Z",
		"content": "I'm really looking forward for this. XkyKeen1 was great, XkyKeen2 was greater, XkyKeen3 was once again great, but this will be something entirelly new.------------------------------------------------------<br />Keep in mind, I'm not an artist.<br /><br />\"Take evasive action!\""
	},
	{
		"id": 6246,
		"title": "Re: I Agree!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-01-04T17:47:23.000Z",
		"content": "Indeed. I can already taste the action packed Keenage and droolable creativity. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <b>Life.. It's worth of 20000 points!</b>"
	},
	{
		"id": 6247,
		"title": "Re: I Agree!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-04T23:46:38.000Z",
		"content": "Hmm. You didn't say \"sounds good.\"[img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6248,
		"title": "Re: I Agree!",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-01-05T00:49:54.000Z",
		"content": "No one has released a full-fledged Galaxy mod yet. <i>Someone</i> needs to set the bar before it can be raised. But whether Xky wants to be that person or not is entirely up to him.-----<br />Before you judge someone, walk a mile in their shoes. You'll be a mile away and have their shoes!"
	},
	{
		"id": 6249,
		"title": "Re: I Agree!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-01-05T02:48:18.000Z",
		"content": "Ooh, ooh! Me! ME! Let me set the bar!<br /><br />(clunk!) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br /><br />Ow, thats a heavy bar! I'll let Xky pick it up first! I'm a wimp![img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 6261,
		"title": "Re: XkyKeen4 discussion thread",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2005-09-10T23:49:04.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What the Billy Blazes am I gonna do to replace this freakin' Arachnut? The son of a gun's got just 4 frames that need to work for moving both left AND right![hr][/quote]<br /><br />Too true. I'm working on a keen4 mod too, and I found that the arachnut was also a pain in the *** .<br /><br />[quote]<b><i>Quote:</i></b>[hr]My new year's resolution for 2005 is to complete XkyKeen4 by 2006, and for it to be of the same quality as XkyKeen2.[hr][/quote]<br /><br />Oh my, that is MASSIVE. To create a keen4 mod as good as XKYkeen2 in less than a year... well, good luck! feel free to take ideas from my post 'Ideas for a Keen4 mod', as i'm not going to get there anytime soon. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />____________________________________________________<br /><br />                              - The yorp shalt inherit the mars -"
	},
	{
		"id": 6262,
		"title": "Arachnut, eh?",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-09-12T16:42:46.000Z",
		"content": "For the arachnut, depending on the type of mod you have, you could go for another similar creature, a crab, for instance. Or, there's also those minecart things... you know, those platforms that go on railway tracks, and you pump the top lever up and down to go places?"
	},
	{
		"id": 6263,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-09-13T01:39:30.000Z",
		"content": "I've got an idea in mind--the problem is making it communicable and understandable while keeping the sprite size small.  :-\\"
	},
	{
		"id": 6264,
		"title": "Re: How is this?",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-13T23:53:42.000Z",
		"content": "XKy, you could make the Arachnut into something like this:<br /><br />[img]http://i15.photobucket.com/albums/a371/najawa/Sprites/ArachnutReplacement.jpg[/img]<br /><br />It moves back and forth on a hover craft, has weapons on both sides (A 7,500 zapper; [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]  , and a Spiker [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-bloody.gif[/img]  ), and has a tricked out Motherboard panel (Under bullet proof, water proof [up to 300 Km.], stunn proof, laser proof, child proof, and virtually keen proof plexi-glass), and a little bullet hole for looks. Mortimers house pet; [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  , Keens worst nighmare; [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  , and is not recomended for kids under the age of 12,354,135,151 (By that time they'll be mature enough for this weapon). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]  <br /><br />Basically, something with no head, and weapons on both sides. If I took the time to animate it, The zapper, and the sword would move up and down... Just, to bad ID never released the EGA version of Keen. Then the arachnut replacement could meve in any direction, and the player would be thinking, \"Whoa! Guard bot, no one is safe here!!!\"<br /><br />Hope this helped! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />-- NAJAWA --"
	},
	{
		"id": 6265,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-09-14T00:41:54.000Z",
		"content": "Hehe... that didn't really help, sorry... thanks for trying, though.  Maybe you could use that in a mod of your own?  :-)"
	},
	{
		"id": 6266,
		"title": "Um... VGA, EGA; Big difference",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-14T02:20:33.000Z",
		"content": "Sorry Xky, I drew this one in EGA. I may use it in a fan game though.<br /><br />Did you figure out what you are going to use for your Arachnut? Would it help if I VGA'd it? If so, let me know if you are using a palate patch.<br /><br />-- NAJAWA --<br /><br />Edit: Whoa, it is easier than I thought; I was very close to VGA."
	},
	{
		"id": 6267,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-09-14T03:34:40.000Z",
		"content": "Yeah, I know what I'm going to do with the enemy--read my post before you drew your picture."
	},
	{
		"id": 6268,
		"title": "Re: Oh, I see know.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-14T12:17:50.000Z",
		"content": "I see now. I bet it is going to be great (just like everything else you make). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Good luck then buddy!<br />(BTW - Srry for the irelivant posts in the \"reorganization in progress,\" I was just posting the info so other modders didn't have to see for themselves. I didn't think it'd bother anybody. I'll stop doing it then).<br /><br />Good luck with that mod; hurry up please!!! I want to be able to play it in my life time: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 6269,
		"title": "well..",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-09-15T00:50:47.000Z",
		"content": "If I do finish it, it's going to be because I want to finish it, and because I think it's going to be fun to play.  I'm not going to do it just because the rest of the world thinks it'll be good just because it has \"Xky\" in the title.  :-P<br /><br />It's on hold at the moment, because I'm working full-time and I'm having difficulty finding time to do things."
	},
	{
		"id": 6270,
		"title": "Gatchya",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-15T02:55:05.000Z",
		"content": "Hey, I could release a game under the title \"Xky,\" though it'd be just a bunch of slander.<br /><br />I understand... I can wait... Bacause... I'm gunna make my own Keen 4 mod!!! I just started, and am experiencing dificulty, but I hope all goes well, or I might just put it down (I won't delete it, so I may come back to it).<br /><br />No one is forcing you to do it; we wouldn't hate you if you quite modding, and being such a keen person; but we'd miss you (the point is we won't hate you for not doing at fast as e'd prefere, not that you're leaving).<br /><br />-- NAJAWA --"
	},
	{
		"id": 6271,
		"title": "Re: 2006",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-01-11T23:19:10.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]My new year's resolution for 2005 is to complete XkyKeen4 by 2006, and for it to be of the same quality as XkyKeen2. Wish me luck; I'm a procrastinater. :-)[hr][/quote]<br /><br />2006 - [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />but as najawa said, well- no rush [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br /><br />[img]http://i16.photobucket.com/albums/b33/freeyorp101/sig2.png[/img]<br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 6272,
		"title": "Re: 2006",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-12T06:06:27.000Z",
		"content": "No, KeenRush. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br /><br />Meh, whatever; its only liek the crowning acievement and pinicle of the Keen  community, why rush it?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6273,
		"title": "bah",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-01-13T03:15:15.000Z",
		"content": "I don't know why you guys are so hung up on XkyKeen4.  I understand that my 2nd and 3rd mods were put together in a way that made them fun to play, and I'm very proud of that, but I look at my first mod and just wonder what's the big deal.  <br /><br />I have a strong suspicion XkyKeen4 is going to be a stark parallel to XkyKeen1, in the sense that it's my first attempt at the engine, I'm clumsy with the editing tools, and it's done more as as \"wow, look what I can do!\" as opposed to a \"let's make a game\" process.<br /><br />I still need to decide what to make the enemies, how to animate them, and how to piece together a story that works.  Keen's sprite isn't even done yet.  I haven't opened the folder since October.  Like I said, I'm a procrastinator--but also like I said in the new year's resolution thread, I need to rediscover what makes Keen worth sticking with.  <br /><br />There will be other Keen4 mods released before mine.  Anyone who's holding back production of their mod to wait for me is stupid.  Anyone who's clinging to the idea that I'm some sort of deity is a fool.  I'm a Keen fan, I'm a sprite hobbyist, and I enjoy level design to a certain extent.  But I've had NO free time lately.  <br /><br />If I can get a better laptop, that may change as school starts this next semester.  :-)  School's always been a good place to hone my thoughts on Keen.<br /><br />I stated in a response to z-1 that I wasn't going to make XkyKeen4 just because it's XkyKeen4.  I don't want to sell an idea on name recognition.  If I do complete this Keen4 mod, I want it to happen because I have a reason; a vision; an idea I want to share. <br /><br />I've got nothing to share right now.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 6274,
		"title": "Re: bah",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-13T10:30:14.000Z",
		"content": "Careful Xky, once z-1's editor is out <b>I'll</b> be on the modding scene.<br /><br />Then I can undermine you directly,muhahahaha...A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6275,
		"title": "Re: bah",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-13T11:02:53.000Z",
		"content": "I think I first make a Keen 5 level pack with some new tiles before doing a mod. Or well, time will tell. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img]  I was planning not to do Keen 4-6 stuff yet and make Keen 1 mod next when/if my current mod is done, but seems I'm now wanting to try the \"next\" Keens.<b>Eat your veggies!</b>"
	},
	{
		"id": 6276,
		"title": "Re: bah",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2006-01-17T07:04:14.000Z",
		"content": "z-1's making a Keen 4-6 editor? Where have I been? And more importantly, if the editor comes out, do I dare try and make a Keen4 mod of my own?[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 6277,
		"title": "Beta!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-01-17T07:51:58.000Z",
		"content": "[hr]<b>Ilsoap</b> And more importantly, if the editor comes out, do I dare try and make a Keen4 mod of my own?<br />[hr]No, the real question is, \"Now that [url=http://p072.ezboard.com/fpubliccommanderkeenforumtheoriginalcommanderkeenga.showMessage?topicID=915.topic]the editor has been released[/url], do you dare create a Keen4 mod of your own?\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 6278,
		"title": "Re: Beta!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-18T06:10:08.000Z",
		"content": "Ooooh, an ilsoam by Ilsoap?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6279,
		"title": "Re: Beta!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-18T12:45:53.000Z",
		"content": "Of course you dare!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 6280,
		"title": "Re: Beta!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-01-27T18:39:27.000Z",
		"content": "Xky, are you going to have new music or old music in your mod? I'd like to hear something new. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 6281,
		"title": "hey, yeah!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-01-27T23:59:35.000Z",
		"content": "If we've got tools to change the music, I will change the music.  I'm sick of the default songs, myself.  :-)<br /><br />Just keep in mind, all you budding level designers, that when you make a level and it says \"Insufficient Memory for Background Music!\" the level is going to be quiet.  :-P"
	},
	{
		"id": 6282,
		"title": "Re: hey, yeah!",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2006-01-28T17:25:37.000Z",
		"content": "You can change out the music, actually.<br /><br />That was what the big revolutionary surprise with Dangerous Dave vs. the Infernal Infantry was going to be.  Using a combination of IMFCreator and WDC, both by the famed Wolfenstein 3D utility maker Adam Biser, you can turn MIDIs into IMF format music and import them into the game.  You can find both utilities at [url=http://winwolf3d.dugtrio17.com]his website[/url].<br /><br />As to how to go about it, here's a general idea of how to work things out so that they work properly.<br /><br />1) Pick a relatively simple MIDI to start with, or design your own.  I can't recall the exact specifications of an IMF, but I know that it can only be a maximum of 64kb on output, which means if it's more than 32kb to begin with, chances are it will not output well.  It also has limited note play capabilities--I want to say only 8 notes can be playing at once--so it can't be anything overly complex.  For a better, more specific idea, check around the [url=http://diehardwolfers.areyep.com]DieHardWolfers Forums[/url], under Audio Adventures.  There's probably more specific information there.<br />2) Set up IMFCreator to make a CK4-6 style IMF.  Click Options and make sure \"Write Duke Nukem 2-style IMF\" is checked.  Also, change the \"IMF Tics/Second\" to 600 as opposed to 700.  The output will sound fast, but as anyone who has ripped the IMFs would know, they play fast outside of the game engine.<br />3) Output the IMF.  This ought to be simple enough to do.  After setting it up to make an IMF for the game, tweak the output further to your liking, and then hit the \"Convert to IMF\" button at the bottom.<br />4) Create the project for your mod in WDC.  Select File, then New.  Type in the name of what you want to call the WDC project file for your mod.  The base data folder should be the folder in which your CK4-6 mod is located.  It will tell you that it can't find a prebuilt definition for the extension CK4.  All you have to do is either use or base it off of the blank template, which is called blank.  Output folder is important as well if you have any desire to be able to save your changes.  WDC is project-centric, so it reads base data from one folder and saves the changes to a different one.  (An easy way to do this is pick the unmodified game as the base folder and the mod as the output.)  All that's left you need to fiddle with is checking the \"Use Tile16s for maps, if they exist\" box and moving on.<br />5) Importing your music.  Click on the button that looks like a musical score.  Here, you'll see a list of songs with no names and listed by number and filesize.  Don't fret, however, as WDC automatically plays whatever IMF is selected.  On the bottom, there should be a box that says \"Replacement file\".  Click the \"...\" button directly right of it, find your IMF and select it.  It's that easy!<br />6) Compile the \"AudioT\".  Hit file, go under \"Compile\" and click \"AudioT\".  It's that simple.<br /><br />And as simple(?) as that, you've imported new music into the game.  I hope this information proves useful to you guys.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 6283,
		"title": "w00t",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-01-28T19:55:53.000Z",
		"content": "That was INCREDIBLY useful, and should be moved to its own thread, so this one may die.  ;-)  Thanks, Zero!"
	},
	{
		"id": 6284,
		"title": "Re: hey, yeah!",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-01-29T01:57:00.000Z",
		"content": "<i>Also, change the \"IMF Tics/Second\" to 600 as opposed to 700.</i><br /><br />Actually that should be 560 - the Keen IMFs are 560Hz, and the Wolf3D ones are 700Hz.<br /><br /><i>The output will sound fast, but as anyone who has ripped the IMFs would know, they play fast outside of the game engine.</i><br /><br />Only if you don't use the right IMF player [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 6285,
		"title": "garg",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-01-29T04:30:24.000Z",
		"content": "Oh, poop.  This doesn't cooperate with UNLZEXE at all.  I can run WDC and swap my music in and out no sweat with a \"clean\" copy of Keen4... but if I try and do this with my modded folder, (or just my \"clean\" unlz'ed copy,) it chokes as soon as it tries to load the main menu.  :-( <br /><br />Can we find a workaround?"
	},
	{
		"id": 6286,
		"title": "Re: garg",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2006-01-29T07:20:30.000Z",
		"content": "Perhaps, and this is only a stab in the dark, you could LZE it again before doing music work?  It's just an idea, but perhaps it could work."
	},
	{
		"id": 6287,
		"title": "Re: garg",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-29T18:23:35.000Z",
		"content": "Woah, sounds awesome! Have you asked adurdin yet, Xky? I'm sure it can be get to work since we're this far already. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Very cool find!<b>Eat your veggies!</b>"
	},
	{
		"id": 6288,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-01-29T20:03:01.000Z",
		"content": "Andy's probably not going to have time to work on something like this... he's leaving for Europe in a week or two, and then he won't even have online access for 2-4 months.  :-$"
	},
	{
		"id": 6289,
		"title": "Re: well...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2006-02-01T03:37:09.000Z",
		"content": "Ahhhhh!!! K:M is doomed... and I won't be there to do anythign about it.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />We'll miss you Andy.<br /><br />...<br /><br />No internet access? What part of Europe is he going to? What about a library computer lab?<br /><br />Geez... poor Andy... poor us...<br /><br />\"Alas; poor Andy. I knew him well.\"Tough Guys Wear Pink!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 6290,
		"title": "haha",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-02-01T06:31:35.000Z",
		"content": "How active has Andy been on K:M, really?  He's posted maybe 10 times in the past three months, and that's being generous.  Sure, he does some work behind-the-scenes monitoring new registrees, but I can do that just as easily.  <br /><br />Don't be so fatalist.  And let this topic die, already!  :-P"
	},
	{
		"id": 6291,
		"title": "Re: well...",
		"author_id": 1485854,
		"author_name": "AdamBiser",
		"timestamp": "2006-02-02T06:48:59.000Z",
		"content": "@XkyRauh2001: The key to WDC's ability to work with Keen at all is in the CatBuster.ini file.  WDC only works with the 1.4 versions of Keen4 at the moment.  Now, to get this to work with your mod, I'd need to know a few things.<br />1) Which verion of Keen4 1.4 is it based on? Apogee or GoodTimes?<br />2) What's the EXE's filename?<br />3) Has anything else been done to the EXE?<br /><br />WDC uses UNP to unLZEXE your file, so don't worry about that.  However, let me explain a bit about how WDC works with Keen, etc.  Since Keen has several files compiled into the EXE, I use Catbuster.ini to store where in the uncompressed EXE these files are found.  Now, if nothing has been changed to the EXE and these files are in the same location as the were before, all the better.<br /><br />Let's assume you're using the Apogee 1.4:<br />[Commander Keen 4 - v1.4 - Apogee]<br />Name1=KEEN4.EXE<br />Name2=KEEN4E.EXE<br />StartSize=106178<br />EndSize=264832<br />File1=AUDIODCT.CK4&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H387B6&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp 1024<br />File2=AUDIOHED.CK4&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H240B0&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp 652<br />File3=EGADICT.CK4&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H38BB6&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp 1024<br />File4=EGAHEAD.CK4&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H24340&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H37B0<br />File5=MAPHEAD.CK4&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;H27AF0&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp 402<br /><br />The part in the brackets needs to be a unique identifier.  So yours can be something like [XkyKeen4].<br />NameX are the names this file can be.<br />StartSize is not really that important.<br />EndSize is the size of the uncompressed EXE.  This in conjuction with the name is how WDC verifies that it found the right file.<br />The internal files are listed as:<br />FileX=FileName.ext  Offset  Size<br />This should be pretty self explanatory.  I should note that &amp;H is VB's way of denoting a hexadecimal value and is the same as C's 0x.  Also, the only sizes that might be different are those of AUDIOHED and EGAHEAD.<br /><br />I hope this helps out to at least some degree.  I never posted much information about how to edit Keen and other EGA games in WDC because there hasn't been too much interest.  No one really expects that from a Wolf3D editor, I guess.  WDC will also edit Keen maps.  Eventually, it might edit the EGAGRAPH, too, if I get into gear on that.<br /><br />It has been a long time since I've tested the Keen stuff. Hopefully it still works..."
	},
	{
		"id": 6292,
		"title": "hmm",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-02-04T09:20:25.000Z",
		"content": "Well, the problem is that for our other modding utilities to work, the EXE has to be rather permanently UNLZ'ed.  We've got a utility called \"UNLZEXE\" which takes the original executable, renames it Keen4e.olz, and then spits out a new, UNLZ'ed executable called Keen4e.exe.  WDC tries to run its UNLZ on that file, can't do it, reads from the wrong address, and spits out all sorts of errors.<br /><br />So when we put together a patch with WDC to replace the music, it stuffs these new files in at particular offsets, and then when we use CKxPatch to load it into memory, those things are in the wrong place comparatively, and the whole thing goes sour.  I know I don't have the technical expertise to explain things better than that....<br /><br />We'd need a version of WDC which doesn't attempt to re-lz everything once it's done... or a version of CKxPatch which doesn't need everything to be already un-lz'ed in the first place.  <br /><br />If I had to try and explain it in other terms, it'd be like having two toasters... both take BREAD and turn it into TOAST.  Putting TOAST in a toaster makes for BURNED YUCK.  :-)  Or something.  I'm sorry I can't explain it better than that!"
	},
	{
		"id": 6293,
		"title": "Re: hmm",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-04T10:10:38.000Z",
		"content": "Or you could just get a copy of LZEXE, run it on your Keen .exe, use WDC to insert the music into it and then UNLZEXE it. (This would work, AFAIK)"
	},
	{
		"id": 6294,
		"title": "Doodeedoo.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-02-04T12:03:30.000Z",
		"content": "Now to derail this conversation even further.<br /><br />[hr]<b>Xky</b> Putting TOAST in a toaster makes for BURNED YUCK. :-)<br />[hr]Putting <i>bread</i> in my toaster does that. Gotta keep an eye on it and pounce when you think it's ready.<br /><br />On topic, though: Wo.0t @ music editage! Next step is editing the PC speaker and Adlib sound effects... anyone know where to start?<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 6295,
		"title": "Re: Doodeedoo.",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2006-02-04T16:41:44.000Z",
		"content": "WDC comes with utilities that can make PC Speaker and AdLib sounds, too.<br /><br />I think I switched some out in Dangerous Dave vs. the Infernal Infantry before it got all pukey."
	},
	{
		"id": 6296,
		"title": "bah.",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-02-04T21:12:20.000Z",
		"content": "Okay, it works, but I'm still kinda skeptical.  I took a clean fresh install of Keen4, added the music I wanted to use with WDC, and then ran UNLZ on the end product, and went about patching like normal from there.<br /><br />So it would appear that changing music is Step 1 of making a Keen4 mod."
	},
	{
		"id": 6297,
		"title": "Re: bah.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-05T18:06:22.000Z",
		"content": "Or you could do it like this:<br /><br />1. Change graphics/levels/etc. on working copy of Keen.<br />2. Export everything from working copy.<br />3. Get clean copy of Keen and put music in it.<br />4. UNLZ the no-longer clean copy (which has the music in) and import all your stuff from the working copy into it.<br />5. Profit!<br /><br />This way, you can do everything else before you do the music.[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 6298,
		"title": "Re: hmm",
		"author_id": 1485854,
		"author_name": "AdamBiser",
		"timestamp": "2006-02-20T03:19:16.000Z",
		"content": "If it's UNLZ'ed that's fine. (sorry I didn't check this topic for awhile... I never got a notification email).<br /><br />May I ask you to email me your EXE so I can see what the CatBuster.ini values need to be?  WDC won't try to uncompress the EXE if it doesn't have to do so.<br /><br />Check my profile for the email.<br /><br />EDIT:<br />Let me explain what WDC does a bit further if I can...<br /><br />WDC checks the EXE to see if it needs UNLZ'd.  It does so if it thinks it does depending on the CatBuster.ini file as mentioned above.<br /><br />You then edit the files.  You can currently only alter the AUDIO and GAMEMAPS files.  EGAGRAPH is on the way, but very slowly.  If there's a strong enough desire from this community, I would work on it a bit faster.  This would also open up the door for Catacomb 3D editing and maybe BioMenace (now freeware, yay!).<br /><br />WDC then plugs the header information back into the EXE.  It does NOT re-compress the EXE.  The problem is all in the offsets, from what I can guess.<br /><br />I'll have to familiarize myself with CKxPatch.  Hopefully it won't change the offsets on you all the time..."
	},
	{
		"id": 6299,
		"title": "Re: hmm",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-21T21:32:38.000Z",
		"content": "If by editing EGAGRAPH you mean editing graphics, that's already covered by [url=http://andy.durdin.net/keen/modding/viewtopic.php?t=276]ModKeen 2[/url]."
	},
	{
		"id": 6300,
		"title": "Re: hmm",
		"author_id": 1485854,
		"author_name": "AdamBiser",
		"timestamp": "2006-02-21T21:36:43.000Z",
		"content": "Thanks.  Its existence is basically the reason I've not really worked on implementing the graphics editability in WDC.  Though it will get it... eventually."
	},
	{
		"id": 6301,
		"title": "Re: hmm",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-23T00:55:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />So I'm asking you, the Keen Community... where do you guys get the inspirations for your mods? What do you do when you get stuck? How do you fight the jealously and jaw-dropping despair that comes whenever another Keener releases a fantastic new mod? (Benvolilord's Christmas mod blew my mind today)...<br />[hr][/quote]<br />I know this was commented upon, but I thought I woudl add my two sense:<br /><br />When I started out with my game 6 years ago (That has gone on and off the burner about 7 times, lol), my original Help file ended saying:<br /><br />\"Thanks for downloading my game!  I really don't expect this game to be better than Issis II, Norp, or any of those type of games.\"<br /><br />I think this is a good approach, in retrospect.  Not having a clear idea of what you are doing in relation to other games is important, in my opinion.  The game really should only be what you want it to be.  In my case, I fell in love with the original series (1-3), and I wanted to do a remake of them with Keen4 style graphics --and it ended up blossoming into a hundred different directions.  I decided to start using all original graphics --which ended up making me re-draw them through the various times I've quite and re-started, and I've learned to do awesome cartoonish graphics.  I've learned various programming tips while attempting to write a source code about 6 times (Although I never got very far with any of these).  And, I've had the time to think through various storylines and such.  If I ever do make the fangame, it'll be awesome.<br /><br />I think this is how you need to make mods and fangames --don't think about what you shoudl do, think about what you want to do with your game, and where you want to take it.<br /><br />*shrugs*  That's my two cents.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 6302,
		"title": "Re: hmm",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-04-08T17:26:01.000Z",
		"content": "are you done yet?[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 6303,
		"title": "feh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-04-09T23:30:45.000Z",
		"content": "No, I'm not.  In fact, it will probably never be done.  I don't have a good story to tell, I'm not motivated, and I've lost sight of the Keen spirit that was flowing freely through my veins two years ago.  <br /><br />The only way this mod is going to come out in the near future is if I force myself to work on it--and if I do that, it's not going to be very good quality.  It will become something that is done \"because it has to be done,\" not something that is done \"because it's a good idea.\" <br /><br />I don't want to release a sub-par mod, so I am pretty much letting this die.  I wish this thread would disappear."
	},
	{
		"id": 6304,
		"title": "Re: feh",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-10T06:53:27.000Z",
		"content": "If you're gonna let it die, can I have it?<br /><br />Seriously, if you're not going to, I'd like to finish it.<br /><br />Even if it does take a year or more.<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6305,
		"title": "Aww.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-04-10T08:46:13.000Z",
		"content": "Don't feel pressured to make this thing. As you rightly say, it shouldn't be something that 'has to be done'. I know exactly what it's like when the Keen spirit seems hidden. In fact, I'm sort of in such a state at the moment. I'll catch a glimpse of it here and there, but not focussed or strong enough to put toward a mod.<br /><br />This doesn't even need to be a Keen4 mod. It is a bloody massive game. Why not put your effort toward another Keen 1 mod or something, utilising some new patches? Or maybe even Keen Dreams? You don't have to be linear about which Keen games you use.<br /><br />Hopefully you rediscover that Keenish state of mind and we see a new XkyKeen someday.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 6306,
		"title": "Re: Aww.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-11T09:10:58.000Z",
		"content": "Use the For..Keen, Xky! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] <br /><br />Hmmm, bad news. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  But yeah, I guess it's best to do as Spleen said, either wait for the Keen spirit or try the stuff in a smaller mod. Or then just make some Keen 1, 2, or 3 mod using the old player sprite of yours if the new doesn't fit, and so on. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 6307,
		"title": "Re: Aww.",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2006-04-11T23:57:11.000Z",
		"content": "I will write you a story.<br /><br />I'll just need to play the first three first.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]"
	},
	{
		"id": 6308,
		"title": "garg.",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-04-12T00:12:06.000Z",
		"content": "Well, alright, here's the deal.  I've got a story.  I know exactly what I want to happen.  I've had that planned for a while now.  I did some art for it, I sketched a lot, I still have those sketches.  I've got a lot of work done on my Keen sprite, I've got a few of the monsters done, and I've even got a few tiles made that look great.<br /><br />But.<br /><br />I have no free time.  Literally.  After I graduated from Community College, I needed to get a full-time job to help pay for my admission to University.  That meant working 8-5 days Monday thru Friday.  That means I woke up at 6:30 to fight the San Diego traffic.  That means when I got home at 6:00pm every night, I was pretty bushed.  I had dishes to wash, carpets to vacuum, furniture to dust and yardwork to do.  On weekends, I didn't feel like doing much of anything that even seemed like work.  Keep in mind there's a girlfriend involved in the picture, too.  I simply didn't have the schedule to do what I wanted to do.<br /><br />Once a month or so, when I had a free hour or two, I'd open up Paint and toy with some tiles, or tweak my patches a bit--I even started doing the text stuff I hate so much.  But I couldn't stay focussed on it.  It's a lot of work, and lots of it is somewhat new and definitely more complicated than the 1-3 stuff.  I'm amazed nobody else has released a 4 mod besides Benvolio's one-level thing.<br /><br />So once University started, my schedule has changed yet again.  Now I'm waking up at 6am on Mondays and Wednesdays, staying on-campus until 8:30pm (which means I get home at 9:15 or so)... Tuesdays I'm out the door by 7:30, and I don't get home until 8pm... Thursday is my only short day, with me out the door at 6:45am and home by 5pm, and then Fridays I leave home at 7am and don't get home again until 11pm or midnight, because I work on-campus until 5pm and then go up to a friend's house for a weekly get-together.  Saturday mornings I do yardwork, Saturday afternoons I have friends over to hang out and relax, and Sunday after my friends have gone home, I clean the house and study for the exams I have every week.<br /><br />Where is there time for me to work on a Keen mod?  I doodle on my papers in History class, still... I know exactly how I'd like to work on my tiles.  But all I have is a free hour here and there, and a painfully slow laptop (433mhz, 32mb RAM, Win98, monitor with such a slow refresh rate I can't play Keen because the scrolling hurts my eyes).<br /><br />I tried doing tilework during those hours--I submitted my first batch to the CKCM at K:M back at the beginning of March.  I even took some of those tiles and started modifying them... but honestly, doing the checkerboarding thing with a touchpad is a pain in the ass, and the monitor on the laptop doesn't show the difference between dark cyan and blue very well--nor dark grey and black.  Everything looks terrible, and I can't get a good sense of how my mod actually looks.<br /><br />The bottom line is that I'm unmotivated, very busy, frustrated about it, and unfortunately unable to do anything to change that.  This semester will end partway through May, and I'll go back to the M-F 8-5 thing (if the company I was working for previously wants to re-hire me) ... Maybe I'll have more time and energy then, since I'll actually be getting home before 6pm most days.  <br /><br />But seriously, guys, I do want to make a Keen mod.  This isn't something I decided on a whim... it's an unfortunate side-effect of my schedule, and a question of priorities.  I'd love to be a high-schooler again, and recapture that 3pm-to-midnight freedom every single day.  But I've got other priorities, chores, a girlfriend, and a dwindling supply of sanity.<br /><br />LevelLord: I'm keeping what I've got.  It will be used.  :-)<br /><br />I've got complete faith in you guys to carry the torch.  I'm here in spirit, even though I don't post as much as I used to.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 6309,
		"title": "Re: garg.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-12T06:41:18.000Z",
		"content": "*bows head*<br /><br />Xky is now comatose, we shall see him but rarely. <br /><br />Our greatest modder has moved on to greater things.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6310,
		"title": "Re: garg.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-12T09:10:06.000Z",
		"content": "Wrong. More minor things ya know, nothing's as important as a Keen mod. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br /><br />Well, I surely hope that your schedule changes one day to something that isn't as hectic (correct word?).3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 6311,
		"title": "Re: garg.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-14T08:04:56.000Z",
		"content": "what you mean Xky from the time I ...ehm... was bussier [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stoned.gif[/img]  <br />I hope that you'll get some more spare time soon even if just only for yourself. Good luck with your university and thanks again for your mods. <br />-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	}
]
