[
	{
		"id": 544,
		"title": "Commander Keen 64 Beta",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-01T09:29:37.000Z",
		"content": "Here goes nothing! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]             <br /><br />Here is Keen 64 Beta, a game I have been working on since August (on and off though ). It's one level and it's based off Keen 1, but with 3D graphics. It's the groundwork if I continue with this game, and I would add more levels, and more Keen elements.<br /><br />I wanted to add sound so badly, but when I would rip sounds from Keen 1, it would sound scratchy when played in the game and I just wanted to get this out. <br /><br />Many thanks to everyone on this thread for making this game better thanks to all of the feedback. If there is any problem with downloading, unzipping, or running the game tell me, same with any errors or bugs anyone may find.<br /><br /><b>WARNING: READ BEFORE YOU DOWNLOAD</b><br /><b>When you unizp the file, make the directory of the program start in c:\\keen64beta otherwise the level map textures won't show up!!!!<br /><br />If the level map textures still don't show up please tell me!!!!</b><br /><br />Download Link:<br />[url=http://www.gigafiles.co.uk/files/5827/Keen64Beta.zip]www.gigafiles.co.uk/files...64Beta.zip[/url]<br /><br />Screenshot:<br />[img]http://img.photobucket.com/albums/v337/Tirqin/Keen7a.jpg[/img]<br /><br />Original Thread on PCKF:<br />[url=http://p072.ezboard.com/Commander-Keen-3D-Beta/fpubliccommanderkeenforumfrm17.showMessage?topicID=1170.topic]p072.ezboard.com/Commande...1170.topic[/url]"
	},
	{
		"id": 14785,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-02-01T11:19:20.000Z",
		"content": "Ok here's a problem when I unzip the game he gives a memory problem but when I keep it zipped I can play it.<br /><br />About the game: unlike Keen Dreams 3d this one is really playable even though it doesn't look as good. I would advice to drop the live system and start working with continue point because it isn't fun in a game where you can fall to dead so easily to start all over again.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 14786,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-02-01T21:11:11.000Z",
		"content": "Mirrored: [url=http://arnott.f2s.com/files/keen64beta.zip]arnott.f2s.com/files/keen64beta.zip[/url]"
	},
	{
		"id": 14787,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2007-02-01T22:44:01.000Z",
		"content": "really nice!----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14788,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-02-01T23:10:50.000Z",
		"content": "This is great!<br /><br />Just a note, if you lose, and get a game over, whenever you select 'new game', it just reverts to the game over screen.<br /><br />The same with if you win, it says 'The end for now' and you have to quit and start a new app before you can play again.<br /><br />---Freeyorp"
	},
	{
		"id": 14789,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-02-02T00:33:20.000Z",
		"content": "The game shouldn't be so, I dunno...platformic? The level design is boring and devoid of anything. The reason games like Mario 64 work so well is because of the feeling of being in a huge world yet to be explored. This game doesn't really feel truly three-dimensional. It feels like some kind of coiled two-dimensional game. So essentially it's Keen 1 except you have to turn around all the time. Also, the gravity is largely unconvincing. You shouldn't be able to adjust where you're landing so late after the declining arc of the jump. I feel like Mary Poppins floating slowly to the ground all the time.<br /><br />So basically what I want to say is just make sure you don't compromise the playability of the game for the sake of replicating the mechanics of the original.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 14790,
		"title": "Okie dokie...",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-02T01:12:25.000Z",
		"content": "@Djaser <br /><br /><b>\"Ok here's a problem when I unzip the game he gives a memory problem but when I keep it zipped I can play it.\"</b><br /><br />That's odd, when I download it myself and try it out, it works just the opposite. I will see if it works on another computer.<br /><br /><b>\"About the game: unlike Keen Dreams 3d this one is really playable even though it doesn't look as good.\"</b><br /><br />Well, I'm glad there's progress over the last 3D keen game, gameplay wise. Graphics wise: I hope you mean \"doesn't look as good\" about the enviroment, which I admit, my level isn't that colorful or texturally detailed (though I don't like some of Dreams 3D's choice of textures), but I do think that the Keen model is superior to the one in Dreams 3D and our enemy models are about on the same same level [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]            <br /><br /><b>\"I would advice to drop the live system and start working with continue point because it isn't fun in a game where you can fall to dead so easily to start all over again.\"</b><br /><br />I know what you mean. I think that's why when Mario 64 went 3D they implemented the health system. Which I could add a health system, the hard part is keeping it in the style of Keen.<br /><br />Many thanks for the criticisim [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]           <br /><br />@grafix Thank you for mirroring it Grafix! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]            <br /><br />@lv4n many thanks! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]           <br /><br />@freeyorp101 Thank you! <br /><br />Thank you for pointing this out, I will try to fix this. In the meantime, to tie up loose ends I think I will make it driectly quit, rather than go through to the menu and not have it work. I got it to restart the game (from what I can tell), but I can't move keen around.<br /><br />@allstories <br /><br /><b>\"The level design is boring and devoid of anything.\"</b><br /><br />I threw it together for the beta.<br /><br /><b>\"The reason games like Mario 64 work so well is because of the feeling of being in a huge world yet to be explored. This game doesn't really feel truly three-dimensional. It feels like some kind of coiled two-dimensional game.\"</b><br /><br />Well I hate to mention my ideas so early, but since you are basing this on one makeshift level. When or if I would make Keen 64 (full version), I was planning on using a level hub that you can explore and thus access the levels from there (like in games such as Mario 64, Sonic Adventure, Commander Keen series and Keen Dreams 3D). And so the levels accessed would be a tad more linear, because even the levels accessed from the hubs in Mario 64 were linear.<br /><br /><b>\"So essentially it's Keen 1 except you have to turn around all the time.\"</b><br /><br />lol, well that was kind of the point. <br /><br /><b>\"Also, the gravity is largely unconvincing. You shouldn't be able to adjust where you're landing so late after the declining arc of the jump.\"</b><br /><br />Please clearify [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]        <br /><br />Also, do you think having a free camera (ie controled by a mouse), would give you freedom to plan your falls?   <br /><br /><b>\"So basically what I want to say is just make sure you don't compromise the playability of the game for the sake of replicating the mechanics of the original.\"</b><br /><br />Ok, I will keep that in mind [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]    Thank you for the honest criticisim [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]      <br /><br />@ Everyone<br /><br />If anyone has the same problem as Djaser with the zip file please tell me so I know if it's just his computer or if it's mine."
	},
	{
		"id": 14791,
		"title": "Re: Okie dokie...",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-02-02T08:39:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Also, do you think having a free camera (ie controled by a mouse), would give you freedom to plan your falls? [hr][/quote]<br /><br />Definitely. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />---Freeyorp"
	},
	{
		"id": 14792,
		"title": "Re: Okie dokie...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-02T10:11:39.000Z",
		"content": "I don't want to plan my falls, I want to avoid them.<br /><br />This is spooky weird, it has a lot of potential. Keep it up!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 14793,
		"title": "Re: Okie dokie...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-02-02T10:18:50.000Z",
		"content": "It's mediocre right now, but then again it's still being made. I hated how Keen slid of platforms for no reasons at times, and I didn't like it that nothing was textured. Hope to see it become better once you progress though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Btw, jumping is linear? Make that exponential, dude. Linear jumping looks horrible. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14794,
		"title": "Re: Okie dokie...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-02T17:36:57.000Z",
		"content": "Nice work! It's interesting to finally start seeing the first 3D Keen games coming up, this being the second ever. Yeah, in the final version the movement could be a bit different, the direction perhaps controllable with mouse or something. It's great to see this stuff in 3D. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  I like the models.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14795,
		"title": "Re: Okie dokie...",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2007-02-03T00:43:30.000Z",
		"content": "This is awsome, I can't wait until its finnished. The enemies looks really nice, as does the keen sprite. I agree with the comments made about keens jumping, and my only major criticism is that the gargs are easy to walk past. But since this is only the beta, you're probably still working on them, so great job [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14796,
		"title": "Hooom.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-03T02:27:17.000Z",
		"content": "Experiment with different configurations of points. Putting a chunk of them together might work in a 2D platformer, but in a 3D environment you need to be more creative. Space them out a bit. Less is more.<br /><br />The ability to strafe would be nice, and I'm all for a movable camera.<br /><br />The 3D models need some depth to them. Gargs and yorps should have spheroid bodies. Aside from that, they're looking good. The lollipops also look too flat. I was always under the impression that the Keen 1 lollipops were spherical. If you stick with flat ones, I suggest making them spin or something.<br /><br />Finally, the creatures need to move freely around the platforms, rather than linearly as they currently do.<br /><br />It's an impressive start to the second ever 3D Keen fangame, and I look forward to improvements."
	},
	{
		"id": 14797,
		"title": "whee",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-02-03T14:28:56.000Z",
		"content": "Good work so far! There are a few issues I have with the game as it is, but nonetheless the progress made is promising.<br /><br />The main problem is the camera - as various people have pointed out, it makes jumping and moving in general pretty hard. The camera in most good 3D platformers moves around to follow the player, rather than just hovering behind them in the same place; this is especially useful near hazards obscured by cliffs. If you could implement that at some point, rather than require the player to move the camera every time they approached an edge, it would make the game much more playable.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 14798,
		"title": "well",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-02-03T17:52:24.000Z",
		"content": "This looks like a good start--just get a Mars-y skybox, and then start adding huge expanses of barren red planet, and you'll be in much better shape.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 14799,
		"title": "Re: well",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2007-02-04T10:11:06.000Z",
		"content": "The textures don't show up in my version for whatever reason."
	},
	{
		"id": 14800,
		"title": "Hopefully....",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-05T06:23:03.000Z",
		"content": "It *should* be fixed now, I changed the coloring too (from the coloring shown in the development pictures). When you unizp the file, make the directory of the program start in c:\\keen64beta, that's the way the editor I used for making the level works, if you don't have the right directory the textures won't show up.<br /><br />I want to change editors, but I already the made the level with this one. So when\\if I start on the full version, I will hopefully be using a better editor.<br /><br />So, anyone please tell me if it still doesn't display the textures even with the right directories.<br /><br />And many thanks to Zero and DaVince for bringing this up (though I didn't get what DaVince meant until now, lol).<br /><br />My apologies,<br />Lava89"
	},
	{
		"id": 14801,
		"title": "RE:",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-05T08:01:40.000Z",
		"content": "<b>@Levelass </b><br /><br />Well yeah, I mean \"fall\" as in falling after you jump, lol.<br /><br />Thank you! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]         <br /><br /><b>@DaVince</b><br /><br />Thank you for bringing up the untextured part, I didn't realize what you meant until Zero said something. Slid for no reason? That might've been the camera's fault, lol.<br /><br />Thanks again! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]         <br /><br /><b>@KeenRush </b><br /><br />Thanks a ton KeenRush!<br /><br /><b>@ceilick</b><br /><br />Thank you [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   <br /><br />Yeah, I noticed that myself about walking past the gargs, though in Keen 1 there were times when you could bypass them. But in 64 it's way too easy lol.       <br /><br /><b>@Commander Spleen </b><br /><br />I totally agree with the points part, but when I was experimenting with Keen in 3D for the first time I had to slurge haha.<br /><br />Strafe? Maybe, if it doesn't fit snuggly in my control scheme I'll make them extra. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />The enemy models, the yorps I think I will leave, I shrink the edges a tad, and the Gargs I think need more depth as well. <br /><br />The lollypop models, well looking at them in the original, their shininess indicates spherical, but most completely spherical lollypops have longer handles and smaller candy, I think I might keep the main shape but make the sides more like a dome. And I actually made them spin originally, but the ones on the top of the level had problems with spinning.<br /><br />Yeah, that's what I would like to fix, their robot-ness. I might still retain their main path, but when they see you, they will follow \\ chase you and then go back to their path.<br /><br />Many thanks for the criticisim [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]         <br /><br /><b>@grafix </b><br /><br />Thank you [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]    <br /><br />I understand your point. Though even most good 3D platformers excell in gameplay but completely lack in camera, which alters the gameplay. Mario 64, considered one (if not the) of the greatest platformers, but it's camera is horrible, and Sunshine didn't improve in this area much. Sonic Adventure imo had great gameplay, but a horrendous camera, it's sequel didn't improve it much either, like Sunshine.<br /><br />I think a player controlled camera is something game developers should give the player. Because the cameras in Mario 64 \\ Shine and Sonic Adventure 1 \\ 2 had a common problem, they tried doing too much for the player. When Sonic Adventure DX came out for Gamecube, I thought they fixed it a little, because it gave you feature to control the camera more freely, but my hopes were dashed when the camera would return to normal when I would move my character. If the camera would stay it would've been fantastic, but like Mario 64\\ Shine and SA1 \\ 2, you could only get a glimpse of what was there but taking that glimpse and using so you could see where you were going was a different story.<br /><br />So I want to give the player about the same or a little more control  (not too much or it will be too complicated) as a regular 3D platformer, but alot of freedom - to move the camera around to where you want it - and make it stay.     <br /><br /><b>@XkyRauh2001 </b><br /><br />Sounds good to me, I think this will help the look alot, thank you! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]       <br /><br />LAVA89"
	},
	{
		"id": 14802,
		"title": "Re:",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-02-06T15:32:53.000Z",
		"content": "<b>Server:</b> Firefox no puede encontrar el servidor en www.gigafiles.co.uk.<br /><b>SM:</b> Argh! It doesn't work! Stupid server, wake up NOW!<br /><i>*smashes computer with a hammer*</i><br /><b>Server:</b> This terminal will self-destruct in one second.<br /><b>SM:</b> Huh, what the...?<br /><i>*BOOM!!!*</i><br />[hr]<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-bloody.gif[/img]  Looking forward to the finished product. I recommend you get some mirror servers for it when finished.<br /><br />I'll have to try it again in a month or two, or four... or 10 years.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 14803,
		"title": "RE: Shadow Master",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-06T21:12:27.000Z",
		"content": "Here try this link out:<br /><br />[url=http://www.savefile.com/files/471394]www.savefile.com/files/471394[/url]<br /><br />Tell me if it works. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 14804,
		"title": "Re: RE: Shadow Master",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-02-07T19:41:32.000Z",
		"content": "Really great! <br /><br />But about the control, have you ever played MDK2?<br />I love the controls in MDK2, why don't you try have same in Keen 64? Would be alot easier..."
	},
	{
		"id": 14805,
		"title": "Re: RE: Shadow Master",
		"author_id": 1485776,
		"author_name": "therealdopefish",
		"timestamp": "2007-02-08T09:37:40.000Z",
		"content": "if this is your first game I'm amazed even though I can see clearly it's made in Blitz 3D(and not only because of the icon) with little physics knowledge. You should look at the source of one of the examples of Blitz 3D which has a jumping 'Mario'.<br /><br />As for the camera: I think 3D Platformers are not very suited for PC keyboards and really need a controller.<br />So a free camera movement is needed. For some things it might move to a fixed camera position(believe me, the creators of Super Mario 64, etc. did add this with purpose, because in some areas with free movement camera it's harder than you think(spiral towers mainly)) that can be overwritten with mouse movements. You can use the mouse for camera movement.<br />Make sure the movement is relative to camera and not to the character and make sure the camera does not flip too fast. You could use some code like this:<br /><br />camerax=oldcamerax*(SMOOTHNESS)+wantedcamerax*(1.0-SMOOTHNESS)<br />cameray=oldcameray*(SMOOTHNESS)+wantedcameray*(1.0-SMOOTHNESS)<br /><br />in this case SMOOTHNESS is a value between 0.0 and 1.0 with 0.0 meaning instant flipping the camera and 1.0 with never moving the camera. You should try to find a value between 0.0 and 1.0 for it that seems to work fine if you get the camera working.<br /><br />And I love frustration in a platform game so I personally like the platformness:PIf Dopefish is for real, what would it be evolved from?"
	},
	{
		"id": 14806,
		"title": "Re: therealdopefish",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-08T22:04:49.000Z",
		"content": "No, this is not my first game, if you go on the thread for this game in the \"Unoffical games\" thread. In my first post I have links to my other games. This is however my 2nd programmed 3D platformer, the first was another beta of a game, and I'm not too proud of it, though with all I have learned from this game I might update it. <br /><br />Yes, I'm sure you could tell it was Blitz3D, because it was so amateur lol.<br /><br />I'll check out the example again, I never really looked it over because the jumping in it is flawed compared to mine (for instance he can keep jumping in midair before he even hits the ground, which last checked is not the case in mine, and if it is...please tell me!!!! haha).<br /><br />It's not that I have little physics knowledge, I just didn't implement that knowledge. Most of the programming was done in a crunch in the last days of January so I was suprised things are as good as they are. I am taking physics right now and I am doing very well in it, I considered implementing some of the formulas in it while crunching to make it, but I didn't have time.  And I now plan to (Globox suggesting it backed up the idea).<br /><br />I agree they need a controller, but heh, who has a controller? I could add a fixed camera for certain areas, like sprials, that does sound like a good idea.<br /><br />I have a controller, I'm not sure about anyone else, but I could program it in and let people switch.<br /><br />Agreed, I admit the games' jumping and movement is a little rough around the edges. My main focus was to get it all working without major problems. My focus now will be to add upon my good base to make it meet up to the standards and smooth things out.<br /><br />Many thanks [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 14807,
		"title": "Re: ZidaneA",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-08T22:24:44.000Z",
		"content": "ZidaneA, I have played the demo of MDK2 on Dreamcast, so I don't remember the controls too clearly but I will definately check them out now. Thank you! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 14810,
		"title": "thetastyplatformgame",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-09T00:39:54.000Z",
		"content": "I don't recall the MDK2 controls, but I've been playing Lego Keen II on PC for a couple of days, and it's renewed my faith in the 3D platform genre. I can see a 3D Keen game actually working with a similar engine.<br /><br />Definitely include gamepad support. I use a PS2-style one for most games these days.<br /><br />If iPod fetish is from veal, what beer would Ford love?"
	},
	{
		"id": 14811,
		"title": "Re: thetastyplatformgame",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-02-09T10:28:47.000Z",
		"content": "Would that be \"Lego Star Wars II\"? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  (Assuming that's what you mean, I have to agree - it's a great game)"
	},
	{
		"id": 14812,
		"title": "Re: thetastyplatformgame",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-09T13:42:22.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Yeah, Lego Star Wars II."
	},
	{
		"id": 14808,
		"title": "Re: ZidaneA",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-02-10T21:42:25.000Z",
		"content": "Try to download the PC version, haven't tryed out the DC version.<br />But the PC version is smooth and easy to use. ^^"
	},
	{
		"id": 14809,
		"title": "RE: ZidaneA and Commander Spleen",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-13T01:51:35.000Z",
		"content": "Ok, I'll check out Lego Star Wars 2 demo for style ideas. <br /><br />I also have a PS2-style controller, so I will base it off that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   <br /><br />I tried out MDK and I really like the controls! I think for Keen 64 the keyboard controls will be WASD for movement, and the mouse for turning and looking up, then left mouse button will shoot and right button will jump.<br /><br />Also in the beta, I have an option where you can switch the camera modes, so if it's in the 2nd mode, you can turn 360 around keen. Well in the next update I will include that, but instead when the 2nd cam mode mode is set, the mouse will be able to zoom out and turn 360 instead of delete and pg down being the buttons to turn 360 and not having a zoom button.<br /><br />Then for the joystick, 1st stick will be movement, 2nd stick will be camera (360-turn and zoom) that will switch to when R trigger will be pressed. Also left trigger will be fire.<br /><br />Thanks ZidaneA and Commander Spleen! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 14830,
		"title": "Re: Okie dokie...",
		"author_id": 1485776,
		"author_name": "therealdopefish",
		"timestamp": "2007-02-13T22:38:30.000Z",
		"content": "oh yea, i remember i could jump in the air again in that demo, but the jump is smoother than your jump. You don't need work out physics but you could have something like this:<br />[pre] if onAPlatform then   if(jumpButton and not previousFrameJumpButton)then      speedy=15   else      speedy=-1   end ifelse   if(jumpButton and speedy&gt;0)      speedy-=0.5   else      speedy-=1.0   end ifend ify+=speedy;onAPlatform=(collission(floors));previousFrameJumpButton=jumpButton;[/pre]<br />And I advise to make difference between ceilings, walls and floors somehow in your level or you can perform wall jumps and ceiling jumps too.<br />Good luck on the physics.<br />If Dopefish is for real, what would it be evolved from?"
	},
	{
		"id": 14831,
		"title": "Re: Okie dokie...",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-02-14T14:44:01.000Z",
		"content": "No problems. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]    (Yey! I'll be in the credits : D (or not [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   ) )<br /><br />Will you use the original Keen music or will you let somebody make it for you? :3 (I mean like remixes or something.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img]  )"
	},
	{
		"id": 14832,
		"title": "Re: Okie dokie...",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-15T21:28:01.000Z",
		"content": "Hmm, I'm not sure about the music. I could use remixes, it's pretty undecided right now, being that Keen 1-3 didn't have music, so I would have to use Keen Dreams-Keen 6 music or remixes.<br /><br />Credits is another thing that is undecided. I want to add the people who signifigantly contributed (such as you and many others), but then I don't want to leave anyone out. <br /><br />So then lets just say I put everyone who posted on my threads for the project in the credits (regardless of what they did) it would make the bigger contributions seem trivial."
	},
	{
		"id": 14833,
		"title": "Re: Okie dokie...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-02-15T23:27:14.000Z",
		"content": "Okay, I finally got around to playing this...<br /><br />-You should probably add some regular Mars ground. It will make the game feel more like Mars, and make it harder to fall into an endless abyss.<br /><br />-This has probably been said, but the cylinder blocks shouldn't be striped. They were like that in the original game because it was the best way to shade a cylinder with only 16 colors. Of course, you could always keep it for texture, but the top shouldn't have stripes.<br /><br />-Yeah, improve on the jumping. Also, Keen should only be able to turn as he walks, not while he just stands there.<br /><br />-The stars in the background shouldn't move with the rest of the map. It feels as though the stars are just outside the level, rather than far out in space. Also, the original game wasn't really at night. Maybe use a gray sky, rather than night?-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 14834,
		"title": "Re: Okie dokie...",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-02-17T09:54:49.000Z",
		"content": "Lava89: Okey, coz about the music...I'm not really great at remixing and stuff, but atleast I know SOMETHING :P<br />So if you need music I'll be there for you. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 14835,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-02-23T19:39:22.000Z",
		"content": "So I'm on the slow boat to China (problems with the video card), but I finally got the opportunity to play this beta.  It's really good!  It has a ton of potential!  I like it in these early stages.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 14874,
		"title": "Re: Commander Keen 64 Beta",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-04-26T23:41:14.000Z",
		"content": "any updates Lava???[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 14875,
		"title": "Update",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-04-28T20:48:21.000Z",
		"content": "Nothing much, I have been working on an editor to help me make levels, instead of coding all of the items in manually, but I ran into a dead end, but I have been working on the problem."
	},
	{
		"id": 14876,
		"title": "Woo!",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2007-05-08T20:56:14.000Z",
		"content": "Pure... AWESOMENESS."
	},
	{
		"id": 14829,
		"title": "Hey, Whaddya Know.",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2007-05-08T21:27:40.000Z",
		"content": "They don't show up in mine either- however, I didn't put it on  C:/..."
	},
	{
		"id": 14836,
		"title": "Back in the saddle! ......Maybe",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-10T21:46:01.000Z",
		"content": "Flaose:<br />Thank you! I'm glad things got resolved with your card.<br /><br />BP:<br />Thanks man I appreciate the feedback.<br /><br />Everyone:<br />Ok, production <i>might</i> start up again. I've scrapped the editor idea right now, and when I think I have an idea of how I should fix my problems, I have ideas, but I just don't know how to go about doing it.<br /><br />But I don't need an editor to go through with changes, only if I make new levels, and even then it's still possible but it's too tedious of what I feel like doing.<br /><br />I think the first 3 things I will do for the next update is fix the jump \\ fall physics, Yorp \\ Garg AI, and fix the texture problem, which I have figured out how to make the textures show up, even when it's not in the C:\\such and such directory."
	},
	{
		"id": 14837,
		"title": "Re: Back in the saddle! ......Maybe",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-05-10T22:02:07.000Z",
		"content": "Hooray!!"
	},
	{
		"id": 14838,
		"title": "3D Thinking Yorp?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-11T20:35:40.000Z",
		"content": "Ok, I am working on the Yorp AI, I added the little hops (it's rough around the edges, he just goes up real quick then falls down every so often). Now I am working on the \"thinking\" and following movements, but before I add that, I want to make a new animation of the Yorp \"thinking\" (when he looks side to side). <br /><br />So what I want to ask is-- what would the Yorp look like thinking in 3D? In the original games, he looks to side to side, and in 2D that was perfect, but would he be doing in 3D? Since it's hard to tell what a completely 2D character would be doing in 3D.<br /><br />In the 2D games, he faces the direction he is moving then when he thinks he turns to the side and moves his eye back and forth, now this is possible in my game, but that would look weird, in my opinion.<br /><br />There are some other ideas of what he could do, like would he turn from side to side (facing forward)? Will he look behind himself then in front? Will he move his eye from side to side (facing forward)? Or something different?<br /><br />I could always decide myself, but I think asking what you guys think is better. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14839,
		"title": "Re: 3D Thinking Yorp?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-05-11T21:08:13.000Z",
		"content": "Yeah, I think looking over his \"shoulder\" with the eye-stalk would be a good way of doing the \"thinking animation for the Yorp.<br /><br />With the Garg (for the future), a combination of eye-stalks and face tilt.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 14840,
		"title": "Theatrics",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-05-12T02:37:41.000Z",
		"content": "I think a similar animation to the original 2D graphics could work. It'd look sort of like the yorp is looking around a corner, but exaggerated. Kind of hard to describe, but basically instead of the eystalk moving in a straight line from side to side, it swivels out as the eye is rotating."
	},
	{
		"id": 14841,
		"title": "Shuffling Yorp",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-12T18:49:06.000Z",
		"content": "Both interesting ideas. I had one new idea, which the Yorp wouldn't really move his eye, but he turn around confused till he found Keen, then he would continue following him. What do you guys think of that? It's just an idea.<br /><br />Anyway here's a new screenshot, after changing some stuff around:<br /><br />[img]http://img.photobucket.com/albums/v337/Tirqin/Keen8a.jpg[/img]"
	},
	{
		"id": 14842,
		"title": "Hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-05-12T19:53:50.000Z",
		"content": "Really, what would be damn cool (but not easy, if you're coding this yourself) would be to have the Yorp's eye point in the direction of nearby info_nodes that you placed in the environment... So that when he stood still to look around, he'd glance in their direction--at least, his little eyeball would point at them.  <br /><br />This way, when you're designing your levels, you can put the little info_nodes on cool pieces of scenery, maybe platforms that are off to a side, or a clam plant.  Also, make it so other monsters, and Keen himself, are entities the Yorp will glance at.<br /><br />If you can get all that working, the Yorp will wander around, glance at a few key places (you decide) in the environment, and even check Keen out as he approaches.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif?ttinline=true\"/>  That'd be damn cool."
	},
	{
		"id": 14843,
		"title": "Re: Hehe",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-05-12T20:27:10.000Z",
		"content": "The screenshot is looking nice.<br /><br />Keep in mind - Right now everything is floating in space above the ground. Maybe you should have actual ground for Keen to walk on? I think that'd look much better...<br /><br />Btw, Xky ,that's a great idea! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 14844,
		"title": "Re: Hehe",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-05-12T23:50:26.000Z",
		"content": "Looks amazing. But like Genius said have actual ground to walk on. Keep it up.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]"
	},
	{
		"id": 14845,
		"title": "Re: Hehe",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-14T22:06:53.000Z",
		"content": "XkyRauh2001: I think that's a fantastic idea! I'll definately try to acheive it, I think it will bring a little more lively-ness to my game. <br /><br />Genuis314: You're right, it should have ground. But rather than add it to the one level of this, I'll add ground to actual levels adapted from Keen 1.<br /><br />Yorp thinking issue:<br />I think I will combine Flaose's and Spleen's ideas. I think I will have the yorp look to the side of him then in behind (like Flaose said), and while he looks his eye will swivel (Spleen ideas), it will twist (in a way), as his eye turns. That's if I can accomplish it.<br /><br />Now here's some new screens. Commander Keen welcome to Mars!<br /><br />[img]http://img.photobucket.com/albums/v337/Tirqin/Keen9a.jpg[/img]<br /><br />[img]http://img.photobucket.com/albums/v337/Tirqin/Keen10a.jpg[/img]<br /><br />[img]http://img.photobucket.com/albums/v337/Tirqin/Keen11a.jpg[/img]"
	},
	{
		"id": 14846,
		"title": "Re: Hehe",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-05-14T22:25:31.000Z",
		"content": "Looking *much* nicer.<br /><br />Now, also keep in mind, that Keen 1 went above AND below ground. So, you can have areas on the ground, areas in the sky, and areas below the ground.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 14847,
		"title": "Re: Hehe",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-14T22:30:14.000Z",
		"content": "Thank you<br /><br />Yeah, exactly, most of the levels start on the ground and you climb up into the floating areas. Also just to note, those pics I showed are from map level where you'll choose the levels.<br /><br />I'm intending this (if all goes well) to not be an update to Keen 64 Beta, but it will be Keen 64: Demo. It will be alot like the Beta, but different title screen, new updates to the existing level (such updates were mentioned earlier), 3 levels (Beta's level, Map level and secret Map Level). I don't want get too much into a story, but it will be before Keen lost the parts of his vessel. Then if I go and make a remake of Keen 1 as a full game it will have the same story of Keen 1."
	},
	{
		"id": 14848,
		"title": "Re: Hehe",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-05-14T22:33:58.000Z",
		"content": "Sounds good. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 14849,
		"title": "Re: Hehe",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-14T22:36:08.000Z",
		"content": "I don't know if you saw my edit of the post, so I'll post what I was going to say in the edit as it's own post.<br /><br />The pic I showed was from the Map level. The Beta level has already been played in the Beta. And the secret map level, won't be like the map level or the Beta level. It will be just a small area which you can explore, I might show pics of it so you can get a hint of how to get to it, but then I might not. I call it a secret map level because I don't want people to think there will be new levels like the beta level, with enemies to shoot and items to collect, so it's more like map than a platformer level. <br /><br />I hope that all makes sense, LOL."
	},
	{
		"id": 14850,
		"title": "Re: Hehe",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-05-15T00:43:11.000Z",
		"content": "sorta!?"
	},
	{
		"id": 14851,
		"title": "Re: Jimmy",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-15T01:40:20.000Z",
		"content": "Ok....let me put it this way.<br /><br />You have the platformer level that was in the beta, it's just like the cities you go into on Keen 1. They have items to collect, enemies to shoot, etc, just like the levels in Keen 1.<br /><br />Then you have the Map level, like in Keen 1 it's hub with access to the different cities (aka Platformer levels).<br /><br />Finally you have the secret map level. But I only call it a map level because you can only explore it, you can't shoot or collect anything. But it's not like the map level, because you can't access the platformer levels from it."
	},
	{
		"id": 14852,
		"title": "Re: Jimmy",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-17T22:43:29.000Z",
		"content": "So, does this only run on Windows?------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 14853,
		"title": "Re: Jimmy",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-05-18T06:19:19.000Z",
		"content": "Sadly so. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   I don't know what it's made with, but Cedega might run it. (Search for it on Google, then download the trial)"
	},
	{
		"id": 14854,
		"title": "Screenies!",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-05-18T07:00:40.000Z",
		"content": "Those new screenshots are looking most impressive, and seem to possess some notable Keenish atmosphere. Congrats. A pre-Keen 1 setting sounds intriguing--exploring the mountains of mars!<br /><br />The yorp behaviour Xky mentioned would indeed be nifty, and really emphasise the yorp's inherent curiosity."
	},
	{
		"id": 14855,
		"title": "Re: Screenies!",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-18T21:23:27.000Z",
		"content": "Shadow Master, sadly no. Blitz 3D only runs on Windows, if I was using BlitzMax or BlitzMax 3D (when it comes out), it would work on Mac, Linux and Windows. Sorry about that.<br /><br />Thank you Spleen!"
	},
	{
		"id": 14856,
		"title": "Re: Screenies!",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-18T21:40:05.000Z",
		"content": "Never mind. Emulation tricks come to me. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 14857,
		"title": "Re: Screenies!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-05-19T15:06:59.000Z",
		"content": "Man, awesome looking shots. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  Really like the B-w-B. Looks very Keenish, and Mars has a great atmosphere.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14858,
		"title": "Re: Screenies!",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-06-09T15:43:05.000Z",
		"content": "Yeah I agree.  Now if it can just keep the playability!--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 14859,
		"title": "Update:",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-07-02T19:28:40.000Z",
		"content": "Keen 64 has been put on hold indefinately.<br /><br />The last area I was working on was the movement of the yorps."
	},
	{
		"id": 14860,
		"title": "Update #2",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-07-04T01:10:07.000Z",
		"content": "Sorry about the double post.<br /><br />Keen 64 is back on schedule, I got the Yorp AI to work pretty well now, I just have to make it work more consistently and redo the animation for the Yorp's looking animation. Though I have yet to make the curiosity part, both in programming and animation but it shouldn't be too hard implementing that."
	},
	{
		"id": 14861,
		"title": "Re: Update #2",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-09T12:51:35.000Z",
		"content": "Good to hear. Eagerly awaiting new screenshots or a demo. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14862,
		"title": "Re: Update #2",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-07-10T13:29:11.000Z",
		"content": "Yes, good to hear.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 14863,
		"title": "Re: Update #2",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-07-17T20:31:46.000Z",
		"content": "[img]http://img.photobucket.com/albums/v337/Tirqin/YorpKeen1a.jpg[/img]<br /><br />[img]http://img.photobucket.com/albums/v337/Tirqin/Garg1a.jpg[/img]"
	},
	{
		"id": 14864,
		"title": "Re: Update #2",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-18T00:33:16.000Z",
		"content": "Very cool! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Love the yorp, especially. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] [img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 14865,
		"title": "Re: Hehe",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-07-26T18:35:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Then if I go and make a remake of Keen 1 as a full game it will have the same story of Keen 1. [hr][/quote]<br />Remember that stories can be rewritten and still be true to the original.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 14866,
		"title": "Re: Hehe",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-08-29T15:52:52.000Z",
		"content": "After seeing Tabun's work in the [url=http://p098.ezboard.com/fpubliccommanderkeenforumothercommanderkeenstuff.showMessageRange?topicID=1285.topic&start=101&stop=125]Gik or Bip thread[/url] I thought I could update my work, so far I've done the Yorp, though the textured models won't be implemented till I make the full game.<br /><br />Work so far:<br />[img]http://img.photobucket.com/albums/v337/Tirqin/Yorp1a.jpg[/img]"
	},
	{
		"id": 14867,
		"title": "Better?",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-08-29T20:21:47.000Z",
		"content": "Hmmmm..... While the new model would look better to non keen players I think the first is more keenish. Though who am I to talk seeing its your game. Well advice on the new model:  less shading. While Shading sometimes makes a model better I think you might have went a wee overboard. But then again I might not know what Im talking about."
	},
	{
		"id": 14868,
		"title": "Re: Better?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-08-29T20:39:59.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Hmmmm..... While the new model would look better to non keen players I think the first is more keenish. Though who am I to talk seeing its your game.[hr][/quote]<br /><br />Good point, in fact when making it I was wondering the same thing: Will more detail betray the more 64ish feel? In fact I am thinking of start a poll about this. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Well advice on the new model: less shading. While Shading sometimes makes a model better I think you might have went a wee overboard.[hr][/quote]<br /><br />I believe the shading matches the look I was aiming for well. But you could be right, I'll see what others say. I could also lighten the Yorp, as that will make the shading less."
	},
	{
		"id": 14869,
		"title": "Great",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-08-29T21:43:26.000Z",
		"content": "Well seeing as I am not advanced in shading nor 3D models your probably right.  And if the the shading matches the look you want go for it! Because I think the game should look the way the creator wants it to.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 14870,
		"title": "Re: Great",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-08-29T22:24:25.000Z",
		"content": "Well regardless of your experience, I think you made a good point about the Keenish feel.<br /><br />While I like what I've done so far with the Yorp for the style...I am conflicted 50 / 50 about which style to go for. So it's best to let you guys...the Keeners to really make that decision, so never hold back on what you'd like to see, I may not agree 100% but it's good to hear from you guys, the people I am making this for. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14871,
		"title": "Re: Great",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-08-31T03:18:17.000Z",
		"content": "I think the new [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  looks good, but for the sake of Keenishness I would stick with the first one.[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 14872,
		"title": "Re: Great",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-09-03T18:23:16.000Z",
		"content": "I  hate it when the Keenish argument is abused like this. Its like saying well it looks bad but its better because it resembles the original closer. If you reason like this you might as well use the flat 16 colour sprites of the original game: 100% ugliness but still 100% Keenishnness.<br /><br />Seriously whats wrong with a creators own imagination?<br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 14873,
		"title": "Re: Great",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-09-04T04:31:47.000Z",
		"content": "Good point.<br /><br />I guess it would be more accurate to say that I like the original more, not necessarily for the sake of Keenishness so much as the fact that that's just the kind of look I like better.  The other yorp is certainly of higher quality and most likely goes better with the newer, better tiles anyway.  In any case, go with whatever you think is best, because I personally will like it enough either way.[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 14813,
		"title": "Re: thetastyplatformgame",
		"author_id": 1486114,
		"author_name": "poyZONE",
		"timestamp": "2007-09-06T17:01:32.000Z",
		"content": "Broken link [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]"
	},
	{
		"id": 14814,
		"title": "Re: thetastyplatformgame",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-09-06T21:44:30.000Z",
		"content": "Ok...it should work now. Methinks my profile was deleted."
	},
	{
		"id": 14815,
		"title": "Re: thetastyplatformgame",
		"author_id": 1486114,
		"author_name": "poyZONE",
		"timestamp": "2007-09-07T05:59:38.000Z",
		"content": "Great work indeed. Thanks for you efort.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   :P<br /><br />Negative goes to this: <br />1.Turning to left or right is to slow.<br />2.When you jump you get to much speed.<br />3.Where's the pogostick?<br /><br />You need to bend to see what's down , or a panoramic camera when youy puse one key...( this is very important ) <br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]"
	},
	{
		"id": 14816,
		"title": "Re: poyZONE",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-09-17T16:16:58.000Z",
		"content": "1. Yes, very much so, the turning has been completely revamped, you no longer \"turn\" but when you press left or right he automatically walks in that direction. Like in the 3D Mario or Sonic games.<br />2. Noted [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />3. Pogostick is absent due to a combination of a little lazyness for the beta and plot device. The beta (same with the upcoming demo which is the beta level but with a little more and improved gameplay) is based un-canonically before the first game, the premise is \"what if Keen explored other parts of Mars before he went where he went in first game and got his parts stolen?' so you won't see the pogo till the full game."
	},
	{
		"id": 14817,
		"title": "Re: poyZONE",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-09-18T00:33:27.000Z",
		"content": "You should add something to the story (of the full game) explaining how Keen's pogo stick became a holy relic.  Maybe it showed divine powers somehow.  Heh.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 14818,
		"title": "Keen 64",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2007-09-20T20:12:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You should add something to the story (of the full game) explaining how Keen's pogo stick became a holy relic. Maybe it showed divine powers somehow. Heh. [hr][/quote]<br /><br />Remember that in the Keen 1 story, the Martians consider ALL toys to be \"holy\", so the pogo stick isn't really that much different.<br /><br /><br /><br />I tried to play the Keen 64 demo, but it wouldn't work.  I followed all the instructions, but when I ran the EXE, a 640x480-size window popped up, and then after a couple seconds, I got a message saying \"unable to set graphics mode.\"  I have a Windows XP with 256 MB of RAM and just under a gigahert of speed, and earlier tried it on a Windows ME with the same capacities and got the same results."
	},
	{
		"id": 14819,
		"title": "Re: Keen 64",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-20T20:15:55.000Z",
		"content": "It means that for some reason, your video card cannot switch to the game's resolution mode. Seeing as the resolution is a standard 4:3 resolution (640x480) this is pretty weird, though. Tried installing the latest video card drivers?____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 14820,
		"title": "Re: Keen 64",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2007-09-20T20:33:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Tried installing the latest video card drivers?[hr][/quote]<br />I just got my computer recently, from a friend, and it has the latest DirectX, but no OpenGL programs will run on it.  On the Windows ME computer I mentioned, however, OpenGL worked fine but I did have a relatively old version of DirectX.<br /><br />Could it have something to do with the fact that XP does not openly support 640x480, or perhaps because my video card only has 32 MB?"
	},
	{
		"id": 14821,
		"title": "Re: Keen 64",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-09-20T21:45:04.000Z",
		"content": "I think it might be the fact that any OpenGL games won't play on it. To my knowledge BlitzBasic uses OpenGL.<br /><br />It could be the fact that it only uses 32MB, but I doubt it. Have you tried it on other computers with higher memory?"
	},
	{
		"id": 14822,
		"title": "Re: Keen 64",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-21T11:24:30.000Z",
		"content": "32 MB is quite 3D capable, and any monitor/video card supports 640x480 (doesn't depend on the OS really), so I'll put my bets on the OpenGL thing too.<br /><br />I'm not sure, but I think there are software emulated OpenGL drivers out there...____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 14823,
		"title": "Re: Keen 64",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2007-09-27T19:57:44.000Z",
		"content": "OK.  I found a promising OpenGL software kit called \"GLSetup\", but I can't download it directly; only with a download manager.  Since the only computer I have with internet has certain restrictions, I can't run the 200-kb download manager.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]   Oh well.<br /><br />No, I haven't tried it on any better computers.  I agree, it's probably the OpenGL.  Thank for the help!"
	},
	{
		"id": 14824,
		"title": "Re: Keen 64",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2007-10-04T20:43:35.000Z",
		"content": "I found out why it wouldn't work on my computer.  My video adapter only allowed 16-bit and 24-bit color palettes, and Keen 64 apparently needs 32-bit.  I tried it with a 32-bit-enabled adapter and it will run, albeit very slowly.<br /><br />However, the textures won't show up.  I've tried playing the game with the files being in C:\\keen64beta\\*.*, C:\\keen64\\keen64beta\\*.*, and C:\\keen64beta\\keen64\\*.*, and the textures wouldn't show up no matter what.<br /><br />I suggest you add a feature to optionally move Keen in relation to the camera instead of using the left and right keys to turn.  It would make it more classic and also allow your Keen model to be seen from more angles.  WIth the current controls, it can get annoying waiting for Keen to turn 360 degrees just to shoot a Garg or something! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14825,
		"title": "Re: Damien SR",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-10-04T22:23:28.000Z",
		"content": "<b>File path:</b><br /><br />It should work if the folder containing the exe is on the C drive, so like C:\\Keen64Beta, but you've already tried that it seems. <br /><br />Does anyone else have textures not working? (Compare the way the game looks on your computer to the pictures to know for sure) <br /><br />Because some people I noticed didn't realize that if the map is white the intended textures weren't working, so please make sure the map isn't white so I know what is being done wrong and what is being done right.<br /><br />For the demo I figured out a solution for it so it *should* work in the next revision.<br /><br /><b>Turning controls:</b><br /><br />Yeah that's a good point, even though it's still being refined, in the demo I have made it so when you press left he's automatically turned left and moving left and so on, like in the 3D Sonic or Mario games."
	},
	{
		"id": 14826,
		"title": "Demo Update",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-10-29T06:18:56.000Z",
		"content": "Ok, recently I've been working on the controls. <b>So here is an update of my progress:</b><br /><br /><b>Joystick &amp; Camera:</b> Having a Joystick might be scrapped till the full version. I have been having problems with the joystick and playing the game (aiming for platforms, movement too sensitive, etc), this could be some bad level design on my part because the level has alot of endless pits, as Genius314 mentioned before, so it wouldn't really be till the full version that I could make levels more adapted for the game pad.<br /><br />I could just leave it to the Keyboard &amp; Mouse, but I'd hate to cut back on features and leave them for the full game. And I did get the controls set up, I just needed the camera to update properly, so I could do this as the last area in the demo. <br /><br />Either way it's not too much trouble, I just don't want to have a bunch of control problems for people.<br /><br /><b> What do you guys think?</b> Considering the problems mentioned in this post...<b>should I still bother putting in gamepad support for the demo?</b><br /><br /><b>Jumping:</b> DaVince, I noticed you said on the first page of this thread to make the jumps exponential, if I was to do that, what would that look like? (visually, I'm not talking from the programming side) And what would be the difference between that and linear jumping? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14827,
		"title": "Re: Demo Update",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-29T08:11:26.000Z",
		"content": "[hr]<b>Lava</b> DaVince, I noticed you said on the first page of this thread to make the jumps exponential, if I was to do that, what would that look like?<br />[hr]It would look just as in the Keen games, and indeed most platform games. Mathematically it would look like an upside-down [url=http://en.wikipedia.org/wiki/Parabola]parabola[/url].<br /><br />For example, an object has an initial jumping rate of 10 units. Every fraction of a second, the value is added to the object's height, and reduced by one. So a fraction of a second later, the object moves up 9 more units.<br /><br />Eventually it reaches zero, at which point it stops increasing and sits there for a moment. Then the value becomes -1 and the object goes back down at an increasing rate (up until a maximum velocity of, say, 10) until it hits something.<br /><br />That's how it's usually done in 2D platformers, anyway."
	},
	{
		"id": 14828,
		"title": "Re: Demo Update",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-10-29T21:04:56.000Z",
		"content": "Yup, it'd look like a smooth jump with a bit more gravity rules applied (velocity). Linear would be if you leave out the velocity, which results in a \"move up at a constant speed until you suddenly fall down again at a constant speed\" behaviour.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	}
]
