[
	{
		"id": 146,
		"title": "keen babysitter music",
		"author_id": 1486387,
		"author_name": "merder",
		"timestamp": "2005-09-29T10:08:33.000Z",
		"content": "i mant to find a certain  music from aliens ate my babysitter but cant find it i tried spatang but that did'nt have it. you can hear it in the deomo too its the music of the level where there are bloogourd on easy in the demo (that makes it much easyer to identify doesn't it?)i want to put it in a game of mine(though not keen)This is not real.<br />You did not see this.<br />You werent here."
	},
	{
		"id": 3756,
		"title": "Re: keen babysitter music",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-29T10:21:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]i mant to find a certain music from aliens ate my babysitter but cant find it i tried spatang but that did'nt have it. you can hear it in the deomo too its the music of the level where there are bloogourd on easy in the demo (that makes it much easyer to identify doesn't it?)i want to put it in a game of mine(though not keen)[hr][/quote]<br /><br />Uh... There are bloog-guards on the first guard-stop (the second demo level) and on the bloog factory (the third demo level)...<br /><br />Could you please be a little bit more specific?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 3757,
		"title": "Re: keen babysitter music",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-09-29T11:09:30.000Z",
		"content": "Good point, Harvey. And also, which format music are you looking for? There's MIDI and also IMF. <br /><br />If you're after MIDI (which I suppose you are, because the IMF pack would have the song you're after in it), chances are if you couldn't find it at Dos Classics, then it doesn't exsist. Sorry...--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 3758,
		"title": "Re: keen babysitter music",
		"author_id": 1486387,
		"author_name": "merder",
		"timestamp": "2005-09-29T11:31:20.000Z",
		"content": "i meant the level you need the grapling hook for(in the demo).i want it in midi and also in mod(becouse the program  i want to use it in is,nt midi compatible (yet)).This is not real.<br />You did not see this.<br />You werent here."
	},
	{
		"id": 3759,
		"title": "Re: keen babysitter music",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-09-29T12:34:25.000Z",
		"content": "In that case, you are probably out of luck. No one's composed a MIDI version of that song yet (I don't think so. At least I didn't see any on Beyond the Pogo). And there's even less chance there's a MOD version of it. <br /><br />There's some MID2MOD conversion utility I used once which worked okay for making MOD files. You could use that if you come upon a MIDI file.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 3760,
		"title": "Re: keen babysitter music",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-09-29T14:27:56.000Z",
		"content": "Long time no see merder , I have a very good progam to edit sound files that I can send if you can come online on msn and i will take a look in the keen files , come online on msn okI am the bad you are the ugly There is no good"
	},
	{
		"id": 3761,
		"title": "Re: keen babysitter music",
		"author_id": 1485755,
		"author_name": "Scizor CT",
		"timestamp": "2005-09-29T20:19:51.000Z",
		"content": "I suppose this is as good a time as any to post [url=http://www.angelfire.com/musicals/slightlyoddguy/ckmusicpack.zip]this.[/url] I'm fairly certain I've got every Keen track in MIDI form there, collected from B. Prince, Xky, and KeenCommander's stuff. As for MOD files, I don't believe any have ever been made.<br /><br />Oh, and feel free to tell me if I've mislabeled anything, especially the CK5 tracks."
	}
]
