[
	{
		"id": 482,
		"title": "Fanfiction: The earth is doomed 2",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-22T21:35:49.000Z",
		"content": "<b>CHAPTER ONE: THE DROOLY PLANET</b><br /><br />It was a dark and stormy night. Keen went in his B-W-B to study the ancient Vorticon I. Just before he reached the planet, he got a call on his Photachyon Transceiver saying that he had to go to planet Vervoo; the princess of that planet has been kiddnapped and Commander Keen is the only one who could save her.<br /><br />When he got there, he started to drool uncontrollibly because of some gas. While gargling, Keen said  \"I must save the princess!\" He found out the \"princess\" is actually a man eating monster shaped like a lima bean and the size of an rhino!<br /><br />Keen whipped out his stun gun but the bullet did nothing to the monster! Keen ran in his B-W-B and flew off the planet! After Keen left the atmosphere, he stopped drooling.<br /><br />Find out what happens next in chapter 2...<font color=\"BLUE\">A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13493,
		"title": "Hmm...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-22T21:44:56.000Z",
		"content": "Well, I'd say Keen just visited the planet Harvey Smith [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  .<br /><br />Weird... That sounded like a 2nd grader's summary of a book.<br /><br />You need to work on your suspense skills.<br />The reader has no reason to keep reading.<br /><br />Just some things you should keep in mind for you next chapter.<br /><br />-- NAJAWA --<br /><br />Edit: Ah... easier to read. It makes more sense now. Okay... er... Gimme chapter 2 please!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]"
	},
	{
		"id": 13494,
		"title": "Re: Hmm...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-09-23T02:53:54.000Z",
		"content": "dude, that's like four loosely connected sentences.  definitely not a chapter.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 13495,
		"title": "Re: Hmm...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-23T05:31:50.000Z",
		"content": "Let us rename this the 'teach Harvey fanfictioning' thread.<br /><br />1.) Make a chapter longer, usually about 500 words.<br /><br />2.) Individual sentennces. That are loosely connected together. Don't really sound. That good. Make them longer. And more descriptive. And try to make them flow together.<br /><br />3.) Witter on about something as long as you can, usually fanfics fail because they skip stuff to fast. It was a dark stormy night, but where? What time? Why was Keen there? Was it raining? How does he feel? And so on.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13496,
		"title": "Re: Hmm...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-23T06:46:30.000Z",
		"content": "Haha, I like the self-deprecating joke. Apart from that, it's not really a chapter - more like a poorly-written book summary as najawa said.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 13497,
		"title": "CHAPTER 2: RETURN TO PLANET VERVOO",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-23T10:31:25.000Z",
		"content": "Keen was starting to get interested in planet Vervoo. He returned to planet Vervoo just to explore it, even though it forces him to drool.<br /><br />He examined it. The seas of the planet are made on drool. Everyone on the planet looked like Keen, but they were always drooling.<br /><br />He soon met the Vervoo king, who gave Keen the ability to spit acid 50 miles far! Keen didn't know it yet, but he will need it in the next planet he visits...<br /><br />Which he will visit in chapter tree, which will come soon!<font color=\"BLUE\">A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13498,
		"title": "Re: CHAPTER 2: RETURN TO PLANET VERVOO",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-23T12:46:29.000Z",
		"content": "Can't say this story interesting. I don't think this is written seriously at all, just another way of spamming.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13499,
		"title": "Try this:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T13:43:14.000Z",
		"content": "Instead of your first chapter 2, do something more like this:<br /><br />\"Keen went home that night, and lay in bed. He couldn't sleep. <i>What substances make you drool in their vecinity?</i> Keen though. He did some research, but the only one which could produce such immediate results would be mercury... but that would take a few minutes to begin, and kick in.<br /><br />Keen was starting to get interested in planet Vervoo, and decided he would return to the planet, and discover what substances, or power, made him drool. This time, though, he packed a breath mask, and a murcury alarm. He then returned to planet Vervoo in order to explore it.<br /><br />When he landed, he put on his mask, and turned on his alarm, and headed outside. Even though he was wearing a bioweapeon proof mask, he still drooled... and started to sufficate in the drool. Drool started to clog his nose, and was filling up the airtight mask. Keen started having trouble getting the mask off. He started to wave in and out of counscienceness... and fainted.<br /><br />To his luck, even though he was unconscience, he still drooled. His mask was blown off the the extreame pressure buildup of saliva, and drool. When Keen came to, he was dreanched head to toe in drool.<br /><br /><i>So...</i> he thought <i>I guess it's not any substance I've ever heard of.</i> So he decided to explore the planet. He examined it. The seas of the planet are made on drool. Everyone on the planet looked like Keen, but they were always drooling. <i>Strange...</i> he thought <i>... I guess no one is immune to it. But I didn't see any incoming space craft, and therefore, they have been here far longer than, and haven't died... so I'm safe, I guess.</i><br /><br />He soon met the Vervoo king, a man who looked just like keen, but had a beard [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] . He taught Keen how to spit acid 50 miles far! Keen didn't know it yet, but he would need it in the next planet he would visit...<br /><br />Stay Tuned For Chapter 3\"<br /><br />BTW - Avoid preseant tense; I gives the impression that this is a pc games selling line <br />(e.g. Commander Keen, Episode 4:<br />Keen has just returned from Vortican IV, and is forced to eat mashed potatoes, and go to bed early...)<br /><br />Oh well; I hope to see an improvement in your next chapter.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13500,
		"title": "Re: Fanfiction: The earth is doomed 2",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-23T14:30:13.000Z",
		"content": "When I opened this topic I knew that I would find some quality Harrey stuff. I was right as always.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13501,
		"title": "Uh...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T15:36:25.000Z",
		"content": "\"When I opened this topic I knew that I would find some quality Harrey stuff. I was right as always.\" - Emphesis added.<br /><br />Are you implying that you are Harvey?<br /><br />-- NAJAWA --"
	},
	{
		"id": 13502,
		"title": "Re: Uh...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-23T15:40:25.000Z",
		"content": "\"Opened\" as in \"double-click to open\", rather than \"open a new discussion\"."
	},
	{
		"id": 13503,
		"title": "Well...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-23T16:09:51.000Z",
		"content": "I used to write exactly like this. It was way-back-when when I was twelve. Then over three years I noticed how corny I was. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />I've read books on writing and here is my advice.<br /><br /><b>Elongate.</b> You need to stretch it out with every bit of worthwhile bit of information you can think of. Add on to the plot by having something going on at home. Maybe something humorous, maybe some family problems so on. This leads us to...<br /><br /><b>Character Development.</b> Always think about the character and how he is in, and reacts to, the events in the plotline. Always show, just at the start, his many great trait and maybe over time show a character flaw that can be knocked out during the length of the story. The best way to show a characters personality is to have...<br /><br /><b>Dialogue.</b> Dialogue is one of the character and plotline development tools. Remember a character always has his own feelings and secrets, so he won't reveal everything about himself in a conversation, leaving a bit of mystery [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  . Now it's ok to show what's going on in the mind of the main character, (but if he's going to have a character flaw leave him ignorant to it in his own mind. Or if you have a better idea, give it a twist to where he knows he has a problem) but with other characters leave what they are thinking hidden to the readers. But another good way to add a surprising element to your story, and a good way to introduce a character, is to have...<br /><br /><b>Stereotypes.</b> These thing are great because once you give the general impression of a character your introducing, it helps to give the reader an image of the character, with both appearance and personality. But then you surprise the reader by making the character totally different from what they had first thought. This surprises your reader making the story a lot more interesting.<br /><br />Ugh... guh. My brain is exhausted from writing that now. I just fished out of me what I could. Alright. There's my...<br /><br />Wait, I just thought of something.<br /><br /><b>Descriptions.</b> Describe most everything, but not down to the smallest detail. Describe the places that surround your character. Describe the appearance of other characters and your own with vivid detail. Also, if you have already described something, you don't need to describe it again after you come around that person, place or thing. Let's say you described the BWB with every noticeable detail, so the next time you encounter the ship, just say something like, \"the sleek BWB.\"<br /><br />Okay, there's my thoughts. :P-Dreamer"
	},
	{
		"id": 13504,
		"title": "Er...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T17:25:43.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]   Uh... Yeah! I knew that!!! hehe... he. *not funny* [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  <br /><br />-- NAJAWA --"
	},
	{
		"id": 13505,
		"title": "Re: Er...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-23T17:55:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Are you implying that you are Harvey?[hr][/quote]<br />Yep, that joke has taken long enough. Harrey is one of my clones, if an admin would bothers to do an IP test than he would see that I'm right. <br />I'm surprised nobody noticed this before, I'm the only one who could make such an annoying clone.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13506,
		"title": "Haha!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T18:09:57.000Z",
		"content": "hahaha!!! *not*<br /><br />Well Harvey; what do you think; are you ready to give us something worth reading (or mocking [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] ).<br /><br />Everybody else: Have you ever considered that an author takes situations in his own life, and puts them in his writting?<br /><br />The planet of drool would be the PCKF [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] .<br /><br />-- NAJAWA --"
	},
	{
		"id": 13507,
		"title": "Re: Haha!!!",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-23T18:13:10.000Z",
		"content": "Ok then not.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13508,
		"title": "CHAPTER THREE: THE MOST DANGEROUS PLANET KEEN'S EVER BEEN ON",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-23T19:10:26.000Z",
		"content": "Keen lands on a planet that looks like some-kind-of factory and has seas made of green acid that can eat through anything and everything but bones. It made Keen feel sick. (and I can understand why![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  ) Keen wanted to open a door, but he couldn't reach the button.<br /><br />He spit on it with his super acid spit and, not only was the button pushed, but it also was eaten straight through! Keen found out that acid he can spit was the same acid that is in the seas of the planet, but mixed with an other chemical too protect Keen from getting eaten by it. It ate everything but everything that comes with a human (besides for clothes).<br /><br />Keen entered the door, which is now open, and saw a monster hungry for humans!! Keen spit on the monster and his spit quickly ate through the entire monster, leaving nothing but bone.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  Keen needs to explore more...<br /><br />Find out what he runs into in chapter four...<font color=\"BLUE\">A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13509,
		"title": "Q:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T19:18:20.000Z",
		"content": "How old are you, Harvey?<br /><br />-- NAJAWA --"
	},
	{
		"id": 13510,
		"title": "Re: Q:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-23T19:21:01.000Z",
		"content": "Dude, don't you see you're offending him?<br />Personally I'm more curious to know your age.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13512,
		"title": "Re: Q:",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-09-23T19:25:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Keen entered the door, which is now open[hr][/quote]<br />..that is brilliant [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] [url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 13511,
		"title": "13",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T19:27:32.000Z",
		"content": "I'm 13:<br /><br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumother.showMessageRange?topicID=2185.topic&start=1&stop=20]p072.ezboard.com/fpublicc...=1&amp;stop=20[/url]<br /><br />I even said so. I an exited, young, enthusiastick... teen (I keep forgetting I'm a teen now, and not a preteen).<br /><br />I'm turning 14 very soon.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13513,
		"title": "Re: Fanfiction: The earth is doomed 2",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-23T19:34:37.000Z",
		"content": "Well it's stated that door is open because Keen had some obvious problems with it. It puts an emphasis on Keens achievement and I think that's well done.<br />It shows this guy has tallent and knows how to attract the readers attention, I can't wait for the next episode. <br /><br />Oh ten years later I will soon turn into thirty.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13514,
		"title": "I agree:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T19:51:06.000Z",
		"content": "Well, xtraverse; If he didn't say, \"which was now open,\" we'd have thought that keen did something supernatural.<br /><br />Though, it is kinda funny!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 13515,
		"title": "Re: I agree:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-23T21:50:41.000Z",
		"content": "\"Everybody else: Have you ever considered that an author takes situations in his own life, and puts them in his writting?\"<br />Well, definitely not always.. At least I don't.<br /><br />Anyways, try to decrease normal chattering, please! (And do NOT reply \"Ok, I will\" or anything related to that!)<br /><br />Wouldn't it be best to say just \"Keen opened the door and entered\"? (Rhetorical question..)[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13516,
		"title": "Retorical Answer:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T22:13:52.000Z",
		"content": "Retorical Answer: Yeah... I agree.<br /><br />If you do your homework, you will relize that almost everything in J.R.R. Tolkien's books can be related to his life.<br /><br />Did You Know; When Tolkien was a boy, he was bit by a very large african spider; thus, Shelob.<br /><br />-- NAJAWA --<br /><br />Addition by KR: Who cares about Tolkien's material? It's not that good. Anyways, I've read one biography about him (and it was much better than any LotR) but I naturally can't remember the spider thing. But I think it's quite far-fetched to say almost everything is based on his life.<br />Besides, Tolkien's name has been mentioned only once in my school books. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]      <br />And, cut the rhetorical answers.<br /><br />Edit by Najawa:<br /><br />1) You should like him; He wrote the greatest books ever!<br />2) He loved Finish [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]     <br />3) Read the Hobbit, and the Lord of the Rings; and you'll know why... If you have, then your brain of a [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img]     !!!<br /><br />Continued by KR:<br />1.) You have no taste about literature. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]    <br />2.) Dunno about that.<br />3.) I have read them. And didn't like them.<br /><br />Additions by Najawa:<br />1) Get a life<br />2) It's true, yes; Finish was his favorite language second to old English.<br />3) And they don't like you either!!! Boy, what do you read? How-to manuals???<br /><br />Replied by KR:<br />1.) No need.<br />2.) Ok, whatever.<br />3.) Well, that's good they don't like me. Of books I read cyberpunk and philosophy mostly, and traditional scifi as well, and from web allkinds of stuff, whatever nice comes across. Manuals? No need for those.<br /><br />Exasperations from Najawa:<br /><br />1,2,3) Gah!!! Your hopeless!!!"
	},
	{
		"id": 13517,
		"title": "Re: Retorical Answer:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-23T22:29:53.000Z",
		"content": "Hey Najawa, are you going to continue your fanfic, it was doing pretty well.<br /><br />\"Commander Keen - It came from the Drool planet!\"A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13518,
		"title": "Chapter four: deaper into the dark planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-23T23:13:25.000Z",
		"content": "Keen found a machine that was invincible to all acids, so he jumped into it and rode in through the icky acid that ate everything but bone. The liquid was 50% transparent, 50% green, so it was hard to see.<br /><br />\"Why am I going through this awful acid anyhow?\" Keen asked himself, forgetting that he had to explore it. Keen turned on the flashlight, but it seemed to disappear 10 inches in front of the machine.<br /><br />Keen soon entered a cave and, without realizing it, Keen accidentally entered the mouth of a yawning monster! But Keen soon turned around, to escape the acid and try to repair his ship.<br /><br />After repairing his B-W-B, Keen hopped inside and used the super duper blast to get off the face of the planet.<br /><br />What planet will Keen visit next? Find out in chapter five....<font color=\"BLUE\">A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13519,
		"title": "Re: Chapter four: deaper into the dark planet",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-09-24T00:25:57.000Z",
		"content": "Usually plots involve conflicts and character interactions, not random tours of the galaxy.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 13520,
		"title": "*Tour Guide*",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T02:34:14.000Z",
		"content": "\"*Ding-ding* Next stop; the planet Yorphus II, here, we will see the pink breed of yorp, with 3 teeth, instead of 1!\"<br /><br />Yeah, xtraverse, I agree.<br /><br />Sorry, LL, this one is Harveys post. I have no desire to delve deeper into the slimy world of drool anyways.<br /><br />Just wait till I post my fan-fic (though... that'd probbably be sometime in December. I'm pretty busy writting a story I am calling \"Ronald the Swift: The Legeand of the Moon Blade\" I am really obsessed with it.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13521,
		"title": "Re: *Tour Guide*",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-24T08:16:24.000Z",
		"content": "Didn't we have a nearly identical story about a month ago?Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 13522,
		"title": "Re: *Tour Guide*",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-24T08:31:37.000Z",
		"content": "Who can remember events happened that long ago?<br />But now when I think about it, yes, I think we had some fan fiction there, but can't be entirely sure about it.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13523,
		"title": "Re: *Tour Guide*",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-24T10:02:45.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Just wait till I post my fan-fic (though... that'd probbably be sometime in December. I'm pretty busy writting a story I am calling \"Ronald the Swift: The Legeand of the Moon Blade\" I am really obsessed with it.[hr][/quote]<br /><br />Some tips:<br /><br />* Stay away from too much ancient legends and magical sourcery stuff, thats fine for say, Final Fantasy, but when its done to serious little games like Keen, it can really screw things up.<br /><br />* Study your characters, don't make them do anything they wouldn't do. [This doesn't mean limit them, they should have a unique twist inspired by you.]<br /><br />* One single mysterious powerful character controlling the story is not good.[The 'Dark wizzard syndrome'] Instead try to have 'real life' enemies [Eh?] that have believeable powers, etc. For example, Mort worked hard to make that galaxy destroyer, and Keen had to fight hard to beat it.<br /><br />* Study my role plays and first fanfiction carefully, avoid doing anything that even remotely resembles them.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13524,
		"title": "Whoa!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T14:43:03.000Z",
		"content": "Wait: Ronald the Swift has nothing to do with keen!!!<br /><br />My Keen fan-fic has a lot to do with Carbon Monoxide.<br /><br />BTW - A few questions I need (this would be my research):<br /><br />1) What grade is keen in? I heard collage here, and 3rd grade there; What is it???<br /><br />2) What is the compound for carbon monoxide (e.g. Water is <i>H2O</i>, and Carbon Dioxide is CO2, I want Carbon Monoxide's compound).<br /><br />3) Keen, and myths don't usually mix, but just because you told me so, I going to do some fan-fic like that, not my first, though.<br /><br />Thanks!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 13525,
		"title": "Re: Whoa!!!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-24T14:49:53.000Z",
		"content": "Di- means 2, mono- means 1, so it's simply: CO.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 13526,
		"title": "Hehe... yeah:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T14:59:26.000Z",
		"content": "Oh, duh; I think I remember that from somewear. Thanks; It will be a bit easier than writting Carbon Monoxide evertime.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13527,
		"title": "Re: Fanfiction: The earth is doomed 2",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-24T15:34:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr](And do NOT reply \"Ok, I will\" or anything related to that!)[hr][/quote]<br />That's aimed on me, I guess?<br /><br />Sorry, but I can't promise I will. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 13528,
		"title": "Re: Fanfiction: The earth is doomed 2",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-24T17:01:38.000Z",
		"content": "\"1) What grade is keen in? I heard collage here, and 3rd grade there; What is it???\"<br />Not sure about his real school grade, but he's doing something fast-degree college on his spare time (or something like that, can't remember the exact term).<br /><br />And no Djaser, that was not aimed on you.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13529,
		"title": "CHAPTER FIVE: The planet of the drooling monster",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-09-24T18:40:48.000Z",
		"content": "Keen visited an other planet of eternal drool, became the drool king, and lived happily ever after.<br /><br />If you think that he really did become a drool king, your sadly mistaken.<br /><br />A huge, drooling monster tried to eat Keen, but Keen was to fast, and rushed in his B-W-B and rushed home, living happily ever after.<br /><br />The end.<font color=\"BLUE\">A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13530,
		"title": "Fast Degree Collage:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T20:31:20.000Z",
		"content": "Yes, fast degree collage, that's what it was. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br /><br />Um...<br />[quote]<b><i>Quote:</i></b>[hr]The End[hr][/quote]<br />Err...<br /><br />Geese, that stunk!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <br /><br />Wow...<br /><br />Please, if you have to post a fan-fic (I can't beleive I have to say this); make it worth reading, and don't mess with the, \"And everybody lived happly ever after\" crap.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13531,
		"title": "Re: Fast Degree Collage:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-24T21:22:08.000Z",
		"content": "Well, I'm glad it's all over now. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  The fiction wasn't very well written.. You didn't listen to the tips at all.. But whatever..[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13532,
		"title": "Re: Fast Degree Collage:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-25T02:37:02.000Z",
		"content": "Maybe next time eh H?A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
