[
	{
		"id": 263,
		"title": "\"Keen & Norp: QED War\"",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-07-19T13:21:00.000Z",
		"content": "Well, I know I hae promised this game nearly 5 times over the past 5 years, but this time is actually different.  Before I hadn't a clue how to program, so that always stuck my program pretty good.  However, I waited until now to inform everyone of my progress.  Around two weeks ago (After a course on Computer Programming) I re-started my project.  And since then I have completed all but one of my monster sprites, almost all of my Keen sprites, I have only 2 tile sets left, and I have a so-so programmed Keen, I have a complete story as well.  I'm soon going to put up a website, although that may take some time.<br /><br />I will soon get up my website, hopefully.  I'm also gonna try and get a few screen shots, too.  But this is the most I can give you for now, the story:<br /><br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />One year after Billy's heroic battle with Mortimer McMire:<br /><br />Billy Blaze, now 9, wakes up from something smacking him across the face.<br />\"Mmm... Stop it!\" Billy grumbles.<br />\"I have to go to Mars today!\" Says Billy's pet Norp, a green, one-eyed creature from Mars collected from an earlier adventure.<br /><br />\"What's the occasion?\" Said Billy drowsily.<br /><br />\"Today is the aniversary of the Despotic Garg King was killed by that Viking craft, freeing all Yorps!  It's a day remembered by all Yorps,\" Norp said patriotically.<br /><br />\"Lovely,\" said Billy not fully awake. \"But I think I'll sleep through it.\"<br /><br />\"Come on, get up!\" repeated Norp.<br /><br />15 minutes later Billy was forced to get up at 8:00.  Billy agreed to leave as soon as he got his ship, the Bean-with-Bacon Mega Rocket, preped.  Luckely his mom had to work today, and Molly was inside watching TV, so he could just slip into his ship undetected and drop off Norp.  Billy once again donned his brother's helmet, and grabbed his Neural Stunner and became Commander Keen: defender of the universe!  Then he headed out to the docking bay: his club house.  He got Norp situated, and started his engines.  Keen marvelled at how lovely life was without having to constantly deal with Mortimer.  After all, without Mortimer there can be no problems can there?  How wrong he was.<br /><br />Keen dropped Norp off on Mars, and started to head home.  When he broke atmosphere, he got a distress call from his com system.  It seemed there was a Vorticon Mothership in the area under attack.  This was bad, thought Keen.  The Vorticons had declared war on the Shakadi in what Keen asumed was a territory dispute.  The Vorticons had been winning as far as Keen knew, so he hadn't a clue why there would be a distress call from a Vorticon ship, let alone one of their capitol ships.  Keen set in coordinates and entered hyperspace.  When he got out of it, he looked upon the remnants of a Shakadi craft, and a heavily hit Vorticon Mothership.  Keen was wondering just how it could of been damaged.  He noticed a piece of the Shakadi craft was still attached to the docking bay of the Vorticon ship.  He blasted it away and docked his rocket.  He knew their was more than likely a few hostiles still in the Vorticon ship from the previously docked craft.  He looked at his side, there was his Nueral Stunner. He checked it, it had a full clip: 99 rounds.  Keen docked his ship and hopped out of it.  He walked forward and all of a sudden he was under attack from a VORTICON!  Keen was perplexed beyond belief: the Vorticons had always, when in their right minds, been his ally.  Keen went for his Nueral Stunnerand shot the Vorticon and it fell into a clump, but the Vorticon had already struck Keen first.  Keen was knocked back and his Nueral Stunner flew out of his hand right into a plasma generator.  Much to his dismay, his gun exploded into a thousand fragments.<br /><br />\"NO!\" Keen screamed in anger. \"Crud!\" Keen said a second later, he had also forgotten his pogo stick, now that he had thought about it.  Still perplexed, and now completely disarmed, he proceeded forward into the dangerous, unknown Vorticon Mothership...<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 7042,
		"title": "Re: \"Keen & Norp: QED War\"",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-07-19T14:27:50.000Z",
		"content": "How does the QED figure into this?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 7043,
		"title": "Re: \"Keen & Norp: QED War\"",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-07-19T16:14:29.000Z",
		"content": "If you don't have non-Geosh*ties space, I can provide you with some. Email me on grafix5000 &amp;t gmail d0t com if you want any."
	},
	{
		"id": 7044,
		"title": "Re: \"Keen & Norp: QED War\"",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-19T20:21:49.000Z",
		"content": "Hey, this is good story! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />The gargs won't be happy about that day.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  Poor things have to do some work by themselves instead of making the yorps to do the work.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 7045,
		"title": "Re: \"Keen & Norp: QED War\"",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-07-20T05:49:20.000Z",
		"content": "Garg 1: Gaaarg! [What are the one eyes on about?]<br /><br />Garg 2: Gaaaaarg! ... Garrarrg! [The king died, uh, a lot of days ago]<br /><br />1: Gaaarg? [We had a king?]<br /><br />2: Gaarrg Gaaaarrrrggg! [Yes, KeenRussian the 3rd]<br /><br />1: Gaaaarggg! [Ah yes, horriblly imperialistic fellow.]<br /><br />2: Gaaarrrg! [Meh, lets go run around yelling]A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 7046,
		"title": "yesh",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-07-20T20:29:53.000Z",
		"content": "lemur- You'll have to see now won't you?<br /><br />gpx5000- I already have GeoCities space, but thanks for the offer.<br /><br />KRush- Thanks!<br /><br />LL- You're insane, but that's a good thing."
	},
	{
		"id": 7047,
		"title": "Re: yesh",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-08T18:31:14.000Z",
		"content": "I thought I put some status on this game, I quit it a while ago.<br /><br />I really see no more point in continueing it, because unless I were learn how to program, GM jsut plain sucks at making these types of games.  My source code failed me miserably, and I've already written it twice, so I don't feel like trying for luck number 3.<br /><br />Some day I may release the sprite sheets and tiles for this game, as they were pretty nifty.<br /><br />bleh, fucl you GM.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
