[
	{
		"id": 778,
		"title": "Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-08T02:55:05.000Z",
		"content": "I have had an interesting discussion and want to see some opinions on something. A friend of mine argues that paedophiles are like gays, they cannot be 'cured' that is, their offences against children are part of their sexuality, inherent and unalterable. Therefore they must be locked away and never released because if they are, they shall, as part of their sexuality.<br /><br />My point of view is that this can be treated and cured much like any other criminal activity or psychological disease. I believe this as I have talked to a former paedophile. (Mostly he lectures about getting off of drugs, which he says requires a simalar will to overcome.)<br /><br />There seem to be people on either side of the divide here, what are your opinions?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20175,
		"title": "Re: Paedophilia.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-08T04:02:02.000Z",
		"content": "Considering we no longer live in a society of absolutes, an extreme solution is definitely a bad idea. For that reason, I'm not sure about classifying it as a disease either. It's still a problem that should be worked on, but I dunno, is it really more than an extremely unfortunate sexual deviation?<br /><br />Yeah, I only took one semester of high school Psychology, so I'm not totally sure what I think of this subject yet.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 20176,
		"title": "Re: Paedophilia.",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-11-08T04:59:58.000Z",
		"content": "My guess would be that for some people, it's 'curable', and for some, it's \"built-in\". But who knows._________________<br />[url=http://www.getfirefox.com][img]http://tinypic.com/58fb5[/img][/url]"
	},
	{
		"id": 20177,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-08T08:26:54.000Z",
		"content": "Might be bullshit.<br /><br />In my previous school, there was a teacher who turned out to be a paedophile years later (after I graduated). He didn't do a thing in all those years, they just found out because he was kicked out two schools earlier because of that reason.<br /><br />We were all like \"who would have expected that\"... But maybe that part of his life was simply over, or he learned how to deal with it?____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20178,
		"title": "Re: Paedophilia.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-08T13:20:20.000Z",
		"content": "LevelLord made a topic something like this a while ago (might be a year already from that), although its subject was whether it's morally right or something like that.<br /><br />I don't know, probably it can be cured with some extreme methods and torturing, or as suggested in that other topic, by removing their genitals (which would be appropriate, and would likely slow them down, although not necessarily stopping them altogether). But try and do that to paedophiles in today's society! They have laws and rights and they can't be treated the way majority would like to treat them. Or, does the majority even care enough to get rid of the problem?<br /><br />I'm a bit cynical, and for some reason see it (paedophilia) becoming legal in like 30 years. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20179,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-08T14:58:20.000Z",
		"content": "Punishment that bad is ridiculous. It depends on to what extent they feel attracted to kids, and whether it can be reversed. Should be possible.<br /><br />Best read my post above again, too.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20180,
		"title": "Re: Paedophilia.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-08T15:19:16.000Z",
		"content": "I did read your post but I had nothing to say about it -- punishment isn't needed if they get over it by themselves, or learn to control themselves and don't do anything anymore. I guess that's what you meant.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20181,
		"title": "Re: Paedophilia.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-08T21:01:04.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I'm a bit cynical, and for some reason see it (paedophilia) becoming legal in like 30 years. [hr][/quote]<br />So it's contagious! (that cynical thing)<br /><br />You're being to cynical. I don't how it's Finland but when we here have a paedophilia at work the people are going nuts so I don't see that happen. Also, wasn't Finland the country that prohibited prostitution a few years ago, if so than you're heading in the opposite direction.<br /><br />By the way I think you're talking about practising paedophilia? Because I've never heard about prosecuting paedophilia who weren't involved in sexual abuse of children.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20182,
		"title": "Re: Paedophilia.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-08T21:34:27.000Z",
		"content": "Yeah, you can punish sexual offenders, but it wouldn't be really fair to crack down and stigmatize pedophiles but exclude diaper fetishists or something.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 20183,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-08T23:01:09.000Z",
		"content": "Rewarding them if they do not look at any kids for a while might work better.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20184,
		"title": "Re: Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-09T05:56:10.000Z",
		"content": "Castration has no effect whatsoever, but has been practised since nazi germany, it seems these things are more with desire than ability. (As, I would argue is the case with most men)<br /><br />I just can't think of how a like fro children would be built in, but I don't know, that's why I ask.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20185,
		"title": "Re: Paedophilia.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-09T11:11:11.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Castration has no effect whatsoever, but has been practised since nazi germany, it seems these things are more with desire than ability. (As, I would argue is the case with most men)[hr][/quote]<br />I'm sorry but that's not true.<br />First of all it hasn't been practised <b>since</b> nazi Germany because (secondly) this method was used in slaves in ancient times for example to prevent slaves from sleeping with women of the kings harem and more uses. A method that seemed to have worked as it was practised over several millennia and countries and no known reports of failure are known to me.<br />Now, this isn't final solution to paedophilia and rapists because they have more (sick?) motives for their behave but it does exclude any sexual desires.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20186,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-09T19:36:56.000Z",
		"content": "Not necessarily sick; they just happen to be attracted more to kids. Never forget that every human is a human, no matter how some ethical issues like these are to them. I mean, that teacher I was talking about acted like a normal human too.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20187,
		"title": "Re: Paedophilia.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-09T19:55:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Not necessarily sick; they just happen to be attracted more to kids. Never forget that every human is a human, no matter how some ethical issues like these are to them. I mean, that teacher I was talking about acted like a normal human too. [hr][/quote]<br />No, that's what I'm saying. <br />I referred to criminal activities with children like raping and that when you castrate people they still have some motives to abuse children in other ways.<br /><br /><br />edit - on second hand I understand your confusion. My bad.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20188,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-09T20:26:20.000Z",
		"content": "Ah k. As long as you aren't one of those people who turn against anything not-so-ethical and come up with invalid reasons. I've seen that happen with other discussions a lot, so yeah. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20189,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-10T02:34:47.000Z",
		"content": "It's kinda one of those things where everyone is far too paranoid about it, and with good reason: If you don't support crastration for paedophiles, then you might be one yourself, and then the mob will castrate you.<br />I read it in a comic: [url=http://www.qwantz.com/index.pl?comic=567]www.qwantz.com/index.pl?comic=567[/url]----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20190,
		"title": "Re: Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-10T05:38:01.000Z",
		"content": "Well, as far as anyone can tell, castration doesn't prevent reoffending, simply because whilst it prevent any sexual acts, sex is a lot in the mind and they have a horrible tendency to do other things just as damaging.<br /><br />[url=http://www.research-assistance.com/paper/30119/a_ra_default/chemical_castration.html]www.research-assistance.c...ation.html[/url]<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20191,
		"title": "Re: Paedophilia.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-10T07:16:37.000Z",
		"content": "-You know where that comes from? They were abused themselves, maybe by another pedaphile or maybe some other form of abuse/neglect (there are several). That is what research says. Abuse is a cycle; you've proly heard that phrase b4. And it's any kind of abuse on either side of the cycle, that is, some1 sexually abused may turn abusive some other way or get into some addiction, such as alchohol. But any of those will most likely result in abuse to someone else, and so it's a cycle.<br />-And so no, it is not built in, not from birth. I suppose you could call it \"built-in\" in the sense that they have a strong tendancy, an addiction to it. But that's not an excuse (getting to that point).<br />-Of course, then you ask, well if it's a cycle, then where did it come from in the first place? IDK really, i guess some people just gravitated to it for some other reason that i don't know about. What i've read for sure is that abuse is a cycle, that is, that most people who turn abusive were abused.<br />-And you know, that is where gays come from too; I read that a huge percentage of them have distant/non-existant/abusive fathers/mothers or possibly lost one tragically (again, some kind of abuse). Please don't take that offensively and sorry if it was very blunt, didn't know how else to say it clearly; i don't wanna be mean to a gay guy/girl, because they've obvioulsy suffered enough meanness. But I do think it's wrong to be gay.<br />-addiction seems to often come from the desire to escape from something very painful too. I'm pretty sure I read that. Just thought I'd throw that insight out there.<br /><br />-anyway, none of that makes it a full excuse because you can't blame your environment for your bad, especially abusive, behavior , because then nobody would do anything to help themselves or others; and we all believe that the world has problems that need dealing with right? Someone's gotta stop the cycle and spare victims and those vicitm's victims and so on 4eva since it is cycle.<br />-Okay, maybe you're saying that they've been abused so bad that they can't help themselves, maybe not even be able to recognize the evil nature of their behavior, and so someone else needs to step in and help. You have a point, and it's really getting beyond this topic to argue against that. And yeah, that is true to an extent, or maybe i should say it is true in a sense, and certainly people should step in to help. Still, there have been people who suffered this and didn't become abusive. I happen to know someone like that personally, someone who overcame it, I mean. So yes, it is possible, but not on their own. There is help for that, just like there's help for other addictions/abuse.<br />-btw those books i've read were authored by Stephen (Steve) Arterburn. He's a Christian like me but please don't call it all biased or w/e because what i was mostly talking about were facts, not opinions.<br /><br />-here's a site that seems to have some great, detailed info about this.<br />[url=http://www.ncjrs.gov/txtfiles/break.txt]www.ncjrs.gov/txtfiles/break.txt[/url]<br /><br />I have read only a little, but i did find this:<br /><br />\"For example, antisocial behavior in females such as<br />sexual misconduct or substance abuse often leads to<br />a diminished capacity for parenting, which, in<br />turn, fosters child abuse and neglect or family<br />violence. When the children of these women grow up,<br />they too may abuse or neglect their children,<br />continuing the cycle of intergenerational violence. Women who engage in prostitution or illicit drugs<br />may not establish stable relationships. Growing up<br />without a positive male role model, boys develop<br />simplistic notions of masculinity that emphasize<br />aggression and power. As a result, they tend to<br />engage in delinquent and criminal behavior.\"<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20192,
		"title": "Re: Paedophilia.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-10T13:05:31.000Z",
		"content": "<i>And you know, that is where gays come from too; I read that a huge percentage of them have distant/non-existant/abusive fathers/mothers or possibly lost one tragically (again, some kind of abuse).</i><br /><br />No offence, but that sounds like it came from a religious publication [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  (and they're notorious for being, shall we say, somewhat inaccurate...)  As discussed many times in the excessive number of threads on this forum covering these topics, homosexuality has been all but proven to be a type of birth defect (incomplete set of chromosomes.)<br /><br />I'm not sure about paedophelia though - I don't think enough studies have been done to prove what causes it.  It certainly seems like a psychological disorder, but then that's what people thought about gays before they discovered it was a birth defect, and thus impossible to \"fix.\"<br /><br />At any rate, people don't choose to be paedophiles, so just like being gay, I don't think they should be blamed for something they had no control over.  Providing they have enough self control to live within the laws of our society, so be it.  Given the large number of gay people in the world, and the comparatively small number of paedophiles that get caught, I'd be willing to bet there are rather a lot of paedophiles in the world that are very good at behaving themselves."
	},
	{
		"id": 20193,
		"title": "Re: Paedophilia.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-10T21:35:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, as far as anyone can tell, castration doesn't prevent reoffending, simply because whilst it prevent any sexual acts, sex is a lot in the mind and they have a horrible tendency to do other things just as damaging.[hr][/quote]<br />Well that's basically what I'm saying, isn't it?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20194,
		"title": "Re: Paedophilia.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-10T22:15:19.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]But I do think it's wrong to be gay.[hr][/quote]<br /><br />[img]http://dylangallagher.googlepages.com/sweeper4.jpg[/img][center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 20195,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-11T02:02:55.000Z",
		"content": "How to get straight A's in school:<br /><br />1) Take a photo of yourself, naked, but not showing your face.<br /><br />2) Put it on your teacher's computer<br /><br />3) Threaten to have him/her jailed for paedophilia, unless you get straight A's<br /><br />Works every time!----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20196,
		"title": "Re: Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-11T09:31:48.000Z",
		"content": "That's horribly immoral and I hope you're joking. I'm just glad that the second step is very difficult.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20197,
		"title": "Re: Paedophilia.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-11T19:11:56.000Z",
		"content": "-Well, if it's true that most gays have incomplete chromosones, then fine, but that doesn't mean they can't do anything about it. There have been gays who turned their life around, so it's not cirppling. Just like people can get off drugs or alchohol with help, so could pedaphiles or some other kind of sex addict, or just sex addicts in general. So I still hold them responsible.<br />-There probably are environmental factors that predispose certain people to stuff like this, but they can still do something about it. Like i said, you can get off an addiction with help. It does happen. There's more books and programs and stuff on this than there has ever been, I'm sure, so I find it hard to say they can't seek help. Maybe some of them really are crazy, and I acknowledge that insanity can nullify one's responsibility. But I still think that this is mostly extreme addiction.<br /><br />I found this just to back up what i said before.<br />[url=http://www.narth.com/docs/1996papers/dickson.html]www.narth.com/docs/1996pa...ckson.html[/url]<br /><br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />So i still say that that kind of abuse/neglect is a huge factor in homosexual development, not just chromosones.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20198,
		"title": "Re: Paedophilia.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-11T20:55:00.000Z",
		"content": "Lol, only difference with most homosexuals between other people is their sexual preference. I don't have any problem with homosexuals who just act normal.<br />Of course, there's a whole bunch of homosexual idiots who like to act all weird and softy. And they're like \"oooh I'm gaaay\". I hate those kind of people. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stoned.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20199,
		"title": "Re: Paedophilia.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-11T22:21:12.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>LA:</b><br /><br />I have had an interesting discussion and want to see some opinions on something. A friend of mine argues that paedophiles are like gays, they cannot be 'cured' that is, their offences against children are part of their sexuality, inherent and unalterable. Therefore they must be locked away and never released because if they are, they shall, as part of their sexuality.<br /><br />My point of view is that this can be treated and cured much like any other criminal activity or psychological disease. I believe this as I have talked to a former paedophile. (Mostly he lectures about getting off of drugs, which he says requires a simalar will to overcome.)<br /><br />There seem to be people on either side of the divide here, what are your opinions?[hr][/quote]<br /><br />Well, I'm going to assume that you're Saradis, and you're refering to our conversation.<br /><br />What I said was quite simple: I don't think that paedophiles can change with the information given to me.  I'm not saying they don't, just that I've not seen proof that they do.<br /><br />There is a fair difference between those to argument, though very finite.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>Mortimer:</b><br /><br />-Well, if it's true that most gays have incomplete chromosones, then fine, but that doesn't mean they can't do anything about it. There have been gays who turned their life around, so it's not cirppling. Just like people can get off drugs or alchohol with help, so could pedaphiles or some other kind of sex addict, or just sex addicts in general. So I still hold them responsible.<br />[hr][/quote]<br /><br />Responsible for what, praytell?  For being gay and/or acting on their homosexuality?<br /><br />We've all heard the conservative Christian argument that homosexuals can change their sexuality around, but as of yet, I've never seen one actually work.<br /><br />The statistics that I've heard about and read about have all stated that there is no real way to change homosexuality around.  Homophilia probably is changeable, but not homosexuality.  (Homophilia is the homosexual attraction that is caused by complete environment and no genetic factors.  For example, Sparta in Greece was a largely homosexual nation because of the way their soceity worked.)<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>Mort:</b><br /><br />-There probably are environmental factors that predispose certain people to stuff like this, but they can still do something about it. Like i said, you can get off an addiction with help. It does happen. There's more books and programs and stuff on this than there has ever been, I'm sure, so I find it hard to say they can't seek help. Maybe some of them really are crazy, and I acknowledge that insanity can nullify one's responsibility. But I still think that this is mostly extreme addiction.<br /><br />I found this just to back up what i said before.<br />www.narth.com/docs/1996pa...ckson.html<br /><br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />So i still say that that kind of abuse/neglect is a huge factor in homosexual development, not just chromosones.<br />[hr][/quote]<br /><br />Corrolation =/= causation.  I'm certain there is a environmental factor, but I think it is more like a ratio of environment to genetics.<br /><br />You can argue that they could change it (Though current statistics doesn't shine a very positive light in that direction), but you've failed to state <i>why</i> they should change their sexuality/paraphilias.  If you are going to use the Bible as grounds for argument, I'll let you know right now that that's bad place to argue with me on.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20200,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-12T09:08:57.000Z",
		"content": "I really hope I was joking. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />It just seems like it might be true, to an extent, when you hear of schools where they keep on finding that teacher after teacher after teacher is a paedophile. There's probably a book/movie about it by now - kids making their teachers out to be paedophiles and/or blackmailing them.<br /><br />Since we're talking about homosexuality, let's not forget that there's two sides to that: One is that it's part of the sexuality, which is genetically built-in and blah blah. The other is that it's part of sexual preference, which is very flexible and can, in theory, override anyone's sexuality. (WATCH OUT U MIGHT TURN GAY OH NOES OMG!1111)<br />The \"negative father figure/male role model\" theory is probably true for explaining why some people \"turn\" gay, but it doesn't explain why others are born that way, or why homosexuality occurs in animals with parents that were normal (for their species).----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20201,
		"title": "Re: Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-13T02:45:38.000Z",
		"content": "Well, there is the simple theory that animal behaviour is flexible; the sex drive and behaviours can turn to homosexuality from sheer variation, though in some species it does appear to play a definite role.<br /><br />Another theory I ahve found interesting is that advanced in 'Sex advice for all creation' which proposes that a gene that allows females to breed more successfully (Perhaps by making them more feminine or improving mothering skills) may have a negative impact on males by making them gay; the negative effects from gay individuals (Not breeding, etc) are outweighed by the positive effects on females.<br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20202,
		"title": "Re: Paedophilia.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-13T07:24:55.000Z",
		"content": "@DaVince: I dont see how u say there is no difference other than preference when I just quoted a source saying, \"...results showed significant differences between heterosexual and homosexual groups...\"<br /><br />@LoG: would you believe Pedophiles can change if you knew it was an addiction? Since they have such a strong tendancy to it, it sounds like addiction to me. People can and do get addicted to sex, especially in America since America is so full of it. Notice I just named an environmental factor, but does that make it okay? Rape and pedaphile is not okay because it like obviously hurts people. If you get into that stuff again and again and associate it with violence, like a good bit of the media does, then you are much more likey gonna be a rapist. If you associate with children, then you are much more likely gonna be a pedaphile. And yeah, there are other fetishes and stuff you can get addicted to too that make sexuality complicated and w/e so I don't see how it can't be addiction.<br />-There are help programs for kinds of addiction, alchohol, drugs, etc. Some people get off them and some don't--they either choose to do the hard work to get off or choose not too, and don't forget getting into the addiction was most likely a choice too. You gotta stay away from it all in the beginning and save yourself plus others/victims pain and influence into it. That is a choice, morally.<br />-responibile for being pedophile/gay. Could you show me those statistics somewhere like online if you find it? In particular I want to know if they viewed it as an addiction or as a preference.<br />-if correlation =/= causation then why does this fact I've heard that homos have incomplete chromosones seem to prove to everyone that it isn't possible for them to change? A source for this would be good too.<br />-I would use the Bible, but I know that there's going to be so much debate over that that it would get off topic so fast and much. Now that I think about it, me mentioning the gay thing back there was off topic and I proly shouldn't have said it. However, if you want to start a new post about me using the Bible to argue this, or if its no big deal to argue it here, then I will.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20203,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-13T10:19:36.000Z",
		"content": "But, Levelass, wouldn't the \"feminine gene\" that makes men gay mostly likely indicate that there's a corresponding \"manliness gene\" that gives the species the advantage of having manlier men, but also the spinoff of making some women lesbians?<br />In that case, there wouldn't really be any clear evolutionary winner - manliness or femininity - because the presence of one gene would have the same effect as the absence of the other. And since it's easier to pass on an \"absence of a certain gene\" than a certain gene (I share \"absences of genes\" with LOADS of species! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   Me and the humble wormouth share an absence of the \"purple spikes on the nose\" gene, for example), those two particular genes would just shake hands and file for redundancy.<br />(Wouldn't they? I never studied biology as far as school certificate at high school.)<br /><br />I gotta agree with you that it's an interesting theory though.----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20204,
		"title": "Re: Paedophilia.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-14T00:36:21.000Z",
		"content": "The appearance of a gene for one trait does not imply a gene for another. A gene for black hair does not imply one for blonde, indeed, most often a gene for something explains something else by its ABSENCE. Ergo manliness could be due to lack of a faminizing gene.<br /><br />Of course the reverse may be true; homosexuals may be lacking in a masculinity gene that gives an advantage when women *don't* have it. (And when they do, the become lesbian, or perhaps just poor mothers)<br /><br />Another contentious issue is the rape gene; it is known that rape is genetically based in many species. In mallard ducks rape occurs regularly in springtime for example and rape has been seen in as wide a range of species as homosexuality. Indeed, in some species, given the nature of copulation rape could be considered the norm. The problem arises then, that if there is a gene that predisposes someone to rape, are they any less guuilty?<br /><br />I'm being forced to study more biology than I ever thought existed; who wants a list of the bits of the eye and what they do?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20205,
		"title": "Re: Paedophilia.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-14T01:57:42.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]would you believe Pedophiles can change if you knew it was an addiction? Since they have such a strong tendancy to it, it sounds like addiction to me.[hr][/quote]<br /><br />Buh? An addiction is not the same thing as a preference. That's like saying someone is addicted to apple juice because they prefer it to orange juice. Even if in some cases you can make a homosexual person into a heterosexual, that's not the same as being able to expect all of them to.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 20206,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-14T10:45:02.000Z",
		"content": "\"Criminal Behaviour genes\" sounds like a very politically dangerous &amp; controversial field to investigate. Since certain types of genes can be naturally dominant in certain races/ethnicities of people (blonde hair, flat noses, tallness, etc), imagine how much it would *suck* if your ethnicity was found to have the most occurances of the \"enjoys punching old ladies in the face\" gene. You'd never get a job at a nursing home.<br />Trial-, verdict- and sentence- by DNA... and you don't even have to be born yet to be guilty. Genetically guilty! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]   <br /><br />Um, back on topic, it'd suck if your ethnic group was found to have lots of paedophile genes, and you were a schoolteacher.----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20207,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-15T10:49:38.000Z",
		"content": "Once again, [url=http://www.qwantz.com/index.pl?comic=882]T-Rex has the answer[/url].----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20208,
		"title": "Re: Paedophilia.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-16T04:35:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />@LoG: would you believe Pedophiles can change if you knew it was an addiction? Since they have such a strong tendancy to it, it sounds like addiction to me. People can and do get addicted to sex, especially in America since America is so full of it. Notice I just named an environmental factor, but does that make it okay? Rape and pedaphile is not okay because it like obviously hurts people. If you get into that stuff again and again and associate it with violence, like a good bit of the media does, then you are much more likey gonna be a rapist. If you associate with children, then you are much more likely gonna be a pedaphile. And yeah, there are other fetishes and stuff you can get addicted to too that make sexuality complicated and w/e so I don't see how it can't be addiction.<br />[hr][/quote]<br /><br />I think you've just given a very simplified outlook onto a very complex thing.  No one is arguing that pedophilia is a good thing or that it doesn't hurt its victums --it quite clearly does.  But that is not what we're arguing.<br /><br />Now secondly, being addicted to cocaine and having a paraphilia is largely different.  You can live without cocaine and take yourself away from cocaine, but you cannot take yourself away from sex, sexuality, and sexual thoughts.  It is very simplified just to state \"Well, if it's like an addiction, then they can change it.\"  It's a false analogy and it's not exactly truthful.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-There are help programs for kinds of addiction, alchohol, drugs, etc. Some people get off them and some don't--they either choose to do the hard work to get off or choose not too, and don't forget getting into the addiction was most likely a choice too. You gotta stay away from it all in the beginning and save yourself plus others/victims pain and influence into it. That is a choice, morally.<br />[hr][/quote]<br /><br />This is all wonderful, but your false analogy doesn't allow any of it to remain relevant.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-responibile for being pedophile/gay. Could you show me those statistics somewhere like online if you find it? In particular I want to know if they viewed it as an addiction or as a preference.<br />[hr][/quote]<br /><br />I'll post a few when I get the chance.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-if correlation =/= causation then why does this fact I've heard that homos have incomplete chromosones seem to prove to everyone that it isn't possible for them to change? A source for this would be good too.<br />[hr][/quote]<br /><br />There's no study on this.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-I would use the Bible, but I know that there's going to be so much debate over that that it would get off topic so fast and much. Now that I think about it, me mentioning the gay thing back there was off topic and I proly shouldn't have said it. However, if you want to start a new post about me using the Bible to argue this, or if its no big deal to argue it here, then I will.<br />[hr][/quote]<br /><br />I won't, but if you want to debate it, I won't object.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20209,
		"title": "Re: Paedophilia.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-17T00:26:33.000Z",
		"content": "-You've basically said that my reasoning was false because it was simple. Well that has nothing to do with the validity of an argument. Even if it is \"a very complex thing\", I never claimed to say everything there is about pedaphile/w/e, just those facts. I mean, just those things that I believe are facts. So that next paragraph you quoted still stands, the one about choosing to get off, choosing to stay away and spare victims, etc.<br /><br />-So wait, homons do NOT have a missing chromosone or something? Malvineous said that right after my first post here. If anyone can find source for this please cite it. what you said, LoG: \"The statistics that I've heard about and read about have all stated that there is no real way to change homosexuality around. Homophilia probably is changeable, but not homosexuality. (Homophilia is the homosexual attraction that is caused by complete environment and no genetic factors.\" seems to imply to me that you believe genetics is involved. What exactly is your argument and reasoning?, cuz idk.<br /><br />-since my part about correlation =/= causation got nullified to you because you said that \"fact\" had no study on it, I'll say something else about it. I really dont know what to say except that if you find that homos have this one thing in common, like my source did, well it seems pretty reasonable to suspect that that is at least a very big factor.<br /><br />-I understand that we're arguing whether or not pedaphiles/homos can change and whether or not it is their responsibility. What you said about being unable to take yourself away from sex, I don't think that's relevant because what I was saying was that you gotta avoid getting into it the bad way and thus ruining it and hurting others. (not that im saying \"getting into it\", as in promiscuity, is okay.) So my point there was avoiding those bad things about it is a choice, morally, along with choosing to get out of it.<br /><br />-since you've said before that you've \"never seen one actually work\", i found this. IDK what method/help program was used, and it doesnt really matter to me here; i just wanna cite source of the posibillity. [url=http://new.cnsnews.com/ViewCulture.asp?Page=\\Culture\\archive\\200202\\CUL20020226a.html]new.cnsnews.com/ViewCultu...0226a.html[/url]<br />I know someone said somewhere that just cuz one guy got off doesn't mean every1 can. I just wanna cite this. And I confess I haven't found any source showing a changed, former paedophile, not yet anyway.<br /><br />-you also said: \"but you've failed to state why they should change their sexuality/paraphilias\" The reason for pedaphiles is because its bad, cuz it hurts people, just like you said b4: \"No one is arguing that pedophilia is a good thing or that it doesn't hurt its victums --it quite clearly does.\" As for gays, I use the Bible for that, since I trust God is right. Again, don't wanna get off topic like arguing that would. Could some administrator give us the green light to argue this?<br /><br />-if i missed anything you adressed to me, leme know cuz its getting hard to keep track of it all.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20210,
		"title": "Re: Paedophilia.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-17T01:50:10.000Z",
		"content": "Here are my links and points of interest:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />There are no reliable statistics on the number of people who are homosexual. The American researcher Alfred C. Kinsey conducted extensive surveys on sexual behavior in the 1950s, and estimated that about 4% of men and 3% of women were exclusively homosexual; however, his research found that 37% of men and 28% of women had had some sexual experience with a person of their own gender. Most researchers in the 1990s estimate the percentage of the population with homosexual orientation at about 5%, while recognizing that the estimate is based on projections, not hard statistics.<br /><br />[...]<br /><br />There is no scientific evidence to support the idea that sexual orientation can be changed through therapy. <br /><br />[url=http://www.findarticles.com/p/articles/mi_g2602/is_0003/ai_2602000302]www.findarticles.com/p/ar...2602000302[/url]<br />[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Karen Hooker executed the first psychological test done to test for biological determinism in 1957, on a grant from the National Institute of Mental Health [2].  The study was meant to explore the relationship between homosexuality and psychological development and illness.  Hooker studied both homosexuals and heterosexuals.  Both groups were matched for age, intelligence quotient (IQ) and education level, and were then subjected to three psychological tests.  These three tests, the Rorschach, Thematic Apperception Test (TAT) and the Make-A-Picture-Story Test (MAPS), were then analyzed by psychologists, and the results were tabulated.  The results of Hooker's experiment yielded no significant differences in answers on any of the three tests.  Because both groups' answers scored very similarly, she concluded a zero correlation between social determinism of sexuality. <br /><br />[...]<br /><br />D.F. Swaab conducted the next noteworthy experiment in 1990.  This experiment became the first to document a physiological difference in the anatomical structure of a gay man's brain.  Swaab found in his post-mortem examination of homosexual males' brains that a portion of the hypothalamus of the brain was structurally different than a heterosexual brain.  The hypothalamus is the portion of the human brain directly related to sexual drive and function.  In the homosexual brains examined, a small portion of the hypothalamus, termed the suprachiasmatic nucleus (SCN), was found to be twice the size of its heterosexual counterpart [2]. <br /><br />At the same time, another scientist, Laura S. Allen made a similar discovery in the hypothalamus as well.  She found that the anterior commissure (AC) of the hypothalamus was also significantly larger in the homosexual subjects than that of the heterosexuals [2].  Both Swaab's and Allen's results became a standing ground for the biological argument on homosexuality.  The very fact that the AC and the SCN are not involved in the regulation of sexual behavior makes it highly unlikely that the size differences results from differences in sexual behavior. Rather the size differences came prenatally during sexual differentiation.  The size and shape of the human brain is determined biologically and is impacted minutely, if at all by behavior of any kind. <br /><br />Simon LeVay conducted another experiment regarding the hypothalamus of the human brain in 1991.  LeVay, like Swaab and Allen also did a post-mortem examination on human brains; however, he did his examinations on patients who had died from AIDS-related illnesses.  He examined 19 declared homosexual man, with a mean age of 38.2, 16 presumed heterosexual men, with a mean age of 42.8, and 6 presumed heterosexual women, with a mean age of 41.2 [3].  LeVay discovered that within the hypothalamus, the third interstitial notch of the anterior hypothalamus (INAH3) was two to three times smaller in homosexual men then in heterosexual men.  The women examined also exhibited this phenomenon.  LeVay concluded the \"homosexual and heterosexual men differ in the central neuronal mechanisms that control sexual behavior\", and like Allen and Swaab, agreed that this difference in anatomy was no product of upbringing or environment, but rather prenatal cerebral development and structural differentiation [2]. <br /><br />[...]<br /><br />We have examined many causes for homosexuality in the preceding pages, both biological and social.  And although an interesting topic of debate, no one theory or experiment leads to a definitive answer.  Some believe that the characters found on Xq28 are the Holy Grail of homosexuality research, the elusive 'gay gene'.  <br /><br />[url=http://allpsych.com/journal/homosexuality.html]allpsych.com/journal/homosexuality.html[/url]<br />[hr][/quote]<br /><br />All I'm stating here, Mort, is that stating \"Homosexuality is obviously not a biological factor\" is clearly not founded on statistics and science.<br /><br />Now, I'm willing to admit that this could be wrong, but the current science is pointing to it being a ratio of biological to psychological factors that cause homosexuality.<br /><br />I'm not going to derail this thread anymore.<br /><br /><br /><br />Back to topic.<br />~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20211,
		"title": "Re: Paedophilia.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-17T12:42:03.000Z",
		"content": "I wonder if this thread is being monitored by the FBI yet. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />HEY FBI!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img] <br />PLAY COMMANDER KEEN, IT'S FUN!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20212,
		"title": "Re: Paedophilia.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-19T03:15:42.000Z",
		"content": "-what I wanna say is I did not say that quote, \"Homosexuality is obviously not a biological factor,\" (the context makes it look like I said it, not necessarily intentional) and also another thing on biology. Our physical bodies are connected to our emotions. As a simple example, if I am mad all the time, then I am probably going to develop high blood pressure. But the thing is, high blood pressure doesn't make us angry, as in totally determines it. It's the other way around. I'm sure any emotion has signs in the brain and maybe elsewhere, they just don't necessarily determine our emotions, like my example. Not that I disagree with those researches' findings, but the conclusion of that first one after your link I have a hard time believing; I've got another back there concluding the opposite. I'm going to investigate what those tests are.<br />-Now that I think about it, I wonder if there is any evidence of any emotion that is the other way around (physical determines emotion rather than emotion determines physical, like my example), other than gays, so they say. I'm using \"emotion\" very loosly here.<br />-sorry for like countering you when you said enough of this kind of stuff; i still had more to argue, and if u do, then I say don't worry about continuing it.<br />-I was gonna say something about peadophile again, but now I don't know what everyone's arguing exactly. I think I have my argument so far on the other posts.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20213,
		"title": "Re: Paedophilia.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-19T16:03:18.000Z",
		"content": "I'll start a new thread for this.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
