[
	{
		"id": 663,
		"title": "CKFS - free file storage for the CK community! Sign up now!",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-02-20T16:38:27.000Z",
		"content": "I'm fed up with finding broken links to fan art and speedrun videos which point to free hosting sites, so I've decided to start one of my own in the hope that it might be more reliable. The Commander Keen File Storage Facility, or CKFS for short, will be open to any member of the Keen community who needs somewhere to upload stuff. A few ground rules:<br /><br /> <b>* The majority of stuff in your account should be Keen related.</b> Whilst I don't mind hosting a small or medium amount of stuff which is unrelated, it seems somewhat unfair to give valuable resources to people who just want to host their collection of Mario comics. People who violate this may be asked to leave. (If you want hosting for other stuff, ask me for an actual web hosting account)<br /> <b>* Don't upload anything pornographic, or excessively violent, prejudiced or offensive content.</b> If you're keeping to the above rule, you shouldn't be breaking this one anyway. You should ask me before uploading content you think might violate this rule.<br /> <b>* Don't overuse resources.</b> This will cost me a fair bit to keep running, so I'd rather people didn't use lots of space or bandwidth. (Edit: by \"lots\", I mean over 200MB of space or 2GB of bandwidth per month)<br /> <b>* Yes, you can hotlink.</b> However, I might make an exception to this rule if someone's avatar or hilarious animated GIF is being hit 100 times a second from another site.<br /><br />If you want an account, email me at \"grafix5000 at gmail dot com\" and I'll set you up with one. Addresses will be of the form http://files.commanderkeen.org/users/<i>username</i>/, and you'll upload via a web interface. If you want to try it out, then you can login at [url=http://files.commanderkeen.org/index.cgi]files.commanderkeen.org/index.cgi[/url] with the username and password as \"test\". (All files uploaded on the test account will be deleted when you logout.)<br /><br />Since the account it's on has enough balance to run of its own accord for at least 2 years, the stuff uploaded should stay around for quite some time. I'll also be renewing the domain soon, so that shouldn't be a problem either."
	},
	{
		"id": 16888,
		"title": "Re: CKFS - file storage for the Keen community!",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-02-20T17:26:46.000Z",
		"content": "Nice. This sure will help people who make mods and such. I mean, I'll ask for one when I'm sure I'll use it.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 16889,
		"title": "Re: CKFS - file storage for the Keen community!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-02-20T20:00:56.000Z",
		"content": "This sounds like it'll be useful. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 16890,
		"title": "Back, and nice.",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2007-02-20T23:05:11.000Z",
		"content": "I come back to find someone with a good idea! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 16891,
		"title": "sticky, plz?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-07-16T17:31:05.000Z",
		"content": "Would someone mind making this a sticky? It seems we don't go a week without someone needing webspace of some kind."
	},
	{
		"id": 16892,
		"title": "w00zle s0zzle",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-16T17:46:37.000Z",
		"content": "This is perfect, since I and a lot of other people have a whole bunch of keen-related files that need hosting. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   I can't believe this hasn't been done before.[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 16893,
		"title": "what the hell is a w00zle s0zzle",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-07-16T21:50:02.000Z",
		"content": "During the kMod era, I remember that I came up with an idea very similar to this called \"ModServ\"; alas, I never follow through with anything, so I'm glad someone has done it (not saying you copied my idea, because I don't think I ever announced it).<br /><br />I may have to get one of them accounts, because qsilver90.com is on cocaine again.-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	}
]
