[
	{
		"id": 994,
		"title": "Lolz, my beliefs suck!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-25T14:04:54.000Z",
		"content": "With all the new deep threads going on, we should take some time out to ridicule our deepest beliefs, after all, what do we have if we cannot laugh at ourselves?<br /><br />My belief in God is unfounded and has no proof; here are some christian jokes: [All nice and clean, I'll leave you to post the dirty ones.]<br /><br /><br />Three pastors went to the pastor convention and were all sharing one room. The first pastor said, \"Let's confess our secret sins one to another. I'll start - my secret sin is I just love to gamble. When I go out of town, it's cha-ching cha-ching, let the machines ring.\" <br />The second pastor said, \"My secret sin is that I just hate working. I copy all my sermons from those given by other pastors.\" <br />The third pastor said, \"My secret sin is gossiping and, oh boy, I just can't wait to get out of this room!\"<br /><br /><br />There was a barber that thought that he should share his faith with his customers more than he had been doing lately. So the next morning when the sun came up and the barber got up out of bed he said, \"Today I am going to witness to the first man that walks through my door.\" <br /> Soon after he opened his shop the first man came in and said, \"I want a shave!\" The barber said, \"Sure, just sit in the seat and I'll be with you in a moment.\" The barber went in the back and prayed a quick desperate prayer saying, \"God, the first customer came in and I'm going to witness to him. So give me the wisdom to know just the right thing to say to him. Amen.\" <br />Then quickly the barber came out with his razor knife in one hand and a Bible in the other while saying \"Good morning sir. I have a question for you... Are you ready to die?\"<br /><br /><br />A little boy was kneeling beside his bed with his mother and grandmother and softly saying his prayers, \"Dear God, please bless Mummy and Daddy and all the family and please give me a good night's sleep.\" <br />Suddenly he looked up and shouted, \"And don't forget to give me a bicycle for my birthday!!\" <br />\"There is no need to shout like that,\" said his mother. \"God isn't deaf.\" <br />\"No,\" said the little boy, \"but Grandma is.\"<br /><br /><br />As the storm raged, the captain realized his ship was sinking fast. He called out, \"Anyone here know how to pray?\" One man stepped forward. \"Aye, Captain, I know how to pray.\" <br />\"Good,\" said the captain, \"you pray while the rest of us put on our life jackets - we're one short.\"<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23655,
		"title": "No dirty ones here:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T03:20:41.000Z",
		"content": "Okay... but I have no dirty ones...<br /><br />   Every Saturday Morning, A Catholic Priest, a Lutheran Pastor, and a Baptist Minister got together to drink coffee. They would discuss religion, and their everyday problems.<br />   One Saturday, they got together, and discussed a common problem; mice. All 3 of their houses were infested with mice. \"I know, said the Baptist!!! Lets go home, and try to get rid of them!!! Whoever gets rid of the most mice by next week wins a free Mocha!!!\"<br />   They went home, and did what they could to get rid of the Mice. They met next Saturday. The Baptist spoke first, \"Well, I tried to catch them with live bait traps, but the mice just evaded my traps.\"<br />   The Lutheran spoke next, \"I tried to get them with kill traps, but the mice also evaded mine.\"<br />   The pastors both looked at the Catholic Priest who was smiling contentedly. \"I brought them all in, baptized every one of them, and haven't seen them since\"<br /><br />(Basically; that 'joke' mocks the fact that most people will go to church, get Baptized, and go through the motions, but then, they don't go to church)<br /><br />President Bush and the pope met together. The popes hat comes off, and it carried by the wind into the lake. Bush runs to the lake to rescue the cap, and he runs across the water to the hat. Bush recovers the hat, and gives it to the pope. He and the cap are completely dry.<br /><br />The headlines the next day read, Bush Cant Swim<br /><br />(Basically a mockery of how messed up the media is these days)<br /><br />A visiting priest says Mass one Sunday. After Mass, a man comes up to him, and says, That was the worst Homily I have ever heard!!! The visiting priest, quite disturbed, went to the pastor of the parish, and pointed the man out. Oh, him, said the pastor, Dont worry about him; he is not responsible for what he says. He never has an original though; he just goes around repeating what other people are saying<br /><br />(Basically, a mockery of the visiting priest [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] )<br /><br />Thats it 4 now more 2 come 14735 (Hahaha; 1 4m 5000 1337!!! [14735 - Later])<br /><br />-- NAJAWA --"
	},
	{
		"id": 23656,
		"title": "Re: No dirty ones here:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-26T05:17:52.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Well, I don't know any jokes related to this (nor much at all), but a fun joke topic is a nice change for the deeply philosophical ones. Good jokes. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23657,
		"title": "Re: No dirty ones here:",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-26T06:20:05.000Z",
		"content": "The children were lined up in the cafeteria of a Catholic elementary school for lunch. At the head of the table was a large pile of apples. The nun made a note, and posted on the apple tray, \"Take only one. God is watching.\"<br /><br />Moving further along the lunch line, at the other end of the table was a large pile of chocolate chip cookies.<br /><br />A child had written a note, \"Take all you want. God is watching the apples.\"[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23658,
		"title": "Re: No dirty ones here:",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-26T09:25:39.000Z",
		"content": "It seems that a rabbi, a priest and a minister decided to go fishing one sunny afternoon.  All three climbed into the boat and headed for the middle of the lake.  After several hours of relaxation, the minister decided that \"nature was calling\", and climbed out of the boat and walked across the water to the shore.  In a few moments, he walked back out to the boat and climbed back in.<br /><br />The rabbi was absolutely astonished, but decided not to mention the apparent miracle.<br /><br />A few minutes later, the priest also decided to go ashore for a moment, and climbed out of the boat, walked to shore, and a few minutes later came back.<br /><br />By now the rabbi was in great distress and had begun to doubt his beliefs and wonder if there might be some validity to the Christian teachings.  But he immediately reaffirmed the fact that his faith WAS JUST AS STRONG as either the priest's or the minister's and decided that anything they could do, with God's help, he could do as well.<br /><br />The rabbi then announced that he needed relief and would walk to shore.  He climbed out of the boat and went straight to the bottom of the lake.  While the rabbi was thrashing about in the water, the priest turned to the minister and said, \"So... do you think we ought to tell him where the rocks are?\""
	},
	{
		"id": 23659,
		"title": "Re: No dirty ones here:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-27T03:04:44.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The children were lined up in the cafeteria of a Catholic elementary school for lunch. At the head of the table was a large pile of apples. The nun made a note, and posted on the apple tray, \"Take only one. God is watching.\"[hr][/quote]<br /><br />Really weird; that actually happened 4 real to my dad in his school!!! It actually happened!!!<br /><br />Another Joke:<br /><br />   A preist was eating a ham sandwich as an Orthodox Jewish Rabbi watched on, his stomach growling. \"So,\" asked the priest, \"When are you going to break down, and eat ham?\"<br />   The Rabbi smiled and answered, \"At your wedding reception.\"<br /><br />-- NAJAWA --"
	},
	{
		"id": 23660,
		"title": "Re: No dirty ones here:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-27T19:30:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />A preist was eating a ham sandwich as an Orthodox Jewish Rabbi watched on, his stomach growling. \"So,\" asked the priest, \"When are you going to break down, and eat ham?\"<br />The Rabbi smiled and answered, \"At your wedding reception.\"<br />[hr][/quote]<br /><br />That is excellent.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23661,
		"title": "Re: No dirty ones here:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-27T22:55:03.000Z",
		"content": "Ty, and how is this:<br /><br />There once was a Rabbi. His son was quickly reaching adulthood and he felt his son just didn't have the appriciation for the Jewish religion that an adult should have so he decided to send him on a trip to the holy lands to get a first hand look at Jewish culture. <br /><br />The boy came back from the trip and the father was asking him how it went. <br /><br />\"Oh it was really great dad, thanks! But, I must tell you that i'm a Christian now.\" <br /><br />The father was none too pleased and felt he had to do something but didn't know what. he went to a fellow Rabbi and told him the situation. <br /><br />The Rabbi exclaimed, \"don't look at me! I sent my son to Jerusalem and he came back a Christian also. Their combined oppinion was that it was a conspiracy and decided to go to the Head Rabbi. <br /><br />The Head Rabbi exclaimed, \"Don't look at me! I too sent my son to Jerusalem and he came back a Christian. this is something we MUST pray over.\" <br /><br />All three kneeled and prayed and God answered: \"Don't look at me....\" <br /><br />[hr]<br /><br />A friend was in front of me coming out of church one day, and the preacher was standing at the door as he always is to shake hands. He grabbed my friend by the hand and pulled him aside. <br /><br />The Pastor said to him, \"You need to join the Army of the Lord!\" <br /><br />My friend replied, \"I'm already in the Army of the Lord, Pastor.\" Pastor questioned, \"How come I don't see you except at Christmas and Easter?\" <br /><br />He whispered back, \"I'm in the secret service.\" <br /><br />[hr]<br /><br />After the funeral, the attorney gathered the entire family for the reading of the will. Relatives came from near and far, to see if they were included in the bequests. The lawyer somberly opened the will and began to read: <br /><br />\"To my cousin, Ed, I leave my ranch. <br /><br />\"To my brother Jim, I leave my money market accounts. <br /><br />\"To the good priest, and friend, Fr. Fred, I leave my stocks. <br /><br />\"And finally, to my cousin George, who always sat around and never did anything, but wanted to be remembered in my will, I say, 'Hi, George.'\" <br /><br />[hr]<br /><br />A man is talking to God. The man asks God how much a million years is to him God says that it's a second. Then he asks how much a million dollars is to him God says it's a penny. <br /><br />So the man asked, \"God can I have a penny?\" <br /><br />And God replied, \"Just a second.\" <br /><br />[hr]<br /><br />A man, his wife and mother-in-law went on a trip to the holy lands. Unfortunately, the mother-in-law passed away while on the trip. <br /><br />The man and his wife were trying to decide what to do with her body. They were talking to a man and he said, \"You can ship her home but it will cost thousands of dollars! Or we could bury her here for about two dollars.\" <br /><br />The man said, \" Um no we will have her shipped home. I heard about a man burried here once and he rose from the dead. I just can't take that chance.\" <br /><br />[hr]<br /><br />Our church was saddened to learn this week of the death of one of our most valued members, Someone Else. <br /><br />Someone's passing creates a vacancy that will be difficult to fill. Else has been with us for many years and for every one of those years, Someone did far more than a normal person's share of the work. Whenever there was a job to do, a class to teach, or a meeting to attend, one name was on everyone's list, \"Let Someone Else do it.\" Whenever leadership was mentioned, this wonderful person was looked to for inspiration as well as results; \"Someone Else can work with that group.\" <br /><br />It was common knowledge that Someone Else was among the most liberal givers in our church. Whenever there was a financial need, everyone just assumed Someone Else would make up the difference. <br /><br />Someone Else was a wonderful person; sometimes appearing superhuman. Were the truth known, everybody expected too much of Someone Else. Now Someone Else is gone! We wonder what we are going to do. <br /><br />Someone Else left a wonderful example to follow, but who is going to follow it? Who is going to do the things Someone Else did? <br /><br />When you are asked to help this year, remember -- we can't depend on Someone Else anymore. <br /><br />And yet more to come<br /><br />-- NAJAWA --"
	},
	{
		"id": 23662,
		"title": "Re: No dirty ones here:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-28T07:23:51.000Z",
		"content": "A man and his wife were plannig a vacation in Hawai; after some wrangling it was decided that the wife go two days ahead of the husband to make sure all of their preperations worked out.<br />Strange how only the christians are posting...<br /><br /><br />The next day the man was at home when the pastor of his local church dropped by, having been invited so that he could be consoled about the death of his wife last week. The pastor cam in, did the usual things you do when visiting, but, when the man left to fetch some tea he heard a terrible scream and aa thud. Rushing back he saw the pastor passed out in front of his computer, the email from his wife still on the screen. It read:<br /><br />Dear husband:<br /><br />Got here just yesterday, and boy is it hot down here! So glad I'll be seeing you soon, this is just to notify you that everything is prepared for your arrival tomorrow.<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23663,
		"title": "Re: No dirty ones here:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-30T05:47:10.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Good one!!!<br /><br />Just some quick Q's: <br /><br />1) Who's wife went to Hawaii<br />2) Who's wife died<br />3) Who's Email account<br />4) Who's house<br /><br />I did get the joke, but it took awile; answering this should clear up some Q's<br /><br />TY-14- NAJAWA -14-"
	},
	{
		"id": 23664,
		"title": "Not the pastah!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-30T11:18:01.000Z",
		"content": "1.) Not the pastor's.<br />2.) The pastor's.<br />3.) Not the pastor's.<br />4.) Not the pastor's either.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23665,
		"title": "Re: Not the pastah!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-30T12:38:41.000Z",
		"content": "Thanks Spleen, I really can't tell jokes.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23666,
		"title": "Re: Not the pastah!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-30T20:30:23.000Z",
		"content": "Ah...<br /><br />LOL!!! It makes more sense; I was almost positive it was the other way around, cause usually it is the pastor who consoles the lay person...<br /><br />FUNNY!!!<br /><br />\"Boy... It's sure hot down here\"<br /><br />Muahahahaha!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23667,
		"title": "Re: Not the pastah!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-31T03:46:25.000Z",
		"content": "Okay! Atheist joke time!<br /><br /><br />1.)An atheist was attending the class of a Budhist monk at the top of a tall mountain, to see if there was any part of his belief worth listening to. He was dissapointed as the monk wittered on about peace and harmony and reincarnation as if they were solid facts. Finally he got up in frustration, interrupted the monk and said \"Listen, I am an award winning physicist, I have dedicated my life to exploring the mysteries of the universe, and I tell you I will not belive a word of your claptrap until I see it for myself with my own eyes!\" At this comment the monk pushed the atheist off a cliff and watched him plummet to his death a thousand feet below. He then turned to his class and said:<br /><br />\"Now I must tell you about a mna named Newton, for he was most definitely right.\"<br /><br />2.) A creationist, scientist and atheist were riding in a train across New Zealand. Looking out the window they saw four black sheep. \"Amazing!\" said the creationist \"All the sheep in this country are black!\" \"Nonsense!\" said the scientist \"Only some are provably black, maybe only those four in the entire country.\" <br /><br />Then the ateist chimed in \"And only on one side too!\"<br /><br />3.) It was the year 2026; scientists had made not only GE, but an entire new form of life, silicon based, usuing radioisotopes, that operated in a way never seen in the natural universe. Then they all went to God. \"We have made life from nothing, you are no longer needed, and to prove it we will create paradise in six days, even less if you wish to challenge us!\" God thought this over. \"Very well, we will have a competition. Whoever's creation is the best will win.\" Immediately the scientists started grabbing handfuls of dirt. \"OI!!\" God shouted,<br /><br />\"Get your own dirt!\"<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23668,
		"title": "Re: Not the pastah!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-31T06:04:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]At this comment the monk pushed the atheist off a cliff and watched him plummet to his death a thousand feet below.[hr][/quote]<br /><br />And thus he proved his point about peace and harmony; no more intteruptions.<br /><br />Hehehe, and I like the last one as well; we will never be rid of God.Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23669,
		"title": "Re: Not the pastah!",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-31T11:55:16.000Z",
		"content": "I've never heard that version before - this is the one I'm used to (sorry, not religious.)<br />------------<br />A biologist, a statistician, a mathematician and a computer scientist are on<br />a photo-safari in Africa.  As they're driving along the savannah in their<br />jeep, they stop and scout the horizon with their binoculars.<br /><br />The biologist: \"Look!  A herd of zebras!  And there's a white zebra!  Fantastic!  We'll be famous!\"<br />The statistician: \"Hey, calm down, it's not significant.  We only know there's one white zebra.\"<br />The mathematician: \"Actually, we only know there exists a zebra, which is white on one side.\"<br />The computer scientist: \"Oh, no!  A special case!\""
	},
	{
		"id": 23670,
		"title": "Re: Not the pastah!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-01T10:20:32.000Z",
		"content": "Heh. Okay:<br /><br />A biologist, chemist and mathematician are staying in a hotel, all three are asleep, but something awakes the biologist. It is a fire, buring in the room next door. The biologist does the evolutionarily sensible thing, and runs. Shortly the chemist awakes and sees the fire. Immediately he yells 'A fire needs both fuel and oxygen to continue!\" and shuts the door, starving the fire and putting it out. The chemist then goes to bed. Later the mathematician awakes, to find the the heat of the fire has started a new fire in the opposite room. He stands in the hall, stares at the fire, the closed room, opens the closed rooms door and looks at the extinguished fire. He pauses a moment then says<br /><br />\"Ah, a solution exists!\" and goes back to bed.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
