[
	{
		"id": 745,
		"title": "Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-07T04:21:31.000Z",
		"content": "Okay, I can't find this on Wikipedia nor Nasa.gov<br /><br />I just wanna know the details of a space craft window, as in their material that protects from solar rays and whatnot. What I really need to know is if you can see in from the outside. Does any1 know?<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19519,
		"title": "Re: Space Craft windows",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-04-07T07:26:21.000Z",
		"content": "Do you need windows for your space ship? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I couldn't find anything, so I'll just say that in movies you usually can see (so this doesn't mean anything). Perhaps it also depends.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 19520,
		"title": "StarCraft Linux",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-04-07T07:32:58.000Z",
		"content": "It's strange that information about this is so difficult to find. It's probably something of an FAQ. I've had about as much luck as you finding it through Google/Wikipedia. I do recall reading or hearing something about the material a long time ago, but the details have escaped me."
	},
	{
		"id": 19521,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-07T18:06:48.000Z",
		"content": "well i did find this, thanks to Ask.com's many features (it beats Google any day): [url=http://www.bettyschinapainting.com/marcitec.htm]www.bettyschinapainting.com/marcitec.htm[/url]<br /><br />Still, it's not satisfactorily conclusive. surely, someone out there in the Keen community must know?<br /><br />[edit]<br />AH OF COURSE! I was thinking you could just search for some hi-res photos of the shuttle and see if the cokcpit looks black, but then I remembered all those photo's of astronouts on the moon. You could never see through their helmet visors; they were always black.<br /><br />[edit 2]<br />thank gooness for howstuffwork's 'lots more information' page at the end of their space shuttle page! [url=http://science.howstuffworks.com/space-shuttle11.htm]science.howstuffworks.com...ttle11.htm[/url]<br />I guess this means case closed [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] \"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19522,
		"title": "Re: Space Craft windows",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-04-07T19:19:59.000Z",
		"content": "Keep in mind, an astronaut's helmet is not illuminated inside, and they also have a silver coated visor over it. A space ship could have lights on inside, making it easy to see in. Also look at [url=http://www.boeing.com/news/frontiers/archive/2005/march/qt_snapshots.html]this[/url].  Space shuttles presumably have windows of glass, since I don't think something like Lexan could take the heat of re-entry. Judging by the picture and by common sense, they aren't tinted.<br /><br />[url=http://www.hightechscience.org/buran_window.htm]And see this.[/url]<br /><br />Look at your neighbor's windows though. In the daytime you can't see in at all, even though they are fully clear. When it gets dark you can if it it illuminated. A space shuttle must be much the same.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19523,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-07T21:49:12.000Z",
		"content": "Nice find, Lemur. What you say makes sense, and you just saved me a loophole. If it means anything, I did find information before that the windows indeed have Lexan, that is, they are composed of Lexan and other stuff.<br /><br />As I recall, there were three layers to the cockpit windsheild; the top was designed to withstand the outside extremeties, and the bottom was desisigned to withstand crew-cabin pressure and stuff, and the middle was--er, something, just protection i guess lol.<br /><br />That link i put from howstuffworks has great info.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19524,
		"title": "Re: Space Craft windows",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-04-09T02:30:28.000Z",
		"content": "Yeah, the link wasn't working for me so I had to break out some of my Google-fu.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19525,
		"title": "Re: Space Craft windows",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-09T13:35:21.000Z",
		"content": "The middle is impact protection, if something hits, it will hit with great force and must be prevented from puncturing.<br /><br />Nothing protects against solar and cosmic radiation though, if you go up, you get increased cancer risk, and permanent bone density loss. Nothing can be done about these as yet.<br /><br />Now, are they using silver coatings on helmets these days? Gold films are still used on earth, especially in skyscrapers for their superior UV blocking ability, and I know they have been used in sapce.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19526,
		"title": "Re: Space Craft windows",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-04-09T16:11:43.000Z",
		"content": "Beats me. I had always thought it was gold, but my research said silver.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19527,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-09T18:47:38.000Z",
		"content": "Nothing protects against it? Just put some Ozone inbetween the glass panes and you'll be fine I say.<br />Seriously, I thought they could with some material that's still transparent. Gold or silver tho? Hmm, didn't know that.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19528,
		"title": "Re: Space Craft windows",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-04-09T22:09:55.000Z",
		"content": "You'd need a *lot* of ozone between the glass panes, and then you'd turn the spaceship into a greenhouse (ozone doesn't reflect cosmic rays, the Earth's magnetic field does that.)<br /><br />Most Australian trains apparently have a thin layer of gold on the passenger windows to reflect the heat but let the light through, so that makes sense.<br /><br />At any rate current spaceships aren't protected against things like cosmic radiation, which is why they have a lead-lined chamber all the astronauts climb into whenever there's a big solar flare, and the reason why astronauts can see cosmic rays as white flashes when they close their eyes..."
	},
	{
		"id": 19529,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-10T04:02:21.000Z",
		"content": "i didn't know that stuff either. it must really stink to lift all that lead into space, not to mention the price of gold. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19530,
		"title": "Re: Space Craft windows",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-10T14:27:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr](ozone doesn't reflect cosmic rays, the Earth's magnetic field does that.)[hr][/quote]<br />So the trick would be making an artificial magnetic wave around the ship, right? That must be one hell of a job to manage to get working.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 19531,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-10T17:14:34.000Z",
		"content": "Hmm, I think that generating a magnetic field like that would interfere way too much with the onboard electronics. Just think of what you'd if you saw someone putting a magnet to your HD.<br /><br />On the other hand, Earth's magnetic field exists all the time and it is protective enough, and I don't see hard drives being wiped all the time, lol, so maybe it is possible.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19532,
		"title": "Re: Space Craft windows",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-10T17:24:23.000Z",
		"content": "I for one, would kill that person immediately.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 19533,
		"title": "Re: Space Craft windows",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-04-10T22:35:10.000Z",
		"content": "That's exactly what they were discussing for the first human trip to Mars - an artifical magnetic field.  It would have an interesting effect, in that the [url=http://en.wikipedia.org/wiki/Aurora_%28astronomy%29]Aurora Australis/Borealis[/url] that you can see over the Earth's magnetic poles is caused by the remnants of solar flares coming into contact with the Earth's magnetic field, so you'd have a kind of mini-Aurora around your spaceship's artificial magnetic field.  The example I saw only had one section of the ship covered by the magnetic field so that shouldn't cause too much trouble for the instruments, but it does mean the astronauts will need to crowd into that section whenever there's trouble on the way."
	},
	{
		"id": 19534,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-11T01:26:04.000Z",
		"content": "Very cool, but where did you see it online, if it was online? I was thinking that you could have sheild satellites that make the field itself so that the field is in front of the ship and not interferring with its electronics. Or you could do it like you said, which I didn't think of.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19535,
		"title": "Re: Space Craft windows",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-11T03:29:25.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]not to mention the price of gold.[hr][/quote]<br /><br />Gold is not as expensive as people think it is, also, only nanofilms are needed, tiny amounts!<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]Hmm, I think that generating a magnetic field like that would interfere way too much with the onboard electronics. Just think of what you'd if you saw someone putting a magnet to your HD.[hr][/quote]<br /><br />It would depend onthe field strength, and most importantly if it were moving or varying; a steady magnetic field is much less problematic.<br /><br />[quote]<b><i>Quote:</i></b>[hr]On the other hand, Earth's magnetic field exists all the time and it is protective enough, and I don't see hard drives being wiped all the time, lol, so maybe it is possible.[hr][/quote]<br /><br />The Earth's magnetic field is set at about 4 x 10 -3 Tesla; rather weak. A fridge magnet is hundreds of times stronger. Though since it's made of layered magnets, its field barely extends above the surface. Not only the field strength, but its extent is important, Earth's field is weak, but extends a long way, and has the buffering of the Van Allen belts and solar wind.<br /><br />[quote]<b><i>Quote:</i></b>[hr]the Aurora Australis/Borealis that you can see over the Earth's magnetic poles is caused by the remnants of solar flares coming into contact with the Earth's magnetic field,[hr][/quote]<br /><br />Actually they are high energy particles, both from space and the sun, mostly protons, that are caught in the Van Allen belts where they spin around and around, desperatly trying to get out. Near the poles the magnetic field dips and the particles can hit the atmosphere, giving up their energy as light.<br /><br />For a spaceship to do the same, it would need somewhere for the field to dip, maybe onto the craft's surface.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19536,
		"title": "Re: Space Craft windows",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-11T03:45:05.000Z",
		"content": "Well, I understand that a steady magnetic field would not be a problem like an accelerating field would, but to turn it on/off in the first place causes some kind of acceleration/variance, which would interfere--unless I don't know what I'm talking about.<br /><br />\"For a spaceship to do the same, it would need somewhere for the field to dip, maybe onto the craft's surface.\" -Levelass<br /><br />Don't all magnetic fields dip in at the poles? I thought that's how the particles get to the atmosphere and cause the aurora.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19537,
		"title": "Re: Space Craft windows",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-04-11T10:47:04.000Z",
		"content": "That makes sense - all I know is the auroras increase in activity with solar flares, so it makes sense if the particles are \"pushed\" towards the poles where they can interact with the atmosphere.<br /><br />I saw the craft generating its own magnetic field in a documentary a few years back, discussing what would be required for a trip to Mars and elsewhere in the solar system.  It was quite interesting, and seeing the aurora swirling around a section of the spacecraft was intriguing.  Certainly more impressive than a boring old lead-lined chamber [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 19538,
		"title": "Re: Space Craft windows",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-14T06:36:38.000Z",
		"content": "@ Mort, yes, turning anything electric on/off makes a varying magnetic field. In televisions you can hear this as the 'thunk' when the screen is turned on.<br /><br />Not all magnetic fields dip at the poles, they can be distorted, or a 'T' shaped magnet used, which produces a more spherical field. Fields can also be combined or overlapped. Either way, the area of dip is likely to only be a few inches round.<br /><br />Solar flares can kill satelites, indeed they arte the main cause of death. Araurae are pretty, but deadly, remember Mr Sun is a gigantic nuclear explosion the likes of which you can't imagine.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19539,
		"title": "Re: Space Craft windows",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-04-14T11:13:12.000Z",
		"content": "Turning something electric on and off only makes a *really* small magnetic field though, and it only lasts for a fraction of a second - the 'thunk' you hear when you turn a CRT on (be it a TV or a computer monitor) is the degauss circuit, which is an electrical coil wrapped around the outside of the tube, specifically designed to produce a strong magnetic field.  The field is strong enough that in a cheap TV you can hear it vibrate for the first few seconds after the TV is switched on (after two or three seconds the degauss circuit is switched off again.)  In digital computer monitors you can also trigger the degauss circuit from the on-screen menu, which gives you the same 'thunk' as when you first switch the monitor on (although it's usually more like a click or a buzz, given the smaller size of most monitors compared to a large TV.)"
	}
]
