[
	{
		"id": 376,
		"title": "what was the first computer you played keen on",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-09-22T11:22:05.000Z",
		"content": "mine was a 486dx2 at a friend's house it had keen 1 , 3 , 4 , 6 demo and dreams they gave me their pc after they got a new one [this is the one that died] but the FIRST computer we ownd was a ibm-xt type2 with keen dreams i still have it and it works like a charm i tell you no pentium 4 can beat the ibm-xt it's one mean dos machine[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 11239,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-09-22T12:16:08.000Z",
		"content": "Mine was a 286, in our home. I played all my childhood with that computer. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Before that we had some computer, but I honestly have no idea what it was! I never touched it; I didn't start using computer until we got our 286. And back then the only thing I did on computer was basically playing games (mainly just Keen all the time), I had no idea about programming or such, nor Keen interest in it back then. I don't have the old computer here, too bad. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  I think its screen is still safe somewhere (not in our house), and if it is, I'll fetch it back some day. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Unfortunately the actual computer hardware is kaputt now. I still have the desk the computer was on, and I'm definitely going to keep it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  So nostalgic..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 11240,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-09-22T16:00:06.000Z",
		"content": "waaaaay back when i first was introduced to the Keen universe was 93-94 or something. honestly i can't tell what computer is was (it was a friend's) and i can't say what OS it had either... some dos based shit... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  <br /><br />but i do remember the charming PC speaker!<br />omg what i liked that sound actually. it was so amazing to hear that beep-beep-beep-beep when you walked through Miragia and then you stoped and enjoyed the silence (and the computer fan).<br /><br />: nostalgia :"
	},
	{
		"id": 11241,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-09-22T23:51:15.000Z",
		"content": "Hmmm, considering I played the games around the time they came out (I think), and that I used my dad's hand-me-downs at the time... I'm guessing 286, but I'm really not sure.<br />I got K1 with my original Gravis... I really don't think I can pinpoint the date nor system though.<br />I think I had my original SoundBlaster by the time I got to K4, one of the first people at school if I remember correctly.<br /><br />I've used 8086 I think, but I was too young too know much about the tech at the time, a 286 which I think was the system I got from my uncle, home-build, wood case and everything.<br />Also a 386, I think I had a 486SX, know for sure that I had a 486DX2.<br />After that a Pentium of some kind, for some reason I don't quite remember... and now I'm using an Athlon XP 2100+, soon to be upgraded, although I've been saying that for (a) year(s).<br />Of course now I finally see some good reasons coming, like UT2007 and Supreme Commander.<br /><br />Anyway, Commander Keen tends to follow me around on all those different systems, so that's cool. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 11242,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-09-23T09:08:55.000Z",
		"content": "As far as I'm aware, it was a 286 at an after-school club in 2001 or so. It was so old that the CMOS battery had died, and it had all sorts of wacky and wonderful DOS games on it - including Keen 4, which was listed under the name \"Keen 2\" for reasons unknown. Keen was by far the most popular game on the machine, and regularly had a large queue of people waiting to play (despite there being three other PCs, including an old Atari with a huge stack of tapes, and many other activities aside).<br /><br />After being introduced to the wonders of Keen, I pirated a floppy disk off a friend (to be fair, this was the only possible way I could have obtained it - my parents had no intention of letting me use their credit card or, indeed, buying strange games from companies in America at that point) and played. A lot. Two years later I stumbled across this forum (I was searching for cheats [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] ) and the rest is history.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 11243,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-10-17T16:00:14.000Z",
		"content": "I found it in a school's computer (1999). It was a 486 with MS-DOS 6.22 and Windows 3.11. The Keen game was Keen 6. I copied it to a floppy disk and brought it to my computer (Pentium 166 MHz, Win95). For some reason, a virus destroyed my hard disk's contents, and I lost the floppy disk with Keen6. After all these years, I know it's not legal to copy that episode [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  Well, I found Keen again in another school's computer (2004). It was Keen4. I didn't remember how much I liked the game before playing Keen4."
	},
	{
		"id": 11244,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-19T16:44:56.000Z",
		"content": "Shadow Master, [url=http://www.youtube.com/watch?v=afuc8TmU2Rg]Don't Copy That Floppy\\[/url]! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 11245,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-10-19T22:49:18.000Z",
		"content": "Welcome to the end of the Computer Age.<br /><br />Aahahahahaha.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br /><b>Edit</b><br />Hmm... just realised I haven't posted a reply to this topic yet.<br /><br />The first computer I played Keen on was at my uncle's place... 1991, I think. He had two machines setup, which I imagine would have been 386es. My brother and I took a computer each and we were given Keen 4 to play. I believe it was also the first PC game I ever played.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] <br /><br />My friends a couple of houses up the road got a computer around then (I don't remember the timeframe though), and I discovered all sorts of interesting games, including a whole range of these Keen games. Though I'm not sure if they had Keen 4 and above at that point.<br /><br />Finally we got our own 386, and thanks to the magic of piracy it was laced with countless wonderful games, including Keen 4 and 6. Unfortunately, that machine is now the embodiment of tragedy.<br /><br />During the late 90s the hard disk crashed causing me to lose a whole bunch of classy Qbasic programs and all manner of stuff I wrote and created during my childhood; the motherboard died a couple of years ago when its battery leaked; and I think I threw the case away last year because it was too rusted to be of use any more.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />Getting a new computer is less exciting these days, since there aren't many games worth playing that push the hardware boundaries. Well, not action games anyway--there are a nice selection of simulation and adventure games, but without variety of genre they lose some of their impact."
	},
	{
		"id": 11246,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1485755,
		"author_name": "Scizor CT",
		"timestamp": "2006-10-19T23:15:25.000Z",
		"content": "The good ol' 386 for me. Oddly enough, it's still sitting around back home for reasons unknown."
	},
	{
		"id": 11247,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-10-20T00:42:45.000Z",
		"content": "a really old 286.. it was a greyscale screen too, with only a pc speaker. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br /><br />oh well...<br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 11248,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2006-11-25T21:11:37.000Z",
		"content": "My 286. And Keen 5 was the first Keen experience that I had. Keen 4 was too powerful for my puny system though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  The game also suffered a glitch where I'd be teleported to Korath III Base after completing the first level.<br /><br />It wasn't until I got a 386 when I was able to play Keen 4 and beyond. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -- I'm not just normal, I'm abnormal. --"
	},
	{
		"id": 11249,
		"title": "Re: what was the first computer you played keen on",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-26T23:59:29.000Z",
		"content": "I don't recall, but it was about the first few months of 2000 on I think an HP Vectra.<br /><br />Nothing quite as old as most of your guy's stuff, but nevertheless...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
