[
	{
		"id": 941,
		"title": "Eh",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2005-12-03T06:56:53.000Z",
		"content": "I just thought I'd stop by... it's been a few months since I looked at anything around here. I see a lot of posts by the same people, which is never a good sign of a community's health. You'd want lots of different posts from lots of different people. Too bad.<br /><br />So what are you guys doing to improve this place now that the second generation has moved on? I see Keenrush is still keeping things in check, which is good.<br /><br />I'll probably come by here a few more times over the next few days, and you can always catch me on #keeners... well, I'm usually there, but I'm not always paying attention [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 22666,
		"title": "wow",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-12-03T08:32:29.000Z",
		"content": "Hi eK, good to see you again!<br /><br />We've been trying to get more of a live presence on Instant Messenging networks at this point, and MSN seems to be the network of choice.  <br /><br />Rumor has it there's development of a multi-user doodling program with pixel-by-pixel editing capabilities, which should give our Modding community a shot in the arm.<br /><br />As far as the same-old, same-old goes, I think the newer members are finally coming to understand the smaller scale of this community, and the posting frenzy has been quelled a bit.<br /><br />Thanks for stopping by to check on us."
	},
	{
		"id": 22667,
		"title": "Re: wow",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-03T12:03:06.000Z",
		"content": "Yah, long time no see. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />There are interesting projects going on, hopefully they get completed as well.<b>Eat your veggies!</b>"
	},
	{
		"id": 22668,
		"title": "eh",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-12-03T19:50:15.000Z",
		"content": "Yea, life is pretty boring around here.  I've made a slight return... But other than that this here \"2nd generation\" sucks pretty good.  =P"
	},
	{
		"id": 22669,
		"title": "Re: eh",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-04T03:07:07.000Z",
		"content": "There was a generation shift? I didn't know that.<br /><br />Who were the great Keeners of old? What did they do? What remains of their superior works?<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22670,
		"title": "Re: eh",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-04T10:30:57.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Good question.<br />Honestly, there has happened none generation shift, just couple of newbies has joined up, who (thanks heaven) aren't the exactly same anymore than they were a month ago.<b>Eat your veggies!</b>"
	},
	{
		"id": 22671,
		"title": "Well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-12-04T20:02:44.000Z",
		"content": "I wasn't really around when the \"First generation\" was here.  That would be Thea, chogall, and cc314's original founder--I don't even remember his name!  They'd all pretty much moved on or stopped being active by the time I showed up in the community.<br /><br />The \"Second Generation\" would probably be JosephBurke/Forge314, eK, Ilsoap, and a few others.  They all had a part in keeping cc314 running/updated, and they've all either left the community or become lurkers who post very rarely.  There were also members like Snortimer, Shockshund, and a few others I can't see because EzBoard killed a lot of our older messages.<br /><br />The \"Third Generation\" would seem to be a bit larger, including myself, KeenRush, Spleen, LevelLord, EzJay, Benvolio, and many others.<br /><br />There's a few people who I'm not sure where they fit in, just because I wasn't around from the start.  Andy/adurdin could very well be first generation, but he could also be second.  It's true that he doesn't post very much any more, though.  :-)  Djaser's been around longer than I have; I'd guess he's 2nd.<br /><br />Either way, this influx of newbies would probably be the \"4th generation,\" wouldn't it?  :-) Mr12000, Alex87, Najawa, Harvey, and a few others are shaping up to be our new generation.  Rather interesting, to view it that way."
	},
	{
		"id": 22672,
		"title": "Re: Well...",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-12-04T20:39:22.000Z",
		"content": "man o man the 4th generation already this makes me feel really old [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img]   apart that yesterday was my 15th birthday , and i had my n00b times fortunate my n00b time wasn't nearly as bad as the 4th generation and like xky rauh already said it's interesting the to view members in generations[img]http://img.photobucket.com/albums/v177/memsys/sig-png.png[/img]"
	},
	{
		"id": 22673,
		"title": "Re: Well...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-12-04T21:14:32.000Z",
		"content": "According to Xky's logic, I'm actually third generation - I was here a fair bit before Spleen and LL. Of course, I wasn't really involved in the community; in fact, I suppose I never have been apart from discussion on the forums. (And wouldn't Xky be from the second generation anyway?)<br /><br />I can still remember following a link through Google for \"Commander Keen cheats\" (haha [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  ) and being surprised to find a whole community dedicated to Commander Keen. I was further intrigued by the way it was so much more than a shallow forum for the sole purpose of discussing a game: there were debates and discussions, artwork and fangames and so much more.<br /><br />This was the first forum I had ever posted on or even read, and it was a great place to mature (in terms of the internet) and learn netiquette without being subjected to bullying or angry forumers who had seen it one too many times before. We still have that welcoming and accepting atmosphere; it is one of the many things about this community that has kept me coming back for almost three years.<br /><br />There might be members who, like I was, have not yet learned the ways and customs of the internet. I believe that we should be tolerant towards them, and help rehabilitate them to the harsh realities of online discussion.[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 22674,
		"title": "Re: Well...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-12-04T21:20:10.000Z",
		"content": "Woa... I was active on the PCKF for a few years; I could just never post, but I read everything, and cursed because I didn't have an email address...<br /><br />I followed Keen. I remember life before modkeen... All there was was just Keen [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  , and Keen fan-games [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  , and thus reduced Keen fan-ism to [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img]  . I didn't think the PCKF would last this long.<br /><br />Yes; I have been around. Not as long as Xky, but I remember KR, and a few others...<br /><br />I just got an email this August, and the first thing I did was sign up.<br /><br />The reason I sorta spammed, was because I had all this stagnant Keen energy storing up for years.<br /><br />I HATED the great hack, but it spared you from me bumping some old posts... like Ceilicks \"I want out\" topic.<br /><br />yes, I would put my self in 3rd generation, I just spammed because I couldn't post for a whole generation, but I was there...<br /><br />Edit: [quote]<b><i>Quote:</i></b>[hr]I can still remember following a link through Google for \"Commander Keen cheats\"[hr][/quote]<br /><br />Haha... that's how I found this too...<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />I admit; I am a big, nasty cheater...Tough Guys Can Fix Their Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 22675,
		"title": "Re: Well...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-12-04T21:51:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Djaser's been around longer than I have; I'd guess he's 2nd.[hr][/quote]<br /><br />I wish. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />But I did register before your released your first mod and I think even before Keenrushs first mod. <br /><br />If we are talking in generations I would say that every year makes a new one. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22676,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-12-04T23:30:35.000Z",
		"content": "I don't know how long everyone's been around; I was just generalizing.  I was trying to explain why eK said \"Now that the second generation has moved on.\""
	},
	{
		"id": 22677,
		"title": "Re: hehe",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-12-05T01:00:51.000Z",
		"content": "I guess I'm third generation then...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22678,
		"title": "Re: hehe",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-12-05T04:13:23.000Z",
		"content": "Xky, you're easily second generation by that logic.  Your megalevel was up on CC314 back in the 90's.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22679,
		"title": "Re: hehe",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-05T07:41:47.000Z",
		"content": "Quite frankly this is like the whole 'oldies and youngsters' generation X division crap; people 'know' what each generation is, but there's never a precise dividing line. Its like trying to find where blue stops being blue and becomes purple; you know blue and purple, but what about in between?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22680,
		"title": "heh",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2005-12-10T04:24:27.000Z",
		"content": "there doesn't need to be lines, but it's sort of happened that way.<br /><br />I just looked at it like this: The community began with Geoff (who I haven't heard from in a long long time). I joined like... 8 years ago or something (geez, that's scary to think about). I think I was 15 or 16 at the time... but it may have been even further back than that. Very very few of those around during that time are here now... in fact... Ilsoap might be about it, since Cho'gall and Flaose are gone.<br /><br />After that Thea, Cho'gall, Flaose and I ran things, but now none of us do: now it's in the hands of people like xtra and keenrush. That's the third generation (of leadership in the community).<br /><br />You guys should know though, that the keen community will soon dry up. Many of those who grew up with Keen don't really care about it anymore, and there are no longer people growing up playing Keen the way we did. The only way the community can grow would be if a new keen game game out and hit mainstream. Even a fan game could do this if it was done well enough and released in the right places. But unless something like this happens, this place will be abandonned and keen will be layed to rest in the realm of fond memories."
	},
	{
		"id": 22681,
		"title": "Re: heh",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-12-10T04:57:12.000Z",
		"content": "i made a thread so people can all improve keen tiles and sprites in Other Keen Stuff section (should be sticky if its not)"
	},
	{
		"id": 22682,
		"title": "Re: heh",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-12-10T18:58:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]there doesn't need to be lines, but it's sort of happened that way.<br /><br />I just looked at it like this: The community began with Geoff (who I haven't heard from in a long long time). I joined like... 8 years ago or something (geez, that's scary to think about). I think I was 15 or 16 at the time... but it may have been even further back than that. Very very few of those around during that time are here now... in fact... Ilsoap might be about it, since Cho'gall and Flaose are gone.<br /><br />After that Thea, Cho'gall, Flaose and I ran things, but now none of us do: now it's in the hands of people like xtra and keenrush. That's the third generation (of leadership in the community).<br /><br />You guys should know though, that the keen community will soon dry up. Many of those who grew up with Keen don't really care about it anymore, and there are no longer people growing up playing Keen the way we did. The only way the community can grow would be if a new keen game game out and hit mainstream. Even a fan game could do this if it was done well enough and released in the right places. But unless something like this happens, this place will be abandonned and keen will be layed to rest in the realm of fond memories. [hr][/quote]<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yawn.gif[/img]  <br />Yeah that's what you said last time you visited. Boring, you're getting old early.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22683,
		"title": "Re: heh",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-11T01:52:27.000Z",
		"content": "Well the sad thing is, everything dies, as will this community and Keen itself in due time. When that time will be, who knows. Lets at least enjoy it while we can; I for one think that right now whatever is left of the Keen community is doing things that the founders would've given their fron teeth for.<br /><br />If the stuff we're getting recently is the end of Keen, then bring it on says I!A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22684,
		"title": "actually",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2005-12-11T05:50:47.000Z",
		"content": "Actually Djaser, I said different things this time. The first time, I talked about a result of people leaving a community. The second time I talked about how to reinvigorate it.Had you actually read both messages thuroughly, that should have been clear.<br /><br />You've always had a tendency to either skim what people say, or to simply not understand some of it (maybe you're selectively ignoring certain things?). I should hope you find a way to deal with this before you're faced with the rigors of adult life. If not, I'm sure you'll find a nice safe simple niche where you won't be forced to flex your brain muscles more than you are now."
	},
	{
		"id": 22685,
		"title": "Meh.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-12-11T10:32:41.000Z",
		"content": "Now now, children...<br /><br />I still strongly disagree that the Keen community is nearing its end. Maybe without a new official Keen game, or at least a stunning fangame continuance of the series, something to keep the mainstream aware of the series, there'll be no fresh Keeners by the end of the decade.<br /><br />There'll always be people inclined toward this game, though. Our works are increasing in quantity and quality all the time, and as that happens, more and more groups of people are introduced to the Keeniverse. And soon enough there'll be a Keen engine that can be ported to any OS, bringing the original Keens and even our mods to more people than ever.<br /><br />It's our job to bring Keen to those people who will appreciate it as much as we did and, hopefully, still do.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22686,
		"title": "Re: Eh",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-12-11T15:28:28.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Actually Djaser, I said different things this time. The first time, I talked about a result of people leaving a community. The second time I talked about how to reinvigorate it.Had you actually read both messages thuroughly, that should have been clear.<br /><br />You've always had a tendency to either skim what people say, or to simply not understand some of it (maybe you're selectively ignoring certain things?). I should hope you find a way to deal with this before you're faced with the rigors of adult life. If not, I'm sure you'll find a nice safe simple niche where you won't be forced to flex your brain muscles more than you are now. [hr][/quote]<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]   <br />Fascinating eK, you're now referring to a post of before the big post loss? Do you mind that I can't remember that first post the full 100% and do you mind that I think that it doesn't change anything of the fact that you're repeating yourself?<br />As for your second strophe, you said that the last time you visited too, and the time before, and before....<br />If adults have to tell other people that they are dumb and childish all the time than I'd rather stay at the mental age of three. Funny thing is, you don't sound so grown up but more like a twelve years old who thinks he has seen the world.<br />Puberty is going to be hard for you.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	}
]
