[
	{
		"id": 1413,
		"title": "Gargs or not? The great debate",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-13T05:24:33.000Z",
		"content": "There are few things as contentious in biology and taxidermy as the subject of what defines a species and what is a new species respectively. Tonight we examine just one such contentious case, wether or not the two taxiforms <i>Gargus Keenrussians</i> and <i>Gargus Monumenta</i> are two different species. <br /><br />Speaking as a professor of martian history and Areaobiology I submit the case that they are two geographically and genetically distinct species. However this is still contended, most famously by my coleuge Doctor Retdon8, whose thorough and inspiring work on martian plant life remains the textbook work even today and the Garg behavioural specialist Mr Keen Rush, discoverer of the Gargus K. species.<br /><br />Firstly we observe the two incidences of 'gargiforms':<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/mon.jpg[/img]<br /><i>Gargus Monumenta</i><br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/garg.jpg[/img]<br /><i>Gargus Keenrussians</i><br /><br /><br />Evidence against speciation:<br /><br />1.) Basic morphology is simalar, both species share the characteristic doubble motile eye stalks.<br /><br />2.) Both forms are dangerous and toxic to the touch, the poison used being almost identical.<br /><br />3.) Both species are carnivourus and survive by consuming martian plantlife, especially phytozooforms such as pat-pat.<br /><br /><br />Evidence for speciation:<br /><br />1.) Morphology is appreciably different; Gargus K are green with highly visible teeth and red eyes. Gargus M. conversely are red with green eyes and almost never show their teeth unless eating.<br /><br />2.) Both species utilize different manners of attack and defense; While Gargus K. are capable of completely disembowleing an opponent and devouring them, Gargus M.  refuses to use its teeth in either attack or defense, prefering its poisonus skin as a deterrent. This makes them vulnerable to attack by heroes. Also, Gargus K. is capable of quite a turn of speed when charging, whilst Gargus M. prefers to walk sideways, crablike and is incapable at moving at more than walking pace.<br /><br />3.) While both species are carnivorus, Gargus K survive on Mars widdershin face, where they mainly prey on pat-pat and even small Yorps. Gargus M. are found only on the turnwise face of Mars, where large plant and animal life is rare, they consume much smaller organisims.<br /><br />4.) Different behaviour; While Gargus K. actively seek out food supplies and violently charge intruders, especially dominant males, Gargus M. prefers aimless rambling, often just moving back and forth pointlessly. <br /><br />5.) Different size. In the comparative illustrations it can be seen that while Gargus K. are approximately slightly taller than the height of an 8 year old child, Gagus M., despit their sparse diet, are about as tall as a grown man.<br /><br /><br />Given these points of evidence I propose that Gargus K. and Gargus M. are seperate species.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 29687,
		"title": "Gargus Monumenta",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T06:07:53.000Z",
		"content": "The Gargus Monumenta looks a bit like that Garg me and my brother skinned. Mom forgot to kill it, and so will tried, but found it more fun to take off its skin, and salt it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />The skins tasted pretty good, but when it came time to bring in our salted (and slightly smoked) garg... It had escaped.<br /><br />TY LL for finding him... though aparently the salt wore off, because, at least in my browser, he's standing quite still.<br /><br />*licks chops*<br /><br />Whahahahaha!!! We're having Garg tonight!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 29688,
		"title": "Woah",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-13T08:07:06.000Z",
		"content": "Agree completely. The evidence presented shows pretty much they're two separate species.<br /><br />Awesome work LL. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 29689,
		"title": "Re: Woah",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-13T09:34:53.000Z",
		"content": "The former looks more like a cross between a Yorp and a Garg.-- Censorship is F**ked! --"
	},
	{
		"id": 29690,
		"title": "Todd",
		"author_id": 1486071,
		"author_name": "Frenkel",
		"timestamp": "2005-10-13T14:36:42.000Z",
		"content": "Someone should ask Todd Replogle if someone can find him."
	},
	{
		"id": 29691,
		"title": "In the name of debate:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T23:40:17.000Z",
		"content": "Well... in Yorphus II, the yorps are pink; where they really yorps? YES!!!<br /><br />Who says their isn't orange Gargs?<br /><br />-- NAJAWA --"
	},
	{
		"id": 29692,
		"title": "Re: In the name of debate:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-14T01:09:45.000Z",
		"content": "I really need to play Monuments on Mars....<br /><br />lol, they are possibly the same, I dunno.  Ask Tom Hall, lmao.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 29693,
		"title": "Re: In the name of debate:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-14T02:40:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well... in Yorphus II, the yorps are pink; where they really yorps? YES!!![hr][/quote]<br /><br />Actually, they were a related species; Yorps are <i>Yorpa IDiaus</i>, the so called Yorphius are  distantly related <i>Yorpa Keenrussians</i><br /><br />Someone should show Todd this topic first, he may be interested.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 29694,
		"title": "Latin Roots:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-14T02:52:05.000Z",
		"content": "Well in that case;<br /><br />Sometimes; 0Levellord0 is controlled by a <i>Levellordiangenius</i>, but at times, we are faced with posts by <i>Levellordiusmustmakeherpointius</i> (which 1) is a stupidly long name, and 2) posted the last post)<br /><br />Um... their both Yorps... KR said so; would you acuse KR of lying??? Remember; KR can edit your posts ([img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] )<br /><br />-- NAJAWA --"
	},
	{
		"id": 29695,
		"title": "Re: Latin Roots:",
		"author_id": 1486909,
		"author_name": "RocketJess",
		"timestamp": "2005-10-14T04:37:18.000Z",
		"content": "Of course, it's very often overlooked that there is in fact a third species of garg: the Altairian Cave Garg (gargus altairius). Having evolved completely underground, it has unusually large eyes, to the point that the eyestalks cannot support them properly and they tend to be next to the garg's body rather than held above it. They also have the most curious (and quite frankly rather stupid) defence mechanism of shooting their eyeballs at potential threats. The actual effectiveness of rendering themselves half-blind in the dark caves with a potential enemy approaching is questionable at least, and it is fortunate for the garg that they have very fast regenerative abilities.[hr]<br /><br />RocketJess, blasting off again!<br /><br />[url=http://www.geocities.com/rocketjess]The Dragonkeeper's Lair[/url]"
	},
	{
		"id": 29696,
		"title": "Re: Latin Roots:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-14T05:48:30.000Z",
		"content": "\"Well... in Yorphus II, the yorps are pink; where they really yorps? YES!!!\"<br />Ok, I can't really remember anymore, please point out where I have said they are yorps.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br />If I remember correct I've always said they are NOT yorps.<br />But it may be that I have accidentally said something else, but according to my memory the time I was making Yorphius, recolouring and tweaking yorps' teeth, I intended them not to be yorps. So please point out the topic.<br /><br />And besides, I've never edited a post to remove anything from there, so I'd advice you to stop talking sh1t. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br /><br />Ha! Jess, you're right! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Completely forgot that, the creature indeed looks like a garg.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 29697,
		"title": "Re: Latin Roots:",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-14T07:59:05.000Z",
		"content": "What about Arachnuts?<br />At times it seems like they have had some parallel evolution going on, although they have mouths where their eyes \"should\" be, and eyes where their mouth \"should\" be.<br /><br />Of course they have a few more legs as well, are insectoid, and don't do the Garg's charge attack, which the Sparky robot in fact does, leading me to believe its AI designer was inspired by the Garg's thought patterns.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 29698,
		"title": "Re: Latin Roots:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-14T11:24:04.000Z",
		"content": "Hehe, very true. But Sparky is more limited than garg, it can't make jumps or drop to deadly pits. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 29699,
		"title": "Arachnut:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-14T12:05:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Altairian Cave Garg (gargus altairius) [hr][/quote]<br /><br />Through an interesting strand of evolution, the Cave Gargs managed to replace their eyes with those laying all over the cave. Many died, so there were many eyes, though they had all dehidrated, and thus were much smaller.<br />Over a few milliniums, these eyestalks have taken on digestive tracts, and thus <i>gargus arachnius</i> was born.<br /><br />Hehehe; I'm loving this topic.<br /><br />-- NAJAWA --"
	},
	{
		"id": 29700,
		"title": "Re: Arachnut:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-14T13:15:52.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Sometimes; 0Levellord0 is controlled by a Levellordiangenius, but at times, we are faced with posts by Levellordiusmustmakeherpointius (which 1) is a stupidly long name, and 2) posted the last post)[hr][/quote]<br /><br />Hey, my schit... skitzo... split personality is nothing to make fun of!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Of course, it's very often overlooked that there is in fact a third species of garg: the Altairian Cave Garg (gargus altairius)[hr][/quote]<br /><br />Ah yes, thanks to Professoress Jessica Rocket, currently studying animinoid lifeforms at Pallet Town University for that brief but enlightening insight into what is currently an active and interesting area of research. [Especially finding out how those Gargs got all the way over to Altair.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]What about Arachnuts?[hr][/quote]<br /><br />Sorry, no relation, and little in the range of paralell evolution either. This is probbably due to the fact that both species evolved on different planets a quarter of a galaxy away.<br /><br />[quote]<b><i>Quote:</i></b>[hr]the Sparky robot in fact does, leading me to believe its AI designer was inspired by the Garg's thought patterns.[hr][/quote]<br /><br />I repeat, no one, especially me and my esteemed colleuge Professor Xky 'Sparkmeister' Rauh have ever been in contact with or pledged aid or alliegence to the creators of the Omegamatic.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Through an interesting strand of evolution, the Cave Gargs managed to replace their eyes with those laying all over the cave. Many died, so there were many eyes, though they had all dehidrated, and thus were much smaller.<br />Over a few milliniums, these eyestalks have taken on digestive tracts, and thus gargus arachnius was born.[hr][/quote]<br /><br />Really? I hadn't heard that theory before. Too bad DNA sequencing disproves it. Oddly however, it is believed from said genetic tests that the poison slugs are from a different planet, the Gnosticenes are not in fact related to humans, and the Arachnut lineage is most closely related to Licks.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
