[
	{
		"id": 1322,
		"title": "Are every audience deaf?",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-05-03T13:55:13.000Z",
		"content": "Before I begin, I go off topic: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />I've seen the R.E.M. concert two months ago, and I went to see the Alanis Morissette concert yesterday which was really great (yes, we get many concerts here in Hungary [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ). She is my all time favourite and I have bought all of her albums.<br /><br />now back to the topic: the concert was great, but, just like any other concert, the first two songs were so loud that it was not so enjoyable. The other songs were loud too, but after the first two, the ears get accustomed to the volume. I just don't see why are every concert like this. ( When I write \"concert\" I mean pop/rock etc, I know there are other kinds of music that may not be like this ) Maybe I'm alone with my opinion, but if the music was not so loud and the ears didn't have to get accustomed to it, it still would seem just as loud, with a bit better sound quality too.<br /><br />All in all, I've loved the concert and it didn't make me disappointed, even if I sounded like that. It just could have been even better."
	},
	{
		"id": 28418,
		"title": "Re: Are every audience deaf?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-05-03T14:10:07.000Z",
		"content": "Yeah, the music can be way too loud (although I've never been in any concert).<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 28419,
		"title": "Re: Are every audience deaf?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-05-03T17:37:08.000Z",
		"content": "It's a bit up to where you stand. If you're somewhere behind the crowd than there are not much stereo boxes, but there are a lot in front of the stage. Not only can the music be very loud but notice how horrible it's sometimes mixed. I went to Megadeth the other day and I wasn't able to hear the vocals. But what can you do, if you turn down the volume, you hear the crowd to much or the people in the middle are not able to hear everything.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Yeah, the music can be way too loud (although I've never been in any concert). [hr][/quote]<br /><br />So you know that it's loud because.... And your sure that it's loud because.... And your point it?-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 28420,
		"title": "Re: Are every audience deaf?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-05-03T19:30:00.000Z",
		"content": "Well, the point was that it can be too loud.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br />And I've only read it thousand and one times. (But maybe that has been all lie.)<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 28421,
		"title": "Re: Are every audience deaf?",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-05-04T00:20:20.000Z",
		"content": "It's more immersive when it's loud. Think of listening to music (make it classical) in a silent room. You don't need much volume to hear clearly. Now think of cranking the volume up, or sitting in the middle of the orchestra, if you know what that's like. It's a different experience when you can literally feel it. Our ears aren't the only body part we use to hear. Or think of a rock concert. It just wouldn't be the same if the bass didn't make your intestines bounce around. A recent concert I attended comes to mind. A band called When Sorrow Fails played. Their musical goals consist entirely of being very heavy, as far as I can tell. They cranked it up to the point where it was felt as much as heard (I <i>was</i> leaning on one of the PA speakers), and it changed the whole atmosphere. The more senses you engage the better. When you turn it up and add a light show, you get three out of five, and that's not bad at all. Still, hearing damage isn't cool. I recommend ear plugs.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 28422,
		"title": "Re: Are every audience deaf?",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-05-04T02:01:51.000Z",
		"content": "I don't have problem with loud music, only when it's so loud that it wouldn't feel less loud even if it wasn't as loud... I don't know if you get what I say.<br /><br />The concert was held in this concert hall [img]http://img.photobucket.com/albums/v505/z-one/ch.jpg[/img] which is relatively small (despite the perspective in this photo) and where classical music is played just as well. There were two tall speakers, as tall as this concert hall, and several others too. These speakers were more then enough to produce loud sounds with great quality in the open air just as well, but the volume was turned up much higher than what was needed.<br />  I understand that people get used to bigger, louder and flashier shows, but it feels like quality tends to become less and less important nowadays. Even in cinemas you feel the sound waves of explosions and such, but it makes you less deaf than a concert, plus hearing the crowd (though not much) adds a little something to a concert in my opinion.<br />  They say that Alanis Morissette plays rock music. Nowadays rock is just another name for pop, for most of the bands (she is no exception in my opinion). She has many loud songs, but not too heavy ones, and even her quieter songs had the volume of an errupting volcano. I'm a \"bit\" exaggerating here, but you get the picture. Still don't get me wrong, this is all about concerts, not her music, which is great. (for me at least and for many others)<br /><br />Maybe I just shouldn't go to concerts... but I had to see her as she is my favourite song writer and performer.<br /><br />*edit* fixed the image's link<br />so the answer to my question is \"yes\"? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 28423,
		"title": "Re: Are every audience deaf?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-05-04T13:42:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, the point was that it can be too loud..  <br />And I've only read it thousand and one times. (But maybe that has been all lie.) [hr][/quote]<br /><br />We know it's loud KR that's what Z-h said. Imagine me saying, 'I'm Djaser', and ten people replying, 'yes you are Djaser'. Wouldn't that be necessary and stupid?<br />So is your post.<br /><br />[quote]<b><i>Quote:</i></b>[hr]plus hearing the crowd (though not much) adds a little something to a concert in my opinion.[hr][/quote]<br />I don't but if you wasn't able to hear other people sing along, than there was something terrible wrong. -----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 28424,
		"title": "Re: Are every audience deaf?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-05-04T14:44:21.000Z",
		"content": "Yes, you are Djaser.<br /><br /><br /><br />Blah. Ok then..<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 28425,
		"title": "Re: Are every audience deaf?",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-05-04T16:51:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]...than there was something terrible wrong.[hr][/quote] with the volume... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img]"
	},
	{
		"id": 28426,
		"title": "Re: Are every audience deaf?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-05-05T08:05:24.000Z",
		"content": "If is that worse as you're saying than it's an exception. To all concert Ive been (a lot) was I able to hear the audience.-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	}
]
