[
	{
		"id": 69,
		"title": "Commander keen shareware update.",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2006-10-01T08:11:55.000Z",
		"content": "Episodes 1, 3.5, 4, the five level demo for episode 4, and the three level demo for episode 6 are the only ones that you are legally allowed to upload and download anywhere.<br /><br />Episodes 2, 3, 5, the registered version of episode 3.5 keen dreams, and the full version of episode 6 are commercial software, and should not appear on the Internet or any other online service, or should otherwise be sold except for authorized sellers of the games.<br /><br />The seven Commander Keen games were all written by id Software.<br /><br />  1) Marooned on Mars <br />  2) The Earth Explodes - Invasion of the Vorticons<br />  3) Keen Must Die<br />      <br />3.5) Keen Dreams - The Lost Episode (Softdisk lost it)<br /><br />  4) Secret of the Oracle<br />  5) The Armageddon Machine - Goodbye Galaxy     <br />  6) Aliens Ate My Babysitter - The Discontinued Episode[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]           <br /><br />Also the eighth commander keen game was written by David A. Palmer Productions.<br /><br />  7) Commander Keen - Game Boy Color (Play the rom on your pc if you own it)<br /><br />How to play this game on the pc:<br />--------------------------------<br />Window size set to fullscreen stretched.<br />Set your keboard controls to:<br />A Button - Ctrl<br />B Button - Space<br />Select Button - Alt<br />Start Button - Enter<br /><br />The ROM requires an emulator to run.<br /><br />Recommended emulator - [url=http://bgb.bircd.org/]BGB[/url]<br /><br />[Tom Hall does not consider this game canon.]<br /><br />And at the moment, there is no legal way to obtain Keen 6 - it was a retail game by FormGen that Apogee merely resold the title.<br /><br />As FormGen doesn't exist anymore, the game has been discontinued, and for now, there is no legal way to obtain Keen 6."
	},
	{
		"id": 2605,
		"title": "Re: Commander keen shareware update.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-01T10:49:08.000Z",
		"content": "<i>for now, there is no legal way to obtain Keen 6.</i><br /><br />You can still buy it second hand, original copies pop up on eBay now and again."
	},
	{
		"id": 2606,
		"title": "Re: Commander keen shareware update.",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2006-10-01T19:12:21.000Z",
		"content": "True, you can buy it second hand on eBay but all I ever see are copys downloaded off the internet being sold (money stealing jerks) or Id anthology.<br /><br />Id anthology seems to be the only way to get it.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  <br /><br />FormGen doesn't exist anymore, the game has been discontinued, there is no way to obtain Keen 6 because id software or 3D realms doesn't sell it anymore and they are never going to sell it ever again, so im going to ask this question...<br /><br />Should commander keen 6 be freeware?<br /><br />Also who makes that kind of decision if FormGen doesn't exist now? <br /><br />Give me the keen 6 EGA installer, the one from id anthology sucks![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 2607,
		"title": "Re: Commander keen shareware update.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-01T22:04:44.000Z",
		"content": "I think Keen6 can well and truly be considered abandonware, because if you did get into trouble for copying it, you could hardly end up in court - for a start if FormGen doesn't exist who would try to sue you to recover costs?  Even if someone did it'd be hard to say you were causing lost profits when you can argue \"but I *wanted* to pay for it, nobody would take my money\""
	},
	{
		"id": 2608,
		"title": "Re: Commander keen shareware update.",
		"author_id": 1485688,
		"author_name": "Litude",
		"timestamp": "2006-10-02T12:47:49.000Z",
		"content": "The fact that Commander Keen 6 is however protected by ESA makes a lot of abandonware sites unwilling to put it up for download.<br /><br />As for the legality, it would still be illegal. FormGen (dunno what it's called nowdays) still owns the rights to publishing the game and by downloading the game for free you are stealing their copyrighted material, so getting to a court and paying lot's of bills is not out of the question (if someone catches you)."
	},
	{
		"id": 2609,
		"title": "Re: Commander keen shareware update.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-02T14:30:09.000Z",
		"content": "Freeware is a legal term, at least it is used by multiple companies as if it was, and there are specifications for it.<br />Abandonware is a term invented by fans of old games, but means something different to everyone you might ask; there are no real specifications for it.<br /><br />I looked up FormGen quite a while ago, and found this:<br />FormGen turned into GT Interactive (1996-06), which turned into Infogrames (1999-11-15), which turned into Atari (2003-05-07), the current name.<br />So anything owned by FormGen back then is now property of Atari as far as I can tell.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	}
]
