[
	{
		"id": 437,
		"title": "A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-26T02:20:32.000Z",
		"content": "A special christmas present; a story for the whole community, containing most of it.<br /><br />Note: This will probbably end up insulting the hell out of you, so don't read on unless you hate me already. [Its also friggin looooong.]<br /><br /><br />Keen straightened his tie and tried to view his reflection in the garage window. The large amount of cobwebs in it made that quite difficult. He stared at Adirael sombrely. \"This had better work Levellord; if it doesn't I am so going to put coal in your stockings!\" Adirael smiled. \"Sure it'll work; I've studied human psychology for years!\" Just then the rest of Keens family entered. \"Billy dear,\" said his mother, \"Just where was this resturant we're going to? You weren't very specific.\" Keen tried to smile. \"Just down the road, you can see it from here\" He said activating the transpatial Cisverter. There was a buzz and suddenly the entire family was on Vorticon VI. Now; the human mind is incredibly flexible because it can ignore things that can't happen. One of the things that can't happen is instantaneous travel to another planet. \"Oh! So it is!\" exclamied Mrs Blaze staring admiringly at the ancient stonework of Hals Kitchen. For a few seconds the family experienced a dull nagging, but then their reality caught up with them and quashed it. \"Wallpapers a bit tacky though.\" replied Mr Blaze staring at the polkadot interior.<br /><br />Levellord sat alone in the garage. \"Yes! Foolish Keen! Now <i>I,</i> <i><b>Adirael McMire</b></i> am alone in the Blaze house, able to do what I wish!\" she said gleefully as she ran upstairs toward Becky Blaze's room. \"Plushies! I crave plushies!\"<br /><br />The Blaze family stared at the impressive and sophisticated interior of their dining establishment, completely overlooking the fact that the only patrons appeared to be bipedal blue dogs. However Keen noticed something amiss, even the Vorticons were dressed weird. \"Gnaaarrrg!\" \"Eeeuoch!\" gasped Keen as a pair of very sharp teeth clamped around his leg. Looking down he saw a young vorticon who had glued two green pipecleaners onto his head. A taller, but still short figure approached and dragged the protesting Vortikid off. \"Vertzin, no!\" \"Gnarrr! I'm KeenRush! Gnnaarrg!\" Keen remembered where he'd seen the figure before. \"Jax?\" he asked, already knowing the answer.<br /><br />Jax looked up and noticed Keen for the first time, seconds later both he and Keen had moved several meters horizontaly at a high acceleration. \"Keen! You're here? This is great! Wait till the club hears about this!\" Keen pulled himself up, hitting a wall was much more painful without a helmet. \"Club?\" he asked. \"Sure!\" beamed Jax. \"The Private Club of Keen Fans, or PCKF for short!\" Keen stared around him, noticing why things had looked a little strange. \"A... fan,,,club?\" he said weakly. Several other small Vorticons were already headed in his direction, notepaper and autograph pens at the ready. One was wearing nothing but his underwear, and drooling; another was holding a gutair and pretending to shoot stuff with it; two more, much older, carried something looking suspiciously like bibles and wore clothing suggesting they spent a lot of time knocking on doors. Jax pointed to each in turn \"This is Spln, he's 'special'; that guy there is Ks'tra, he's technically normal, but I dunno... Oh, and these two are Glo and L'muir; they're Jehovah's witlesses, don't talk to them, make eye contact, or stand behind any rectanglular wooden object.\"<br /><br />After a few miniutes of signing his name [On a gum wrapper? Well, okay] Keen was left withclub vice president and dictator for life, Bipp'n Pec'd [or BP to his friend.] who took him to see the clubs administrators. Keen was impressed; he'd never seen goth Vorticons before. Even the air around them seemed to drain of color and joy. They were both quite old and looked like they'd been sucking lemons as practice for the occasion. The taller one spoke first. \"So you're Keen huh? I'm Ek; Think that just because you visit our community on its first aniversary it'll revitalize it or something?\" \"Yeah.\" chimed in Djaser \"This place is dying. It was a lot better when I was last here.\" Keen frowned, uh, when were you last here?\" Djaser screwed up his brow in strained and unacoustomed thinking. \"Uh. at the creation of the community, about, oh... four months ago. Boy it was active then!\"<br /><br />Keen backed away slowly trying not to make eye contact. This was lucky, as not only did it stop the two goths savaging him, it also drew his attention to a mysterious figure in the dark corner of the room. \"Hello Mortimer\" he said casually, sitting down opposite his nemesis. Mortimer looked up. \"Ah, William; how... nice to see you. I see you've brought a crack guard of Vorticons to enforce your families evening out. And I've come prepared too. But, it is christmas; lets leave the bloodbath till tomorrow shall we?\" Keen agreed; he hadn't expected to See Mort; but as long as he didn't know that he was safe.And he'd watch his back tomorrow. \"Came prepared...?\" Keen muttered under his breath \"What did he mean by-\" There was a low growl as he passed a table. Even the Vorticons were staring curiously at this table of odd brownish quadrapedal Vorts. Well, most were quadrapedal. \"Hello Xky.\" Said Keen evenly, trying to edge away. \"I should've known you'd be here, where there's smoke there's fire.\" he said, indicating Mort with his finger. In a second Xky was on his feet, pistol drawn-<br /><br />A growl. Xky looked down. \"But mom! He's my employers nemesis!\" Another growl. \"But mo-oom! I've been waiting years for this!\" \"GrrrrRRRR\" \"Fine.\" spat Xky sitting down resentfully \"its christmas, ho-ho-ho\" he said sarcastically. Keen let out a held breath and tried not to stare at Xky fighting his brothers for a piece of steak; it was... interesting. Instead he bumped into a rather surprised waitress. \"Molly?\" gasped Keen \"So thats why you gave up babysitting! I heard you can get 63 gehlt and hour at peak times here!\" Molly smiled benevolently. \"Yeah, I'm the third, no, fourth human hired here; but the two apprentice chefs, Natawa and Harvey I think, they got fired last week for constantly lacing the food with spam. Hey; your families missing you, better get back.\" Keen thanked her, then added \"So who's the fourth?\" Molly indicated a small cage near the door; it was marked 'security' in it were two of the most vicious Foob's Keen had ever seen, who were busy fighting over some scraps. Behind them was a familiar face, quietly snacking on a half empty tin of spam. She wore the tag 'dangerou- animie freak' on her collar. \"Huh,\" mused Keen \"I wondered what Jax did with ol Jess.\"<br /><br />His family had ordered without him and were now almost halfway through their meal and chatting about the employment of Molly at this great facility. Keen had to get another chair, a young Vort by the name of D'lan had taken his and was staring open mouthed in adoration at Becky while she expoused her theory of univeral older brother annoyity. Actually getting the chair was more difficult; the only free space was occupied by a particularly grumpy Fleex that was very unflexible on the matter of chairs. Finally, several shots later he was able to sit down and enjoy a meal with his family, what he'd intended all along. There were more requests for autographs of course, and not all of them were from the fanclub. Aside from that, everything went rather quietly until Keen got up to fetch a dessert menu. Walking back to his table he suddenly became aware of a cold metal object pressed to his temple. \"Christmas my tail!\" mumbled Xky squeezing the trigger, before getting a very weird expression on his face and collapsing. A small vortikid bounded off between the tables as Keen wondered what to do with the unconsious Xky. \"hey! Wanna have some fun? We could dump him in the Anth convention next door!\" said a voice. It was a vorticon, covered head to tail in braided fur. \"Ummm, you braided <i>all</i> your fur?\" asked Keen weakly. \"Yeah.\" replied the Vorticon grabbing Xky's feet and dragging. \"You have way too much spare time on your hands.\" mumbled Keen helping him drag Xky out of the door.<br /><br />The Anthro convention wasn't hard to find, it really was right next door. Standing outside welcoming guests wearing a full body human suit was someone Keen recognized. \"Ah, hello Galax; thanks for all the corespondence and stuff, but I'm still not coming to your convention, I have family plans. But I brought a friend!\" Keen snickered as he walked away from the cries of 'yerf!' emenating from the building. \"Boy, some nights I can be evil.\" he said smiling. \"So spare time guy, where can a guy get a good chocolate icecream around here?\" The icecream was good, with extra fudge sauce, and as he'd hoped, the rest of the evening was uneventful, excepting a tiny incident that had him transported back in time to save the universe from Mortimers great-great-grandfather, and a bagel. There were however a few embarassing moments where his family subliminally tried to pat the patrons, but those instances were easily evaded with Keens usual maneuver of pretending to be totally unrelated to whatever family member was causing him grief.<br /><br />Almost too soon it was time to go hoe, the lights were dimmed, chairs put on tables and salt sprinkled on the floor [Its a Vorticon tradition, it doesn't have to have a reason] Another quick push of a button returned his family to their garage, [After of course Keen alingined them perfectly with their points of entry, so as not to materialize them inside a wall.] where their minds did a neat job of intergrating the past few hours experiences with 'reality' [Of course they all felt vaugely unsettled whenever a cartoon was on television, and they tended to talk to border collie's, but no severe effects.] Keen yawned. It had been a very long day, with many presents and good times. Tomorrow it would be back to normal, the mad daily rush, saving the world, but for tonight he could relax. \"Waaaaa! My plushies!\" Keen stared inthe direction of his sisters room. \"Aww c'mon! Give me a break!\" He mumbled.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12797,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-12-26T03:23:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]\"Boy, some nights I can be evil.\"[hr][/quote]<br />Yes... evil.<br /><br />Very evil...<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] -----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 12798,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-26T12:04:42.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Pretty good stuff again LL; I love your stories, they are so good! This one was filled with fun stuff and nice references to community members.<br /><br />Gnaaarg!<b>Eat your veggies!</b>"
	},
	{
		"id": 12799,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-12-27T09:26:07.000Z",
		"content": "<i>continueing where LL left off</i>:<br /><br />[hr]<br />On new years eve, Commander Keen was riding around with his dad. They stopped to get an oil change. A young man, who was dressed very similarly to the PCKFers took his dad's keys, and started to work on an oil change. Keen decided to watch. The taller, more compitent, and sane looking one wore a badge labeled \"Najawa\", and the shorter plumper, and more stupid looking one was named Harvey.<br /><br />Najawa opened up the engien, and let out the old oil. Then, Harvey bent over, and started to drool into the car. Keen ran in, and confronted the two dimwits.<br /><br />\"What in the name of Mike do you think you're doing?\" asked Keen.<br /><br />\"We're changing the oil!\" replied Najawa.<br /><br />\"With what?\" asked Keen.<br /><br />\"Oh, a special type of drool which is know for Flamming, and other posting disorders, but as first mentioned; it is really flammible!\" and with that, najawa pulled out a lighter, and ignited Harveys drool. With that, the garage blew down.<br /><br />Keen's dad pulled himself out of the rubble, and cursed.<br /><br />Wait here, while I call for a ride home... no insurance... no, My Lawyer!!!<br /><br />Keen stood there...<br /><br />\"Incompitent Fools... but they are trying... at least Najawa is. I guess we all should just give him a break\"<br />[hr]<br /><br />THe moral of the story; don't pick on me: I'm trying - I mean... I haven't posted for a while! I am doing this purposlyTough Guys Can Fix Their Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 12800,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1486794,
		"author_name": "Br1ck",
		"timestamp": "2005-12-31T06:17:47.000Z",
		"content": "You left out the most important community member--ME!<br /><br />Luckily I was spared the necessity of reading all of you drivel, thanks to the 'search' function... Well done Levellord, I'm sure..."
	},
	{
		"id": 12801,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-31T14:00:13.000Z",
		"content": "Hmmm, your behaviour has changed quite a lot Br1ck.. You weren't like this before..<b>Eat your veggies!</b>"
	},
	{
		"id": 12802,
		"title": "Re: A christmas Carol [And Challotte, and Candice and...]",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-12-31T19:36:29.000Z",
		"content": "hahahaha<br /><br /><br />wow.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	}
]
