[
	{
		"id": 975,
		"title": "Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-21T21:01:08.000Z",
		"content": "This topic contains serious criticism of the Christian religion which could be interpreted as flaming.  It has swearing, and it seriously blunt.  It also discusses mature sexual topics.<br /><br />**READ MY ENTIRE TOPIC BEFORE POSTING! THOROUGHLY!**<br />(Or I shall make you look like a fool, =P)<br /><br />This first section of verses are not meant to prove anything other than the Bibles full admittance of how harsh slavery is (mainly note the verb usage):<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />1Ki 9:22<br />But Solomon did not consign the Israelites to slavery<br /><br />2Ch 28:10<br />Now you plan to  reduce  the people of Judah and Jerusalem, male and female, to slavery.<br /><br />De 24:7 - Show Context <br />\"If anyone kidnaps a fellow Israelite and treats him as a slave or sells him, the kidnapper must die.<br />[hr][/quote]<br />These verses are used to show that the Bible (and its writers) had a working knowledge of how hurtful, emotionally painful, and horrid slavery is.<br /><br />Here is a list of verses where, even though it has admitted is hurtful (ergo in any competent human mind it must be wrong), it is still accepted and regulated:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Leviticus 22:11<br />But if a priest buys a slave with money [Proceeds to talk about feeding your slave]<br /><br />Ex 21:4 -<br />\"If his master gave him a wife while he was a slave, and they had sons or daughters, then the man will be free in the seventh year, but his wife and children will still belong to his master. <br /><br />Ex 21:7 - Show Context <br />\"When a man sells his daughter as a slave, she will not be freed at the end of six years as the men are. <br />Ex 21:21 - Show Context <br />If the slave recovers after [being beaten by his master] the owner should not be punished, since the slave is the owner's property. <br /><br />De 21:14 - Show Context <br />But if you marry her and then decide you do not like her, you must let her go free. You may not sell her or treat her as a slave, for you have humiliated her. [This is perhaps my favorite verse, because God now allows you to get divorced (In direct contradiction to what Jesus said) merely because shes nothing more than a slave)<br />[hr][/quote]<br /><br />Did many Christians know these verses existed?  Im willing to bet a majority of you did not.  But this is only the beginning of my point:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Romans 1:24-31 (forgive me, I know this is a long stretch of verses)<br />24Therefore God gave them over in the sinful desires of their hearts to sexual impurity for the degrading of their bodies with one another. 25They exchanged the truth of God for a lie, and worshiped and served created things rather than the Creatorwho is forever praised. Amen. <br />    26Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. 27In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion. <br />    28Furthermore, since they did not think it worthwhile to retain the knowledge of God, he gave them over to a depraved mind, to do what ought not to be done. 29They have become filled with every kind of wickedness, evil, greed and depravity. They are full of envy, murder, strife, deceit and malice. They are gossips, 30slanderers, God-haters, insolent, arrogant and boastful; they invent ways of doing evil; they disobey their parents; 31they are senseless, faithless, heartless, ruthless. 32Although they know God's righteous decree that those who do such things deserve death, they not only continue to do these very things but also approve of those who practice them. [hr][/quote]<br /><br />The remainder of the chapter is only going on about how horrible non-Christians are, how they will burn in hell etc.  At any rate, I love the use of the word degrading here.  Also how they are all senseless, faithless, heartless, ruthless for being non-Christians.  Its no wonder in order to be a Christian you [normally] have to be black and white.<br /><br />Does the Bible really have any excuse for allowing and espousing such hatred (This was quoted from the New Testament, mind you) against homosexuals?<br /><br /><br />Without further ado, heres my favorite story from the Bible.  Its about a concubine, two homophobic men, and about a thousand perverts who all (If there is a God) shall rot in Hell (Excluding, of course, the concubine):<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Jud 22:30 - Show Context <br />22 While they were enjoying themselves, some of the wicked men in the town surrounded the house. They began beating at the door and shouting to the old man, \"Bring out the man who is staying with you so we can have sex with him.\" 23 The old man stepped outside to talk to them. \"No, my brothers, don't do such an evil thing. For this man is my guest, and such a thing would be shameful. 24 Here, take my virgin daughter and this man's concubine. I will bring them out to you, and you can do whatever you like to them. But don't do such a shameful thing to this man.\" 25 But they wouldn't listen to him. Then the Levite took his concubine and pushed her out the door. The men of the town abused her all night, taking turns raping her until morning. Finally, at dawn, they let her go. 26 At daybreak the woman returned to the house where her husband was staying. She collapsed at the door of the house and lay there until it was light. 27 When her husband opened the door to leave, he found her there. She was lying face down, with her hands on the threshold. [She was dead, it is said in certain translations]<br />[hr][/quote]<br /><br />Granted, if you follow the rest of the verses, it talks about how this sparks a war.  Thats a great little bedtime story is not it?  For, they did the morally correct thing, did they not?<br /><br />They sacrificed the woman to be raped (and Im sure sodomized) repeatedly all night long.  I love the part where they say pushed her out the door (IE: she sure as hell didnt want to get raped and murdered by the crowd).   But all of this was necessary, you see, because apparently in the Christian religion its is better for a woman to be literally raped to death than for a homosexual act to be committed.  Its nice to see a morally courageous man using a woman as his scapegoat.<br /><br />Which just goes to show ever further, this woman wasnt his sexual love interest; she was his bitch, nothing more.  He didnt give a damn about her, if he could sacrifice her for himself.<br /><br />This story to me is the ultimate act of immorality.  It teaches you that it is okay to throw out your subservient partner if your life is in danger.  After all, shes just a slave, is she not?  And after all, you can beat those slaves so long as they dont die, no?  And you not becoming a homosexual is the penultimate immorality to avoid, no?<br /><br />You hypocrites.  How dare you come at me with your greater than thou morals when your God encourages such ignorance.<br /><br />**NOTE**<br /><br />Ill save you the time of making your first point against this: Well, the Old Testament isnt the law anymore, is it?<br /><br />Nope, it sure isnt.  But then one ponders: Why was it ever morally expectable?<br /><br />Because the fact that it was at one point in time acceptable, makes it no better.  It doesnt matter if it is acceptable now, in the future, or in the past.  It was endorsed.  Thats the only relevant point.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23152,
		"title": "Re: Christianity",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-21T21:49:27.000Z",
		"content": "i agree completely <br /><br />but do not want to be part of any flame wars<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] [img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 23153,
		"title": "Re: Christianity",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-10-22T00:46:48.000Z",
		"content": "I'm a little bit confused, Globox. I read your post few times, and still don't get it. Why have you posted this? On a Commander Keen forum? There's not a whole heap of people here who'll either understand this or care about it.<br /><br />This rant, or whatever it is, would be more relevant in some religion forum somewhere. Or the letters section of your local newspaper.<br /><br />But I don't understand or care about the topic, so I'll just let you get on with it.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 23154,
		"title": "Re: Christianity",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-22T00:52:03.000Z",
		"content": "it was relating to another thread where people were discussing this. He shot it off from that thread.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 23155,
		"title": "Re: Christianity",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-22T02:08:49.000Z",
		"content": "This doesn't seem to be an argument against Christianity as a whole, but merely those Christians who take the Bible literally (to my knowledge, most Protestants).<br /><br />I know a fair number of Christians, some of whom are indeed morons, but most are simply dedicated to the principles of Jesus' teachings.  They don't have a problem with homosexuals, and they don't think that morally upright nonbelievers will burn in hell.<br /><br />My point is, just make sure you're careful what you say the target of this argument is.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23156,
		"title": "Re: Christianity",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-10-22T04:28:35.000Z",
		"content": "Why is this board descending into controversy all of a sudden?"
	},
	{
		"id": 23157,
		"title": "Re: Christianity",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-22T09:58:01.000Z",
		"content": "At least there's life on the forum. But is it intelligent? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  I've posted in such topic previously and I admit that it was pointless... I've decided not to do it anymore. I bet every one of you are really afraid now [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]"
	},
	{
		"id": 23158,
		"title": "Oh man...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T18:22:54.000Z",
		"content": "Oh man... first, you must know a few things about the bible.<br /><br />God did not, personally, take out a quill, bottle of ink, and parchment himself. The Bible is the inspired word of God, not God himself.<br /><br />As you may have seen, the slave verses may contradict; but you must take them all in context. This means that you must understand what time period the writter came from.<br /><br />For Example; Christ was dead for 3 days... but Friday to Sunday is only 2 days... not 3.<br /><br />The Jews in Jesus' time understood a day in a more literal fashion; Friday, Saterday, and Sunday are 3 days... and so Jesus was dead for three days... though in our mesurments, he was dead for exactly 48 hours.<br /><br />God told Isreal not to have slaves, but over time, they disregarded his law... so God had to tell his people not to abuse their slave; a good example of this in real life would be:<br /><br />Smoking: We know it is bad for your lungs [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]  <br /><br />Kids are told not to do it, but they still do, so now, there are regulations on how old you must be to buy them for yourself.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Ill save you the time of making your first point against this: Well, the Old Testament isnt the law anymore, is it?[hr][/quote]<br /><br />No exactly, but it is there as a record of salvation history:<br /><br />First, There was the passover (A forshadowing of Christ's death)<br /><br />Then, There is the jewish priesthood (A forshadowing of Catholic Priesthood - Jesus is the high priest)<br /><br />Ect...<br /><br />I may post more, when my hands aren't as tired<br /><br />-- NAJAWA --"
	},
	{
		"id": 23159,
		"title": "Re: Oh man...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-22T19:37:49.000Z",
		"content": "Najawa- Before you tell me I need to get a clue, try using verses.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23160,
		"title": "Um...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T22:08:49.000Z",
		"content": "Explain...<br /><br />What do you want verses for?<br /><br />-- NAJAWA --"
	},
	{
		"id": 23161,
		"title": "Re: Um...",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-22T23:46:53.000Z",
		"content": "Yes, I'm a Christian. Yes, I know of these verses.<br /><br />Now, the reason that debates like this turn into flame wars is because there are no simple answers. Everything in the Bible is interconnected, with backstories and references, and because of this fact, no conversation can completely cover the issues.<br /><br />I wish I could come into this claiming to understand it all, but maybe I can help in at least some of this.<br /><br />You mentioned your \"favorite story\" of the Bible. First of all, it's in Jud 19, not Jud 22, but that's a typo, and I won't dwell on that.<br /><br />You assume that Christianity supports this act because it's in the Bible. Yet, just because it's in the Bible doesn't mean it's right. When Israel builds idols to worship, it's not an invitation for everyone to do the same. When a king of Israel commits suicide, God doesn't smile. A man throwing an innocent woman outside to be raped... that should go without saying.<br /><br />This happened in the land of the tribe of Benjamin. In the next chapter, you find out how all the rest of Israel found out about this and was just as disgusted as you or I would be. So, they amass their fighting forces, and they ask God what to do. Does God say \"No, my children, the tribe of Benjamin has done well, go and rape and abuse any woman you want\"? No, he says \"Go, for tomorrow I will give them into your hands. (Jud 20:2[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img] \" And the rest of Israel fights the tribe of Benjamin because of the evil.<br /><br />I understand that none of this sounds very love-like, but consider these facts: <br /><br />- God gave every person free will to love him.<br />- God gave every person free will to obey him.<br />- God called Israel his chosen people, thus promising to put his protection over them, despite the rebellion of any group of them<br /><br />So, in a situation like this, there are only so many things he can do without breaking his own word.<br /><br />There's my simple answer. Now, if this turns into a flaming contest based on what I've said, I will have no part in any further discussion in this thread.<br /><br />And yes, I realize I didn't answer your whole post, LordOfGlobox. I've found it best to try to answer these one at a time. The longer these explanations get, the more people tend to skip them.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23162,
		"title": "Re: Christianity",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-23T01:45:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />**READ MY ENTIRE TOPIC BEFORE POSTING! THOROUGHLY!**<br />(Or I shall make you look like a fool, =P)[hr][/quote]<br />Thats right. . . similar to what Proverbs 18:13 says:  He that answereth a matter before he heareth it, it is folly and shame unto him.<br /><br />(I believe the 1611 King James Version is the most accurate translation of the original Greek and Hebrew, so thats what I use.  Ive also added emphasis in some verses.) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]Deuteronomy 21:14  And it shall be, if thou have no delight in her, then thou shalt let her go whither she will; but thou shalt not sell her at all for money, thou shalt not make merchandise of her, because thou hast humbled her.<br /><br />Deuteronomy 21:1-2  When a man hath taken a wife, and married her, and it come to pass that she find no favour in his eyes, because he hath found some uncleanness in her: then let him write her a bill of divorcement, and give it in her hand, and send her out of his house.  And when she is departed out of his house, she may go and be another man's wife.  [hr][/quote]<br />These two verses allowed a man to divorce his wife, but when we look at what Jesus says about <i>why</i> it was allowed...<br />[quote]<b><i>Quote:</i></b>[hr]Matthew 19:8  He saith unto them, Moses <b>because of the hardness of your hearts</b> suffered you to put away your wives: but from the beginning it was not so. [hr][/quote]<br />It looks to me (though Im no expert) as though it was because of the peoples wickedness -- hardness of your hearts -- that divorce was <i>ever</i> permissible.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />*In regards to the passage from Romans*<br />The remainder of the chapter is only going on about how horrible non-Christians are, how they will burn in hell etc. . . Does the Bible really have any excuse for allowing and espousing such hatred (This was quoted from the New Testament, mind you) against homosexuals?[hr][/quote]<br />Well, let's see what the Bible says. . .<br />[quote]<b><i>Quote:</i></b>[hr]Psalm 53:1  \"The fool hath said in his heart, There is no God. Corrupt are they, and <b>have done abominable iniquity: there is none that doeth good.</b>\"<br />Psalm 5:5  \"The foolish shall not stand in Thy sight: <b>Thou hatest all workers of iniquity.</b>\"[hr][/quote]<br />The question should be:  does <i>anyone</i> have an excuse to question who or what God hates?<br />[quote]<b><i>Quote:</i></b>[hr]Romans 9:20 (not the entire verse)  Nay but, O man, who art thou that repliest against God? . . .<br />Isaiah 55:8-9  For My thoughts are not your thoughts, neither are your ways My ways, saith the LORD.  For as the heavens are higher than the earth, <b>so are My ways higher than your ways, and My thoughts than your thoughts.</b>\"[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Judges 19:22-30  Now as they were making their hearts merry, behold, the men of the city, certain sons of Belial, beset the house round about, and beat at the door, and spake to the master of the house, the old man, saying, Bring forth the man that came into thine house, that we may know him.  And the man, the master of the house, went out unto them, Nay, my brethren, nay, I pray you, do not so wickedly; seeing that this man is come into mine house, do not this folly.  Behold, here is my daughter a maiden, and his concubine; them I will bring out now, and humble ye them, and do with them what seemeth good unto you: but unto this man do not so vile a thing.  But the men would not hearken to him: so the man took his concubine, and brought her forth unto them; and they knew her, and abused her all the night until the morning: and when the day began to spring, they let her go.  Then came the woman in the dawning of the day, and fell down at the door of the man's house where her lord was, till it was light.  And her lord rose up in the morning, and opened the doors of the house, and went out to go his way: and, behold, the woman his concubine was fallen down at the door of the house, and her hands were upon the threshold.  And he said unto her, Up, and let us be going. But none answered. Then the man took her up upon an ass, and the man rose up, and gat him unto his place.  And when he was come into his house, he took a knife, and laid hold on his concubine, and divided her, together with her bones, into twelve pieces, and sent her into all the coasts of Israel.  And it was so, that all that saw it said, There was no such deed done nor seen from the day that the children of Israel came up out of the land of Egypt unto this day: consider of it, take advice, and speak your minds.<br /><br />*Keep in mind, however. . .*<br />Judges 21:25  In those days there was no king in Israel: every man did that which was right <b>in his own eyes.</b><br /><br />Proverbs 12:15  The way of a fool is right <b>in his own eyes:</b> but he that hearkeneth unto counsel is wise. <br /><br />Proverbs 21:2  Every way of a man is right <b>in his own eyes:</b> but the LORD pondereth the hearts. [hr][/quote]<br />As Illsoap pointed out, just because God chose to record it in the Bible, that does not necessarily mean it is/was right in <i>His</i> eyes.  Furthermore, He <i>does</i> have reasons for why He records somethings, though those reasons might not be obvious. . .<br /><br />CONCLUSION--<br />Your standards and morals (wherever they originate) are obviously not Gods righteous standards; thus, they conflict.<br />One last verse. . .<br />[quote]<b><i>Quote:</i></b>[hr]I Corinthians 2:13  But the natural man receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them, because they are spiritually discerned.[hr][/quote]"
	},
	{
		"id": 23163,
		"title": "Re: Christianity",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-23T09:32:39.000Z",
		"content": "Thanks for the reply Ilsoap, I was already wondering if I should ask someone a bit more knowledged person about this matter. Cheers, this cleared it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23164,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T13:26:44.000Z",
		"content": "Poit by point refutation:<br /><br />[quote]<b><i>Quote:</i></b>[hr]This first section of verses are not meant to prove anything other than the Bibles full admittance of how harsh slavery is (mainly note the verb usage):[hr][/quote]<br /><br />The bible had many writers, but most would know the hardship of slavery.<br /><br />Slavery is regulated in the bible because, especially Levidicous and Deuteronomy are guidelines to the functioning of a primitive civilization. If you read the whole chapters, you will see regulations for almost every aspect of life. If we go by Jesus's preachings, surely we cannot condone slavery?<br /><br />[quote]<b><i>Quote:</i></b>[hr]The remainder of the chapter is only going on about how horrible non-Christians are, how they will burn in hell etc. At any rate, I love the use of the word degrading here. Also how they are all senseless, faithless, heartless, ruthless for being non-Christians. Its no wonder in order to be a Christian you [normally] have to be black and white.[hr][/quote]<br /><br />And yet we are supposed to love our neighbour and convert them, I'd say this is more a description of this lowly group than a 'all atheists sux' verse.<br /><br />Also, it states indecent acts, not homosexuality itself, prostitution is disliked by God, gay or straight yet it does not condem straight sex.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Bring out the man who is staying with you so we can have sex with him[hr][/quote]<br /><br />So a crowd of people surround a vistors house with the sole intention of dragging the guy out and raping him, and they deserve mercy?<br /><br />Then they rape this poor woman in lieu of breaking down the door and doing God knows what to everyone inside.<br /><br />And still God says, if you find 50 good people, the town will remain. Now thats mercy. Frankly I'd kill the lot of the bastards.<br /><br />[quote]<b><i>Quote:</i></b>[hr]because apparently in the Christian religion its is better for a woman to be literally raped to death than for a homosexual act to be committed[hr][/quote]<br /><br />No, apparently it is better to sacrifice a woman then have a man raped. This was probbably common feeling at the time, God sanctioned or not. I really don't think rape can be homosexual, just rape, but if your view focuses on the participants rather than the act, okay...<br /><br />[quote]<b><i>Quote:</i></b>[hr]Which just goes to show ever further, this woman wasnt his sexual love interest; she was his bitch, nothing more. He didnt give a damn about her, if he could sacrifice her for himself.[hr][/quote]<br /><br />Hell, thats even more common today. Its a pity.<br /><br />[quote]<b><i>Quote:</i></b>[hr]This story to me is the ultimate act of immorality. It teaches you that it is okay to throw out your subservient partner if your life is in danger[hr][/quote]<br /><br />I think it illustrates why the town was destroyed. Also, I'm glad the bible prints the errors of its writers, unlike say, the Koran. [Or any autobiography, press release, etc.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]You hypocrites. How dare you come at me with your greater than thou morals when your God encourages such ignorance.[hr][/quote]<br /><br />Where did he encourage? Where is his commands? Ignorance of what? And your morals have resulted injust as bad. I abhor this, so this is why I moralize at you. If you abhor it then we are in agreement and our issues are of theistic belief. If not, then you are sick and it is no wonder I moralize at you.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Because the fact that it was at one point in time acceptable, makes it no better. It doesnt matter if it is acceptable now, in the future, or in the past. It was endorsed. Thats the only relevant point.[hr][/quote] <br /><br />No it is not law, but, atheists once disected animals alive, believing them automata, amny atheists wrote slave laws. Does this taint them? Two points must be made; 1.)The OT is long and varied, for each example as above, there are counter examples showing virtue. 2.) It was acceptable once, but usually not anything like what you quote. The 10 commandments do not endorse rape, in fact, I see no direct allowance in the whole bible. Now if God had said 'its okay to rape your enemies women' as I believe happens a lot these days, then I would worry.<br /><br /><br />Ilsoap: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] <br /><br />Gmixer: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] <br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23165,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T13:43:12.000Z",
		"content": "Since Isloap is the only one who has posted verses and anything of relivence, I won't bother responding to the others.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Yes, I'm a Christian. Yes, I know of these verses.<br /><br />Now, the reason that debates like this turn into flame wars is because there are no simple answers. Everything in the Bible is interconnected, with backstories and references, and because of this fact, no conversation can completely cover the issues.<br /><br />I wish I could come into this claiming to understand it all, but maybe I can help in at least some of this.<br />[hr][/quote]<br />As LL once said on the \"Pedeofilia\" thread: \"Hazzah, a worthy opponent\"<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />You mentioned your \"favorite story\" of the Bible. First of all, it's in Jud 19, not Jud 22, but that's a typo, and I won't dwell on that.<br />[hr][/quote]<br />Indeed, I shall edit it out after I finish this post.  I thank you for not obbsessing over it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />You assume that Christianity supports this act because it's in the Bible. Yet, just because it's in the Bible doesn't mean it's right. When Israel builds idols to worship, it's not an invitation for everyone to do the same. When a king of Israel commits suicide, God doesn't smile. A man throwing an innocent woman outside to be raped... that should go without saying.<br />[hr][/quote]<br />I never assumed that because it was in the Bible, that it was smiled upon.  However, my point was, these acts are still evil.  Everyone of them.  Yet, God says nothing.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />This happened in the land of the tribe of Benjamin. In the next chapter, you find out how all the rest of Israel found out about this and was just as disgusted as you or I would be. So, they amass their fighting forces, and they ask God what to do. Does God say \"No, my children, the tribe of Benjamin has done well, go and rape and abuse any woman you want\"? No, he says \"Go, for tomorrow I will give them into your hands. (Jud 20:2 \" And the rest of Israel fights the tribe of Benjamin because of the evil.<br />[hr][/quote]<br />I know this.  I thought I put the fact that they went to war with them at the bottom of my quote... I'll double check, but I thought I did.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  .<br /><br />At any rate, my complaint was more reserved for the man that through her outside to get raped and murdered, yet was not punished or even frowned upon.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />As for that verse, <br /><br />I understand that none of this sounds very love-like, but consider these facts: <br /><br />- God gave every person free will to love him.<br />- God gave every person free will to obey him.<br />- God called Israel his chosen people, thus promising to put his protection over them, despite the rebellion of any group of them<br />[hr][/quote]<br />I'm not sure where this ties in...?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />So, in a situation like this, there are only so many things he can do without breaking his own word.<br /><br />There's my simple answer. Now, if this turns into a flaming contest based on what I've said, I will have no part in any further discussion in this thread.<br />[hr][/quote]<br />Who is \"he\"?  I'm sorry, I don't understand.  Could you re-phrase?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />And yes, I realize I didn't answer your whole post, LordOfGlobox. I've found it best to try to answer these one at a time. The longer these explanations get, the more people tend to skip them.<br />[hr][/quote]<br />I fully understand and prefer it this way.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23166,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T14:37:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]these acts are still evil. Everyone of them. Yet, God says nothing.[hr][/quote]<br /><br />And he says nothing now. To do so would destroy free will. Saying nothing is not support. There is genocide going on right now, yet you say nothing.<br /><br />There is much discussion to be found on this subject.<br /><br />Good on ya Ils!A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23167,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T23:08:11.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />And he says nothing now. To do so would destroy free will. Saying nothing is not support. There is genocide going on right now, yet you say nothing.<br /><br />There is much discussion to be found on this subject.<br /><br />Good on ya Ils! <br />[hr][/quote]<br /><br />But I'm not tlaking about genocide right at this moment.  Then I would comment on it, whereas the Bible has not even frowned on it.  I'm not talking strictly about the woman beign raped, but that fact that she was forced by her masters.<br /><br />So when God says something is wrong, that's debasing free will?  Think that one over again, LL.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23168,
		"title": "Re: Christianity",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-10-24T05:53:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I'm not talking strictly about the woman beign raped, but that fact that she was forced by her masters.[hr][/quote]<br />The Bible pretty well established by this chapter what God's opinion on this action was, to actually state it in this story would be excessive and out of form with the writing. In other words, the reader should, by the time they read this, know beyond a shadow of a doubt that God was both disgusted and heartbroken over this action.<br />Prior to this verse, the point had been made that God was so disgusted by the immorality of this city that he was about to completely obliterate it. At no point are we told that God was happy with the people in this house, only that he would allow them to leave safely due to prior promises he had made. <br /><br />This whole story is meant to illustrate both the sinfulness of the people of that city, and the faults of the old man and consequently his family. (As they learned from his example.)<br />When he said \"But don't do such a shameful thing to this man\", the \"man\" was actually and angel of God. The story illustrates how little faith this old man had that he was actually worried about the safety of an angel. He had gone so far from God that somehow the thought didn't cross his mind that \"hey, God isn't going to let this crowd touch this angel, we have nothing to worry about\", instead he freaked out and offered both the woman who was forced out and his own daughter!<br /><br />The purpose here is not to condone this action, not to say such a trade-off is a good thing, but to illustrate how this exceedingly wicked town had so negatively affected this old man. And to show that it was indeed bad enough that God had decided to destroy the town, killing everyone in it.<br /><br />See, this passage has unfortunately been used with a one-track-mind by a lot of religious zealots. Specifically, a lot of religious people use this to say \"see, God hates homosexuality so much He will kill people for being gay!\" That's not at all what the point was. The point is that there was a boiling point at which God had put up with too much wickedness and decided to force a cleanup.<br /><br />This passage also demonstrates a nifty parallel to the overall story and purpose of the bible.<br />1. Theres a place that is sinful and God will destroy. In this case it was a city, overall its the world.<br />2. God sent in somebody to rescue those who will accept the offer and instructions. An angel then, Christ overall."
	},
	{
		"id": 23169,
		"title": "*understands*",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-24T13:40:03.000Z",
		"content": "[hr]<b>Vitamin Zach</b> This passage also demonstrates a nifty parallel to the overall story and purpose of the bible.<br />1. Theres a place that is sinful and God will destroy. In this case it was a city, overall its the world.<br />2. God sent in somebody to rescue those who will accept the offer and instructions. An angel then, Christ overall.<br />[hr]Wow. That's the most sense I've heard from someone referencing the Bible.<br /><br />There may be hope for Christianity in my belief system yet.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23170,
		"title": "Re: *understands*",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-24T16:05:30.000Z",
		"content": "Thanks Zach, awesome post.<br />That should hopefully give LoG something to think about. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23171,
		"title": "Re: Christianity",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-24T20:30:29.000Z",
		"content": "Well, actually, Vitamin Zach, I think LordOfGloBox was talking about an <i>entirely</i> different incident.  You're refering to the story in <i>Genesis</i> 19, whereas LOfGBox was talking about Judges 19. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]But I'm not tlaking about genocide right at this moment. Then I would comment on it, whereas the Bible has not even frowned on it.[hr][/quote]<br />Ah, quite the contrary.  In I Samuel chapter 15, God (through Samuel) told Saul to <i>utterly</i> destroy the Amalekites.<b><i>If the universe were toast, what jelly would you put on it?</i></b>"
	},
	{
		"id": 23172,
		"title": "Re: Christianity",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-10-25T00:42:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, actually, Vitamin Zach, I think LordOfGloBox was talking about an entirely different incident. You're refering to the story in Genesis 19, whereas LOfGBox was talking about Judges 19.[hr][/quote]<br />Indeed, you are correct, thank you for pointing this out! I was thinking of that other incident that is often used to argue against homosexuality while ignoring the other important lessons."
	},
	{
		"id": 23173,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-25T05:24:22.000Z",
		"content": "Hi. Sorry I haven't responded sooner... the last two days have been quite busy for me.<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"Hazzah, a worthy opponent\"[hr][/quote]<br /><br />Huzzah! Someone else who says that word! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]I know this. I thought I put the fact that they went to war with them at the bottom of my quote... I'll double check, but I thought I did.[hr][/quote]<br /><br />Yeah, you did. I misunderstood what you were focusing on with this story.<br /><br />[quote]<b><i>Quote:</i></b>[hr]At any rate, my complaint was more reserved for the man that through her outside to get raped and murdered, yet was not punished or even frowned upon.[hr][/quote]<br /><br />Fact 1: He was of the tribe of Benjamin.<br />Fact 2: Every male, it seems, was killed when the rest of Israel went to war.<br /><br />Yeah, he was punished.<br /><br />As for being frowned upon, if you only use these selection of verses, no he wasn't, but it's not like God never talked about this. Besides famous verses like what Jesus quoted from Deuteronomy, \"Love your neighbor as yourself\", there are more specific laws like \"Do not degrade your daughter by making her a prostitute (Lev 19:29)\".<br /><br />I guess a question to ask would be, what should God have done that would have been better than what happened? Sure, God could have used some booming heavenly voice, or used the \"Smite\" button on his computer - that's from a Far Side cartoon, if you haven't seen it - but he didn't. What happened was that the rest of Israel recognized just how depraved the Benjamite and his people had become and followed God's laws without God's direct intervention. This is why I brought up God's will... He wants us to love Him, but didn't create a world where we are forced to do so. Israel followed God's commands, which was more desirable than God carrying out the action himself.<br /><br />That's about as far as I can think of with that Judges thing, LordOfGlobox. I'm still not sure that I'm being very clear about it, but I now give you a chance to respond.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23174,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-25T13:36:13.000Z",
		"content": "*Sigh* if only you weren't married... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] <br /><br />You illustrate the points I want to make with a patiencce and eloquence that I can only dream of. <br /><br />Three huzzah's for Ilsoap!<br /><br />[quote]<b><i>Quote:</i></b>[hr]that's from a Far Side cartoon[hr][/quote]<br /><br />Gary Larson and Terry Pratchett are my favourate rligious atheists.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23175,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-25T15:35:40.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]*Sigh* if only you weren't married... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] [hr][/quote]<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I'll take that as a compliment (but probably won't relay that one on to Rebecca).<br /><br />[quote]<b><i>Quote:</i></b>[hr]Wow. That's the most sense I've heard from someone referencing the Bible.[hr][/quote]<br /><br />Forgot to comment on what CommanderSpleen said in my last post. You were referring to how an Old Testament story references what Jesus did. You might be interested to know that there are many, many more pieces of symbolism for Jesus in the Old Testament... it's one of my favorite pieces of evidence that the Bible isn't just any ordinary book. (It's a topic of discussion I'd love to get into, but again, I've been through enough of these that derailing the original issue never helps, so maybe some other time.)[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23176,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-25T22:15:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Fact 1: He was of the tribe of Benjamin.<br />Fact 2: Every male, it seems, was killed when the rest of Israel went to war.<br /><br />Yeah, he was punished.<br />[hr][/quote]<br />Nontheless, I was of the opinion (As I know very many people are) that God was angry about the homosexual act and the casual sexual nature of the poeple of Benjamin.  Not because someone through a girl out to be raped.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />As for being frowned upon, if you only use these selection of verses, no he wasn't, but it's not like God never talked about this. Besides famous verses like what Jesus quoted from Deuteronomy, \"Love your neighbor as yourself\", there are more specific laws like \"Do not degrade your daughter by making her a prostitute (Lev 19:29)\".<br />[hr][/quote]<br />\"Love thy neighbor as thyself\" is too braod of a verse.<br /><br />\"Making her a prostitute\" and raping are two very separate things in the Bible.  I will note this in the... Sorry, I do not have the time to search up the verse, but I *think* it's 2nd Samuel 13:14, where a girl is raped.  The only crime to her was that she was having sex out of marriage.  So she made herself feel even worse.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I guess a question to ask would be, what should God have done that would have been better than what happened? Sure, God could have used some booming heavenly voice, or used the \"Smite\" button on his computer - that's from a Far Side cartoon, if you haven't seen it - but he didn't. What happened was that the rest of Israel recognized just how depraved the Benjamite and his people had become and followed God's laws without God's direct intervention. This is why I brought up God's will... He wants us to love Him, but didn't create a world where we are forced to do so. Israel followed God's commands, which was more desirable than God carrying out the action himself.<br />[hr][/quote]<br />As good of a stand-alone point as this is, it truly has nothing to do with this debate. (I don't mean to sound like a dick, but it really is an entirely seperate thread on it's own)<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />That's about as far as I can think of with that Judges thing, LordOfGlobox. I'm still not sure that I'm being very clear about it, but I now give you a chance to respond. Isloap<br />[hr][/quote]<br />Actually, I am the one not being as clear as I would like to be (I'm currently being one of the leads in a play, Honors Eng11, and I have an Algebra teacher who thinks that 3 hours of hw a night is a fully fair load, plus physics).<br /><br />My point was this:  The girl might of gotten a form of justice, but the only real motive behind killing that tribe (From my, and a few others, interpretations of the verse) was their blatent sexual nature, their homosexuality, and lastly because they raped a girl.<br /><br />Secondly, why would you not help defend the girl?  I do not understand how one can with one breathe claim someone else is un-righteous, when he just sat back and let them commit such an offensive act right in front of him.<br /><br />From my eyes, he was as guilty as they were.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23177,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-26T00:41:38.000Z",
		"content": "Was that guy christian? The bible doesn't say. A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23178,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-26T05:33:51.000Z",
		"content": "Well, obviously he wasn't CHRISTIAN... this was around 1300 years before Jesus, I believe. He was a Jew by birth... that's as much as it says.<br /><br />Why didn't God help the girl? Well... that's really part of a much larger question, I guess. How can God be righteous when there are starving people all around the world, or people being tortured right now, etc.<br /><br />Yeah... that's definitely a tough one to answer, although that's why I brought up man's free will and what God can do in the first place.<br /><br />That's way too brief of an answer, but it's late, and I gotta head to bed. Sorry.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23179,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-26T22:15:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Well, obviously he wasn't CHRISTIAN... this was around 1300 years before Jesus, I believe. He was a Jew by birth... that's as much as it says.<br />[hr][/quote]<br />I use Christian and pre-Christ Jew interchangably.  You'll have to forgive me.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Why didn't God help the girl? Well... that's really part of a much larger question, I guess. How can God be righteous when there are starving people all around the world, or people being tortured right now, etc.<br /><br />Yeah... that's definitely a tough one to answer, although that's why I brought up man's free will and what God can do in the first place.<br />[hr][/quote]<br />I meant why didn't the religious Christian (Jew, or whatever you wish to call him) help his concubine?  That's the only unanswered question.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />That's way too brief of an answer, but it's late, and I gotta head to bed. Sorry.<br />[hr][/quote]<br /><br />It's okay, I've only got 15 minutes to get online and psot and then to get off... so. meh.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23180,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-29T17:21:28.000Z",
		"content": "Sorry for the long wait on this one, LordOfGlobox.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I meant why didn't the religious Christian (Jew, or whatever you wish to call him) help his concubine? That's the only unanswered question.[hr][/quote]<br /><br />That's a very good question, but it's also unanswerable. The only thing we truly know about this man is that he was a Levite, which means that he's in a line of priests, and probably one himself.<br /><br />However, we don't know his character. But, we do know something about the character of another Levite from the same time period in Judges 17. That man was willing to, basically, get paid to preach good things to the man who hired him (not unlike some people who become pastors, but only preach about nice things to avoid offending the people of their congregation who put the most in the offering plate).<br /><br />To sum up... just because someone calls themselves a Jew or a Christian does not mean that their actions are godly.<br /><br />Does that help?[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23181,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-30T00:24:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />That's a very good question, but it's also unanswerable. The only thing we truly know about this man is that he was a Levite, which means that he's in a line of priests, and probably one himself.<br /><br />However, we don't know his character. But, we do know something about the character of another Levite from the same time period in Judges 17. That man was willing to, basically, get paid to preach good things to the man who hired him (not unlike some people who become pastors, but only preach about nice things to avoid offending the people of their congregation who put the most in the offering plate).<br /><br />To sum up... just because someone calls themselves a Jew or a Christian does not mean that their actions are godly.<br /><br />Does that help?<br />[hr][/quote]<br /><br />Well, I could of told you people who call themselves Christians aren't perfect.<br /><br />But it still begs the question of why God (Or who he infuenced) not belittle his hanus actions?  If the act was irreconsilable, then why did not God state that this act was so horrible.  There should of been something... To pay tribute to this poor woman who was abused by society, by everyone who was supposed to protect her, even by her host.<br /><br />Is your religion so focussed on sin that it cannot feel empathy any more?  Can you not feel for other human beings?  You may claim to feel empathy, but your precious Bible could not clearer that it does not share that empathy.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23182,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-30T00:40:07.000Z",
		"content": "Oh I dunno, the number of passages mentioning empathy outweighs that example.<br /><br />I would also counter that people in general are scum, and wether or not they are christian, they can still call themselves that, who can prove them wrong? Jesus said that to hurt a child was akin to hurting him, yet we have pedophile priests and a church that aided them. How can these people love God and do what they do?<br /><br />Also, people focus too much on sin; they cower in churches lest the devil take them, cringing away from tv, drink and swaering lest they be punnished. God gave us the 10 commandments, and they cover pretty much anything. Christianity should be a religion based on freedom not restraint. I can swaer [just not Gods name] drink and gamble, so long as those things don't interfere with my life or relationship with God or harm others. In a simalar vein I can take drugs, eat what I want and spam this forum [as long as nobody minds, I wonder if I can spam atheists?]<br /><br />Quite frankly I don't see why God has to keep telling us like little children to behave. There is a nice story I like about a man who dies and goes to hell, once there he begs those in heaven to come down and temporarily relive his suffering. He is refused, but askes them to tell his sons they're being wicked. They refuse saying that they have prophets on earth to tell them and they have ingnored them.<br /><br />Quite frankly I think God has a more liberal view of getting into heaven then most of us. I am of the unshakeable belief that only someone who really hates God and others would be refused entry.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23183,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-30T03:06:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Oh I dunno, the number of passages mentioning empathy outweighs that example.<br />[hr][/quote]<br /><br />Verse numbers please...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23184,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-30T04:50:41.000Z",
		"content": "LevelLord might have been referring to Mark 9:37 with the comment about children... I seem to remember a closer verse to what she said, but can't recall it.<br /><br />For verses on God's empathy and understanding, if John 3:16 doesn't work for you (and that one is huge by itself for what God did to remedy the sins of the world, past, present, and future), here's some: Ex 3:7, Dt 7:8, 2Ch 36:15, Jer 31:3, Hos 11:1-4, Eph 2:4-5, 1Pe 5:7...<br /><br />However, I won't argue with you that there is almost always no personal statement from God in the Bible when one of these things happen, something that I find frustrating as well, but I can see enough evidence and personal experience that God loves us that it isn't enough to shake my faith in him.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23185,
		"title": "Re: Christianity",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-30T06:45:30.000Z",
		"content": "Hey... if everybody were perfect, then there would be no need for a church!!!<br /><br />Even I mess up too!!!<br /><br />*Clubs down LoGo*<br /><br />[quote]<b><i>Quote:</i></b>[hr]*Sigh* if only you weren't married... [hr][/quote]<br /><br />He isn't... yet... i don't thinkProud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23186,
		"title": "Re: Christianity",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-30T09:26:24.000Z",
		"content": "\"You may claim to feel empathy, but your precious Bible could not clearer that it does not share that empathy.\"<br /><br />Jesus, anyone? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />\"There is a saying, 'Love your friends and hate your enemies.' But I say: Love your enemies! Pray for those who persecute you! In that way you will be acting as true sons of your Father in heaven. For he gives his sunlight to both the evil and the good, and sends rain on the just and on the unjust too. If you love only those who love you, what good is that? Even scoundrels do that much. If you are friendly only to your friends, how are you different from anyone else? Even the heathen do that. But you are to be perfect, even as your Father in heaven is perfect.\"<b>Eat your veggies!</b>"
	},
	{
		"id": 23187,
		"title": "Re: Christianity",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-30T17:45:51.000Z",
		"content": "Yes, definitely Jesus... I didn't bring him up specifically because that starts to raise the question of the Trinity, and whether or not Jesus was God.<br /><br />God the Father's focus for his compassion and love is generally on a more national level in the Bible. Jesus focus was on a much more personal level (which seemed to be the plan all along).[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23188,
		"title": "Re: Christianity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-31T01:47:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />\"There is a saying, 'Love your friends and hate your enemies.' But I say: Love your enemies! Pray for those who persecute you!\"<br />[hr][/quote]<br /><br />Let's analize that real quick:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Matthew 24:51<br />He will cut him to pieces and assign him a place with the hypocrites. In that place there will be weeping and gnashing of teeth.<br />[hr][/quote]<br /><br />Yes, very empathic.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23189,
		"title": "Re: Christianity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-31T03:52:01.000Z",
		"content": "Now who was being cut up again? I forget.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23190,
		"title": "Re: Christianity",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-31T05:26:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />But it still begs the question of why God (Or who he infuenced) not belittle his hanus actions? If the act was irreconsilable, then why did not God state that this act was so horrible. There should of been something...[hr][/quote]<br />Why wouldn't He \"belittle\" those actions or \"state that this act was so horrible\"?  Maybe because. . . He didn't want to!  Wow!  Why should <i>anyone</i> question what God chooses to do (or not do, in this case)?  Sure, we can question all we like why He does or doesn't act the way <i>we</i> sinners (remember, \"The heart is deceitful above all things, and desperately wicked\" [Jerimiah 17:9]) think He should, but to me it seems rather pointless to do that.  As mentioned earlier, God states clearly--<br />[quote]<b><i>Quote:</i></b>[hr]Isaiah 55:8-9<br /><b>For my thoughts are not your thoughts, neither are your ways my ways, saith the LORD.</b>  For as the heavens are higher than the earth, <b>so are my ways higher than your ways, and my thoughts than your thoughts.</b>[hr][/quote]<br />Obviously God's ways are too high for us to comprehend, let alone question. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>LevelLord00:</i><br />Now who was being cut up again? I forget.[hr][/quote]<br />Yes, who was that?<br />[quote]<b><i>Quote:</i></b>[hr]Matthew 24:48<br />\"But and if that <b>evil servant</b> shall say in his heart, My lord delayeth his coming;. . .[hr][/quote]<br />The evil servant will be punished -- as will all those whom God has not chosen to save; no surprise there. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 23191,
		"title": "Re: Christianity",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-31T06:11:40.000Z",
		"content": "And thus brings up the discussion; Does Hell exist.Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23192,
		"title": "Hell...",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-10-31T17:15:48.000Z",
		"content": "I'd like to get into the discussion of hell - mostly because it's one of the most misunderstood things in the Bible - but before we do, there are some things that LordOfGlobox mentioned right at the beginning (slavery being one of them), and I don't want to forget about those.<br /><br />It looks like this topic is done, but LordOfGlobox didn't make any comments on the verses that I brought up, so I'm not sure... I'll move on if LordOfGlobox gives the go-ahead."
	},
	{
		"id": 23193,
		"title": "Re: Hell...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-01T03:10:36.000Z",
		"content": "I give entire consent; although I do not, again, see the relivence.<br /><br />NOTE: I see no point in responding to the last 5 or so posts because they all assuming everything in the Bible is gospel truth.  Ergo, they are equally capable of being flawed as they are of not, and based solely on opinion.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23194,
		"title": "Re: Hell...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-01T10:25:25.000Z",
		"content": "Yes, however, the possibility of flaws is no reason for ignoring; our model of the universe is already known to be flawed, and the possibility of further flaws is almost definite, yet we do not ignore it, indeed, we argue its points and counterpoints with all the more vigour.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23195,
		"title": "....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-02T03:37:32.000Z",
		"content": "Fine then, I'm simply to lazy to respond to them"
	},
	{
		"id": 23196,
		"title": "Re: ....",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-02T17:21:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I see no point in responding to the last 5 or so posts because they all assuming everything in the Bible is gospel truth. Ergo, they are equally capable of being flawed as they are of not, and based solely on opinion.[hr][/quote]<br /><br />Then why did you ask for verses in the first place?<br /><br />I'll tell you right now, it's absolutely impossible to PROVE that the Bible is the word of God. The most anyone can do is to give evidence that what is in our Bible is remarkably unchanged from the source material, but even if we could scientifically prove that what we're reading is exactly translated from the original hand that wrote it, it still wouldn't prove that it's the word of God.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23197,
		"title": "Re: ....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-03T02:15:03.000Z",
		"content": "I thought you were going to go into a \"Is hell real\" spin off?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23198,
		"title": "Re: ....",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-03T07:24:05.000Z",
		"content": "Without talking about the credibility of the Bible, there's not much that would likely change anything if I did go into that.<br /><br />What I will say is that people's conception of hell is that it's the place where God sentences you to go, like a burning jail cell, where you are tortured by demons and Satan's laughing at you.<br /><br />That is not hell. Hell is simply a place where one can exist for eternity without ever having to deal with God. <br /><br />The reason why God sends anyone to hell in the first place is actually love-based. If God snuffed out unbelievers entirely so that they didn't exist anymore, THEN that would be an act of hate. But God loves everyone, so rather than destroy them, he lets them what they wanted all their lives on earth... a life without Him.<br /><br />You will not be tortured by demons there. Hell was designed for Satan and his forces. The ones who will be most tortured there will be them. The only torturing humans would recieve there is life without God, which, when they realize just what that's like, is enough to cause \"weeping and gnashing of teeth\".<br /><br />So why's hell always talked about as firy? Well, in the end of the Bible, hell is thrown into a lake of fire, but I haven't yet seen anything that says that fire will hurt you there (I might be wrong about that one though).<br /><br />Anyways, yeah. That's hell. If you want to read more about this and other conversations of the same nature, I recommend \"The Case for Faith\" by Lee Strobel. He talks about himself a little too often in the book, but it's a great read. [url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23199,
		"title": "Re: ....",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-03T12:09:32.000Z",
		"content": "Huzzah! Yet more sense!<br /><br />If you ever need an unbeliever 'disposed of' then I'm your girl Ilsoap! Anything for someone with such a great belief!A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23200,
		"title": "Re: ....",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-03T15:20:43.000Z",
		"content": "Yeah, that sounds reasonable. But what if someone wants to go there and later realizes he/she wants to get to heaven instead. Is it possible? I would think it is, can't see a reason why God wouldn't take a regretting soul back to His palace.<b>Eat your veggies!</b>"
	},
	{
		"id": 23201,
		"title": "Re: ....",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-03T22:13:38.000Z",
		"content": "Hell thrown in the lake of fire? I'd say the devil and his following:<br />[quote]<b><i>Quote:</i></b>[hr]Revelations 20:10 And the devil who deceived them was thrown into the lake of fire and sulfur, where the beast and the false prophet are too, and they will be tormented there day and night forever and ever.[hr][/quote]<br /><br />And not only only the devil but also all the sinners, and I don't that anyone who has been thrown in a lake of fire ever comes out.<br />[quote]<b><i>Quote:</i></b>[hr]20:11 Then I saw a large white throne and the one who was seated on it; the earth and the heaven fled from his presence, and no place was found for them. 20:12 And I saw the dead, the great and the small, standing before the throne. Then books were opened, and another book was opened  the book of life. So the dead were judged by what was written in the books, according to their deeds. 20:13 The sea gave up the dead that were in it, and Death and Hades gave up the dead that were in them, and each one was judged according to his deeds. 20:14 Then Death and Hades were thrown into the lake of fire. This is the second death  the lake of fire. <b>20:15 If anyones name was not found written in the book of life, that person was thrown into the lake of fire.</b>[hr][/quote]<br />No thanks for clearing this up. Take a last look on your unbelieving grandparents because you will never see them back in the afterlife.<br />Burn we shall![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img]   -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23202,
		"title": "Re: ....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-03T22:55:28.000Z",
		"content": "My point exactly; also that's not including the story about the sinning man who asked an angel for a \"drop of water\" and to warn his brothers of his sins.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23203,
		"title": "Re: ....",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-04T01:31:46.000Z",
		"content": "What about it? They had messengers on earth, why should they need an angel?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Yeah, that sounds reasonable. But what if someone wants to go there and later realizes he/she wants to get to heaven instead. Is it possible? I would think it is, can't see a reason why God wouldn't take a regretting soul back to His palace.[hr][/quote] <br /><br />Now that is a question of many interesting philosophical points. There used to be a great comic strip about hell that went into all of this, but it  went offline in 2003. It was called 'Repentance' but I haven't been able to find a trace of it since. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]Take a last look on your unbelieving grandparents because you will never see them back in the afterlife.[hr][/quote]<br /><br />Well, if thats what you believe, meh.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Burn we shall![hr][/quote]<br /><br />I just love talking to you two, you have such a positive and enlightening outlook. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-goth.gif[/img] A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23204,
		"title": "Re: Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-04T07:08:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Ilsoap:</i><br />Hell is simply a place where one can exist for eternity without ever having to deal with God.[hr][/quote]<br />Hmm. . .  Again, let's see what the Bible says. . . [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]<br />Matthew 10:28  \"And fear not them which kill the body, but are not able to kill the soul: <b>but rather fear Him which is able to destroy both soul and body in hell.</b>\"<br /><br />Maybe a bit more clear as to the torment. . .<br /><br />Mark 9:43-44  \"And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, <b>into the fire that never shall be quenched:  Where their worm dieth not, and the fire is not quenched.</b> [hr][/quote]<br />I would like to see where the Bible teaches that hell is just \"a place where one can exist for eternity without ever having to deal with God.\"  If it were like that and you could repent, there wouldn't be much to worry about.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Ilsoap:</i><br />The reason why God sends anyone to hell in the first place is actually love-based.[hr][/quote]<br />Or you could call it a lack of love, i.e. hate.  Example:<br />[quote]<b><i>Quote:</i></b>[hr]<br />Psalm 11:5  \"The LORD trieth the righteous: but the wicked and him that loveth violence <b>His soul hateth.</b>\"[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]<i>Ilsoap:</i><br />If God snuffed out unbelievers entirely so that they didn't exist anymore, THEN that would be an act of hate.[hr][/quote]<br />Maybe, and maybe not; after all, does the Bible say that?<br />[quote]<b><i>Quote:</i></b>[hr]<i>Ilsoap:</i><br />But God loves everyone, so rather than destroy them, he lets them what they wanted all their lives on earth... a life without Him.[hr][/quote]<br />Though John 3:16 <i>does</i> say God loved \"the world,\" it does not necessarily mean the entire earthly population.  Perhaps God means, He loved the whole world of His elect, those whom He has chosen \"before the foundation of the world.\" (Ephesians 1:4)  No, God does not love everyone."
	},
	{
		"id": 23205,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-04T09:45:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, if thats what you believe, meh.[hr][/quote]<br />Well doesn't the bible say so?<br />Maybe you should stand up more for what's written in it. After all it your believe, not mine.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23206,
		"title": "Re: Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-04T12:01:34.000Z",
		"content": "Why? Its not like anything I'll ever say will convince you, and I mean it. I really doubt there is any arrangement of words on the planet I could type that would shift your belief one iota.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]No, God does not love everyone.[hr][/quote] <br /><br />Then why would he attempt to save everyone? Quite frankly if I hated someone I wouldn't give them a chance to spend eternity with me.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23207,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-04T13:07:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Why? Its not like anything I'll ever say will convince you, and I mean it. I really doubt there is any arrangement of words on the planet I could type that would shift your belief one iota.[hr][/quote]<br />No I mean that there are certain things in bible that are very clearly mentioned but don't believe. So what's you religion.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Then why would he attempt to save everyone? Quite frankly if I hated someone I wouldn't give them a chance to spend eternity with me.[hr][/quote]<br />Does he? I think only Jesus tried to do so.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23208,
		"title": "Re: Strange. . .",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-04T14:21:43.000Z",
		"content": "Jesus was sent to world by God in attempt to save everyone..<br />Jesus is God as human. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />Besides, only few interpret the Bible fundamentally..<b>Eat your veggies!</b>"
	},
	{
		"id": 23209,
		"title": "Re: Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-04T15:50:27.000Z",
		"content": "The bible forbids premarital sex; therefore, if you don't marry the girl, there is no premarital and anything goes!<br /><br />Ah literalisim!A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23210,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-04T16:23:06.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Jesus is God as human. [hr][/quote]<br />Have you ever read the bible smart guy?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23211,
		"title": "Re: Strange. . .",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-04T16:57:27.000Z",
		"content": "Yes, but most probably not as much as you have.<br /><br />I'll just quote the Wikipedia entry to tell what I meant, believe, and have been taught:<br />\"Generally speaking, most Christians believe that Jesus is the Son of God, part of a trinity of three persons of God, and the Messiah, who came to earth to save mankind from sin and death through the crucifixion, and then rose from the dead three days later and ascended to Heaven.\"<br /><br />Well, maybe my saying \"Jesus is God as human.\" should've been said a bit more carefully. I know it's not exactly that, but I can't explain Trinity, much less I understand it..<b>Eat your veggies!</b>"
	},
	{
		"id": 23212,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-04T17:13:34.000Z",
		"content": "It's hard to find someone who really does understand that. But because the three are seperated in a lot ways (when Jesus was baptized God spoke to him from heaven) and they even differ in opinons (Jesus asked God not to be crucified) I don't my opinion is that strange. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23213,
		"title": "Re: Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-04T20:52:00.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />The bible forbids premarital sex; therefore, if you don't marry the girl, there is no premarital and anything goes!<br /><br />Ah literalisim! <br />[hr][/quote]<br /><br />Indeed.  Which is why I wasn't a fundamentalist during the waning days of my faith.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23214,
		"title": "Re: Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-04T23:44:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Then why would he attempt to save everyone?[hr][/quote]<br />Why is it so great that God is doing this \"saving\"? If I told you to worship me or I'll lock you in my basement I wouldn't be offering to save you from being locked in a basement. I'd be threatening you. Why is it different when God is doing the threatening?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23215,
		"title": "Re: Strange. . .",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-05T11:10:54.000Z",
		"content": "I don't know.<br /><br />My view:<br />1. God is the ultimate good. God has always been there, raw Nothing has never been the state of Everything.<br />2. God is the ultimate good.<br />3. Life is a gift, and along with that you get a free will. You can either do what is right and follow God, or do something else and do wrong.<br />4. God would like everyone to do the right thing. But because we have free will we can do otherwise. Thus, he \"sent\" Jesus to guide us to the light.<br /><br />Anyways, it's no use of thinking these things..<b>Eat your veggies!</b>"
	},
	{
		"id": 23216,
		"title": "Re: Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-05T14:17:53.000Z",
		"content": "Me likey KeenRush!<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]I don't my opinion is that strange.[hr][/quote]<br /><br />I've wondered about this too as we are told Jesus is the 'son' of God rather than God himself. [Oooh, try and guess my specific faith!]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Indeed. Which is why I wasn't a fundamentalist during the waning days of my faith.[hr][/quote] <br /><br />Its hard to imagine a waning fundamentalist. {ZOMG! He was christian! We must get him back! Quick, bibles and holy water, where does he live?]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Why is it so great that God is doing this \"saving\"?[hr][/quote]<br /><br />Its better then wiping the whole lot out and starting again, which, I suspect is what most of us would do.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23217,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-05T17:51:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]3. Life is a gift, and along with that you get a free will. You can either do what is right and follow God, or do something else and do wrong.[hr][/quote]<br />But is that freewill really a gift if it can only bring you in temptation to do wrong so basically the reason that there is pain and suffering in the world. And is that so honest from God? There is no human that doesn't offend the rules written in the bible, and therefore everyone sins. Apparently nobody can not prevent their selves from doing so. And yet according to the bible we are guilty.<br /><br />[quote]<b><i>Quote:</i></b>[hr]4. God would like everyone to do the right thing. But because we have free will we can do otherwise. Thus, he \"sent\" Jesus to guide us to the light[hr][/quote]<br />True, but because God has set the standard for what's right and wrong that's basically just doing what wants.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Its better then wiping the whole lot out and starting again, which, I suspect is what most of us would do.[hr][/quote]<br />I wouldn't blame him for that but I do blame him for leaving this earth suffer with a vague promise of a better world. Like Lemur said, what choices do we really have? <br />-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23218,
		"title": "Re: Ok..",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-05T18:26:52.000Z",
		"content": "I (and LL, and most probably many many many other people) believe God is the ultimate good. He hasn't necessarily set any standards by Himself, He just is the good.<br />We believe life is a gift, and so is the free will. We can't understand almost anything, but neither can non-believers. But either the way, it's all great. It just is that way, and that's good for us.<br /><br />It's impossible to make non-believer see any sense in it or agree with it. I hope I won't reply anymore in this topic, but knowing me I still post something, but I hope not. Since it has no point. This subject is not taboo, not at all, but it's something nobody can understand, that's why I hope I won't talk about it anymore.<br /><br />And who knows, what if things are more complicated than the Bible tells? What if God Himself doesn't know everything and is as confused as we are (although I of course don't believe so)?<br /><br />Either the way, this thread along with the other ones that have dwelved deep inside meta-stuff, have made me think through things throughtfully, in some cases differently, and I've found calmness and peace. Thank you everyone, and I wish all of you can find the acceptance of reality.<b>Eat your veggies!</b>"
	},
	{
		"id": 23219,
		"title": "Re: Ok..",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-06T01:49:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />I (and LL, and most probably many many many other people) believe God is the ultimate good. He hasn't necessarily set any standards by Himself, He just is the good.<br />We believe life is a gift, and so is the free will. We can't understand almost anything, but neither can non-believers. But either the way, it's all great. It just is that way, and that's good for us.<br />[hr][/quote]<br /><br />If God created everything, how could he of not created good and evil?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />It's impossible to make non-believer see any sense in it or agree with it. I hope I won't reply anymore in this topic, but knowing me I still post something, but I hope not. Since it has no point. This subject is not taboo, not at all, but it's something nobody can understand, that's why I hope I won't talk about it anymore.<br />[hr][/quote]<br /><br />So basically we are all to dumb to figure anything out, so we should stop?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />And who knows, what if things are more complicated than the Bible tells? What if God Himself doesn't know everything and is as confused as we are (although I of course don't believe so)?<br />[hr][/quote]<br /><br />If he did indeed create the universe, he should know exactly what's going on.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Either the way, this thread along with the other ones that have dwelved deep inside meta-stuff, have made me think through things throughtfully, in some cases differently, and I've found calmness and peace. Thank you everyone, and I wish all of you can find the acceptance of reality. <br />[hr][/quote]<br /><br />\"acceptance of reality\"?  Who's reality is that?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23220,
		"title": "Re: Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-06T05:53:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LevelLord:</i><br />Then why would he attempt to save everyone? Quite frankly if I hated someone I wouldn't give them a chance to spend eternity with me.[hr][/quote]<br />That's just it:  He did/does not \"attempt\" to save everyone.  Everyone does not have a chance to go to heaven:  God chose long ago (as I pointed out in my last post) who He would save.<br />[quote]<b><i>Quote:</i></b>[hr]Proverbs 16:4  The LORD hath made all things for Himself: <b>yea, even the wicked for the day of evil.</b><br /><br />Evidently, some people --probably most-- were made just to be destroyed.  We may say, \"But that's terribly unjust of God not to give everyone a chance!\"  However, as I have already shown from the Bible, our finite minds are nothing to be compared to <i>in</i>finite God:<br /><br />Isaiah 55:9  For as the heavens are higher than the earth, <b>so are my ways higher than your ways, and my thoughts than your thoughts.</b>[hr][/quote]Thus, it is no wonder that people do not understand God or His Word.  This lack of understanding is no good reason to say He is unjust, however.  For. . .<br />[quote]<b><i>Quote:</i></b>[hr]Romans 9:21  Hath not the potter power over the clay, of the same lump to make one vessel unto honour, and another unto dishonour? [hr][/quote]<br />Does God have a right to do as He pleases with what He makes?  Yes, He <i>definitely</i> does.<br /><br />Now then. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />Why is it so great that God is doing this \"saving\"? If I told you to worship me or I'll lock you in my basement I wouldn't be offering to save you from being locked in a basement. I'd be threatening you. Why is it different when God is doing the threatening?[hr][/quote]<br />Looks like another misunderstanding. . .  It isn't threatening.<br />[quote]<b><i>Quote:</i></b>[hr]<br />Romans 3:23  For all have sinned, and come short of the glory of God;<br /><br />The punishment that all sinners deserve is the wrath of God, or eternal punishment for their wickedness before God:<br /><br />Romans 1:18  For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness;[hr][/quote]<br />So you see, God is not threatening sinners.  He is telling them what they deserve -- what their punishment will be if they do not repent from their naturally evil ways.  Since He is the only One who can cause someone to truely repent, it is all up to Him.  Humans have <i>nothing</i> whatsoever to do with salvation:  it is all up to God.<br />[quote]<b><i>Quote:</i></b>[hr]Romans 9:18  Therefore hath He mercy on whom He will have mercy, and whom He will He hardeneth.[hr][/quote]<br />The only hope for people is to seek God -- the only true God.  At least, this is what I understand the Bible to teach. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]Isaiah 55:6  Seek ye the LORD while he may be found, call ye upon him while he is near:<br /><br />Amos 5:6 (not the whole verse)  Seek the LORD, and ye shall live;. . .<br />Amos 5:8  Seek Him that maketh the seven stars and Orion, and turneth the shadow of death into the morning, and maketh the day dark with night: that calleth for the waters of the sea, and poureth them out upon the face of the earth: The LORD is his name:[hr][/quote]"
	},
	{
		"id": 23221,
		"title": "Re: Strange. . .",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-06T15:08:47.000Z",
		"content": "I was at church yesterday and heard a gospel that disturbed me a bit:<br /><br />[quote]<b><i>Quote:</i></b>[hr]Matthew 25: 1 \"Then the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom. <br />2 Five of them were foolish and five were wise. <br />3 The foolish ones, when taking their lamps, brought no oil with them, <br />4 but the wise brought flasks of oil with their lamps. <br />5 Since the bridegroom was long delayed, they all became drowsy and fell asleep. <br />6 At midnight, there was a cry, 'Behold, the bridegroom! Come out to meet him!' <br />7 Then all those virgins got up and trimmed their lamps. <br />8 The foolish ones said to the wise, 'Give us some of your oil, for our lamps are going out.' <br />9 But the wise ones replied, 'No, for there may not be enough for us and you. Go instead to the merchants and buy some for yourselves.' <br />10 While they went off to buy it, the bridegroom came and those who were ready went into the wedding feast with him. Then the door was locked. <br />11 Afterwards the other virgins came and said, 'Lord, Lord, open the door for us!' <br />12 But he said in reply, 'Amen, I say to you, I do not know you.'[hr][/quote] <br /><br />This gives me the impression that if you die at the wrong time (when your faith has not been tended to or you've committed a bad sin) then you're screwed, God doesn't give you a second chance contrary to all of the forgiveness.<br /><br />Also, Hell is described not really as a place simply lacking God.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Matthew 25: 41 Then he will say to those on his left, 'Depart from me, you accursed, into the <b>eternal fire prepared for the devil and his angels</b>. <br />42 For I was hungry and you gave me no food, I was thirsty and you gave me no drink, <br />43 a stranger and you gave me no welcome, naked and you gave me no clothing, ill and in prison, and you did not care for me.' <br />44 Then they will answer and say, 'Lord, when did we see you hungry or thirsty or a stranger or naked or ill or in prison, and not minister to your needs?' <br />45 He will answer them, 'Amen, I say to you, what you did not do for one of these least ones, you did not do for me.' <br />46 And these will go off to <b>eternal punishment</b>, but the righteous to eternal life.[hr][/quote]<br /><br />These questions are more or less designed to beg the question, should we take the Bible so literally?  There's a lot of good stuff in it, but I think there's also a lot of stuff that we'd be better off ignoring.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23222,
		"title": "Re: Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-06T15:29:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />This gives me the impression that if you die at the wrong time (when your faith has not been tended to or you've committed a bad sin) then you're screwed, God doesn't give you a second chance contrary to all of the forgiveness.<br />[hr][/quote]<br /><br />I am not so sure that is what it meant...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23223,
		"title": "Re: Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-06T19:50:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]So you see, God is not threatening sinners. He is telling them what they deserve -- what their punishment will be if they do not repent from their naturally evil ways.[hr][/quote]<br />You're missing my point. God doesn't <i>have</i> to punish anyone. If he wanted to he could leave well enough alone, and not send anyone to Hell. But he doesn't, he instead tells people to jump through hoops, or he'll damn them forever. Why would one want to do that? Does God just have some sort of anger management problem? Where does the idea that anything God doesn't like must be punished come from? It's God's choice, and evidently God chooses to only \"save\" the select few who grovel to him. But it's not really saving if you \"save\" them from yourself.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23224,
		"title": "Re: Strange. . .",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-06T22:38:43.000Z",
		"content": "Well the priest went on to talk during the sermon about how faith should be well tended to your whole life because you never know when death will come.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23225,
		"title": "Re: Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-07T04:48:47.000Z",
		"content": "Yes; after all, you're a different person during your life, you may like Keen now but later on think its the crappiest game ever. Shock may return in 5 years as a top modder and model forum member. <br /><br />Xtra: I'm dying! Quick fetch a priest!<br /><br />LL: You want to convert?<br /><br />Xtra: Yes, oh God yes!<br /><br />LL: But... why? You've always hated christians!<br /><br />Xtra: Yes, but now I'm dying, better one of those preachy bastards go than one of us atheists.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23226,
		"title": "Re: Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-07T06:01:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />You're missing my point. God doesn't have to punish anyone.[hr][/quote]<br />Yeah, if everyone thought up what God is like, He would, of course, do just like they (each person) wanted because it would be right according to <i>them</i>.  But the God of the Bible is different (as I have already pointed out)<br />[quote]<b><i>Quote:</i></b>[hr]Genesis 2:17  But of the tree of the knowledge of good and evil, thou shalt not eat of it: <b>for in the day that thou eatest thereof thou shalt surely die.</b>[hr][/quote]<br />Adam clearly knew what he was not supposed to do and what his punishment would be if he did it.<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />If he wanted to he could leave well enough alone, and not send anyone to Hell.[hr][/quote]<br />But since God has already stated what the wages of sin will be, He <i>is</i> going to follow through.  For. . .<br />[quote]<b><i>Quote:</i></b>[hr]Numbers 23:19  <b>God is not a man, that He should lie;</b> neither the son of man, that He should repent: hath He said, and shall He not do it? or hath He spoken, and shall He not make it good?[hr][/quote]<br />In other words, the people whom God has not saved (the non-elect) will be given their rightly-deserved reward:  everlasting destruction.<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />But he doesn't, he instead tells people to jump through hoops, or he'll damn them forever.[hr][/quote]<br />Not quite. . .<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />Why would one want to do that?[hr][/quote]<br />Why would anyone want to obey God and do as He commands?  Except for God's chosen (those whose eyes He as opened and whose ears can hear), not a single person wishes to do what is good.<br />[quote]<b><i>Quote:</i></b>[hr]Romans 3:12  They are <b>all</b> gone out of the way, they are together become unprofitable; <b>there is none that doeth good, no, not one.</b>[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />Where does the idea that anything God doesn't like must be punished come from?[hr][/quote]<br />Well, if His creation turns from Him and acts contrary to His righteous commands, I guess He as every right to give them their deserts.  After all, that <i>is</i> how He set it up. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />It's God's choice, and evidently God chooses to only \"save\" the select few who grovel to him.[hr][/quote]<br />Actually, as I pointed out above, God already knew who He would save and who He would not save before the world began.  It is not up to anyone whether or not they are going to Heaven, so it does not matter how much you \"grovel to Him\"; His chosen people will live with Him, and the unrighteous will be damned.<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />But it's not really saving if you \"save\" them from yourself.[hr][/quote]<br />But you see, God does not save people from Himself.  He saves them from their sins.<br />[quote]<b><i>Quote:</i></b>[hr]Romans 8:21  Because the creature itself also shall be <b>delivered from the bondage of corruption into the glorious liberty of the children of God.</b>[hr][/quote]<br />Basically, Christ's people are saved from their sins which -- by the fact that they are sins -- <i>must</i> be paid for..."
	},
	{
		"id": 23227,
		"title": "Re: Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-07T12:51:32.000Z",
		"content": "I now love Gmixer, KeenRush and Ilsoap. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23228,
		"title": "Re: Strange. . .",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-11-07T20:59:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Lemur821:<br />Why is it so great that God is doing this \"saving\"? If I told you to worship me or I'll lock you in my basement I wouldn't be offering to save you from being locked in a basement. I'd be threatening you. Why is it different when God is doing the threatening?[hr][/quote]<br />It is not quite like that. Take another look at the verse GMixer quoted earler:<br />[quote]<b><i>Quote:</i></b>[hr]Isaiah 55:9 For as the heavens are higher than the earth, so are my ways higher than your ways, and my thoughts than your thoughts.[hr][/quote]<br />There is more to this statement than \"I'm smarter than you so you wouldn't understand my thoughts and don't bother.\" God is also saying that He is a superior being. A better analogy might be between a person and a pet dog. (In the analogy, God is equivalent to the person and you are equivalent to the pet.) The person would set rules such as \"Don't bite the other dogs, or I will lock you in a pen alone.\" It is not what you would consider a \"threat\", instead it is a rule with consequences for breaking it.<br /><br />Now lets suppose this rule was a full analogy to the Bible. If that were so, there would be another rule like this: \"I am the supreme being. If you decide to believe that I am who I claim to be, and you decide to accept that I've made {these sacrifices} for your sake (and for the sake of all others), and you ask me to be with you and help you make an honest attempt to do everything I ask, then it doesn't matter how many dogs you've bitten in your entire life, you get to stay in the house with me.\""
	},
	{
		"id": 23229,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-08T09:24:42.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I now love <b>Gmixer</b>, KeenRush and Ilsoap. [hr][/quote]<br />Why? He has almost the same opinion as I do with only real difference that I hate God for what he is.<br />But you call me a fundamentalistic and love him?<br />And no I don't say this of self regret but I find this hypocrite.<br /><br />[quote]<b><i>Quote:</i></b>[hr]But you see, God does not save people from Himself. He saves them from their sins.[hr][/quote]<br />God let people sin. Or is there anyone who doesn't. Apparently it's not possible to doesn't because it is in our charcter. So why does God let himself and us suffer from our own sins? He could end it all today. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23230,
		"title": "Re: Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-08T20:37:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />In other words, the people whom God has not saved (the non-elect) will be given their rightly-deserved reward: everlasting destruction.<br />[hr][/quote]<br />Oh the irony of that last statement.  A religion talking of peace and love simotaniously saying that if you do not obey God, he will smite you.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />But he doesn't, he instead tells people to jump through hoops, or he'll damn them forever.<br />--------------------------------------------------------------------------------<br /><br />Not quite. . .<br />[hr][/quote]<br /><br />Yes quite.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />Why would one want to do that?<br />--------------------------------------------------------------------------------<br />Why would anyone want to obey God and do as He commands? Except for God's chosen (those whose eyes He as opened and whose ears can hear), not a single person wishes to do what is good.<br />[hr][/quote]<br />Really?  I seem to remember plenty of non-Christians doing great things out of the goodness of their hearts... (Oh wait, I'm sorry, I forgot: non-Christians do not have hearts!)<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />Where does the idea that anything God doesn't like must be punished come from?<br />--------------------------------------------------------------------------------<br />Well, if His creation turns from Him and acts contrary to His righteous commands, I guess He as every right to give them their deserts. After all, that is how He set it up.  <br />[hr][/quote]<br /><br />So when my computer program does not work correctly I must banish it to the lake of fire?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />It's God's choice, and evidently God chooses to only \"save\" the select few who grovel to him.<br />--------------------------------------------------------------------------------<br />Actually, as I pointed out above, God already knew who He would save and who He would not save before the world began. It is not up to anyone whether or not they are going to Heaven, so it does not matter how much you \"grovel to Him\"; His chosen people will live with Him, and the unrighteous will be damned.<br />[hr][/quote]<br /><br />Excellent: In your opinion, God created people who could not save themselves.  That is like me putting a toddler with no legs into a swimming pool.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />But it's not really saving if you \"save\" them from yourself.<br />--------------------------------------------------------------------------------<br />But you see, God does not save people from Himself. He saves them from their sins.<br />[hr][/quote]<br /><br />Which \"He\" instilled into us.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Romans 8:21 Because the creature itself also shall be delivered from the bondage of corruption into the glorious liberty of the children of God.<br />--------------------------------------------------------------------------------<br />Basically, Christ's people are saved from their sins which -- by the fact that they are sins -- must be paid for...<br />[hr][/quote] <br /><br />You truly are a repetitive person, are not you?<br /><br />I said to my Christian friend: \"I would rather go to hell and continue beleiving what I know in my heart to be correct, then to conform myself to a religion which preaches love and then does hateful, self-motivated, careless, thoughtless, and forceful\"<br /><br />And if my soul is to burn in hell for doing what is right, then there is no better place for it.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23231,
		"title": "Re: Strange. . .",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-08T21:34:56.000Z",
		"content": "You'd probably have to cut off the arms too.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23232,
		"title": "Re: Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-09T01:45:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]me: Why would one want to do that?<br />you: Why would anyone want to obey God and do as He commands?[hr][/quote]<br />No, why would one (God) want to punish people (us)? God doesn't lose anything but the satisfaction of revenge by not doling out punishments. How many (good) parents enjoy punishing their children? How many pet owners enjoy punishing their pets? People wouldn't punish the ones they love if they didn't know that they have to teach their charges to fit into society. But God doesn't have to do that. An omnipotent god could easily stop people from harming others (in heaven, specifically), so there's no reason not to let everyone in other than a desire to punish what you (God) don't like.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23233,
		"title": "Re: Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-09T06:09:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Djaser:</i><br />So why does God let himself and us suffer from our own sins? He could end it all today.[hr][/quote]<br />Well, I really don't know why.  The closest I can think of (right now) that the Bible speaks of something kind of like this (it seems) is in Revelation. . .<br />[quote]<b><i>Quote:</i></b>[hr]Revelation 6:10-11  And they cried with a loud voice, saying, How long, O Lord, holy and true, dost thou not judge and avenge our blood on them that dwell on the earth?  And white robes were given unto every one of them; and it was said unto them, that they should rest yet for a little season, until their fellowservants also and their brethren, that should be killed as they were, should be fulfilled.[hr][/quote]<br />I really do not know, though. . .<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />Oh the irony of that last statement. A religion talking of peace and love simotaniously saying that if you do not obey God, he will smite you.[hr][/quote]<br />What's wrong with that?<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />Yes quite.[hr][/quote]<br />The reason I said, \"Not quite\" was because jumping through hoops sounds like something that is pointless, maybe a challenge but nothing more.<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />Really? I seem to remember plenty of non-Christians doing great things out of the goodness of their hearts... (Oh wait, I'm sorry, I forgot: non-Christians do not have hearts!)[hr][/quote]<br />Hmm. . .  And how do you know they had any \"goodness\" in their hearts?  Your definition of \"good\" is probably different than God's.  For,<br />[quote]<b><i>Quote:</i></b>[hr]Jeremiah 17:9  The heart is deceitful above all things, and desperately wicked: who can know it?[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />So when my computer program does not work correctly I must banish it to the lake of fire?[hr][/quote]<br />Well, if you want too (though I doubt you could, hehe [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] )<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />Excellent: In your opinion, God created people who could not save themselves. That is like me putting a toddler with no legs into a swimming pool.[hr][/quote]<br />Actually, He created people (Adam and Eve) who didn't <i>need</i> saving.  When they turned from Him, they died (spiritually).  And no, they could not save themselves at all.<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />Which \"He\" instilled into us.[hr][/quote]<br />You'll have to show me that one from the Bible. . .  It seems to indicate people were sinless in the beginning. . .<br />[quote]<b><i>Quote:</i></b>[hr]Ecclesiastes 7:29  Lo, this only have I found, that God hath made man upright; <b>but</b> they have sought out many inventions.[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />You truly are a repetitive person, are not you?[hr][/quote]<br />How?<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />I said to my Christian friend: \"I would rather go to hell and continue beleiving what I know in my heart to be correct, then to conform myself to a religion which preaches love and then does hateful, self-motivated, careless, thoughtless, and forceful\"[hr][/quote]<br />Well, that does sound like a nasty religion (\"which preaches love and then does hateful. . .\"), quite hypocritical.  True believers in Christ -- as far as I know -- are not like that.  For,<br />[quote]<b><i>Quote:</i></b>[hr]Matthew 7:18  A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good fruit.[hr][/quote]<br />As for you knowing in your heart what is \"correct\". . . how do you know your heart isn't deceiving you?<br />[quote]<b><i>Quote:</i></b>[hr]Jeremiah 17:9  The heart is deceitful above all things, and desperately wicked: who can know it?[hr][/quote][Sorry about the repetition [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] ]<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i>  [one last time]<br />And if my soul is to burn in hell for doing what is right, then there is no better place for it.[hr][/quote]<br />Evidently unrepentant. . .<br />[quote]<b><i>Quote:</i></b>[hr]Revelation 16:9  And men were scorched with great heat, and blasphemed the name of God, which hath power over these plagues: <b>and they repented not to give him glory.</b>[hr][/quote]<br />Sounds a little similar. . .?<br />[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />No, why would one (God) want to punish people (us)?[hr][/quote]<br />Oh, I see.  Well, I don't know, except that is what they deserve.  And since that's the way He set everything up, that's the way it must run.  Of course, it should be no surprise that we humans wouldn't understand the why's of God's infinite wisdom. . .<br />[quote]<b><i>Quote:</i></b>[hr]1 Corinthians 1:25  Because the foolishness of God is wiser than men; and the weakness of God is stronger than men.[hr][/quote]"
	},
	{
		"id": 23234,
		"title": "Re: Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-09T08:04:44.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, I don't know, except that is what they deserve.[hr][/quote]<br />That's what gets me. So what if a person <i>deserves</i> punishment. That doesn't force you to punish them. With as much love as God claims to have, I would expect no punishment at all without a very good reason. And I'm left with no indication at all about what that reason might be. Sinners just \"deserve\" it, is all, apparently.<br />[quote]<b><i>Quote:</i></b>[hr]Of course, it should be no surprise that we humans wouldn't understand the why's of God's infinite wisdom. . .[hr][/quote]<br />This also gets me. I'm supposed to accept that God is great, powerful, and wise, but it doesn't look like that at all from where I'm standing. I think some better explanations (from God) are in order for it to be remotely reasonable to expect worship and acceptance.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23235,
		"title": "Re: Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-09T20:11:54.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />With as much love as God claims to have, I would expect no punishment at all without a very good reason.[hr][/quote]<br />What love are you referring to?  True believers, as I understand it, will not receive the punishment for their sins because Christ already paid for them.  However, contrary to what many believe, the Bible seems to indicate that God does <i>not</i> love everyone, and thus not everyone can be saved. . ."
	},
	{
		"id": 23236,
		"title": "Re: Strange. . .",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-09T20:21:55.000Z",
		"content": "But why does he create people he hate and who therefore can't be saved in any way?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23237,
		"title": "Re:  Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-09T22:00:24.000Z",
		"content": "You know, I have absolutely no idea; it doesn't make sense to me either. . .  But as Romans says,<br />[quote]<b><i>Quote:</i></b>[hr]Romans 11:33 (not the entire verse)  how unsearchable are His judgments, and His ways past finding out![hr][/quote]<br /><br />[EDIT]<br />Whoops, actually, here's a verse from Revelation that speaks of this (I think):<br />[quote]<b><i>Quote:</i></b>[hr]Revelation 4:11  Thou art worthy, O Lord, to receive glory and honour and power: for thou hast created all things, and <b>for thy pleasure they are and were created.</b>[hr][/quote]<br />[/EDIT]"
	},
	{
		"id": 23238,
		"title": "Re:  Strange. . .",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-09T23:32:56.000Z",
		"content": "So we're pretty much just toys of God?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23239,
		"title": "Re:  Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-10T01:16:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] So we're pretty much just toys of God?[hr][/quote]<br />That's pretty much what I'm driving at. It's the impression I get, and I don't much like it. Well, I don't actually believe God exists, so I'm not really upset, but in this discussion I'm assuming there is a God.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23240,
		"title": "Re:  Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-10T03:52:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />Oh the irony of that last statement. A religion talking of peace and love simotaniously saying that if you do not obey God, he will smite you.<br />--------------------------------------------------------------------------------<br /><br />What's wrong with that?<br />[hr][/quote]<br /><br />Love and judgement are antonyms.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />Yes quite.<br />--------------------------------------------------------------------------------<br /><br /><br />The reason I said, \"Not quite\" was because jumping through hoops sounds like something that is pointless, maybe a challenge but nothing more.<br />[hr][/quote]<br /><br />I thought getting saved was simple?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />Really? I seem to remember plenty of non-Christians doing great things out of the goodness of their hearts... (Oh wait, I'm sorry, I forgot: non-Christians do not have hearts!)<br />--------------------------------------------------------------------------------<br /><br /><br />Hmm. . . And how do you know they had any \"goodness\" in their hearts? Your definition of \"good\" is probably different than God's. For,<br /><br />Quote:<br />--------------------------------------------------------------------------------<br />Jeremiah 17:9 The heart is deceitful above all things, and desperately wicked: who can know it?<br />--------------------------------------------------------------------------------<br />[hr][/quote]<br /><br />If that is so, than how can you know anything is good?  How can you know God's goodness if you are prone to evil?  Why do you feel thoughts of charity, love, grace, and empathy?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />Excellent: In your opinion, God created people who could not save themselves. That is like me putting a toddler with no legs into a swimming pool.<br />--------------------------------------------------------------------------------<br /><br /><br />Actually, He created people (Adam and Eve) who didn't need saving. When they turned from Him, they died (spiritually). And no, they could not save themselves at all.<br />[hr][/quote]<br /><br />If he could not forsee them failing then he is not a god, and if he created us, he had to know everything about us, including failures.  The failures that he had to of instilled in us, if he truly created everything.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />Which \"He\" instilled into us.<br />--------------------------------------------------------------------------------<br /><br /><br />You'll have to show me that one from the Bible. . . It seems to indicate people were sinless in the beginning. . .<br />[hr][/quote]<br /><br />Revert back to my last point; however, he had to have created our sinful nature when he created us.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LordOfGloBox:<br />I said to my Christian friend: \"I would rather go to hell and continue beleiving what I know in my heart to be correct, then to conform myself to a religion which preaches love and then does hateful, self-motivated, careless, thoughtless, and forceful\"<br />--------------------------------------------------------------------------------<br /><br /><br />Well, that does sound like a nasty religion (\"which preaches love and then does hateful. . .&amp;quot[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] , quite hypocritical. True believers in Christ -- as far as I know -- are not like that. For,<br /><br />Quote:<br />--------------------------------------------------------------------------------<br />Matthew 7:18 A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good fruit.<br />--------------------------------------------------------------------------------<br />[hr][/quote]<br /><br />You have now made a truly falious statement: by your own Bible we have all, and always will, sin.<br /><br />Also, that verse does not stand up if you take it to the extreme of blakc and white.  Eminem gave $50,000 to a children's fund.  He is not a Christian, ergo he cannot spawn goof fruit, according to your interpreatation of that verse.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />As for you knowing in your heart what is \"correct\". . . how do you know your heart isn't deceiving you?<br />[\\quote]<br /><br />And how do you know your heart is not deceiving you?<br /><br />[hr][/quote]<br /><br />So you assume, at any rate.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Sounds a little similar. . .?<br />[hr][/quote]<br /><br />Not at all.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />Lemur821:<br />No, why would one (God) want to punish people (us)?<br />--------------------------------------------------------------------------------<br /><br />Oh, I see. Well, I don't know, except that is what they deserve. And since that's the way He set everything up, that's the way it must run. Of course, it should be no surprise that we humans wouldn't understand the why's of God's infinite wisdom. . .<br />[hr][/quote]<br /><br />Rapists and murders deserve punishment.  If I were the unbaised punisher, I would not.  This is because I did turn him into a rapist/murder and then judge him/her.<br /><br />Is not the man who concieves the plot just as guilty as the man who acts it out?  Our (USA) law is read as such, and it is the truth.  God cannot incriminate us, and then exculpate himself.  You cannot whipe your hands clean of an act after you anounce it as \"sin\".~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23241,
		"title": "Re:  Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-10T06:03:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LOGBox:</i><br />Love and judgement are antonyms.[hr][/quote]<br />Not last time I checked. . .<br />[quote]<b><i>Quote:</i></b>[hr]I thought getting saved was simple?[hr][/quote]<br />Well, I didn't say that.  It's just that jumping through hoops sounds like something that someone might do just for themselves, just so they could have what they wanted -- just a selfish reason.<br />[quote]<b><i>Quote:</i></b>[hr]If that is so, than how can you know anything is good? How can you know God's goodness if you are prone to evil?[hr][/quote]<br />The Bible is the only place to find out what is right and wrong <i>in God's sight</i>.  Anyone can make up their own standard for right and wrong, but that leads to trouble in the end. . .  <br />[quote]<b><i>Quote:</i></b>[hr] Why do you feel thoughts of charity, love, grace, and empathy?[hr][/quote]<br />I'm not sure. . .  Maybe this is why. . .?<br />[quote]<b><i>Quote:</i></b>[hr]Romans 2:14-15  For when the Gentiles, which have not the law, do by nature the things contained in the law, these, having not the law, are a law unto themselves: Which shew the work of the law written in their hearts, their conscience also bearing witness, and their thoughts the mean while accusing or else excusing one another;[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]If he could not forsee them failing then he is not a god, and if he created us, he had to know everything about us, including failures. The failures that he had to of instilled in us, if he truly created everything.[hr][/quote]<br />I don't think instilling something in someone is the same as making it an option.<br />[quote]<b><i>Quote:</i></b>[hr]Revert back to my last point; however, he had to have created our sinful nature when he created us.[hr][/quote]<br />Maybe according to human reasoning, but the Bible doesn't say that.<br />[quote]<b><i>Quote:</i></b>[hr]You have now made a truly falious statement: by your own Bible we have all, and always will, sin.[hr][/quote]<br />Uh. . . which part was \"falious\"?<br />[quote]<b><i>Quote:</i></b>[hr]Also, that verse does not stand up if you take it to the extreme of blakc and white. Eminem gave $50,000 to a children's fund. He is not a Christian, ergo he cannot spawn goof fruit, according to your interpreatation of that verse.[hr][/quote]<br />What makes that a good deed?<br />[quote]<b><i>Quote:</i></b>[hr]And how do you know your heart is not deceiving you?[hr][/quote]<br />I don't; in fact, I know that it does.  That's why it is not good to follow one's heart.<br />[quote]<b><i>Quote:</i></b>[hr]Is not the man who concieves the plot just as guilty as the man who acts it out? Our (USA) law is read as such, and it is the truth.[hr][/quote]<br />What makes it the truth?  And since when should God be judged under US law (or any law for that matter, since He is above all laws).<br />[quote]<b><i>Quote:</i></b>[hr]You cannot whipe your hands clean of an act after you anounce it as \"sin\".[hr][/quote]<br />It depends on who you are or whether or not you had anything to do with the act.<br /><br />Basically, this discussion is pointless for this reason:  <br />[quote]<b><i>Quote:</i></b>[hr]Isaiah 55:9  For as the heavens are higher than the earth, so are my ways higher than your ways, and my thoughts than your thoughts. <br /><br />I know, this is repetitious, but one more. . .<br /><br />Romans 11:33  O the depth of the riches both of the wisdom and knowledge of God! how unsearchable are his judgments, and his ways past finding out![hr][/quote]<br />Until we realize that God's ways <i>are</i> indeed \"past finding out,\" and His thoughts <i>are</i> higher than ours -- or any human's for that matter -- we will continue to judge Him by our own standards.  And thus -- because our thoughts and His thought do not coincide -- we will seemingly find fault, instead of recognizing Him as the God of gods and the Lord of lords.  When we find something we do not understand or we think it is foolish (because our human minds are incapable of comprehending God's ways no matter if we like it or not), we will assume God is at fault instead of us.  Thus the discussion keeps going round and round."
	},
	{
		"id": 23242,
		"title": "Re:  Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-10T11:06:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Until we realize that God's ways are indeed \"past finding out,\" and His thoughts are higher than ours -- or any human's for that matter -- we will continue to judge Him by our own standards. And thus -- because our thoughts and His thought do not coincide -- we will seemingly find fault, instead of recognizing Him as the God of gods and the Lord of lords. When we find something we do not understand or we think it is foolish (because our human minds are incapable of comprehending God's ways no matter if we like it or not), we will assume God is at fault instead of us. Thus the discussion keeps going round and round.[hr][/quote]<br />But God makes no effort at all to help us understand. No explanation at all. Not a metaphor, and not even a lie to placate us. I think that if God wants something from us, then he needs to deal with us on or level. Since when are threats and punishment the best way to reach people.<br /><br />And so what if God's ways are higher than ours? Weren't we created with free will? We don't have to accept that God has a right to \"play God\", so to speak, with us. God's plan doesn't need to be our plan if we don't trust it or like our part in it.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23243,
		"title": "Re:  Strange. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-10T22:14:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Lemur821:</i><br />Weren't we created with free will?[hr][/quote]<br />The idea of free will is an interesting (or odd) topic in itself.  I'm not really sure about it entirely, but what I am certain of is that people do <i>not</i> have free will concerning salvation.  No matter how hard anyone tries, they cannot \"accept\" Christ of their own accord.<br />[quote]<b><i>Quote:</i></b>[hr]Romans 9:16  So then it is not of him that willeth, nor of him that runneth, but of God that sheweth mercy.[hr][/quote]<br />So just because you want and try to get to heaven, there is no assurance that you will, unless God chooses to have mercy on you.  This may seem rather discouraging, but there is hope.  Seek God diligently, with your whole heart, and maybe He will save you. . .<br />[quote]<b><i>Quote:</i></b>[hr]Psalm 10:4  <b>The wicked, through the pride of his countenance, will not seek after God: God is not in all his thoughts.</b><br /><br />However. . .<br /><br />Psalm 9:10  And they that know thy name will put their trust in thee: <b>for thou, LORD, hast not forsaken them that seek thee. </b>[hr][/quote]"
	},
	{
		"id": 23244,
		"title": "Re:  Strange. . .",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-10T23:05:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]So just because you want and try to get to heaven, there is no assurance that you will, unless God chooses to have mercy on you. This may seem rather discouraging, but there is hope. Seek God diligently, with your whole heart, and maybe He will save you. . .[hr][/quote]<br /><br />That sounds a lot like Calvanism...<br /><br />No, as a Catholic, I have to disagree with GMixer - We do have free will, and can choose to do good, or evil. Jesus says that not even the slightest taint of sin will allow you to go to heaven. That is why there is purgatory. Protostants will disagree with that point, but then again, Martian Luther took out the books of Macabees from the bible because he didn't wan't to have to worry about repenting his sins.<br /><br />Purgatory is a state, in the afterlife, of temperal purification. We are cleansed of venial sins; sins that do not compleatly reject the grace of God. Mortal sin, like unjustifiable killing (Murder), is a mortal sin, and removes the life of grace in our soul. We must go to confession, and confess our sins to the priest, who are acting in the place of Jesus - another point argued by protostants.<br />   The priest, when acting in the place of christ, then is able to literally say (at Mass), \"This is My body\" and \"This is My blood\" and is also able to forgive you in the name of Christ.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Matthew 16:19</b> - I will give you the keys of the kingdom of heaven; whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven.[hr][/quote]<br /><br />This is Jesus speaking to Peter, whome he also said<br /><br />[quote]<b><i>Quote:</i></b>[hr]And I tell you that you are Peter, and on this rock I will build my church, and the gates of Hades will not overcome it.[hr][/quote]<br /><br />Thus, Peter was, acording to Jesus, the base on which Jesus would build his church - Thus he was our first Pope. Jesus was not speaking of literally, cause it'd hurt to have someone build a Church on top of you.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] <br /><br />Thus, God gave the apostles the ability to forgive sin, and so we must confess our sins to a priest.<br /><br />Basically, back on topic, we have free will, and it is up to us not to flub up, and masturbate, murder (or suicide), or blatenly disobey God.Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://www.najawa.com/LLMod.jpeg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23245,
		"title": "Re:  Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-11T00:09:06.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />The idea of free will is an interesting (or odd) topic in itself. I'm not really sure about it entirely, but what I am certain of is that people do not have free will concerning salvation. No matter how hard anyone tries, they cannot \"accept\" Christ of their own accord.<br /><br />Quote:<br />--------------------------------------------------------------------------------<br />Romans 9:16 So then it is not of him that willeth, nor of him that runneth, but of God that sheweth mercy.<br />--------------------------------------------------------------------------------<br /><br /><br />So just because you want and try to get to heaven, there is no assurance that you will, unless God chooses to have mercy on you. This may seem rather discouraging, but there is hope. Seek God diligently, with your whole heart, and maybe He will save you. . .<br />[hr][/quote]<br /><br />You are a <i>Puritan</i>?<br /><br />I am afraid I can no longer continue in this debate.  I am sorry.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23246,
		"title": "Re:  Strange. . .",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-11T02:44:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]No matter how hard anyone tries[hr][/quote]<br /><br />No, that sound CalvanistProud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://www.najawa.com/LLMod.jpeg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23247,
		"title": "Re:  Strange. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-11T04:19:46.000Z",
		"content": "Study Puritanism a little closer~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23248,
		"title": "Re:  Strange. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-11T04:22:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The idea of free will is an interesting (or odd) topic in itself. I'm not really sure about it entirely, but what I am certain of is that people do not have free will concerning salvation. No matter how hard anyone tries, they cannot \"accept\" Christ of their own accord.[hr][/quote]<br />I was talking specifically about freedom not to accept God's plan, whatever that may be. We may be stuck with the plan, but we don't have to like it or cooperate when we have a choice.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23249,
		"title": "Re:  Strange. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-11T05:03:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I am afraid I can no longer continue in this debate. I am sorry.[hr][/quote] <br /><br />ZOMG! Someone shut him up! How? Who will defend atheisim now?? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23250,
		"title": "Re: Correction. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-11T06:41:25.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Gmixer:</i><br />So just because you want and try to get to heaven, there is no assurance that you will, unless God chooses to have mercy on you. This may seem rather discouraging, but there is hope. Seek God diligently, with your whole heart, and maybe He will save you. . .[hr][/quote]<br />I was wrong about some of that.  If you seek God, He <i>will</i> save you. . . not just \"maybe\":<br />[quote]<b><i>Quote:</i></b>[hr]Luke 11:10  For every one that asketh receiveth; <b>and he that seeketh findeth; and to him that knocketh it shall be opened.</b>[hr][/quote]<br />The problem is, not many people truly seek God -- with all their heart.  For,<br />[quote]<b><i>Quote:</i></b>[hr]Psalm 53:2-3  God looked down from heaven upon the children of men, to see if there were any that did understand, that did seek God.  Every one of them is gone back: they are altogether become filthy; there is none that doeth good, no, not one.[hr][/quote]<br />So, I was wrong about that.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />That sounds a lot like Calvanism...[hr][/quote]<br />Well, I wouldn't know:  I'm not a Calvanist. . .<br />[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />No, as a Catholic, I have to disagree with GMixer - We do have free will, and can choose to do good, or evil.[hr][/quote]<br />Ah, I didn't say people couldn't choose to do good or evil.  I said people cannot choose to go to heaven.  Only God decides that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Martian</b> Luther. . .[hr][/quote]<br />Been playing Keen 1 a little too much there? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]Purgatory is a state, in the afterlife, of temperal purification. We are cleansed of venial sins; sins that do not compleatly reject the grace of God. Mortal sin, like unjustifiable killing (Murder), is a mortal sin, and removes the life of grace in our soul. We must go to confession, and confess our sins to the priest, who are acting in the place of Jesus - another point argued by protostants.[hr][/quote]<br />Interesting ideas. . .  We can make up anything we want, but does God's Word say that?<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />You are a Puritan?<br /><br />I am afraid I can no longer continue in this debate. I am sorry.[hr][/quote]<br />Well, I don't label myself (or anyone else for that matter) as a Puritan, but. . .  Anyway, why can't you continue this debate?"
	},
	{
		"id": 23251,
		"title": "Re: Correction. . .",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-11T07:23:22.000Z",
		"content": "Is this thread trying to redirect anyone else to Najawa's website?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23252,
		"title": "Re: Correction. . .",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-11T08:11:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I said people cannot choose to go to heaven[hr][/quote]<br /><br />Oh... I agree, but if we are good, then God might just want to have us as company.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Is this thread trying to redirect anyone else to Najawa's website? [hr][/quote]<br /><br />Grr... it stinks; I tried to pass-protect my web-site, and the pic in my sig is linked to there, so you all suffered my wrath. kiddin. I am sorry.Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://www.najawa.com/LLMod.jpeg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23253,
		"title": "Re: Correction. . .",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-11T20:59:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Maybe according to human reasoning, but the Bible doesn't say that.[hr][/quote]<br />hahahaha[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23254,
		"title": "Re: Correction. . .",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-11T21:32:00.000Z",
		"content": "I cannot continue because.... Well, I see no point in debating Puritans.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23255,
		"title": "Re: Correction. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-11-11T22:58:40.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Gmixer:</i><br />Ah, I didn't say people couldn't choose to do good or evil. I said people cannot choose to go to heaven. Only God decides that.<br /><br /><i>Najawa:</i><br />Oh... I agree, but if we are good, then God might just want to have us as company.[hr][/quote]<br />People cannot choose to do good (though I'll admit I implied that they could).  <br />[quote]<b><i>Quote:</i></b>[hr]Psalm 14:1  The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good.<br /><br />Luke 6:43  For a good tree bringeth not forth corrupt fruit; neither doth a corrupt tree bring forth good fruit.[hr][/quote]<br />According to the Bible, unbelievers (corrupt trees, those who are not true Christians) cannot do good.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />I cannot continue because.... Well, I see no point in debating Puritans.[hr][/quote]<br />Well fair enough, though I'm not a Puritan. . ."
	},
	{
		"id": 23256,
		"title": "Re: Correction. . .",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-12T00:15:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I cannot continue because.... Well, I see no point in debating Puritans.[hr][/quote]<br /><br />Is there a point then in debating with a puritian atheist?A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23257,
		"title": "The end",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-12T00:55:35.000Z",
		"content": "Yeah... I left. Or at least, I stopped posting.<br /><br />As can be recognized, this is a discussion that is going nowhere, and frankly, I've been in too many of these things to see any worth in them.<br /><br />Immediately after I finish posting this message, I'm starting a new topic that, I hope, will approach this from a new angle... an angle that I haven't personally seen in forums before.<br /><br />All I ask is that you read that thread and answer honestly.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	}
]
