[
	{
		"id": 1115,
		"title": "funny",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2005-05-22T13:10:17.000Z",
		"content": "[Header]<br />Format=Single<br />Description=New error-messages in Windows 98:<br />[Data]<br />Smash forehead on keyboard to continue.<br />Enter any 11-digit prime-number to continue.<br />Press any key to continue or any other key to quit.<br />Press Ctrl-Alt-Del now for IQ-test.<br />Close your eyes and press escape three times.<br />Bad command or file name!  Go stand in the corner.<br />This will end your Windows 98 session.  Do you want to play another game?<br />Error saving file!  Format drive now? (Y/Y)<br />This is a message from God Gates: \"Rebooting the world. Please log off\".<br />BREAKFAST.SYS halted...  Cereal port not responding.<br />COFFEE.SYS missing...  Insert cup in cup holder and press any key.<br />File not found.  Should I fake it? (Y/N)<br />Bad or missing mouse.  Spank the cat? (Y/N)<br />Runtime Error 6D at 417A:32CF: Incompetent User.<br />Error reading FAT record: Try the SKINNY one? (Y/N)<br />WinErr 16547: LPT1 not found.  Use backup (PENCIL &amp; PAPER.SYS).<br />User Error: Replace user.<br />VirusScan report: \"Windows 98.0 found: Remove it? (Y/N)\"<br />If you are an artist, you should know that Bill Gates owns you and all your future reations.  Doesn't it feel nice to have security?<br />Your hard drive has been scanned and all stolen software titles have been deleted.  The police are on the way.<br />Incompatible software found (made by our competitor). Please remove.<br />You need at least 256 MB more RAM to run this application. <br />File is not compatible with this version of the software. Please go out and buy the latest version for a ridiculously high price.<br />Type \"Ortnsp*&amp;#\" to continue.<br />Enter your Credit Card number to continue.<br />You are low on disk space: only 100,000,000,000,000,000,256 bytes free.<br />This software is obsolete, please close the steam valve and shut down the boiler.<br />Do you really want to install this program?  Ours is so much better!<br />You need a computer to run this program.<br />Type \"I love Bill\" to continue.<br />New hardware found: Mains Plug.  Please insert disk with driver sofware.<br />Colour of computer-housing not compatible with setup back-ground.  Paint now? (Y/N)<br />Please enter the 16 digit serial number into the 14 digit space.<br />The serial number can be found on the back of the cellophane wrapping you just threw away.<br />Compose an ode to Bill to continue.<br />Mouse not found. Click left to continue.<br />This computer will self-destruct in five seconds, rather than running this crazy operating system!<br />Insert pencil in right ear and push hard!  If you still can read this you are ready to continue installing...<br />Press F12 key.  If you still use an old keyboard: Tough luck!<br />Press and hold Scroll Lock key. There, now you have used that key for the first and last time!<br />We can not be held responsible for injuries to your health by prolonged exposure to this operating system.<br />So far you have invested x.xxx.xxx $ to play Solitaire? And you blame us for being rich?<br />Now would be a good time to make a backup of your hard drive.  Please hold 14578 formatted disks ready.<br />Press any key to start formatting, press escape to cancel. Oops, escape is also \"any key\"!<br />You are allowed to make as many copies as you want and give them away to anyone you like.  Aha, just kidding.<br />MSHIT32.DLL not found.  Please buy new computer.<br />Program halt due to low energy resources.  Need more gas.<br />System halted.  Cycle Redundancy Check test failed on your credit card number.<br />Too much static.  Try touching your pet and start over.<br />Input too complex.  Rephrase, using simple words!<br />Program too complex.  Go out and buy an Apple PowerBook.<br />No idea what's causing this error.  Make a guess.<br />Don't touch the touchscreen!<br />Mousetail too long.  Use scissors.<br />Your monitor is incompatible with our new and high-level Speech-Technology software.<br />Low battery power.  Please, toggle any key during half an hour to recharge fully.<br />Turn the screen upside down, just for the fun of it!<br />New user found.  Please insert driver's license or social insurance card.<br />Please wait while your computer is closing down Windows 98, definitively...<br />Your Windows 98 is dirty.  Please use soft cloth to clean.<br />Your mouse is hungry.  Type 'cheese' 10 times.<br />Keyboard too bouncy.  Try attaching springs to your fingers.<br />Press any key for total anarchy.<br />Start here to start to start here.<br />Never use the off-button (it's just there for laughs).<br />Processor overload, CPU too hot.  Please open a window.<br />Take that cookie out off drive A:!<br />Your 'Temporary Internet Files' subdirectory is at maximum capacity.  Shall I empty it while you take a bath?<br />Initiating warp speed.  Please prepare to crash.<br />System resources low.  Could you retype that last letter?<br />If you're planning on doing something right now, don't.<br />Hi there, this is your new OmniSense sotware speaking. Could you please take a shower first?<br />Ready to install.  Take a long hard look at your computer. It will never be the same again! ( Especially the dents you will make by hitting your head against the case will never come out again)<br />System installed.  From now on, any errors you make will be used against you!<br />NAG.SYS installed.  There, are you happy now?  The things I have to do to please you.  And then you come home whenever you choose.  Leaving me sitting here by myself.  I slave all day for you, calculate your spreadsheets, print your letters and what do I get from you in return?  A mouse click now and then.<br />Setup is updating your system.  Important!  Do not touch any key or mouse button at this time!  Hit any key to continue.<br />Setup complete.  This is a time-limited trial version. It will expire in one month.  It is not possible to reinstall your previous system.  Click YES to print a list of software-dealers in your area.<br />Mouse not found.  Keyboard not detected.  Unknown processor. CD-ROM not found.  Disk drive not responding.  Unknown monitor.  Hey!  Are you reading this? <br />Mouse not found.  You can now safely connect a mouse.  Ouch! Not there you fool!<br />Cannot continue.  Setup Aborted.  Click continue to continue.  Click exit to exit.  Click continue to exit to continue to exit.  Click exit to continue to exit.  If you have come this far, you qualify to use our program. Continuing setup...<br />Error-handler message: There is no error message for this error.  Use your imagination.<br />This is not an error-message.  Just keeping you alert!<br />Unexpected error-message.  Generating error.<br />Error in error-handler.  Too many files open.  Buffer overflow.<br />Error!  Error!  Error!  Saw this in an old SF-movie. Always wanted to try it myself!<br />Hardware conflict: there should be no power switch on this machine.  I don't like to be shut down.<br />Your FAT-table is corrupted.  Consult dietist!<br />Unexpected Error!  Shall I click to continue?<br />New error-message found.  Insert disk from O.E.M. manufactrrer (O.E.M =Original Equipment Manufacturer or in this case; Original Error ..... right!).<br />This operating system requires no user input.  Go away!<br />Speech recognition-hardware not found. Please install. Please??!!...  No one ever talks to me.  I feel so lonely.<br />Starting Setup.  Setup will now decide wether your system is worthy of having this operating system bestowed on it.<br />Please type your full name and company name.  \"Get stuffed\" is not a valid name.<br />Please do not disassemble this software. No user-servicable parts inside.  If we can't get the bugs out, why should you?<br />Setup complete.  System will now restart, probably.<br />Click OK to continue.  Do not pass START.  Do not collect 200 $.<br />Fatal Error.  If you know what causes it, please contact us.<br />New hardware found: 5 1/4 inch drive. Please insert wax tablet containing driver.<br />To save on world resources, and for the sake of the environment, and to save the rainforrest, the manuals are on the CD-ROM in electronic format.  To read them you will have to print them, using far more paper than we would have if we had included a booklet.  Hey, that's your problem, we have done our bit!<br />Setup is detecting your hardware ... 386 processor found. Hahahahahahahahahahahahahahahahahahahahah!<br />Setup complete.  System will restart.  By the way, you know this is Beta-software, do you?<br />Setup complete.  Say three \"hail Bills\" before restarting.<br />Disk full.  Please turn over.<br />Setup message: While you were away I've clicked \"YES\" myself.  Wouldn't you like to know to what?<br />BOSSY.SYS installed.  Click Yes!  Now!  What are you waiting for!<br />LOWIQ.SYS installed.  Hit any key to continue.  They're on the keyboard.  It's that flat thing in front of you.  With all the buttons.  Choose one of them.  Put your finger on it.  Now push!  Push!  There that wasn't so hard, now was it?<br />Setup Message: Cannot continue setup.  Hit any key to continue.<br />BUTKISS.SYS installed.  Please hit any key to continue, if you are ready for it.  I can wait.  Wow, you did it.  Man, the way you hit that key, you're a natural!  Please feel free to hit it again any time you want to!<br />New software detected.  Add some old, please.<br />Error in error mesage.<br />Error in error in eror message.<br />Keyboard not found.  Continue setup? (Y/N)<br />It would help enormously if you'd open up the lid of your laptop computer!<br />Integer overflow.  How much is six times seven?<br />During copying, one of the cute little flying papers got misplaced.  Shall I look for it now?<br />Label on Windows 98 box: 'Designed for Microsoft Windows 95'<br />Unable to find cache memory.<br />Cannot find hidden system files.  Help me, please.<br />Loose attachment.  Please search desktop.<br />'Help with help'-file not found.  Reinstalling Windows 98.<br />For maximum performance of our new Organizer software, please rearrange keys on keyboard in alfabetical order.<br />Your laptopscreen is best viewed under an angle of approx. 37.3 degrees.<br />FAT-table corrupted, second one (copy) intact.  Which one do you prefer for further use? (1/2)<br />The following action will copy the larger byte of the F-register in the lower one of your Master Boot sector address.  Your registry database will be adjusted accordingly.  It is extremely important that you understand fully the consequences of this procedure, if not this could result in total data loss.  Press any key to continue.<br />Don't get alarmed.  It's rather normal that while quitting Windows 98 the endscreen stays on your monitor for about 12 minutes (even after unplugging the computer).<br />Don't e-mail us, we'll e-mail you!<br />Harware error: Monitor malfunction or no monitor connected.<br />Stack overflow.  Putting Recycle Bin under desktop.<br />Memory overflow!  Quick, those bits are speedy little bastards, catch'm while you can!<br />Divide by zerro error.<br />Stack too high, support it!<br />NASTY.SYS installed.  Your INI and SYS files have been hidden.  The registry has been corrupted.  All drivers have been removed.<br />Stack too high, lower bytes crushed!<br />Standard keyboard driver not found, switching to Servo-Croatic.<br />Non standard keyboard detected.  Press F13 key to continue.<br />This program has been extensively tested and is guaranteed error-free.  Cross your fingers and hit any key to continue.<br />Illegal call to memory location 4EF1.  Touch wood to continue.<br />This program has caused a memory conflict at address 4F1E. Probably, you can keep on working.  That is if you like to work on a blank screen, with no mouse support and no possibility to save your work.<br />Disk full.  Memory overflow.  Call plumber.<br />File won't fit on disk.  Use bigger disk or shorter words.<br />Delete key disabled.  Use Tipp-Ex.<br />Mouse is scared.  Remove cat from casing.<br />Sound hardware disabled.  CPU has an headache.<br />MORON.SYS installed.  Press CTRL-ALT-DEL to save your work.<br />MIRROR.SYS installed.  eunitnoc ot yek yna sserP.<br />Internet message: Surfing not possible, no waves.  Please rock monitor.<br />Running out of stack space.  Please move furniture.<br />Initialising modem.  Dialing.  Connecting.  Answering machine found.  What shall I say?<br />Modem not responding.  Cannot send e-mail.  Switching to backup system.  Printing message.  Printing envelope. Switching to sleep-mode while you go out and buy a stamp.<br />Run-time error: The lower two bytes in the buffer stack area are generating a parity error during sync-testing of the VGA RAM-banks.  Do you know what this means?  I dont.  But it surely messes up things!<br />CPU error: The math-coprocessor is not responding.  Use calculator.<br />Setup error: This software is not intended for use on a computer.<br />Run-time error: This software is not for human consumption.<br />Warning.  The next error message is an error and must be ignored.<br />Warning.  The previous error message is an error and must be ignored.<br />Warning.  Ignore all error messages.  Live dangerously.<br />There is no help for this error.  There is an error in help!<br />This program is so advanced it can generate new bugs!<br />This program is self-correcting.  Please wait.  Erasing myself.<br />Word 2000 has succesfully saved your file \"my new car\".  It has corrected twelve spelling mistakes, rephrased four sentences and changed the colour to metallic-green.<br />Starting setup.  Now would be a great time to take a valium.<br />Setup complete.  Stand by while generating new bugs.<br />Setup complete.  Press any key to continue or click heels together three times to return to previous O.S.<br />IDIOT.SYS installed.  Press F1 for Help with Help with Help.<br />This is My Briefcase.  Hands off!<br />DYSLEXIA.SYS installed.  Key to continue any press.<br />ESP.SYS installed.  Press that one specific key to continue.<br />LOOK THERE, RIGHT BEHIND YOU!!  Haha, just kidding!<br />Camera fully operational.  Please move very slowly.<br />You have new mail.  Shall I read it for you?<br />Strong Java detected.  Please wait while filtering code.<br />Error code 47: No bugs found.<br />Error code CXVII: Math-coprocessor outdated!<br />Initialising Artificial Intelligence ... Stopped working. Bye for now, try again tomorrow!<br />Your briefcase has been stolen.  Check that gray laptop in the corner.<br />Network environment not found.  Mazes probably to wide.<br />Cannot boot.  Too many knots in laces.<br />This software comes on five CD-ROMs.  If you should prefer a disk version, you wil have to come and get it yourself. Bring a van.<br />System diagnostics reports a 8088 processor.  Please remove JOKER.SYS from your system.<br />If you should find a bug in this program, please send us a report.  You can reach us toll free at no. '!$'d\"\"))45.<br />Virus Warning!  OmniSense software has detected the [COMMON COLD] virus in the saliva you just projected against the screen.  Take two aspirines and go to bed.  Shutting down.<br />Warning!  Our program contains a lot of bugs. This is normal for a multimedia show about cockroaches.<br />YUopuirt  fgion,gherrtsd  azrter  tyopop  tyhjiocvkjl!<br />If you have difficulty reading this, click the up-arrow to increase letter size. If you still can't read this, turn on your monitor. If this doesn't help, you're probably looking at the back of the monitor.<br />WIZ_OF_OZ.SYS installed.  Follow yellow brick road to continue.<br />GRANDMA.SYS installed.  Eat your vegetables to continue.<br />DEPRESSED.SYS installed.  I see no reason to continue.<br />MIDLIFE.SYS installed.  Give me one good reason to continue.<br />NEGATIVE.SYS installed.  Click 'no' to continue.<br />HEBREW.SYS installled.  !eunitnoc ot 'sey' kcilC<br />UNSURE.SYS installed.  Click 'maybe' to continue eventually.<br />GAME.SYS installed.  Find the key to continue.<br />BIKER.SYS installed.  Hit 'the road' to continue.<br />MOUSE.COM installed.  Get rid of cat to continue.<br />POP.SYS installed.  Make a hit to continue.<br />Artificial Intelligence system installed.  If you cannot enter a 12 digit prime number within the next five seconds, I will take over!<br />You have entered a correct twelve digit prime number.  I'm so smart I will take over anyway!<br />Wrong Media Type.  Please use appropriate Recycle Bin.<br />Your disk is 50 % fragmented.  Get some glue fast!<br />Shall I start defrag-program and really mess things up?<br />Track 0 damaged.  Disk unusable.  It will make a nice coaster though!<br />ALCOHOL.SYS installed.  Take a snort to continue.<br />SAILOR.SYS installed.  Hoist anchor to continue.<br />HALT.SYS installed.  Unable to continue...<br />COP.SYS installed.  Show driver's licence to continue.<br />A_BOMB.SYS installed.  There is no reason to continue.<br />You can now safely turn off your computer, if you dare!<br />Please wait while your computer rearranges the Universe.<br />FEMALE.SYS installed.  Rub mouse to continue.<br />System halted.  No computer found.<br />Hot software detected.  Fan activated.<br />BLUES.SYS installed.  Sing 'Love me tender' to continue.<br />Can not store 'www.netscape.com' in My Favorites.  System halted.<br />MALE.SYS installed.  Toggle joystick for maximum pleasure.<br />BABY.SYS installed.  Cukoo di doo joeka? (Y/N)<br />BLUESCRN.SYS installed.  System halted.<br />RAMBO.SYS installed.  Shoot anything to continue.<br />PARANOIA.SYS installed.  There should be 101 keys on your keyboard.  Count them now!<br />GOD.SYS installed.  Where do you want to go today? ... Flaaash!  (that was fast)<br />MADONNA.SYS installed.  Within 10 seconds there should be a strange appearance on your screen.<br />PPPPPeeeeerrrrrrhhhhhhaaaaapppppsssssss     yyyyoooouuuu ssssshhhhhoooouuulllddddd      llloooowwweeeerrrrr tttthhhee    rrrreeeppeeaattt    rrraaaattteee     ooofffff yyyyyooouuuuurrrrrr    kkkkeeeeyyyybbboooaaarrrrrdddd!!!!!!!<br />BIGBANG.SYS installed.  Continuing to expand system.<br />MACHO.SYS installed.  Pull chesthair to continue.<br />NARCISSUS.SYS installed.  I'm too pretty to continue.<br />PROSTATE.SYS installed.  I will wait five minutes to continue.<br />SINCLAIR.SYS installed.  Press C5 to continue.<br />SPECTRUM.SYS installed.  Touch dead flesh to continue.<br />ZX81.SYS installed.  We had to be crazy to continue! (but we did)<br />C64.SYS installed.  Syntax Error.<br />NEWTON.SYS installed.  Drop an apple to continue.<br />ARCHIMEDES.SYS installed.  Take a bath to continue.<br />Yu ar tping to fst fr m dmmt!  Ples slw dwn.<br />Setup not complete.  Remove Win98 CD to continue.<br />Fatal error.  Remove CPU to continue.<br />Fatal error.  Install Netscape Navigator to continue.<br />Internet Explorer reports: Cookies gone bad in cookie folder.  Please clean out.<br />Windows 2000 setup complete.  Aren't you sorry you gave good money for Windows 98?<br />ASSERTIF.SYS installed.  Ask me nicely to continue.<br />FREEMASON.SYS installed.  Show secret handshake to continue.<br />PYTHON.SYS installed.  Do a silly walk to continue.<br />Warning!  So far, we have won all legal actions started against us.<br />SIXTIES.SYS installed.  Be cool to continue man!<br />This Operating System makes no misteaks!<br />Pornographical site detected!  Please wait till harddisk shrinks back to normal size.<br />BOOTLOG.PRV missing.  Waw, this is serious, man!  Press any key to continue setup Windows 98.<br />BGATES.SYS installed.  Game over.  Please insert coins to continue.<br />Cannot reboot.  WINSOCK missing.  Please install BAREFEET.SYS.<br />New MS VibroShock joystick detected.  For external use only!<br />Reading Setup Disk 41.  Too many files open.  Check FILES= line in CONFIG.SYS.  Aborting installation.<br />CD-ROM drive not found.  Please insert CD with driver software.<br />Not enough space for environment.  Please chop some trees now!<br />Unexpected heap error.  You're in a heap of trouble now!<br />Thread data lost.  Tie some knots!<br />Not enough space for arguments.  Please go fight outside!<br />Floating point error.  Probably sunk.<br />ESP.SYS installed.  I sense you want to continue.bp ate the dopefish!"
	},
	{
		"id": 25325,
		"title": "Re: funny",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-05-22T13:40:28.000Z",
		"content": "It would have been nice if you could have cleared that up and formatted it, rather than-just copy-pasting a load of hard-to-read text. At least the jokes were somewhat funny.<font color=\"BLACK\"><br />My [url=http://kevan.org/brain.cgi?grafix5000]MindBending Power[/url] is 5.43 points.<br />Possibly the [url=http://legion.gibbering.net/misterx/troutwar.php?s=grafix5000]funniest thing[/url] on the interweb.<br />Go to [url=http://www.toxicsheep.com]www.toxicsheep.com[/url] to see my site!<br /></font><br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 25326,
		"title": "Re: funny",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-05-22T14:32:27.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Fun stuff. Formatting all that would've taken a long time.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 25327,
		"title": "Re: funny",
		"author_id": 180328,
		"author_name": "DivoKeen",
		"timestamp": "2005-05-22T21:59:54.000Z",
		"content": "Some good ones in between [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -------------------------------<br />If something's HARD to do, then it's NOT worth doing. -Homer J. Simpson"
	}
]
