[
	{
		"id": 973,
		"title": "Superconduction, Superfluidity and inspiration",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-14T10:05:48.000Z",
		"content": "Yes this topic will have a point, just bear with me through the technical stuff. [Although I'm sure you all know most of it anyways.]<br /><br />Over the various years and months of reading and researching I have learnt several things the relevant ones here are:<br /><br />1.) In atoms, electrons like to pair up, especially in sets of four to form stable 'shells' and stuff.<br /><br />2.) All particles have a 'spin' a weird property not actually related to spinning but so named because the physicist who discovered it was a fan of twirly tops.<br /><br />3.) This can be either a whole number like 2 or -1 or half.<br /><br />4.) Whole number particles like light can do weird quantum things like form lasers or act like a single super quantum entity.<br /><br />5.) Half number things can't do this; this is why atoms stay like they are instead of collapsing into a single particle sludge.<br /><br />6.) Spins add; hydrogen has no spin, the proton 1/2 and the electron -1/2 add to 0 for example.<br /><br />7.) I read that superconductivity depends on electrons forming 'Cooper pairs' and that helium 3 doesn't form a superfluid until much much lower temperatures.<br /><br />Righ; got all that? Good. None of these facts were especially related until just this afternoon when my brother said 'Do you know that at low temperatures the small attractive forces between electrons make them pair up?\" I'd never quite thought that way; and it took just under 15 seconds for the following thoughts to occur:<br /><br />1.) Those are cooper pairs!<br /><br />2.) ZOMG! Their spins will add to -1!<br /><br />3.) That means they can do quantum stuff!<br /><br />4.) Thats how superconductors work!<br /><br />5.) Atoms like helium 4 will do the same thing; that explains superfluids! And helium 3 is half spin so it'll need a much lower temperature, then two atoms will pair up!<br /><br />This may be a bit hard to understand, but that what made me so ecstatic; it was a blinding flash of inspiration, an amazing realization of something mysterious and unusual that came to me in a flash.<br /><br />And now the point of the topic: Have you ever had such a blinding flash of understanding or inspiration?<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23140,
		"title": "Re: Superconduction, Superfluidity and inspiration",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-14T11:00:20.000Z",
		"content": "Well to completely ignore the actual point of your post, isn't that thing you described called a [url=http://en.wikipedia.org/wiki/Bose-Einstein_condensate]Bose-Einstein condensate[/url]?  I haven't actually read that yet, it's just that what you describe seems rather familiar...<br /><br />As to your question though, yes, I have had a few 'Eureka' moments like that, and to prove what a geek I am a lot of them were when I was figuring out how to edit games and other assorted programming things... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   It does inspire you when you suddenly manage to fit together a bunch of unrelated things and come up with something you'd never thought of before."
	},
	{
		"id": 23141,
		"title": "Re: Superconduction, Superfluidity and inspiration",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-14T14:42:21.000Z",
		"content": "Well, I assume everyone has them, but the most brightest ones I've got when realizing how to do something difficult program in some Turing-tarpit (or realized what causes an error in that program).<b>Eat your veggies!</b>"
	},
	{
		"id": 23142,
		"title": "Re: Superconduction, Superfluidity and inspiration",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-14T20:02:44.000Z",
		"content": "Generally, these such flashes of ecstatic realisation come at three in the morning when I suddenly work out why the program I've been working on through the night keeps crashing or outputting rubbish. They also come when I fit together thoughts in my mind and suddenly realise the coolness of a new technology, and the amazing things I could do with it if I had the time or motivation.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 23143,
		"title": "Re: Superconduction, Superfluidity and inspiration",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-11-15T01:14:28.000Z",
		"content": "I haven't read too much about superconductivity, but doesn't it involve taking copper wire or whatever and putting it in liquid hydrogen or helium (super cold) and electricity can flow through it forever?<br /><br />And then magnets will float or spin above the superconductor?<br /><br />I had a practical idea for using a superconductor. If there was a way to make it easy to keep the hydrogen/helium cold, then you could have a LARGE superconductor under a floor. Then all appliances would have a magnet in it shaped like a + that would spin around an axle and generate electricity constantly. It could store extra electricity in a rechargeable battery and could be accessed at any time.<br /><br />Only issues with the idea:<br /><br />Availability/Cooling of liquid gases.<br />How far away could a magnet be and still spin/float? Would it depend on the size of the superconductor?<br />Would magnets harm computer components? Such as in a microwave... or in a computer? &gt;&lt;<br /><br />That was actually a brief moment of inspiration for me a year ago or so until I thought of the issues involved. I should probably learn more about superconductivity.[img]http://img447.imageshack.us/img447/4808/dimesterrulez24aa.gif[/img]"
	},
	{
		"id": 23144,
		"title": "Re: Superconduction, Superfluidity and inspiration",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-15T02:17:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]isn't that thing you described called a Bose-Einstein condensate?[hr][/quote]<br /><br />Something simalar; involving electrons instead of atoms, although superfluids are fluid B.E,C's<br /><br />[quote]<b><i>Quote:</i></b>[hr]And then magnets will float or spin above the superconductor?[hr][/quote]<br /><br />Superconductors hate magnets; the don't allow any magnetic field to penetrate them. When a magnet is placed near one the SC repels it, if done right the magnet can be made to flat on it, yes.<br /><br />[quote]<b><i>Quote:</i></b>[hr]a LARGE superconductor under a floor. Then all appliances would have a magnet in it shaped like a + that would spin around an axle and generate electricity constantly. It could store extra electricity in a rechargeable battery and could be accessed at any time.[hr][/quote]<br /><br />As usual, takes more energy than it makes. Besides, a SC will hold a current forever until you need it.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
