[
	{
		"id": 53,
		"title": "Episode 6: Bloog control center. Help!",
		"author_id": 1486669,
		"author_name": "judithdehaan",
		"timestamp": "2007-01-22T10:20:54.000Z",
		"content": "Hai!<br /><br />I have a question about Keen 6, about episode 6: Bloog Control Center. I have no idea how to get further when I took the three keys: the yellow, green and blue one. And now? I hope you know what I mean. Otherwise check the map of episode 6 on the website. Thanks!"
	},
	{
		"id": 2264,
		"title": "Re: Episode 6: Bloog control center. Help!",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2007-01-22T12:51:56.000Z",
		"content": "--This post may spoil your Commander Keening experience (or it might not... you be the judge...)--<br /><br /><br /><br />There's a sequence of doors you need to go through to proceed.<br /><br />From memory, I think the sequence is:<br /><br />- Enter the door in the first 'area' (the upper right 'section' of [url=http://www.classicgaming.com/cc314/encyclopedia/maps/maps-k6-lvl15.html]this[/url] map)<br />- Go through the first door in the room with the green blooglet, you'll arrive in the room with the yellow blooglet.<br />- Go through the third door in the room with the yellow blooglet.<br /><br />You should end up falling out of the chute in the upper left section of the map (again, I'm referring to CCC314's map of the level)."
	},
	{
		"id": 2265,
		"title": "Secret!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-01-22T20:09:33.000Z",
		"content": "The trick is to pay attention to the number of Fudge-pops above each door.  The ones you need to enter have extra treats above them... <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 2266,
		"title": "Ooh",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-01-22T22:52:49.000Z",
		"content": "That level is so much smaller than it seems in the game. Especially after seeing the huge maps that turn up in a lot of mods.<br /><br />[hr]<b>Xky</b> The trick is to pay attention to the number of Fudge-pops above each door. The ones you need to enter have extra treats above them... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[hr]Oh, wow. I never made that connection before. I've always just run through door after door and fluked my way through it. This is handy to know."
	}
]
