[
	{
		"id": 116,
		"title": "How to kill the elites?",
		"author_id": 581322,
		"author_name": "bUR2000",
		"timestamp": "2006-01-16T23:42:26.000Z",
		"content": "Is there any trick how to fight the elite vorticons (or how are those blue ones who shoot called)? I think it's hard enough to hit them twice, but four times? I can't manage to escape their shots, they're just too fast.<br /><br />And once there are like three or more of them together it gets impossible for me to beat that level.<br /><br />Any tactics greatly appreciated. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]"
	},
	{
		"id": 3302,
		"title": "Re: How to kill the elites?",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2006-01-17T00:49:11.000Z",
		"content": "Use the lightswitches to your advantage. The Elites won't jump in the dark, and there's usually some way to get around them once they've stopped jumping (without having to kill them all). I can't remember if they still shoot, though.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 3303,
		"title": "Me too bad...",
		"author_id": 581322,
		"author_name": "bUR2000",
		"timestamp": "2006-01-17T01:08:12.000Z",
		"content": "Okay, thanks. But it looks like I'm just too bad or too impatient to get those levels done. Sometimes there are no switches and you got to be very quick avoiding the shots... oh, well, at least I completed Keen1... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 3304,
		"title": "Re: Me too bad...",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-01-17T02:30:06.000Z",
		"content": "These are probably my hardest guys too fight, cause they're taller then you so you can't block there shots (as opposed to the mom vorticon things in keen3 or the robots in keen 1.  The good news is most of the time they provide a light switch or some other trick to get around him, you just have to find it.  I know a few levels ( this one in particular, i cant remember which, but i thought it was harder then the last level) have you have to fight them with no tricks. luckily when they do this you only have to fight one or two. if that's the case, i'd say the best thing to do is either go as fast as you can and jump up on one of the barrels thats there usually as soon as you enter the room (this usually wont work) or more preferably, just wait on the ledge just before the room thats usually there and shoot them as they jump (making sure if they get onto the ledge you retreat.) <br /> Well, that's the best strategy I can think of, you basically just have to try over and over.  too bad i'm not better at keen 2, i think that's the keen i'm the worst at."
	},
	{
		"id": 3305,
		"title": "Re: Me too bad...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-17T06:06:23.000Z",
		"content": "Yeah, they are pretty hard.. Just try hitting the ctrl+alt as fast as possible, since there sometimes isn't a way to avoid that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 3306,
		"title": "Re: Me too bad...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-17T06:27:01.000Z",
		"content": "Note also there is one level where you have to make the Vorts jump up onto a one way platform, where they can't get down. Then you sneak around and steal the keycard they're guarding by standing under it and jumping just enough for your head to get the card.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3307,
		"title": "Re: Me too bad...",
		"author_id": 1486905,
		"author_name": "chogall",
		"timestamp": "2006-03-02T23:07:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Note also there is one level where you have to make the Vorts jump up onto a one way platform, where they can't get down. Then you sneak around and steal the keycard they're guarding by standing under it and jumping just enough for your head to get the card.[hr][/quote]<br />Yeah, in fact you have to first go to that platform with the lights off, and grab the keycard above the platform, then turn on the lights and go back, wait until they all have jumped onto the platform and get the keycard below."
	}
]
