[
	{
		"id": 498,
		"title": "Dimension Chaos Prequel fic to be released this weekend",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-05-26T20:01:42.000Z",
		"content": "Well I havnt been clearly been telling people more about the status of my fic series \"Dimension Chaos\" lately. First off what you read before is currently being totally rewritten to make it clearly a better experiance like more epic battles and more description in what happens. Another thing is that other than the 5 main fics I have planned I have just finished a prequel fic that originally ment to be a part in the first fic but didnt make the cut due to it taking Keens point of view away which is something I want to keep in the fic.<br /><br />Ok well the prequel fic is pretty short (6 pages on lined paper) which stars Rouge the bat (from Sonic Adventure 2). The fic will provide slight background info for specific parts in the main series like a slight hint towards Rouge's role and a short history of the hero of spirits. And since this is a Keen and Sonic crossover fic you'll be seeing Mortimer for a brief role in this prequel. No Keen since the  main dimension chaos fics are centered around him so you'll have to wait for some updates.<br /><br />And the question on mostly everyones mind IMKO: why a  Keen crossover fic with Sonic? Well I had the idea of having Keen to work with another young kid genius and the only one who I found suitable was Tails (my favourite Sonic character) and who happens to be 8 years old and has a IQ of 300 (14 less than Keen). Since then I developed a epic story that will be sure to be a hit if I can write it well [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  <br />Anyways expect the prequel fic to be released Saturday at the latest."
	},
	{
		"id": 13676,
		"title": "Re: Dimension Chaos Prequel fic to be released this weekend",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-05-26T20:05:41.000Z",
		"content": "*skips half the post*<br /><br />Sounds, uh, good. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 13677,
		"title": "Re: Dimension Chaos Prequel fic to be released this weekend",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-05-27T10:30:22.000Z",
		"content": "Sounds good. And hey, never knew Tails was so smart! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  (S?)He's nice character.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 13678,
		"title": "Dimension Chaos Prequel fic to be released in a few days",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-05-29T02:58:00.000Z",
		"content": "well I just got hit with a huge project for school yesterday so I cant type up the fic this weekend. But it'll be up by Friday for sure though. One bit of good news though. One of my good friends (Poison) who is a great anime artist is taking a crack at drawing some Dimension Chaos fan art. From what he told me based on what he was drawing its seems like it will be a aftermath battle scene with Keen, Sonic and Tails with a funny quote by Keen. I should expect the drawing on monday when I get to school if he gets it drawn in time then I'll try to hunt down a scanner so I can show ya all. Again sorry for the delay but thank god summer vacation is coming up soon though."
	},
	{
		"id": 13679,
		"title": "lfsdkj",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2005-05-29T12:04:03.000Z",
		"content": "where can i find these fics?"
	},
	{
		"id": 13680,
		"title": "Re: lfsdkj",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-05-29T15:58:10.000Z",
		"content": "well theres no point in searching for them now since the first one of the series I thought i didnt write it well enough so its getting rewritten. If i have enough time tonight I'll try to upload the prequel fic.The end is near. An evil force returns. And only Commander Keen can stop him, but this time he must team up with a super sonic hedgehog and a two tailed fox. Follow the adventure:[url=http://www.geocities.com/superadammario/chaos.html]Dimension Chaos[/url]<br />A Commander Keen and Sonic The Hedgehog Crossover Fan Fiction<br /><br />Visit my website at [url=http://www.geocities.com/superadammario]www.geocities.com/superadammario[/url]"
	},
	{
		"id": 13681,
		"title": "update",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-07-12T04:54:00.000Z",
		"content": "Well still havnt typed up the prequel fic yet but I'll try to do that tomorrow so I can have it up by the end of the week (editing and stuff). Progress of dimension chaos has been slowly rising (damn you Half life 2 deathmatch!) and the first chapter is almost done (prologue is already done) which is actually massive and this will no doubt solve the complants of chapters being short. I'm hoping to have the first fic done by the end of the year or sooner. Expect fics #2-3 to be shorter and #4 and 5 to be massive. The end is near. An evil force returns. And only Commander Keen can stop him, but this time he must team up with a super sonic hedgehog and a two tailed fox. Follow the adventure:[url=http://www.geocities.com/superadammario/chaos.html]Dimension Chaos[/url]<br />A Commander Keen and Sonic The Hedgehog Crossover Fan Fiction<br /><br />Visit my website at [url=http://www.geocities.com/superadammario]www.geocities.com/superadammario[/url]"
	},
	{
		"id": 13682,
		"title": "Re: update",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-12T09:05:30.000Z",
		"content": "Allright. Doesn't matter if they're long, that's just better (if they're interesting). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 13683,
		"title": "Re: update",
		"author_id": 1486909,
		"author_name": "RocketJess",
		"timestamp": "2005-07-19T02:23:09.000Z",
		"content": "I read through the first couple of chapters of your fic at Fanfiction.Net (your Geocities links don't seem to be working) and I have one bit of advice: use paragraphs. Currently you're writing it all in big blocks, which makes it hard to read. Particularly for conversations, it's normal to start a new line when someone starts talking.<br /><br />For example, using a bit from your [url=http://www.fanfiction.net/s/2087492/1/]prologue[/url]:<br />[quote]<b><i>Quote:</i></b>[hr]I wish something awful would this way come he sighed as he gazed at the stars. You should be careful what you wish for a dark figure said as he appeared out of nowhere it might come true. Who the hell are you Knuckles demanded. You shouldnt talk to the Grand Intellect like that pathetic Echidna, you could get hurt laughed the stranger.[hr][/quote]<br />Having it all in a block makes it hard for the reader to keep track of who's talking. But if you start a new line each time:<br />[quote]<b><i>Quote:</i></b>[hr]I wish something awful would this way come he sighed as he gazed at the stars.<br />You should be careful what you wish for a dark figure said as he appeared out of nowhere it might come true.<br />Who the hell are you Knuckles demanded.<br />You shouldnt talk to the Grand Intellect like that pathetic Echidna, you could get hurt laughed the stranger.[hr][/quote]<br />It just makes it easier to read. A bit more punctuation (where appropriate) to break up long sentences would help as well.<br /><br /><br />On an unrelated note: I love your avatar! FmA is awesome. ^_^[hr]<br /><br />RocketJess, blasting off again!<br /><br />[url=http://www.geocities.com/rocketjess]The Dragonkeeper's Lair[/url]"
	},
	{
		"id": 13684,
		"title": "Re: update",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-07-19T02:42:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]On an unrelated note: I love your avatar! FmA is awesome. ^_^[hr][/quote]<br />Yay another fma fan [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />Yeah I know I made many mistakes with whats up on fanfiction.net right now but I'm currently rewriting fic so it will be better. Like I felt the Knuckles VS Mortimer fight was kind of lacking so I rewrote it. Stuff like that and some more descriptions in the writing too.Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	}
]
