[
	{
		"id": 1066,
		"title": "Recommend me some GBA/DS games",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-07-22T11:59:44.000Z",
		"content": "I got a Nintendo DS recently (woohoo, my very first console. teehee), and I'm wondering what games I should purchase.<br /><br />The only games i've got are Metroid Prime Hunters First Hunt Demo and The Urbz : Sims In The City.<br /><br />Can anybody recommend me some good GBA and/or DS games?![img]http://www.geocities.com/miniopolis/soul.txt[/img]"
	},
	{
		"id": 24723,
		"title": "DS Games",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-07-22T13:27:51.000Z",
		"content": "Super Mario 64 DS<br /><br />its the same Mario game that came out for the Nintendo 64 but with some differences. im not sure if youre familiar with the game because you said this is your first console.<br /><br />thats all i can think of (i dont own a DS) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 24724,
		"title": "Re: DS Games",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-22T14:52:46.000Z",
		"content": "I'd go with SM64, since it's probably the only good game they'll come out with for it. (although the original was much better)-Genius314"
	},
	{
		"id": 24725,
		"title": "Re: DS Games",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-07-22T18:52:16.000Z",
		"content": "Mario games, Yoshi's Island, Donkey Kong, Duke Nukem (it's different from Duke 3D).<br />I would stay away from racing games, because they get old soon and are therefore to expensive.-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 24726,
		"title": "Re: DS Games",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-22T19:07:22.000Z",
		"content": "Stay away from games like Mario vs DK! They are made really badly and have no replayability. Buy classic remake games like SMB1 and The Legend of Zelda (the original).<br />But if you plan to buy Super Mario Bros 1, get the GBC one (smb deluxe) instead, since it has more.-Genius314"
	},
	{
		"id": 24727,
		"title": "ooh!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-22T19:07:40.000Z",
		"content": "My girlfriend and I plan on picking up DS's sometime soon for Animal Crossing DS.  The Gamecube one stole about 4 months from our lives last summer, and we're hoping this one'll be even more fun.  :-)[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 24728,
		"title": "Re: ooh!",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-07-22T22:26:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]im not sure if youre familiar with the game because you said this is your first console.[hr][/quote]<br /><br />Yeah, i'm definately familiar with Super Mario 64, but i've never really \"played\" it. It looks good and all, but i'd rather play a classic version or remake of the game.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Duke Nukem (it's different from Duke 3D).[hr][/quote]<br /><br />If I could find the Gameboy Advance version of Duke Nukem 3D, i'd definately want to pick that up. I played a ROM of it and thought it was fantastic. It'd be really fun to play on the go.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I would stay away from racing games, because they get old soon and are therefore to expensive.[hr][/quote]<br /><br />I know, I got myself a copy of Need For Speed Underground 2 for PC with a \"Pizza Hut : PC Game Meal\", and I thought it was really boring. I mean, the cars don't even get damaged! BORING!<br /><br />[quote]<b><i>Quote:</i></b>[hr]uy classic remake games like SMB1 and The Legend of Zelda (the original).[hr][/quote]<br /><br />I'd love to, but I can't find them anywhere. And I'm definately not gonna be paying full price for the \"NES Classics\" range of games. I mean, just who pays $25AUD for a repetitive game like Pacman for their GBA? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]But if you plan to buy Super Mario Bros 1, get the GBC one (smb deluxe) instead, since it has more.[hr][/quote]<br /><br />Gameboy Color games (and below) aren't compatible with the Nintendo DS. It's also uncompatible with the E Reader, GBA Multiplayer among other things. Although wireless multiplayer with DS is really cool.<br /><br />[quote]<b><i>Quote:</i></b>[hr]My girlfriend and I plan on picking up DS's sometime soon for Animal Crossing DS.[hr][/quote] <br /><br />I've always had a soft spot for 'The Sims' on handheld, and it's often compared to 'Animal Crossing' and 'Harvest Moon', so i'm thinking of trying them.<br /><br />Super Mario DS is on special this week, although i'm not too sure on whether or not I should get it. It seems like only the most dreadful handheld games are available here... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] [img]http://www.geocities.com/miniopolis/soul.txt[/img]"
	},
	{
		"id": 24729,
		"title": "Re: ooh!",
		"author_id": 1486909,
		"author_name": "RocketJess",
		"timestamp": "2005-07-22T23:15:59.000Z",
		"content": "If you like RPGs, definitely get Golden Sun. It's really good. (Be warned though, you'll have to buy both the games to get the full story... the first one finishes halfway through the plot.)[hr]<br /><br />RocketJess, blasting off again!<br /><br />[url=http://www.geocities.com/rocketjess]The Dragonkeeper's Lair[/url]"
	},
	{
		"id": 24730,
		"title": "Re: ooh!",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-07-23T01:38:44.000Z",
		"content": "Mario 64 DS is more like half a port and half a remake of the N64 version and it provided me with hours of fun with the 4 playable characters (N64 only had Mario) and unlockable minigames that are addicting and take advantage of the touch screen. Definatly its one of the best games you can get for your DS. I also heard the Kirby game for DS is suppost to be the best DS game yet. If you like platformers check out Sonic Advance 2 and 3 since they provided me with some fun. And if your into RPGs Mario and Luigi should have you occupied. Plus of course if you liked Kingdom Hearts on PS2 you owe yourself to check out Kingdom Hearts: Chain of memories since it will set things up story wise for Kingdom Hearts 2. The gameplay is almost like the original except you use cards to attack but its still action RPG which is not a card game like Yugioh.<br /><br />Well hope that helps.Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	}
]
