[
	{
		"id": 1200,
		"title": "Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-20T12:39:42.000Z",
		"content": "What's your stance on piracy?<br /><br />This question is not limited to music, software and movies, but is applicable to information of any sort.<br /><br />My vote goes to Option 4. I pirate anything I can--movies, games, music, books, articles, and any other avenues of underground info-grabbing I can get my hands on. However, I also purchase legitimate copies of anything I can that I get the most value out of.<br /><br />I adamantly refuse to pay to download software, prefering some kind of physical package that's worth putting on display. This includes oldschool games like Keen--I will never buy them from the 3DRealms site unless they start publishing them again. I'm always on the lookout for second-hand copies of the originals, though.<br /><br />One thing that bugs me about the gaming industry these days is that alot of companies slap together some cheap packaging and chuck a massive box on the shelves padded with a chunk of cardboard and a single CD and, at best, a copy of the manual <i>on the CD</i>. Nothing you can really get your hands on.<br /><br />Anti-piracy measures, from what I can see, are having the opposite effect to what they're supposed to. Prices are driven up, and thus less people are willing to fork out the stupid amounts of cash being asked, including me. Of course, when they're on special at a reasonable price ($10-15) at a supermarket, then I'm willing to pay.<br /><br />Anyway... my mind is kinda wrapped around itself at the moment, so if I continue typing it'll end up a relatively incoherent mess. I'll elaborate on some other points when people start flaming me.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 26391,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-20T13:25:40.000Z",
		"content": "OK, let's see... first of all, I voted: \"I don't like it\".<br /><br />I used to pirate everything when I was young, or rather, I didn't know any better and traded games with friends.<br />Now that I'm older I do spend money on games, but only games I know I like, meaning I don't spend a fortune on them.<br /><br />I also sometimes see a nice, old game for a small amount of money, and pick that up.<br />I recently bought Doom Special Edition (including all 3 original engine games, which was actually cost a bit more than I would've liked), Prince of Persia: Sands of Time (which I haven't installed yet), Max Payne, Black &amp; White and Creature Island combo CD (also for my sister, who as suspected likes this game), and a while ago Duke Nukem Manhattan project.<br />With these older games I spend very little money, will know my computer will be able to run them, and still get a good amount of gaming pleasure..<br /><br />I do have some really old games which aren't for sale anymore, meaning there is no other way for me to get them than by downloading them from abandonware sites.<br />At least some of these were actually released as freeware by their respective developers/distributors.<br />It know it's technically not legal, but I do not believe I'm hurting anybody by it, and I simply still like playing those games.<br />I also have MP3's on my computer, quite a bunch of which are free computer game music, but some of which are not.<br />I have to admit I don't like buying CD's, but I really barely listen to music either.<br /><br />I do prefer having something tangible when spending money as well.<br />The older games I mentioned before didn't come with paper manuals, which does sort of bug me.<br />I like to read those things every now and again when I have a spare minute or 2, waiting for an installation to finish or whatever.<br />I do however prefer the DVD-style boxes over the old, relatively huge paper/cardboard boxes which had at least 3 different \"standards\".<br />Then again the UT box with the extra flap thingy did have \"something\", but I can live without.<br /><br />Anti piracy measures as a rule are useless, and REALLY annoying.<br />On that note, in the Netherlands we have to pay taxes on empty CD's and DVD's, because we will supposedly always put illegal copies on them.<br />Well, I suppose that would be a solution for the copying problem, not going into wether or not it's a good one, but copying is still illegal, and if you put your home-brew programmes on it, why would you have to pay taxes?<br />Are we going to have to pay taxes for USB flash drives in the future as well?<br /><br />Some developers claim games are going to get more and more expansive, and should, because more and more money, time, and other resources are put into them, but in my opinion it simply doesn't work like that.<br />A movie filled to the brim with expansive special effects doesn't cost a whole lot more than a simple movie of the same length either.<br />I say games should instead become cheaper, which I am sure will make more, and other people buy them, with the end result of the developers still making more money.<br /><br />Copies being sold as the real thing are obviously wrong in my book.<br /><br />OK, I'll wrap it up now.<br />So... uhm...<br />*Wrap!*Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 26392,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-21T01:28:02.000Z",
		"content": "I voted for the middle one.<br /><br />You'd be surprised how differently people look at piracy where they don't earn as much money in average (like Hungary [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]   , Russia, Poland, etc. ) as those do in more fortunate countries (like Australia, England, USA, Germany etc.).<br />Music and games cost the same amount of money anywhere. You buy 10-15 new games here, and you've already spent your whole earning for this month. This is just a moral question for you, but it's completely different for me...<br /><br />Do I like piracy? Hell no... but either I accept it, or I stop playing games (which I don't do, as I cannot afford a new computer anyway)<br /><br />*EDIT* [quote]<b><i>Quote:</i></b>[hr]On that note, in the Netherlands we have to pay taxes on empty CD's and DVD's, because we will supposedly always put illegal copies on them.[hr][/quote]This is true (almost) everywhere. And you have to pay not just taxes as there is an additional amount for the developer of the technology (sony?)"
	},
	{
		"id": 26393,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-21T06:57:06.000Z",
		"content": "I don't see it as a problem, and I download stuff whenever it suits me.<br /><br />I think that in most cases when people download something they wouldn't have bought it anyway, either because they don't want it enough at that price or because they can't find it. If they have enough cash that they don't mind forking it over for a product then they'll buy it. In my experience, people like to buy stuff, and will jump at the chance if it's within budget. If they don't have the cash then they won't buy it, and it makes no difference whether they download it or go without. None of the stock that the seller paid to produce has been taken (unlike old school stealing), so the potential for profit is just as high.<br /><br />Some people are just leeches and download everything, never buying it even though they could easily afford it, and I'm fine with that too. There are freeloaders everywhere and they're nothing to get mad about.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 26394,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-21T07:20:25.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]However, I also purchase legitimate copies of anything I can that I get the most value out of.[hr][/quote]<br /><br />Same. I won't pay full price on something I'm not sure of whether or not I will fully enjoy it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I adamantly refuse to pay to download software, prefering some kind of physical package that's worth putting on display. This includes oldschool games like Keen--I will never buy them from the 3DRealms site unless they start publishing them again. I'm always on the lookout for second-hand copies of the originals, though.[hr][/quote]<br /><br />Although I don't have a credit card or anything, I'd never purchase a download, but i'd be happy to pay for a physical package as long as its price and usefulness suits me.<br /><br />[quote]<b><i>Quote:</i></b>[hr]a copy of the manual on the CD.[hr][/quote]<br /><br />I hate that. I'd rather they print it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Anti-piracy measures, from what I can see, are having the opposite effect to what they're supposed to.[hr][/quote]<br /><br />I agree. I'm sick of paying for DVDs (namely 'The Simpsons') and having these repeated, lengthy copyright warnings. Alright! We get the freakin' point!!! Repeating them ad nauseum is hardly necessary.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I used to pirate everything when I was young, or rather, I didn't know any better and traded games with friends.<br />Now that I'm older I do spend money on games, but only games I know I like, meaning I don't spend a fortune on them.[hr][/quote]<br /><br />Same. I get greater enjoyment from my games when I pay for them. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]Copies being sold as the real thing are obviously wrong in my book.[hr][/quote]<br /><br />Absolutely.-- Censorship is F**ked! --"
	},
	{
		"id": 26395,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-21T07:21:37.000Z",
		"content": "I agree with that point - I know I only download things when I wouldn't have bought them anyway (so the developers aren't losing out on any money.)<br /><br />But by the same token (particularly with movies) I download them to see if they're any good, and about 25% of the time they are and I've gone out and bought the DVD.  If I wasn't able to download the movie, I wouldn't have gone out and bought the DVD...<br /><br />And there's also another argument to the \"piracy drives up software prices\" case - eventually you'd think the price would be driven up so much that buying a game will cost $10 million for the CD.  But if that happens, the developer will only need to sell one copy to turn a profit and it doesn't matter if people pirate it then, even if everyone has to pay for the pirate copies [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />Of course I don't think piracy really drives up the prices, it's consumers.  If nobody bought any games over $50, you'd find that it wouldn't take long before all games sold for $50.  Just look at other countries around the world - \"poor\" countries sell the same game much cheaper than \"rich\" countries simply because if it was sold at the same price across the board nobody in the poorer countries could afford to buy it and they wouldn't sell *any* copies..."
	},
	{
		"id": 26396,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-21T08:28:24.000Z",
		"content": "This is complicated...<br /><br />1.) Some things need to be pirated, things you just can't aquire honestly but where nobody will be harmed in your aquiry.<br /><br />2.) Music deserves to be pirated, the piracy is wrong, but the music industry sucks.<br /><br />3.) Some things have had a lot of effort put inot them, and the people selling them should have a return on all their effort.<br /><br />4.) Selling cheap ripp off sucks.<br /><br />5.) Making copious amounts of money on pirating sucks, since then you're doing it for your own gain. It also leads to other disreputable activities.<br /><br />So can we post pirated Keen links? I have quite a few, and other games too.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 26397,
		"title": "Yohoho!",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-21T18:44:18.000Z",
		"content": "I don't like what they do [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img]  but they're still people.<font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 26398,
		"title": "Re: Yohoho!",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-21T21:58:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Of course I don't think piracy really drives up the prices, it's consumers. If nobody bought any games over $50, you'd find that it wouldn't take long before all games sold for $50.[hr][/quote]<br /><br />Yeah. Some of the prices here in Australia are ridiculous. While Nintendo DS/GBA games are around an equivalent of AUD$40 in the US, the standard price for a GBA/DS game here is a whopping AUD$70. Although I never buy games until they get a little cheaper as the prices usually only drop when they sell really badly.-- Censorship is F**ked! --"
	},
	{
		"id": 26399,
		"title": "Re: Yohoho!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-21T22:55:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Although I never buy games until they get a little cheaper as the prices usually only drop unless they sell really badly.[hr][/quote]<br /><br />I think the \"unless\" was supposed to be a \"when\", but even then I have different experiences.<br />It seems to me good games remain steady price-wise, and bad games drop in price relatively quickly.<br />Well, everything is relative, I've seen good games drop 50% quickly, and bad games still being sold for a way too high price, like 10 euros dropped, years after.<br />That is for PC games; console games seem to never get any cheaper, relatively speaking.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 26400,
		"title": "Re: Yohoho!",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-22T02:15:26.000Z",
		"content": "The Seven Seas of Rhye?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 26401,
		"title": "Re: Yohoho!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-22T08:48:36.000Z",
		"content": "No, I'm against it. I would be tempted to get hours and hours of good music for free; download the newest stuff by bands I like, and try allkinds of different bands and stuff to find perhaps something worth of listening -- but I can resist it, and buy my stuff legally from the store. Piratism would make me feel bad, although I have to agree completely that the prices are way too high. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  Or well, perhaps not if I had some job. But still very expensive. But anyways, all the real (=album by some specific band) albums I've bought I've liked a lot. All the compilations (=tracks from many different bands) haven't been that enjoyable, but they've been really cheap so it doesn't matter much.<br />And the anti-pirate measures. Oh, please.. Because of them the prices get higher, and they're all broken/cracked in a few days. They are completely useless.<b>Eat your veggies!</b>"
	},
	{
		"id": 26402,
		"title": "Re: Yohoho!",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-22T10:05:24.000Z",
		"content": "I don't know where you get that prices rise because of anti-piracy measures... the prices would rise anyway, the industry just needed a \"good\" reason."
	},
	{
		"id": 26403,
		"title": "Re: Yohoho!",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-22T12:59:37.000Z",
		"content": "I pirate creative software (eg Flash, Photoshop) as I do not have the cash to obtain them legally. I usually buy music legally from the net, because I don't see the point in having a tangible copy of a music CD when I will almost never use it in that form. (ALLOFMP3 makes it affordable and worthwhile to buy music, because it doesn't have DRM). I do not use a pirated copy of XP. I think making money from piracy is wrong, but I don't have a problem with people pirating software for their own use.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 26404,
		"title": "Re: Yohoho!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-22T13:10:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't know where you get that prices rise because of anti-piracy measures... the prices would rise anyway, the industry just needed a \"good\" reason.[hr][/quote] <br /><br />In theory piracy itself causes price rises sice each CD pirated is about 7 CD's worth of profit.<br /><br />But bugger 'em anyways. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 26405,
		"title": "Re: Yohoho!",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-22T13:23:18.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : Can I please have one of your movies, Harry?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] : No.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : Pretty please?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] : No.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : Pretty please with cheese on top?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] : No.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : But why?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] : Because you'd steal it!<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : Dow do you know?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] : Because of my buddy...<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] : It's true. Your a pirate, so you'd steal it.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : How do you know?<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] : Because you look like one.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] : Nuts.<font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 26406,
		"title": "Re: Yohoho!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-22T16:59:23.000Z",
		"content": "\"In theory piracy itself causes price rises sice each CD pirated is about 7 CD's worth of profit.\"<br />Of course it does, that's the most obvious and annoying thing. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 26407,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-22T17:10:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You buy 10-15 new games here, and you've already spent your whole earning for this month. [hr][/quote]<br />When I buy 10-15 games then I've already spent my wages for three months. So apperently you have not much to complain about.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Music deserves to be pirated, the piracy is wrong, but the music industry sucks.[hr][/quote]<br />And you're making it much worse by downloading everything, especially for the people who still buy music. So thank you very much.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I think that in most cases when people download something they wouldn't have bought it anyway, either because they don't want it enough at that price or because they can't find it. If they have enough cash that they don't mind forking it over for a product then they'll buy it. In my experience, people like to buy stuff, and will jump at the chance if it's within budget. If they don't have the cash then they won't buy it, and it makes no difference whether they download it or go without.[hr][/quote]<br />Most people indeed never buy stuff because they don't have the money. A bad excuse if you look at what those people spent their money on: lots of them go to the pub four times a month and spend 50 euros (!) on beer, or they have a mobile phone and spend another 50 (!) euros on that. Big surprise that they don't have the money for games of cds.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Some people are just leeches and download everything, never buying it even though they could easily afford it, and I'm fine with that too. There are freeloaders everywhere and they're nothing to get mad about. [hr][/quote]<br /><br />True, some people like to download everything, some people like shoplifting, some peope like to rape peope. Nothing to worry about indeed. A good argument but worthless. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26408,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-22T17:31:04.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]When I buy 10-15 games then I've already spent my wages for three months. So apperently you have not much to complain about.[hr][/quote]<br /><br />If you have a good job that pays a bit more than the average? A students job lets you buy a maximum of 3 games a month, and only if you study nothing and work all the time... And before you say anything, I've made a mistake. 10-15 games are for the money you don't get, there's still taxes to be payed (more than 50%)<br /><br />I don't know what you do for a living though.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And you're making it much worse by downloading everything, especially for the people who still buy music. So thank you very much.[hr][/quote]The industry deserves piracy. It's a sad thing that the artist don't, they are robbed by the industry itself. They still earn much more than what they deserve for only playing music, at least the more popular bands. I don't forget that there are others who simply don't earn enough to eat, but their music is not pirated either."
	},
	{
		"id": 26409,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-22T17:39:34.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The industry deserves piracy. It's a sad thing that the artist don't, they are robbed by the industry itself. They still earn much more than what they deserve for only playing music, at least the more popular bands. I don't forget that there are others who simply don't earn enough to eat, but their music is not pirated either. [hr][/quote]<br />The music of smaller bands is a much pirated as the bigger bands. And because people are downloading cds get more expensive and an annoying copy protection system and concert tickets get more expensive. I can't blame them 100% when sales get lower then they must take some action.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26410,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-22T17:56:12.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The music of smaller bands is a much pirated as the bigger bands.[hr][/quote]They still earn more than what you do, though I never said that they deserve piracy.<br /><br />I bought every music I really liked as there is not that much, until those annoying copy protections that stopped me creating mp3's for my player. Fortunately all the DVD writers I and my friends now have can copy those music so I don't see the point of the protection. Even with that stupid additional protection software installed. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]...because people are downloading cds get more expensive...[hr][/quote]I still don't believe that it's the real reason."
	},
	{
		"id": 26411,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-22T18:05:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]They still earn more than what you do, though I never said that they deserve piracy.[hr][/quote]<br />A lot small bands don't earn enough to make a living. And I'm talking about profesional international bands right now.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I still don't believe that it's the real reason. [hr][/quote]<br />What do you think the reason is?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26412,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-22T18:38:19.000Z",
		"content": "I don't know, just a guess but here is what I think.<br /><br />There are many industries, like the music and the film industry that earns much more money than what they (reasonably) can spend. Why do they need to raise their prices?<br /><br />The music industry works like many other industries right now. They make up reasons to get more money because there are less companies now and there's no-one else you could buy the music from. In addition to that those companies got so big that they waste a lot of money and take lots of bad steps. It's their fate.<br /><br />*EDIT* why do I make all those stupid typos? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-bloody.gif[/img]"
	},
	{
		"id": 26413,
		"title": "Re: Surfing the Seven Seas. Yaharrr...:pirate",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-22T18:55:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]why do I make all those stupid typos?[hr][/quote] Because your human. We <b>all</b> make mistakes.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Nobody's perfect![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 26414,
		"title": "I don't like it, but:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T19:06:48.000Z",
		"content": "I don't like it, but hey: doen't a guy have a right to copy something so he doesn't accidentially break his origional copy, or have a right to make a mix of his/her music?<br /><br />According to Hollywood: No<br /><br />I don't like it; but to prevent even legal things from occuring... <br /><br />-- NAJAWA --"
	},
	{
		"id": 26415,
		"title": "Re: I don't like it, but:",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-22T19:24:40.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]don't like it, but hey: doesn't a guy have a right to copy something &lt;fixed&gt;in case he accidentially breaks&lt;fixed&gt; his origional copy, or have a right to make a mix of his/her music?[hr][/quote]<br /><br />(I slightly edited the above quote.)<br />That's the part that annoys me too, having to pay taxes on media I'll only use for backup copies, or music I composed (yeah right!), or whatever.<br />It's not just Hollywood though, it's all over.<br />Don't forget some publishers virtually break their CD's to prevent copying, which invalidates their \"CD license\" to word it badly, meaning they are doing something illegal as well.<br />I haven't done much research, but it does seem the actual artists don't get as much out of what they do as the should, compared to their publishers.<br />Then there's the software patent thing coming up in my head again...<br />And of course there's Jack Thompson being an ass again these last few weeks (check Wikipedia for instance)..<br /><br />In conclusion to me it seems like it's a combination of 2 things:<br />1 - The desire to earn lots and lots of money.<br />2 - An amount of ignorance identical to the amounts of money desired.<br />But then again, what do I know; I'm nobody.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 26416,
		"title": "Propaganda",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-23T04:00:42.000Z",
		"content": "[hr]<b>Djaser</b> True, some people like to download everything, some people like shoplifting, some peope like to rape peope. Nothing to worry about indeed. A good argument but worthless.<br />[hr]They're trying to shovel that rhetoric on us here at the moment in the form of advertisements that have now even infiltrated the cinemas.<br /><br />[hr]<b>Anti-Piracy Propaganda</b> You wouldn't steal a Car.<br />You wouldn't steal a Handbag.<br />You wouldn't steal a Mobile Phone.<br />You wouldn't steal a Movie.<br />Movie Piracy is Stealing.<br />Stealing is Against the Law.<br />Piracy. It's A Crime.<br />[hr]<br />Uhuh...<br /><br />If I could <i>replicate</i> a car, or a phone, I'd go right ahead and do it.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 26417,
		"title": "Re: Propaganda",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-23T07:41:23.000Z",
		"content": "If everybody would replicate cars and phones there wouldn't be new cars and phones made anymore, the same goes for music, movies, and games.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26418,
		"title": "Re: Propaganda",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-23T11:44:33.000Z",
		"content": "You really didn't think this over, stealing a car is still not the same thing as music piracy...<br /><br />Would you do whatever a terrorist say, because they have a few people in hostage? (I'm using this image as the same people came up with the anti-piracy laws as the ones who call everyone a terrorist) The hostages would be car makers and you'd have to buy the cars from the terrorists for 1000 time it's price. Wouldn't you rather steal the cars? Killing the terrorists would seem unimaginable.<br /><br />I know this sounds silly as a car is really not the same as music, but you may see my point if you tried. I'd like to know what is your opinion in this perspective."
	},
	{
		"id": 26419,
		"title": "Re: Propaganda",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-23T14:21:51.000Z",
		"content": "I never said that stealing a car is the same as music piracy. However the consequences can be the same.<br /><br />I 'think' that I see your point but it's completely out of proportion. First of all terrorists aren't the rightful owners of the cars, secondly music industry isn't as bad as the terrorists are, and the prices of music aren't so high that it's ridiculous.<br />-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26420,
		"title": "Re: Propaganda",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-23T19:55:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Movie Piracy is Stealing.[hr][/quote]<br />As has been pointed out thousands of times, piracy is copyright infringement and is a completely different crime. Stupid content industry.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 26421,
		"title": "Sig Stealing",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-23T22:05:11.000Z",
		"content": "Oh... and while we are on the topic of stealing; Signature stealing is also a crime.<br /><br />*Tries to nab LL's signature [stolen from najawa]*<br /><br />-- NAJAWA --"
	},
	{
		"id": 26422,
		"title": "Re: Sig Stealing",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-24T09:31:39.000Z",
		"content": "Go ahead, the moment you use my signature I'll stop using it and adopt something else.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 26423,
		"title": "Srry:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T03:58:51.000Z",
		"content": "I'm sorry... I just couldn't help myself<br /><br />-- NAJAWA --<br /><br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]"
	},
	{
		"id": 26424,
		"title": "Shiver me timbers...:pirate",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-11-13T13:43:41.000Z",
		"content": "LL: GAAHHHH!1!!!<br />Xtra: What is it?<br />LL: NAJAWA STOLE MY PICTURE<br />NaJaWa: Mwahahahahaha!!!! No one will ever catch me!!!! Mwahahahahahahahahahahahaha!!!!!!!!!!<br />Xtra: Your under arrest, NaJaWa!<br />NaJaWa: NOOOOOOOOOOO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Tough guys have no table manners![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img]</font>"
	},
	{
		"id": 26425,
		"title": "Re: Shiver me timbers...:pirate",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-02-08T04:38:50.000Z",
		"content": "[url=http://www.bbspot.com/News/2005/11/riaa_lawsuit_family_pack.html]www.bbspot.com/News/2005/11/riaa_lawsuit_family_pack.html[/url] protrays it quite nicely.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 26426,
		"title": "Tears of laughter.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-02-08T12:43:12.000Z",
		"content": "ROFL. Brilliant.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	}
]
