[
	{
		"id": 708,
		"title": "Come on people.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2007-07-29T00:43:27.000Z",
		"content": "Seriously, what's so bad about MegaKeen, I've seen much worse n00bs on boards bigger than this one, and a lot of professionals that are areseholes. (No, not Djaser, he's more of a nemesis, you could yell at him all day.) I personally don't see anything to make fun of here.<br /><br />If anyone wants, I can talk to Shocksund and see if he'll pop back, I actually live closer to him now than I did when he was first here. He's fun to have around, it's always so much nicer when he leaves.<br /><br />Seriously, ease up, we need everyone we can get.Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 18745,
		"title": "Re: Come on people.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-07-29T03:15:32.000Z",
		"content": "I have to agree on this one. Some of the posts around here are starting to sound very sarcastic and elitist. What's with all the reactions?<br /><br />I don't see the big deal about the occasional n00b post... for the most part I can understand what MegaKeen is trying to say, even if it does sound like he's had a few too many cans of VortiCola.<br /><br />That said, it would be nice if he can learn to communicate more effectively, but that's not going to happen if nobody looks any further than his spelling and grammar.<br /><br />Btw, shouldn't this post be in Micellaneous?"
	},
	{
		"id": 18746,
		"title": "Re: Come on people.",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-07-29T07:21:47.000Z",
		"content": "From MegaKeen's welcome thread.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Originally posted by LevelLord00 </b><br /><br />Now, let's not get rid of him like we did Harvey.[hr][/quote]<br /><br />I agree, seriously. We are a very small community and we shouldn't run off those who are new, they'll learn IF we stress that there should be good spelling, that will not only help MegaKeen here but anywhere else he goes, his posts would be professional and people would take him seriously. The world is becoming more and more run by the internet and if he masters the basic skills now it will benefit him in the real world. <br /><br />So letting him off on the spelling and such won't help him, we can't let him be in ignorance, but we shouldn't do it in anger either, we should do it in a \"loving\" way, that we have the best intentions for him to do better."
	},
	{
		"id": 18747,
		"title": "Re: Come on people.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-07-29T09:17:56.000Z",
		"content": "I agree. I made fun of him in his first few posts but I stopped that as you really can only do it once before it just gets to be annoying.<br /><br />It's just that the average post here is of rather high quality. Megakeen's aren't. No one can argue that. He is doing things that are annoying. Making new threads that were supposed to be responses to other threads... posting to a bunch of Commander Keen fans that he can tell us the endings to the games (What?!) things like that. Most of the time we just ignore threads that are \"OMG My new fangame1111!!\" but with Megakeen you simply can't ignore him. He posts EVERYWHERE. (Not as bad as Naj was though I'll give him that.)<br /><br />I really could care less if megakeen sticks around. So long as he isn't annoying and a pain to the community, which right now he is.<br /><br />And besides, I'll give him a few weeks. A couple of months, tops.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 18748,
		"title": "Re: Come on people.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-29T12:03:26.000Z",
		"content": "<b>Did you know that...</b><br /><br />Being harsh to a noob is the best way for him to learn some netiquette?<br /><br />Though I do have to say that it seems like the entire community is against him. That's bad.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 18749,
		"title": "Re: Come on people.",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-07-29T17:32:08.000Z",
		"content": "I think you have a point, LevelLord. This place does seem a bit newbie-unfriendly at times, and I think I've seen new posters be driven away in the past, which is kind of a shame.<br /><br />And bring Shocksund back, then, I dare you! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shockshund.gif[/img] ------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 18750,
		"title": "Re: Come on people.",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-29T18:55:44.000Z",
		"content": "Shockshund must have been before my time.<br /><br />I agree that we should help the n00b learn, but at the same time, we really want to avoid scaring him away.  I don't think he's doomed to make dumb posts forever, and if we can be helpful and critical without being overbearingly mean then I think he can figure it all out. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 18751,
		"title": "Re: Come on people.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-07-30T15:57:42.000Z",
		"content": "He'd better thank goodness that I'm not moderator. I'd edit every of his messages for spell checking and punctuation.<br /><br />For me it smells like he's the same noob that has been lurking in the KeenWiki, causing some discussion.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18752,
		"title": "re:",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-07-30T20:31:53.000Z",
		"content": "I've tried to remain moderate on this, but I must say, the whole coining of the \"n00b\" thing really turned me off from the Internet for quite a long time. It made things ugly."
	},
	{
		"id": 18753,
		"title": "Re: re:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-07-30T21:58:48.000Z",
		"content": "I thought (and still do) he was troll of some sort, purposefully writing like that. I'll move this to miscellaneous.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18754,
		"title": "Re: re:",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2007-07-30T22:43:42.000Z",
		"content": "yea ll has a point we should be a little nicer on the new guy <br />i was a noob or newbie once but you guys gave me a chance<br />[don't start over me never using . and , i have no idea where to put them i'm not joking]<br /><br />[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 18755,
		"title": "Re: re:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-07-31T06:01:49.000Z",
		"content": "I plead myself innocent, I did not pick on this guy more than I would do on anyone else.<br /><br />This topic is quite useless anyway, I think he has stopped posting.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 18756,
		"title": "Re: re:",
		"author_id": 1486058,
		"author_name": "BlueIllusionX",
		"timestamp": "2007-07-31T07:13:38.000Z",
		"content": "yea, best be nice to them. You never know, he might turn out to be another neil mcrae if the abuse continues. i dont want another email account being mail bombed lol."
	},
	{
		"id": 18757,
		"title": "Re: re:",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-07-31T17:05:16.000Z",
		"content": "ahaha, Neil...[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	}
]
