[
	{
		"id": 794,
		"title": "forest ep (my crappy music here)",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-03T16:12:57.000Z",
		"content": "As some of you may know I try to do some electronic music once in a while. Well, I've been working on an ep, \"<b>forest ep</b>\". I just didn't invent an artist name for this one, so don't wonder why there is none.<br /><br />This music is quite simplistic, to some people, but can be nicely bass driven too. What I've noticed it sounds the best with either headphones or pretty loud speakers!<br /><br />Anyways. This ep was meant to be released in all different place than this forum, but I just dropped it. I didn't feel like working on the songs any more (on some I've worked quite a long time already, on and off), although some might need something (or then not), and there was going to be five songs on this ep. Well, I didn't bother to include one. I have a few that need some finishing.. As well, there is no intro or such, as I originally meant. There is no nice cover or such, which I originally meant to photograph by myself. In other words, I'm disappointed how this turned out. This was going to be something good.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />And just to say, the software I'm using, Buzz fucling tracker, is damn buggy, crashes often, mostly I can't get it working no matter how I try, and last, I don't know much of the special stuff in it -- the sound might be a bit lower than in average cd track. Well, just turn up the volume a bit more!<br /><br />Anyways, me, KeenRush, have \"composed\" this crap. Hopefully at least someone likes it. Hopefully you can post your comments. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />This is partly because Spleen encouraged me to show my crappy music in public more. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  He hasn't heard these tracks yet, as has nobody else but me.<br /><br />Listen in this order. Total play time 25:41.<br /><br /><br /><b>quickone</b><br />[url=http://www.keengrid.net/keenrush/quickone.mp3]www.keengrid.net/keenrush/quickone.mp3[/url]<br />This was named 'quickone' because I started it day before my 19th birthday, and expected to finish it while I still was 18. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Well, I obviously was quite wrong, it took a lot longer. Anyways, this track has nicely bass, I guess. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br /><br /><b>calmmind</b><br />[url=http://www.keengrid.net/keenrush/calmmind.mp3]www.keengrid.net/keenrush/calmmind.mp3[/url]<br />I started this track to relieve my anger and frustration as I felt I was going insane. Well, this monotrack track may reflect insanity a bit, perhaps. It's a bit on the experimental side.<br /><br /><br /><b>synthic</b><br />[url=http://www.keengrid.net/keenrush/synthic.mp3]www.keengrid.net/keenrush/synthic.mp3[/url]<br />This is one of my favourite tracks so far. It has a good drive or something, I like it. It's also my most recent track. Also a bit faster than my usual songs.<br /><br /><br /><b>licht</b><br />[url=http://www.keengrid.net/keenrush/licht.mp3]www.keengrid.net/keenrush/licht.mp3[/url]<br />When I made this track I always knew it will be the finale track of forest ep. Features some nice crispy loops. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  Not very light track.. (Pun intended.) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] <br /><br /><br />Have fnu! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20463,
		"title": "my humble opinion",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2006-08-03T18:14:00.000Z",
		"content": "I had fnu... I mean fun, listening to your music [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Ok, I admit it was not the kind of music I usually listen to. I like the last one the most, and didn't like the second one at all, but anyways I don't think I'd be able to make music like this in a hundred years. It doesn't mean that you have reached the highest level of music creation [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  there is still lot to learn. For example I missed more instruments, and the music was a bit ... well... boring at places, but all in all, it's not bad. Just practice and make more![hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 20464,
		"title": "Re: my humble opinion",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-08-03T19:31:09.000Z",
		"content": "I tried it, and it's like all electronic music which means that I just don't get it.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20465,
		"title": "Re: my humble opinion",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-08-04T07:28:08.000Z",
		"content": "I like, but they don't really do much. I can only listen to the same loop for so long. On the other hand, if I were the raver type I might feel differently.<br /><br />It seems like we have kind of the same problem: once you've got a good riff/loop, it's really hard to know where to go from there.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20466,
		"title": "Re: my humble opinion",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-04T18:03:13.000Z",
		"content": "Hmm... To be honest, I don't really like the music. The amount of notes isn't much, the riffs are mediocre to bad and way too repetitive, the noise is annoying...<br /><br />Well SORRY for offending YOU, sir!  Naa kidding. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  I'm sure there are people who do like this kind of music.____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 20467,
		"title": "Re: Monotrack",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-04T18:13:22.000Z",
		"content": "PCKF definitely isn't the right target audience for this kind of music, not at all, I know, but as you can read this thing went ruined and I decided just to release it here.. (Perhaps I should mention about it to some monotrack fans elsewhere.) Thanks for honest comments, anyways. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Too bad this topic didn't attract more attention, I would've liked to hear more comments. (Even negative ones.) This stuff (except 'synthic') tries to be monotrack, which isn't exactly mainstream. If I do more music (if I ever get new software) my sound will go to more harsh/noiseish direction. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Yeah, it's repeative, perhaps disturbing at times, but that's what monotrack often is.. Not all electronic music is that melodic and progressive, as you people know. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20468,
		"title": "Re: Monotrack",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-08-04T21:05:53.000Z",
		"content": "As a giant fan of electronic music and a long time composer of it, this is a good start.  Your structures at the moment are a bit simple, but you have to right idea for the  trance / rave asspect that I know you are interested in.  Im personally more for experimental electronic music.  Learn how to opperate a synthesizer and get ahold of effects.  Practice your patterns and song structure elements.  It takes time and work to get it down.  Ive been making electronic music for 4 years.<br /><br />Heres a song I did if youre interested:<br />[url=http://www.beardologyrecords.com/mp3s/Straying_The_Path.mp3]www.beardologyrecords.com...e_Path.mp3[/url][img]http://imagegen.last.fm/asimpleblue5/recenttracks/Mr12000.gif[/img]"
	},
	{
		"id": 20469,
		"title": "If you think...",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2006-08-06T12:43:04.000Z",
		"content": "I am still here just don't post.<br /><br />If you think THAT was crappy, heres what I made while I was still posting on pckf.<br /><br />[url=http://greenftechn.com/brandon/RSREMIX2.ogg]greenftechn.com/brandon/RSREMIX2.ogg[/url]<br /><br />Yes, it is an .ogg to you people who don't have the exstension, it is fairly easy to download.<br /><br /><br /><br />Check out my newly designed site! same link in my sig.<br />[url=http://greenftechn.com/brandon]greenftechn.com/brandon[/url]"
	},
	{
		"id": 20470,
		"title": "Re: If you think...",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-08-07T11:28:19.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]If I do more music (if I ever get new software) my sound will go to more harsh/noiseish direction.[hr][/quote]<br />What software are you using now?________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20471,
		"title": "Re: If you think...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-07T14:27:43.000Z",
		"content": "It's the freeware and ever so buggy Buzz tracker.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20472,
		"title": "Re: If you think...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-07T19:01:00.000Z",
		"content": "I'd love to try and make a few songs with Adlib Tracker 2 once I'm in MS-DOS and know how to use it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />But normally, I use Modplug Tracker. If you're so curious about my songs, go check my site.____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 20473,
		"title": "music",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-10-04T20:47:02.000Z",
		"content": "Interesting stuff. I've listened to \"calmmind\" and most of \"synthic\" so far, and there was one hard-to-describe section of \"calmmind\" that I particuarly liked. Edit: And \"licht\" contains some rather good distorted percussion/noise sounds.<br /><br />Perhaps I should try and write some electronic music. I've been meaning to for a while, but I've never really made much of an attempt. I still need to get around to recording my album... I have been recording some stuff lately, though.------------------<br />Nothing in particular"
	},
	{
		"id": 20474,
		"title": "Re: music",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-10-04T21:06:43.000Z",
		"content": "Listened to all of them now. I like the use of noise in the first track. You should definitely write more if you get a better tracking program.------------------<br />Nothing in particular"
	},
	{
		"id": 20475,
		"title": "Re: music",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-10-10T04:37:44.000Z",
		"content": "Too much noise and repetition. But its a good start."
	}
]
