[
	{
		"id": 149,
		"title": "Keen 3 moutain level, sealed off area",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-07-27T01:12:11.000Z",
		"content": "In the mountain level of Keen 3, which is a humungous, deadly maze, there is an exit at the bottom right corner of the level. However, I have mapped this entire level out by hand (before I discovered the online pics of all the levels of every Keen) and there is no way in. I don't suppose anyone has found a way in, has anyone (with or without cheats)? The small opening that leads to it is not tall enough for Keen to get through and I've tried blasting all around it with the raygun a lot.<br />And i do know about the exit you get to by going over the mountain... I've been playing Keen ever since I was, like, 8 or so.<br /><br />PS, I'm new to forums on the net and let me know if I do anything stupid or make an error. Sorry if this topic has been addressed before : /The Universe is Toast..."
	},
	{
		"id": 3780,
		"title": "Re: Keen 3 moutain level, sealed off area",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T01:14:25.000Z",
		"content": "I'll look into it, I was playing keen 3 this morning, and I don't play it very much and I found the above the mountain door. I'll look for your sealed off area.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3781,
		"title": "Re: Keen 3 moutain level, sealed off area",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T01:24:23.000Z",
		"content": "I found the small passageway that you mentioned and I saw the door in the bottom right corner. It had the four colored doors in front of it. I'm looking for an alternate route.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3782,
		"title": "Re: Keen 3 moutain level, sealed off area",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T02:01:06.000Z",
		"content": "It feels like a bug to me. There might be a patch that makes the tunnel at the bottom 1 tile bigger in that spot. Fortunately, there is the second entrance by jumping across the mountain so nobody really thinks about this much.<br /><br />I'll check the list of official patches I saw earlier.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3783,
		"title": "Re: Keen 3 moutain level, sealed off area",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T02:05:25.000Z",
		"content": "This was in the keen official games thread which is a sticky right above here.<br /><br />Keen 3<br />[url=http://www.spatang.com/dl.php?a=3keen131&b=orig]patch version 1.0 to 1.31[/url]<br /><br />I'll try it out, see if it works for the mountain level.<br />[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3784,
		"title": "Re: Keen 3 moutain level, sealed off area",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T02:15:19.000Z",
		"content": "apparently my version was already 1.3 or whatever, so I tried the revert to old version patch. same problem. there still might be a way since this is a \"challenging\" catacombs level, but I could open the file with keenedit (adurdin) made and edit the file myself.<br /><br />standby.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3785,
		"title": "what?",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-27T02:19:27.000Z",
		"content": "Good gravy, Alec... there's a button to Edit your old posts, rather than replying 4+ times in a row!<br /><br />That particular map in Keen3 is impossible to beat \"normally.\"  The correct way to do the map is to pogo up and left at the beginning, going outside the cave and over the top of the mountain.  There's even a sign in the SGA which says \"GO UP\" at the beginning of the level.  <br /><br />The rest of the level probably wasn't even beta-tested before release... the entire level set for Keen 3 was done in a single weekend.  :-\\"
	},
	{
		"id": 3786,
		"title": "I see",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-07-27T02:44:11.000Z",
		"content": "Yeah, I knew all about the alternative exit, the go up sign and everything else (except that the keen 3 levels were done in a week). That may definitely explain it; if there's one level that was not beta-tested, that would proly be it. Anyway, I was just wondering if there was a secret way to it, since I've never known the Keen games to have much unreachable secret stuff (though the LifeWater Oasis of Keen4 comes to mind - those lifewater flasks and water dropelts all along the underside of the lowest part of the level (yet those are still reachable with the cheats)).<br />ONE MORE THING. There is an area on the right side of the map that gets real close to the exit, right above it. From there you can see the exit and also a bunch of VortiNinja dolls above it. Notice that if you jump up on top of the exit, there will be no way to drop back down again! the only way to get some of those ninja dolls would be to jump up a little bit, just sticking your head above the exit and not your feet so you dont land on top of it (and then only if you can get there.)<br />If Tom Hall or whoever made the level purposefully set that trap, I dont see why they would purposefully close off the entrance to it. Then again, maybe the closed off the entrance to it because they didnt want that trap - though it would be easier to just remove a few blocks to allow u to drop down from it.<br /><br />Maybe they just wanted you to go through the whole maze, all that hard work only to realize that there is no way to get to its exit and make you mad or something.<br /><br />Who knows!<br /><br />[url=http://www.keengalaxy.com/index.php?option=com_zoom&Itemid=59&catid=3&PageNo=2]www.keengalaxy.com/index....3&amp;PageNo=2[/url]<br />that's a link to a map of the level (level 14). You can see all the places I was talking about on it. I don't know how to insert pics onto a post just yet, but it's kinda big anyway so...<br /><br />And thanx, all, for the help so farThe Universe is Toast..."
	},
	{
		"id": 3787,
		"title": "Re: I see",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T03:12:24.000Z",
		"content": "I've been trying all these stupid level editors to edit keen3 but when I save the map file, it just doesn't make any changes.<br /><br />This could take a bit but I will get this stupid easy problem fixed and I'll host it on my space so you can download the lone map file.<br /><br />Edit: This is it, you can hold your applause.<br />Edit 2: Actually, go down instead.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3788,
		"title": "ok",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-07-27T03:47:05.000Z",
		"content": "ok, just be sure to give me your site, alecswrld, cuz I, uh, dont know what it is. ^^;The Universe is Toast..."
	},
	{
		"id": 3789,
		"title": "Re: ok",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-27T09:37:41.000Z",
		"content": "Yeah, it seems like a bug, I don't think they would just trick the player big time. Or dunno.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 3790,
		"title": "Re: ok",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-07-27T10:19:08.000Z",
		"content": "LL: ROMFLOL, Keen 3 has teh bug!<br /><br />Tom: *miffed* Its not a big, its an oversight.<br /><br />LL: ROMFLOL A Big oversight!!<br /><br />Tom: Romero had a cold and sneezed on the screen, so sue me.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3791,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2005-07-27T12:10:50.000Z",
		"content": "There are sealed off areas like that in a few other Keen 3 levels as well. For example, here's a map I scribbled all over years ago:<br /><br />[img]http://img151.imageshack.us/img151/3479/keen3inaccessible6dj.jpg[/img]<br />(sorry for the poor quality, I'm trying to keep the file size down... I'm sure you all know where to find the real map anyway)<br /><br />The parts shaded white are the only parts of the building that are accessible. It seems unlikely that they would purposely make half of the level inaccessible - including those two ... 'point drops' over on the left.<br /><br />The different colours I think were to show separately sealed off areas - four of them."
	},
	{
		"id": 3792,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2005-07-27T12:22:54.000Z",
		"content": "... Make that five.<br /><br />As a sidenote... I seem to have lost the ability to edit my posts :/"
	},
	{
		"id": 3793,
		"title": "Re: re:",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T12:26:12.000Z",
		"content": "I've lost the ability to edit yowza's posts too. hmmmmmmm.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3794,
		"title": "...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-27T13:07:20.000Z",
		"content": "Yowza--sometimes EzBoard randomly logs you out after you make a post.  Check to be sure you're logged in, when you try to Edit."
	},
	{
		"id": 3795,
		"title": "Re: ...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-27T14:34:16.000Z",
		"content": "Also the secret level in keen 1 has an area that you can't enter (with a yorp thats stuck [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] )-Genius314"
	},
	{
		"id": 3796,
		"title": "Re: ...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-27T14:40:03.000Z",
		"content": "Hmmm, can't remember that.. Better check that out.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 3797,
		"title": "Keen 3 Remix",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T14:44:43.000Z",
		"content": "This is a new pack here for keen 3. It fixes things in level 8 and level 15. Level 8 is the big ugly map to the north of this post. It's a big level and I've tested most of it, but there still might be a couple of places that are unreachable that I'll fix.<br />For example, I think I saw these burgers enclosed in the stone tiles with no entry or exit at all, and it wasn't really blocking anything. I'll open up stuff like this when I can find it.<br /><br />Find more small errors in keen 3 levels! I'll edit this post when I can fix them. And read the .txt file before you play.<br /><br />Here it is:<br />[url=http://members.cox.net/aborlan/keen3remix.zip]Keen 3 Remix[/url]<br /><br />You won't see the level 15 only pack any more.<br /><br />Edit: Level 8 has been edited a little further. There was a group of rooms and a single room that were impossible to get too. Check the .txt file for more fulfilling details."
	},
	{
		"id": 3798,
		"title": "*grins*",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-27T14:49:15.000Z",
		"content": "Why not focus your efforts on a full-on Keen3 mod, Alec?  :-) They're much more fun..."
	},
	{
		"id": 3799,
		"title": "Re: *grins*",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T14:52:09.000Z",
		"content": "well for one, I haven't really discovered how to use to modkeen yet, but...<br /><br />The main reason is that I don't think anybody has played the \"real\" keen 3. And since there are these little problems I want to fix them up. [center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 3800,
		"title": "Re:",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-07-27T20:44:51.000Z",
		"content": "Yeah, I remember those other inaccessible places on those other levels mentioned. But like Xky said, the levels of Keen 3 were all done in a single weekend, which is kinda impressive and kinda not at the same time since there are well-designed levels and also sealed off areas too : /The Universe is Toast..."
	},
	{
		"id": 3801,
		"title": "Re: Re:",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T21:34:47.000Z",
		"content": "That's exactly why I'm editing these levels.[center][img]http://members.cox.net/aborlan/sig/sigpng.png[/img]<br />Crisp Grayscale Signature!<br />[/center]"
	},
	{
		"id": 3802,
		"title": "Re: Re:",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T23:00:47.000Z",
		"content": "Haha. Here's to bad level design.<br /><br />There's a suburb-building like level that has an underground tunnel. Just before the exit door is one of those one way green doors and a vortininja is right on the other side. Right next to the door is in an ankh. So you're actually getting 10 seconds of invulnerability just to shoot 4 shots through a door the enemy can't get through. Then you just make a couple of pogo jumps to get to the door. Really tough.[center][img]http://members.cox.net/aborlan/sig/sigpng.png[/img]<br />Crisp Grayscale Signature! 2152 bytes!<br />[/center]"
	},
	{
		"id": 3803,
		"title": "Re: Re:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-07-28T09:55:14.000Z",
		"content": "Right. Alec, be a smart alec and use the edit post button that appears on all the posts you make. This way you don't have to keep posting again and again, cluttering up the board. In general, you should let at least 2 other people post before posting again.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3804,
		"title": "Re: Re:",
		"author_id": 1486713,
		"author_name": "Eazyjay",
		"timestamp": "2005-08-21T23:09:23.000Z",
		"content": "You guys dont seem to get it. There's a reason why this mountain is called the <i>impossible</i> maze of the caves of <i>oblivion</i>. By reading that it should be clear that you have to find yourself another way trough, that's the clue, that's the puzzle...<br /><br />And Alex, you get ten seconds to pass that vortininja, so why bother shooting it? The point of that part of the level is so that smart ppl can get to save their bullets, and ppl that dont get it can critize the levelbuilder.  [img]http://img.villagephotos.com/p/2004-8/801878/Ezlogo2.jpg[/img]"
	},
	{
		"id": 3805,
		"title": "Re: Re:",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-08-27T17:45:30.000Z",
		"content": "Since there's an exit at the bottom of the level already, people might as well have the choice to go the long way or the short way. Some people don't want to breeze through a game.<br /><br />Save four bullets?!!! We should be punishing the player! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  [center][img]http://members.cox.net/aborlan/sig/sigpng.png[/img]<br />Crisp Grayscale Signature! 2152 bytes!<br />[/center]"
	}
]
