[
	{
		"id": 93,
		"title": "Liberate Commander Keen free episodes !!",
		"author_id": 1486895,
		"author_name": "PhiL6666",
		"timestamp": "2006-06-20T01:01:35.000Z",
		"content": "Many abandoware site refuse to put on their site episode 1, 3.5 and 4 even if they are completly free to be share..<br /><br />probably all of users here know that [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]    but here is a complete source:<br />[url=http://www.3drealms.com/tech/keen.html]www.3drealms.com/tech/keen.html[/url]<br /><br />the two site that refuse to change the status of those three game are:<br />[url=http://www.abandonia.com/main.php?nav=awlist]www.abandonia.com/main.php?nav=awlist[/url] <b>they made the change after i post this topic</b><br />[url=http://www.classic-gaming.net/]www.classic-gaming.net/[/url]<br /><br />so if you're passing by those sites, ask them why many episodes are still consider as protected and they are'nt. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 2947,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-20T08:26:00.000Z",
		"content": "I suppose the registered version of Keen 4 (or the others) would mean warez, but there barely is such a thing, it's just the shareware version again.<br />I agree when you say both sites are wrong in not wanting to let people download these games, at least for the wrong reason.<br /><br />From the second site:<br />[quote]<b><i>Quote:</i></b>[hr]The good old days of Shareware. Thanks to ID's generosity in releasing Keen 4 as Shareware, many people will remember the fun they had playing this game. I got it from a friend who assured me it was totally legal for me to have it as the software company gave it away anyway. So I didn't ask too many questions and took it home and spent a couple of weeks just trying to get to everywhere I could and get all the points.[hr][/quote]<br /><br />Hahaha, first he starts about how shareware is cool and id is generous, then he states he wasn't sure if playing \"somebody else's\" shareware copy was legal.<br />Either they just don't understand the shareware concept, or maybe they have a good reason I'm just not seeing.<br />Of course simply not wanting to supply shareware of these specific titles is a reason as well.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2948,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 1486895,
		"author_name": "PhiL6666",
		"timestamp": "2006-06-20T20:32:32.000Z",
		"content": "The best quote i could find is:<br />\"Episodes 1, 3.5, 4, and the three level demo for episode 6 are the only ones that you are legally allowed to upload and download anywhere. Episodes 2, 3, 5, and the full version of episode 6 are commercial software, and should not appear on the Internet or any other online service, or should otherwise be sold except for authorized sellers of the games.\"<br /><br />that policy about 1st episode being free is not rare at Apogee, you can also think about Duke Nukem 1, Duke Nukem 2, Secret Agent, many more ..."
	},
	{
		"id": 2949,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-20T21:29:30.000Z",
		"content": "Well, that quote you posted is a lot closer to the truth... actually the exact truth as far as I can see.<br />You didn't get it from CGN, did you?<br /><br />In the Keen 1 section there:<br />[quote]<b><i>Quote:</i></b>[hr]In the link you provide, it clearly says in the text that it's shareware--which is a helluva lot different than freeware.[hr][/quote]<br /><br />He is correct about that, it's shareware, but he is still ignorant about what shareware means.<br />Again, there are shareware and registered versions of CK1, KD, and CK4, but they are, for all intents and purposes, identical.<br />There's nothing wrong with hosting the shareware version.<br /><br />If anything, he is hurting 3DR's (and I think id still sells them as well) sales by disallowing people to download the shareware games and maybe be inspired to buy the rest as well.<br />He's might also be hurting the whole shareware concept by claiming it's not legal to download shareware.<br />Not sure about his opinion on the CK6 demo, but what does he think those things were made for in the first place?<br /><br />Of course they'll find copies of the shareware elsewhere anyway.<br />I'm sure people can find copies of the warez elsewhere as well, but what can you do.<br /><br />Anyway, feel free to point him here for a discussion; I'm not going to sign up there just to argue with him.<br />There is a near infinite amount of people I disagree with on the internet, way too many to spend a whole lot of time on.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2950,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-21T10:59:02.000Z",
		"content": "Eh. More Keen Yeahs!<br /><br />[Note, I like the Keen 1-3 shift+tab cheat]A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 2951,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 1485688,
		"author_name": "Litude",
		"timestamp": "2006-06-21T19:58:43.000Z",
		"content": "I think the freeware tag might be a bit misleading, at least for the Keen Dreams one considering that there's a (or two?) registered version so if the game was freeware I should be allowed to upload the registered one here, but I'm not.<br /><br />Just my two cents..."
	},
	{
		"id": 2952,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-22T19:04:50.000Z",
		"content": "If Keen Dreams was freeware (I'm pretty sure it's actually shareware as well), and the registered version is identical (it is), then it still matters which version you distribute.<br />It's not like you can properly check if those games really are identical under the hood.<br />Just check the copyright message(s) that come with the game, and do/don't what they say you can/can't; nothing more to it.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2953,
		"title": "Re: Liberate Commander Keen free episodes !!",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-06-25T22:19:07.000Z",
		"content": "Well that's strange then, because my version of Keen 5 (which was advertised as shareware when I bought it not long after it came out) doesn't say anything about being registered or \"please don't distribute\" - it even has ordering info telling you how to buy the other episodes of Keen.  Although to be fair it doesn't say anything about being shareware either, but it doesn't say you *can't* distribute it [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	}
]
