[
	{
		"id": 395,
		"title": "What do you want in a fangame?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-18T19:43:05.000Z",
		"content": "Ever since Modding started, everyone's been making levels, making graphics mods, and making patches for the original games.<br /><br />It seems that fangames are only made infrequently and often dropped before any serious production has begun.<br /><br /><br />So my question is this:  If someone were to make a fangame, what would you want out of <br /><br />For example (These are a few out of many possibilities):<br /><br />A. Good sprite graphics<br />B. Good storyline<br />C. Has to be programmed effectively, and no CK2000-style bugginess.<br />D. Has to have excellent scenery.<br />E. Must have good music and sound effects<br />F. Creativity with the Keen universe<br /><br />etc.. etc.<br /><br /><br />What would you guys want out of a fangame to make it worth downloading and making it worth that person's time creating?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11640,
		"title": "Re: What do you want in a fangame?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-07-18T20:15:26.000Z",
		"content": "Everything's fine by me as long as it still resembles a Keen game in gameplay, graphics and story. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 11641,
		"title": "Re: What do you want in a fangame?",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-07-19T01:52:49.000Z",
		"content": "it should do my laundry[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 11642,
		"title": "Re: What do you want in a fangame?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-07-19T02:03:17.000Z",
		"content": "Do you seperate blacks from whites?<br /><br />I don't sometimes because I get lazy.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 11643,
		"title": "Re: What do you want in a fangame?",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-07-19T04:28:10.000Z",
		"content": "Graphics make a lot of a keen game, closely followed by interesting programming stuff, and good plot twists.<br /><br />Thats my top 3 at least [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 11644,
		"title": "Re: What do you want in a fangame?",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-07-19T05:16:02.000Z",
		"content": "The #1 thing? It has to be <i>done</i>. After that, it needs to be basically playable. No massive glitches, and decent movement. Most fangames manage the second all right, but they don't usually get finished.<br /><br />I'll forgive a lot in a game as long as it exists and is playable. Standards are low at this point.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 11663,
		"title": "Re: What do you want in a fangame?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-07-19T15:24:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It should do my laundry [hr][/quote]<br /><br />For te love.... Cut it out, Xtraverse, these comments aren't funny anymore (and probably never were).-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 11645,
		"title": "Re: What do you want in a fangame?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-19T15:26:49.000Z",
		"content": "Gal --wtf are you talking about?<br />Xtra-- I now knight you Sir Spamalot.<br /><br /><br /><br />Okay, what about interesting and complex levels?<br /><br />I'm looking for specifics.  When you guys say \"Keenish graphics\", what do you mean specifically? Like, just so they look cartoony or that they are 2D retrographics, or could 3dish graphics styles like Issis or Holloween Harry work just as well?<br /><br />And story... Do you mean a humorous beginning story about his baby-sitter getting eaten by aliens, or him making a ship out of soup cans?  Or do you mean something else?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11646,
		"title": "ooh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-19T20:15:03.000Z",
		"content": "Most importantly, some interesting AI.  One of the reasons I've enjoyed Keen1-3 considerably more than 4-6 is because the Vorticons are such diverse, flexible enemies.  They jump, they follow, they're somewhat unpredictable.  Vorticon Elites are quicker and can shoot, and Vortininjas are downright terrifying.  There's really nothing in the later Keen games that's as dynamic and responsive.  <br /><br />Many of the fangames I've seen involve enemies moving along tracked paths, not even reacting to a player's presence.  That works great for robots (like the good old ButlerBot)... but if the fangame's got a Bloog in it, I want it to behave at least as well as a Bloog did in Keen6.  That is to say, it should change direction periodically, it should react to Keen's general presence, attempt to move towards him when possible, etc.<br /><br />One of the things I loathe more than anything in fangames is the \"enemy which can fire directly at you, at absurd angles which the player cannot replicate, who fires without changing their animation or giving any anticipatory warning that they are about to create a fast-moving projectile.\"  Seriously.  It's like a staple of a fangame... there has to be some enemy walking back and forth along a platform out of the player's reach, who, inexplicably, can create a bullet that travels across the entire game window in under 1 second, in a straight line towards the player, with no warning or mercy.  And then, since the fangame always respawns the player immediately, and the start point is typically in an extremely inconvenient location, the player will be blasted at least twice more before they realize what's going on.  <br /><br />Please do not have those enemies in your game.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />Part of the good AI should involve changed animations or visual cues to inform the player about what the enemy is trying to do... try to make enemies who are useful in a variety of situations, like Vorticons, rather than enemies who are limited in their scope and danger, the way Poison Slugs and Flects are.  <br /><br />Interesting level design can make the encounters with the enemies seem much more vivid, rather than the other way around.  You can have great levels with great enemies as a foundation.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif?ttinline=true\"/>"
	},
	{
		"id": 11647,
		"title": "Re: ooh",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-20T02:10:35.000Z",
		"content": "lol... I'm not making a fangame right now, just wondering what people like in them.<br /><br /><br />I mean, Fangames dropped off of the face of the earth after mods came about.<br /><br />I was just wondering what could make a fangame &gt;&gt; mod.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11648,
		"title": "Re: ooh",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-07-20T03:41:28.000Z",
		"content": "Well the great thing about mods is that they already have the Keenish controls, physics and AI, as well as a familiar and standard interface. No (complete) fangame so far has managed all of these things.<br /><br />The graphics are also a key ingredient. Because they tend to be of a higher resolution than the originals, it takes a lot more effort to create decent art. It's difficult to specify an exact recipe, but you know Keenish graphics when you see them.<br /><br />Ultimately, Keenishness is what is needed. Unfortunately, there is no specific formula--it's just down to experimentation."
	},
	{
		"id": 11649,
		"title": "Re: ooh",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-20T20:55:21.000Z",
		"content": "What about level design?<br /><br />What do you expect out of it?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11650,
		"title": "Hmm...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-21T03:29:12.000Z",
		"content": "I think a good part of what defines Keen from a level-design perspective is its sense of simplicity.  Levels are defined for what they are, and that's all that they are.  <br /><br />Each of the Guard Posts in Keen6 is designed as what is (mostly) a guard post.  It doesn't look like a cityscape, it doesn't look like a cave... it's very plain and well-defined.  I think that the levels which forget this (i.e. Bloogville, which doesn't really define itself as multiple buildings very well, to me) are easily forgotten.  When you think of Keen, (focussing on 6 for the purpose of this train of thought,) you recall specific locations and instances--the first taste of over-industrialized complexity in Bloogfoods; the horrific climb to the very top of Bloogton Tower; the depths of the Bloogdome; the bizarre ethereal cityscape on the satelite-based Bloog Management District.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  <br /><br />On a more specific note, the way the levels are put together contributes to this--there aren't many sharply-angled platforms in the caves... there aren't many subtle curves in the buildings... open areas tend to have arcs of points, while buildings have points lining the ceiling.  Elevator and transport placement is crucial in defining how 'civilized' or 'remote' a location feels.  Everything needs a purpose--even if the purpose is just to look cool or distract the player.<br /><br />I don't think I made any sense..."
	},
	{
		"id": 11651,
		"title": "Re: Hmm...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-21T15:27:44.000Z",
		"content": "Made perfect sense.... Anyone else have personal feelings on what a great fangames' levels should be like?<br /><br /><br />On a side note, you just gave me some great ideas.  =P~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11652,
		"title": "Re: Hmm...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-07-21T20:42:53.000Z",
		"content": "Oh cram it Djaser.  You want me to be serious?  I think it's pretty obvious what people want in a fangame, something that's fun, looks good, and original.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 11653,
		"title": "Re: Hmm...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-07-24T15:55:55.000Z",
		"content": "What you said are the bare basics to get a good fangame... Obviously he's asking about stuff and ideas from there on.____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 11654,
		"title": "...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-24T23:02:48.000Z",
		"content": "Who's the \"you\" that you're referring to in your post, DaVince21?  Many of the fangames released here in the past really didn't have any of the things we've discussed here...  I recall, in particular, a fangame that used no original graphics, ripping everything from existing games, except the enemies were all patrolling along paths, and the only real dangers were guns that shot directly at you, right through walls and floors.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>"
	},
	{
		"id": 11655,
		"title": "Re: ...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-07-25T15:16:52.000Z",
		"content": "I was talking to Xtraverse, who basically pointed out that a fangame should at least be fun, looks good, a polished and playable product. Which is pretty logical, if you ask me.<br /><br />EDIT: Now that I look at Globox's first post, he DOES seem to give some of these basic things as an example... Hmm. Ah well, whatever, eh?<br /><br /><br />Ok, so some of my stuff: alternative graphics are always nice, as long as the fit in the Keen world. High-res graphics is risky, but could give a good result, too. Some stuff is so damn familiar that it can actually get annoying, or it is not enough, like the limited amount of songs and enemies, so if you can I'd try to make a few more NEW Keen-style songs or enemies.____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 11656,
		"title": "hum",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-25T18:52:14.000Z",
		"content": "Hi-res sprites need more frames of animation to be convincing... It's always bothered me to see a game that runs at 800x600 but still tries to maintain a 4 frame run, or a static 'fall' animation.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  If you're going to make the sprites large enough that we could realistically see the clothing ripple from air resistance as the character falls, ANIMATE IT!  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif?ttinline=true\"/><br /><br />Personal gripe, I guess."
	},
	{
		"id": 11657,
		"title": "Re: hum",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-26T03:53:11.000Z",
		"content": "I think it would be wise to use a whole host of lesser known Keen songs and original cartoonish graphics.  I think Xky gave what I was looking for the most:<br /><br />Level design: It has to be simple, and yet effective/beautiful.  <br /><br />AI: The enemies have to be HARD.  They have to have their own minds, basically.<br /><br />Music: Has to be jazz-ish, up-beat, or techno-style dark feel.<br /><br />Sounds: Have to be 'keenish'.  In that they are retro-sounds and not some stupid \"Hey look, that sounds exactly like fire!\" type sounds, but more of a computerized<br /><br /><br />I think the key ingredient, that no one so far has mentioned is this:<br /><br />Creative canon-ness.  It has to be canon. But it has to gain that \"canon-ness\" through creative, albiet corny, storylines and graphics.  It has to feel genuine.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11658,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-26T19:06:30.000Z",
		"content": "The word is 'canon,' with one n.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  And that's a valid point--name choice matters a lot, too.  We've run across that in our discussion of mods in the past... name choice matters almost as much as graphical choice, sometimes <i>more</i> when it comes to modding."
	},
	{
		"id": 11659,
		"title": "Re: hehe",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-27T19:58:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Xky:<br /><br />And that's a valid point--name choice matters a lot, too. We've run across that in our discussion of mods in the past... name choice matters almost as much as graphical choice, sometimes more when it comes to modding.<br />[hr][/quote]<br /><br />I agree.  When I heard the name \"Keen: What's Next\" I wanted to die.  But after a bit, the sheer idiodicy of the name started to appeal to me.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shucks.gif[/img] ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 11660,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-28T17:56:07.000Z",
		"content": "Game titles don't matter so much with fangames and mods--so long as it's got \"Keen\" in the title, it's pretty clear it's a derivative work, based on the official titles.<br /><br />I was referring more to the names of enemies.  In a mod, since you're taking the <i>behaviors</i> for, say, a Yorp, but changing the graphics, it's important that this Yorp replacement have a name that is just as easy to remember, or memorable in some other way, so that players commenting on the mod don't simply say \"Your Yorp replacement looks great!\" or \"The new Yorp guys were so cute!\" ... <br /><br />Case in point, if you name your Yorp replacement the \"Garaboxifribbidibbilaramongulpollydoid,\" nobody is going to remember it, or they're going to butcher it horribly.  \"Your Garabears are adorable!\" and so on.  <br /><br />With a custom-built fangame, this isn't nearly so much of an issue, because chances are you're not going to have an enemy with a 2 frame left/right walk who hops occasionally, and pauses to look around with a 4 frame idle.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif?ttinline=true\"/> <br /><br />Edit: I just wanted to type Gara-box-uh-fribbuh-dibbuh-larra-mongul-polly-doid again.  It's fun to say out loud, too.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif?ttinline=true\"/><br /><i>As a somewhat related sidenote, Allstories, you're a 3dMM fan--d'you remember the \"Pokegays\" episode with the little egg guy with the freakishly long name?  That's kinda what I was getting at.</i>"
	},
	{
		"id": 11661,
		"title": "Re: well...",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-07-29T01:07:41.000Z",
		"content": "There is a topic on K:M about names [url=http://andy.durdin.net/keen/modding/viewtopic.php?t=794]here[/url]. <br /><br />the names DO tend to make a lot of game, but I prefer to concerntrate on the graphics and stuff before I get to the names. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 11662,
		"title": "Re: well...",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-07-29T21:36:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Allstories, you're a 3dMM fan--d'you remember the \"Pokegays\" episode with the little egg guy with the freakishly long name? That's kinda what I was getting at.[hr][/quote]<br /><br />Ahahaha, that movie is <i>old</i>. It was released before I even joined 3DMM. But yeah, the character's name was Garfunkdinkybinkmajamasacasarie.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	}
]
