[
	{
		"id": 101,
		"title": "Bloogton Manufacturing",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-05-19T18:51:09.000Z",
		"content": "Okay, so the second factory in Keen 6 (Blogton Manufacturing, I think?) has always baffled me to an extent.  I'm not sure that I've ever gotten the key located to the left of the entrance without cheating.  I can't imagine that they would make an item so essential to beating the game impossible to reach, but I just can't seem to hop over the green goo with that low ceiling.<br /><br />It's possible, right?  It's just some combination of jumping and/or pogoing in one fluid motion taking speed, distance, and timing into account, right?  Tell me that it's possible."
	},
	{
		"id": 3081,
		"title": "RE: Bloogton Manufacturing",
		"author_id": 1485688,
		"author_name": "Litude",
		"timestamp": "2006-05-19T19:09:25.000Z",
		"content": "I'm not completely sure if I know which key you are talking about, but if it's yellow then I probably know which one. You can't jump to get it, as you will need to activate a switch which you will find later on in the level. The switch will put one of those flying \"books\" (?) flying around that place. The yellow key is not needed either in the beginning of the level."
	},
	{
		"id": 3082,
		"title": "bah",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-05-19T19:35:48.000Z",
		"content": "Bloogton Mfg. is an exercise in \"fetch\" level design.  You begin at the bottom center of a very tall level, and have to climb your way to the top to turn on a switch that activates a platform.  Then, you return to the very bottom to use this platform and get the Yellow key.  Finally, you climb the entire tower a second time, using the Yellow key to open the door to the exit.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 3083,
		"title": "Re: bah",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-05-20T05:07:48.000Z",
		"content": "Ah, many thanks.  So the one, single time that I actually made it across while jumping was either a fluke of luck, or something from my fevered imagination."
	}
]
