[
	{
		"id": 981,
		"title": "Americans",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-10-11T02:19:56.000Z",
		"content": "as some americans on this board maby aware i have been posting anti-american message such as calling them the bustard's of war or human rights, etc, and also you saying that not of you are supporters of president bush, the fact is i met a lovely american woman on my trip to sydney &amp; she was actually quite nice &amp; because of this i have decided to no longer spread critisimis, i have also realized that some americans are really nice people no matter if they support bush or not, so please lemme apologize to any americans i may have offended<br /><br />i'm dead serious this time, i will stop it"
	},
	{
		"id": 23392,
		"title": "Re: Americans",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-10-11T05:16:50.000Z",
		"content": "Thank you. My respect for you has gone up.<br /><br />A lot.<br /><br />So can we finally be friends now? *Holds out hand*-----------------------<br />\"The Adventures of Commander Keen\" issue #1: [img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br />\"Fat people buy lots\""
	},
	{
		"id": 23393,
		"title": "Re: Americans",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-11T05:21:02.000Z",
		"content": "Heh, cool. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Yeah, not everyone is an 4sshole even if their politicians are.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 23394,
		"title": "Re: Americans",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-11T06:22:16.000Z",
		"content": "If that were true then there'd be nobody worthy of being on this board.<br /><br />I don't see Bush as a bastard, more like something pathetic needing pity.<br /><br />The whole world sucks, it can get so damn depressing at times. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23395,
		"title": "Re: Americans",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-11T09:30:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]i have also realized that some americans are really nice people no matter if they support bush or not, so please lemme apologize to any americans i may have offended[hr][/quote]<br /><br />FINALLY! You've realised that only politicians are bastards, not the wonderful people whom dwell the nations in which they reign. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stoned.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 23396,
		"title": "Re: Americans",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-11T10:30:16.000Z",
		"content": "He only said that SOME americans can be nice. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  At least this is what I can only agree with. Everyone being stupid is not a reason to hate them anyway. I think everybody is stupid in some way, including me, but differently.  I guess someone will say now that he/she is not, and \"[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img] \".<br /><br />The politicians are like our worst selves in every nation, it is a good measure for comparing people. And don't forget where was it that Bush won the erections (as the japanese prime minister once incidentally said)."
	},
	{
		"id": 23397,
		"title": "Yeah!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-11T12:08:34.000Z",
		"content": "Then you don't mind if I post this?<br /><br />Bush rocks!!!<br /><br />Muahahahahahahahaha; intimidation!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23398,
		"title": "Re: Americans",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-10-11T17:26:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]the fact is i met a lovely american woman on my trip to sydney &amp; she was actually quite nice &amp; because of this i have decided to no longer spread critisimis[hr][/quote]<br />We can pay agent Molly, she's done her job well. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  <br /><br />[quote]<b><i>Quote:</i></b>[hr]i have also realized that some americans are really nice people no matter if they support bush or not, so please lemme apologize to any americans i may have offended[hr][/quote]<br />Consider your apology accepted, and forgiveness offered.<br />You're welcome here anytime. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />You should realize that when it comes to our (US) politics and elections, very rarely do we get to choose somebody who we agree with on every single issue. Especially at the executive level (the President). So we have to choose out of those offered who we agree with on most issues, or who we think will move in the right direction in general. Kinda like trying to choose the person who will result in two steps forward, one back, instead of the opposite.<br /><br />I'm not suggesting we need more options, 'cause that results in a far worse problem. Namely that a vast majority of people may be split and therefore a small minority succeeds in what the majority absolutely didn't want. (Suppose 74% of the people would accept option 1, 2, or 3, but absolutely would never want option 4. But due to preferences on certain details, the 74% are split evenly among the first three. Now option 4 that 74% totally oppose gets chosen because 26% were united on that one. Yikes!)"
	},
	{
		"id": 23399,
		"title": "Re: Americans",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-11T18:24:51.000Z",
		"content": "Be careful Rorie, once you get rid of your preconceptions, you're on a slippery slope, before you know it, you'll actually start loving Americans if they get a president you agree with in the future.<br />But seriously 1 lone woman changed your views on a whole people?<br />Then again, a woman can do strange things to ones thoughts.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Suppose 74% of the people (...)[hr][/quote]<br /><br />Or suppose there are 2 popular choices, one of wich is really against everything you stand for, and the other is sort of OK.<br />You'd love to vote for a third option, but you know that won't do any good anyway, since no way on earth they'll win, so instead of with your heart you vote with your mind, and pick the \"sort of OK\" one, hoping at least the really bad one won't win if more people think like that.<br />It feels wrong, but you still do it... at least most people who thought about it will.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 23400,
		"title": "Re: Americans",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-11T18:48:51.000Z",
		"content": "So this is that great american democracy? I don't see why are they so proud of it [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img] <br /><br />Can I take Rorie's place now? Sorry [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-foot.gif[/img]"
	},
	{
		"id": 23401,
		"title": "Re: Americans",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-11T20:25:10.000Z",
		"content": "Yeah, it seems to be a lot what Retord8 said. Agree.. It isn't very good, definitely not good enough to make all the other countries take it.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 23402,
		"title": "Re: Americans",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-11T21:33:47.000Z",
		"content": "Also, its not good to judge a whole people by their president.  Many americans, such as myself, despise bush and think he is probably the worst president we have ever had.  But i have friends who are good people who support bush and they are good people... they are just ignorant. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />IMO"
	},
	{
		"id": 23403,
		"title": "Re: Americans",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-11T22:57:22.000Z",
		"content": "I find it truly amazing that you harbored such resentment for Americans.  Granted, I had to learn the same way with homosexuals, but it just goes to show how ignorant, untrustable, and close-minded culture and societies can be.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23404,
		"title": "Re: Americans",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-11T23:57:39.000Z",
		"content": "It seems that people often don't get over their prejudices until they actually get to know someone belonging to whatever group they dislike, at which point they realize, \"Hey, not all these guys are awful.\" Thank you Rorie, apology accepted.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23405,
		"title": "Re: Americans",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-12T01:37:54.000Z",
		"content": "I don't know.  I truly resent other countries for their feelings towards America.<br /><br />Not that I'm talking directly about Rorie, as I have nothing against him.  But in all honesty, America helped many smaller countries out during WWI and WWII.  America helped out Europe, the Filineans (sp?), and many others.<br /><br />I will admit that the USA is even worse in that sense, because we hate France; we did receive a great deal of help from them in the Revolutionary War.<br /><br />I suppose I hate bigotry in any form.  But hating a country for as seemlingly pointless reason (Such as the fact that America does not even decide when to go to war), is especially stupid IMO.<br /><br /><i>Edit: Again, I am never refering exactly to Rorie in any of this, but in general</i>~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23406,
		"title": "Re: Americans",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-12T01:50:37.000Z",
		"content": "haha<br /><br />there are many reasons that many countries hate us.<br /><br />We act as the bullies of the world.  If we dont like whats going on, we go and we change it.  We act as if we are better than everyone going around claiming to be \"the greatest country in the world\" and denying UN help and just breaking away.  We are stubborn and arrogant.  Also, we are seen as a Christian nation.  Muslims are still extremely angry at the Christians for the great injustice they did to them during the crusades.  This is another reason why extremist terrorist groups hate us."
	},
	{
		"id": 23407,
		"title": "Re: Americans",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-12T02:14:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]...America helped many smaller countries out during WWI and WWII. America helped out Europe, the Filineans (sp?), and many others.[hr][/quote] ...and they did that for the money, but had to declare war after Pearl Harbour.<br />But I guess this hatered is not directly because of the wars, but because the average american guy is different from us. People are not built to be tolerant, it's something what we have to learn. <br /><br />I have a half hungarian friend in the US, and she is not a bad person either, though she've lived almost all of her life there. Funny that she is always protecting the americans when we talk about them, but she tells them how stupid they are in a way (using another expression of course [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ), when she talks with her friends there.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Also, we are seen as a Christian nation. Muslims are still extremely angry at the Christians for the great injustice they did to them during the crusades. This is another reason why extremist terrorist groups hate us.[hr][/quote]You seem to be so naive in this. The terrorists, and those countries that are helping them hate america 'cos they think that the US takes away their oil and/or their wealth which they never had. What is sad is that american politicians (and some people too) think that anyone who has different opinion as them are terrorists too. Anyway, the main reason behind terrorism is poverty."
	},
	{
		"id": 23408,
		"title": "Re: Americans",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-12T06:22:42.000Z",
		"content": "Which is why so many suicide bombers are educated and moderately well off.<br /><br />Quite frankly I think terrorisim arises through bastards hijacking a cause for their own ends.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23410,
		"title": "Re: Americans",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-12T11:36:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It isn't very good, definitely not good enough to make all the other countries take it.[hr][/quote]<br /><br />Are you saying not all countries should use the voting system because of what was said right before?<br />Even though sometimes you need to (well, not \"need\") vote intelligently instead of using your gut like your instincts tell you to, that doesn't make it a bad system in my opinion.<br />Voting is probably still the fairest way of getting things to happen.<br /><br />Of course every now and again large groups of ignorant people vote something that's really not good, not even for themselves.<br />Sometimes a dictatorship would be better, as long as this person knows what he's doing, but I'd still much rather live in a democracy like I do now.<br /><br />Something weird (if you ask me) in America is the justice system though.<br />Instead of somebody who actually knows what he's talking about, judgement on somebody's actions, sometimes life is passed by a handful of random people, depending on how nice a presentation the offense and defense can give.<br />(Maybe I'm just not understanding the inner workings correctly of course, my knowledge comes from TV mostly. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   )Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 23411,
		"title": "Re: Americans",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-12T12:21:43.000Z",
		"content": "No, voting is good, I just meant the system with basically only two parties isn't good.. There should be more choice, like in here.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 23412,
		"title": "Re: Americans",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-12T12:33:52.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Anyway, the main reason behind terrorism is poverty.[hr][/quote]I admit this is not true for every one of them.<br /><br />I've seen many movies, documentaries etc. where americans said that they are so proud of their country. No system is perfect and there's no problem with that. It's only that I cannot understand people who are proud of it. It wasn't made by them, it is not working perfectly, not even better than other kind of democracy in many other countries.<br /><br />This has nothing to do with the actual people of the US. Some of them are nice while most of them are not, but this is how it works everywhere."
	},
	{
		"id": 23413,
		"title": "Re: Americans",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-12T16:28:00.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Funny that she is always protecting the americans when we talk about them, but she tells them how stupid they are in a way (using another expression of course [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]   ), when she talks with her friends there.[hr][/quote]<br />I've notices this in my school as well - people will badmouth the school constantly but will defend it immediately as soon as someone from outside or another school critisizes it.<br /><br />And looking at your sig:<br />[quote]<b><i>Quote:</i></b>[hr]I've changed a lot since my last time on this forum...[hr][/quote]<br />Somehow, I don't think you have changed greatly - you're just as strong a Christian and just as keen for an argument as you were before [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] [url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23414,
		"title": "Bush:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T03:33:42.000Z",
		"content": "Hey... bush isn't that bad; I may not perfer the war... but have any of you read about the Spanish-American war? The Philipeans, and Cuba are free countries because of us, and our declaration of war against those who dispise freedom.<br /><br />BTW - If you compare Bush to Kerry... Kerry just plain stunk;<br /><br />Kerry: \"I have a plan...\"<br />Reporter: \"And what is your plan Sen. Kerry?\"<br />Kerry: \"... Now Bush, on the other hand *states a bunch of things that are false, or just plain stupid*\"<br /><br />Oh... and the classic;<br /><br />Kerry: \"Bush gets all his money from his lumber company\"<br />Bush: \"I was not aware of this... want to buy some lumber?\" (He turned slander into a joke)<br /><br />Bush may not be the best choice... but compared to the other choices... Bush was like gold in the midst of the pig sty.<br /><br />I was only joking Riely<br /><br />And it was just <b><i>1</i></b> girl?<br /><br />wow...<br /><br />-- NAJAWA --"
	},
	{
		"id": 23415,
		"title": "Re: Bush:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-13T04:40:47.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]No, voting is good, I just meant the system with basically only two parties isn't good.. There should be more choice, like in here..[hr][/quote]<br /><br />A system where both parties had to cooperate rather than fight each other would be nice. Here in NZ the election was 50:50, so half the countries population will be ignored for the next 3 years!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Hey... bush isn't that bad[hr][/quote]<br /><br />It is well known that when cereal flakes are pored into a bowl of milk that they tend to cluster together in order to protect themselves from predators [you] They mysteriously seem to sense where other flakes are and huddle toward a common center. As they are cereals, this is known as the grain of common sense.<br /><br />It has been proven that when the Bush family is placed in a tub of milk they do not aggerate at all, proving that the entire family doesn't have a single grain of common sense.<br /><br />[Still, it could be a lot worse, but did it have to be this bad?]<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23416,
		"title": "Preditors:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T05:57:13.000Z",
		"content": "By preditors, would you mean the mouth... or the milk which slowly erodes at the helpless corn flakes, until their moral grows soggy?<br /><br />Hey... what would Kerry be then? I'd say he's lit Kerosine [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] .<br /><br />Poor corn cereal; now popcorn...<br /><br />-- NAJAWA --"
	},
	{
		"id": 23417,
		"title": "Re: Preditors:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-13T06:55:30.000Z",
		"content": "Personally, I doubt either Kerry or Bush was better than the other. The only reason you may think that one of the candidates is better is because they are campaining against the person who you believe is attacking your morals and values. As a result, you shutter out the bad things about said candidate and see them as far better than the opposition. If you look at their promises and past actions, you will notice that what they wish to acheive is almost identical.<br />[quote]<b><i>Quote:</i></b>[hr]Bush was like gold in the midst of the pig sty.[hr][/quote]<br />No... Bush is no better than any other politican. (I wouldn't say he's worse than any other politican either - the whole politics thing kind of eats away your soul)<br />[quote]<b><i>Quote:</i></b>[hr]*states a bunch of things that are false, or just plain stupid*[hr][/quote]<br />Welcome to politics, Naj. Find me a single politican who that paragraph could not apply to if the names were changed.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23418,
		"title": ":EVIL",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T12:11:00.000Z",
		"content": "Muahahaha!!!<br /><br />Well... I support Bush's values over Kerry's... becasuse:<br /><br />1) Democracy doesn't work, unless you vote<br />2) You got to find the polotition who won't flub up the most (We still don't know what Kerry's plan was!!!)<br /><br />-- NAJAWA --"
	},
	{
		"id": 23419,
		"title": "Re: :EVIL",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-13T12:30:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Welcome to politics, Naj. Find me a single politican who that paragraph could not apply to if the names were changed.[hr][/quote] <br /><br />We have plenty, however, the things they tend to say are along the lines of 'All asians pi$$ off!' and 'All asians,tourists and white people pi$$ off!' and 'Niggers out!' and my favourate 'I don't hate asians, as you know I'm part Maori, and Maori came from Taiwain, so how can you say I hate asians?'A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23420,
		"title": "Re: :EVIL",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-13T12:34:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Democracy doesn't work, unless you vote[hr][/quote]<br /><br />Uhm... yeah, pretty much.<br />If you don't vote, that's your own fault, so...<br />Not really sure what to say to that.<br />It's like saying you're against computer games as forms of entertainment because they won't entertain, unless you actually play them.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 23421,
		"title": "Dear Me...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-13T17:05:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]We have plenty, however, the things they tend to say are along the lines of 'All asians pi$$ off!' and 'All asians,tourists and white people pi$$ off!' and 'Niggers out!' and my favourate 'I don't hate asians, as you know I'm part Maori, and Maori came from Taiwain, so how can you say I hate asians?'[hr][/quote]<br />Over here, the [url=http://www.bnp.org.uk]BNP[/url]'s attitude is rather similar - \"We're not racist - we just don't think immigrants belong in this country\" is one of their rather excellent/sad statements (and almost a direct quote, too).[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23422,
		"title": "Re: Bush:",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-13T19:15:45.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Najawa said:</i><br />The Philipeans, and Cuba are free countries because of us, and our declaration of war against those who dispise freedom.[hr][/quote]<br />Hmm. . . What do you mean by \"free\"?  As I understand it, Cuba is just as much a Communist country as ever.  And what right does any country have to \"declare\" war on another because it [the other country] \"despises\" freedom? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  <br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />BTW - If you compare Bush to Kerry... Kerry just plain stunk[hr][/quote]<br />As Grafix pointed out, they're both just as bad."
	},
	{
		"id": 23423,
		"title": "Re: Bush:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-13T21:25:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And what right does any country have to \"declare\" war on another because it [the other country] \"despises\" freedom?[hr][/quote]<br />Very little - there are few worse ways of introducing democracy to a country than invading it. Besides, I hardly think they despise freedom - just the freedom of their people. (They want the freedom as government to do whatever the hell they want) Few democratic governments want their people to have freedom, either: why do you think they introduced those new anti-terrorism laws? I hardly think their primary motivation was protecting their own citizens.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23424,
		"title": "God Bless America",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-13T22:30:03.000Z",
		"content": "GMixer; you must not live in America then<br /><br />BTW - Some of my best friends are immigrants!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Very little - there are few worse ways of introducing democracy to a country than invading it.[hr][/quote]<br /><br />More like wiping out the oppresser;<br /><br />Let us pretend that the Iraqi people are a soda can. Sadam was a garbage compressor. America can't really free the soda can (long-term) unless it shuts down the garbage compresser.<br /><br />Oh... and we released Cuba from Spanish control; they choose comunism as a free-will act. The philipeans choose democracy, and thus is a triving nation.<br /><br />-- NAJAWA --"
	},
	{
		"id": 23425,
		"title": "Egad.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-14T00:00:28.000Z",
		"content": "The thing about freedom is that it infers the ability to give it away, which, seeming to take it for granted, is what these Western countries seem to be doing. All in the name of protecting themselves from and actively pursuing an <i>ideal</i>, not even a specific enemy.<br /><br />I'm just hoping common sense, rather than a police state scenario, yet prevails.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23426,
		"title": "Re: Egad.",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-14T00:07:21.000Z",
		"content": "Freedom is a good thing though it does not exists. Dictators who kill many people just because they had other ideas is a bad thing. \"Bad\" and \"good\" is what people understand. The problem I see is that the US gives \"freedom\" for a price, and never asks if the people wants it or not."
	},
	{
		"id": 23427,
		"title": "Re: Bush:",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-14T00:15:13.000Z",
		"content": "Ah, for once I'm not going off topic. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Grafix5000:</i><br />why do you think they introduced those new anti-terrorism laws? I hardly think their primary motivation was protecting their own citizens.[hr][/quote]<br />Excellent!  Of course they don't care for the citizens!  Why did they introduce the \"anti-terrorism\" laws?  So they can take better advantage of the citizens.  <br /><br />Here's a scenario:<br />Government:  Lessee, how can we gain more control over our citizens? . . . Aha!<br />[WTC is attacked by \"terrorists\" on 9/11]<br />Government:  Ah, now we need some anti-terrorist laws to protect you all!<br />[\"Anti-Terrorism\" laws introduded]<br />Government:  Hurrah, we got what we wanted:  more control! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br /><br />Simply put, the evidence indicates that the government attacked the WTC and the Pentagon themselves so they could take away more of the citizens' freedoms and also justify starting the current war.  Sneaky, huh?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />GMixer; you must not live in America then[hr][/quote]<br />Oh, why do say that?<br /><br />[quote]<b><i>Quote:</i></b>[hr]More like wiping out the oppresser;[hr][/quote]<br />Which the US, as far as I know, has no business doing.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Z-1 said:</i><br />The problem I see is that the US gives \"freedom\" for a price, and never asks if the people wants it or not.[hr][/quote]<br />Well said!"
	},
	{
		"id": 23428,
		"title": "Re: Bush:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-14T00:59:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Democracy doesn't work, unless you vote<br />-Najawa<br />[hr][/quote]<br />Actually, Democracy does not work.  Period.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />No, voting is good, I just meant the system with basically only two parties isn't good.. There should be more choice, like in here..=<br />[hr][/quote]<br />And here in lies the problem.  If you have 1 party, 2 parties, or even a thousand parties to chose from, then only the thousand gets represented properly.  In order to have anything accomplished, you must espouse yourself to one of the molds.<br /><br />As soon as this is done, you have right and left winged politics, which allows people to wallow in political ignorance.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Graffix5000: Somehow, I don't think you have changed greatly - you're just as strong a Christian and just as keen for an argument as you were before [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br />[hr][/quote]<br />\"It is better to keep one's mouth shut, and appear stupid than to open it and remove all doubt\" -Ben Franklin (not exact)<br /><br />I'll let you simmer in that thought before I get back to you on it.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23429,
		"title": "Re: Bush:",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-14T01:31:36.000Z",
		"content": "Nothing \"works\" in the sense of being perfect.  But, some things work better than other things.  Democracy works better than Facism, for example.  Among the various systems in use today, democracy is among the better.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23430,
		"title": "Re: Bite Me, Mainstream.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-14T02:10:34.000Z",
		"content": "[hr]<b>GMixer</b> Simply put, the evidence indicates that the government attacked the WTC and the Pentagon themselves so they could take away more of the citizens' freedoms and also justify starting the current war. Sneaky, huh?<br />[hr]Wow, someone who actually sees what's going on.<br /><br />[hr]<b>Xtra</b> Democracy works better than Facism, for example.<br />[hr]Today's so-called 'Democracy' is getting pretty damn close to Fascism.<br /><br />[url=http://www.red-ice.net/specialreports/2005/07jul/bankersmanifesto.html]Here's something for y'all to ponder.[/url]Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23431,
		"title": "Okay; wise guy:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-14T02:39:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Actually, Democracy does not work. Period.[hr][/quote]<br /><br />Okay... what <b>does</b> work?<br /><br />-- NAJAWA --"
	},
	{
		"id": 23432,
		"title": "Re: Okay; wise guy:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-14T02:57:44.000Z",
		"content": "this is now a political topic.<br /><br />See ya all later, and don't do drughs!<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23433,
		"title": "Quit Woozy:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-14T03:08:52.000Z",
		"content": "Okay!!! Okay!!! Let's smoke the peace pipe, and quite down!!!<br /><br />*Grabs Marijuana*<br /><br />Najawa: Hehehe; I don't like burrs, I think that's what we were talking about...<br /><br />Spleen *In a more sever condition*: No *[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] * I was going to carry you...<br /><br />Najawa: Piggy Back!!!<br /><br />GMixer *not much affected*:  *[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke.gif[/img] * Nope... politics.<br /><br />Slpeen; I don't like Wonka Bottle Caps... the grape soda flavor is discusting!!!<br /><br />LL: NO DRUGS!!!<br /><br />Harvey: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br /><br />Najawa: Here... Lovelord... or what ever your called, sir<br /><br />LL: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke.gif[/img]  *5 minutes later* [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br /><br />Spleen; I feel awesome!!!<br /><br />KR: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]  - Boy... I feel so good... I could delete this topic!!!<br /><br />KR: *deletes talking; keeners lose the Emoticon Marijuana*<br /><br />Naj: Darn!!! That was fun<br /><br /><br />See people!!! Now do you understand LL's point?<br /><br />-- NAJAWA --"
	},
	{
		"id": 23434,
		"title": "Re: Quit Woozy:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-14T05:35:13.000Z",
		"content": "\"Simply put, the evidence indicates that the government attacked the WTC and the Pentagon themselves so they could take away more of the citizens' freedoms and also justify starting the current war. Sneaky, huh?\"<br />Yeah. Quite a dirty trick.. I wonder when someone makes a movie of this. By the way, what about the plane attackers? Were they just some suiciders or were the planes controlled outside?[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 23435,
		"title": "Re: Quit Woozy:",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-14T10:39:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Okay... what does work?[hr][/quote]<br /><br />That <b>WAS</b> a rhetorical question, right? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 23437,
		"title": "Re: Okay; wise guy:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-14T14:59:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Okay... what does work?<br />[hr][/quote]<br /><br />In truth, nothing.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Nothing \"works\" in the sense of being perfect. But, some things work better than other things. Democracy works better than Facism, for example. Among the various systems in use today, democracy is among the better.<br />[hr][/quote]<br />I would have to agree that it is better than Fascism*, but I still disagree with democracy.  <br /><br />You might of noted that in the USA we have still enslaved Americans that came from Japanese decent after Pearl Harbor.  We also enslaved Africans for 300 years or so.  This was done because the majority felt it fit and appropriate.  This is why Democracy fails.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23438,
		"title": "Re: Okay; wise guy",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-14T15:07:11.000Z",
		"content": "What we have is not exactly democracy anymore. People now listen to the minorities too. Not too much, but still it's better then how it was before."
	},
	{
		"id": 23436,
		"title": "Re: Quit Woozy:",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-14T21:33:24.000Z",
		"content": "Uh. . . interesting dialog there, Najawa:  kinda funny, I guess. . . [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]<i>KeenRush:</i><br />By the way, what about the plane attackers? Were they just some suiciders or were the planes controlled outside?[hr][/quote]<br />It doesn't seem likely that they could get those \"terrorists\" to actually fly them like that. . .it <i>does</i> seem more likely that they were remote controled somehow.  [url=http://www.public-action.com/911/bumble.html]Here's[/url] an interesting suggestion. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 23409,
		"title": "Re: Americans",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-14T22:04:41.000Z",
		"content": "Quote: Z-1<br />[quote]<b><i>Quote:</i></b>[hr]You seem to be so naive in this. The terrorists, and those countries that are helping them hate america 'cos they think that the US takes away their oil and/or their wealth which they never had. What is sad is that american politicians (and some people too) think that anyone who has different opinion as them are terrorists too. Anyway, the main reason behind terrorism is poverty.[hr][/quote]<br /><br />I did not say it was the sole purpose, but i do believe it plays a factor.  I agree agree with the oil and wealth statement. They are on a Jihad with America, which is a religous war, so i think its safe to say religion plays a part."
	},
	{
		"id": 23439,
		"title": "Re: Bush:",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-14T22:24:16.000Z",
		"content": "najawa:<br />[quote]<b><i>Quote:</i></b>[hr]BTW - If you compare Bush to Kerry... Kerry just plain stunk;<br /><br />Kerry: \"I have a plan...\"<br />Reporter: \"And what is your plan Sen. Kerry?\"<br />Kerry: \"... Now Bush, on the other hand *states a bunch of things that are false, or just plain stupid*\"<br /><br />Oh... and the classic;<br /><br />Kerry: \"Bush gets all his money from his lumber company\"<br />Bush: \"I was not aware of this... want to buy some lumber?\" (He turned slander into a joke)<br /><br />Bush may not be the best choice... but compared to the other choices... Bush was like gold in the midst of the pig sty.[hr][/quote]<br /><br /><br />you have no idea how ignorant you really are and how bad i want to punch you.  did you even WATCH the debates? Kerry laid out his plan MANY times.  He said his plan was to find the terriorist (the ones who actually did something to our country) and kill them. then, wrap up in Iraq over a many month period and begin to slowly remove troops. That may take much longer, but the plan was clear.  Bush didnt have a plan at all.  The thing about the lumber company... Bush qualified for more money (or some sort of tax cut or something i cant remember the exact benifit) because he owned a self run business, when he sold some lumber.  It was proven that he actually did own a lubmer company and ive seen video clips of him chopping down trees.  Bush made it into a joke. he actually said \"I own a lumber company?\" which is a cheep way to get out of the fact that he really did have a very very small business. anndd AAHHHH just makes me mad.... i dont want to get in some political flame war here, so im going to stop but yeah... ignorance pisses me off... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 23440,
		"title": "Re: Bush:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-17T07:12:59.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>LoG</b> \"It is better to keep one's mouth shut, and appear stupid than to open it and remove all doubt\" -Ben Franklin (not exact)[hr][/quote]<br />If everyone followed that there wouldn't be much in the way of discussion, would there? Besides, I never said there was anything <i>wrong</i> with debating and arguing, or being Chrsitian for that matter. (I didn't think it, either)[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23441,
		"title": "Re: Bush:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-18T01:48:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />If everyone followed that there wouldn't be much in the way of discussion, would there? Besides, I never said there was anything wrong with debating and arguing, or being Chrsitian for that matter. (I didn't think it, either) <br />[hr][/quote]<br /><br />Am I Christian?<br /><br />I fully support homosexuality; I am utterly repulsed by nearly all churches; and I detest conservatives, for instance.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23442,
		"title": "Re: Bush:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-18T11:57:54.000Z",
		"content": "So?<br /><br />While not fully supporting homosexuality, that comment describes me too. Now bow down heathen!A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23443,
		"title": "Re: Bush:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-19T01:15:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />So?<br /><br />While not fully supporting homosexuality, that comment describes me too. Now bow down heathen! <br />A proud member of the signature stealing society<br />[hr][/quote]<br />Yet you thought about accepting pedophilia?  Seems rather odd to me, but to each his own line of thought.<br /><br />At any rate, the Bible speaks out against homosexuality, non-Christians, pro-slavery, sexist thoughts... All things I cannot stand for.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23444,
		"title": "Re: Bush:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-19T10:47:22.000Z",
		"content": "Yes, I thought about paedoeophillia. The bible itself does not expressly forbid it [nor say, masturbation] and I wanted to test it against my beliefs.<br /><br />Whats the point of believing in [purportedly] the most compassionate religion in the world if you can't exercise a little tolerance, inquiry and compassion now and then?<br /><br />[BTW Glo, your younger brother is *soo* hot.] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23445,
		"title": "Re: Bush:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-19T18:53:14.000Z",
		"content": "A. Who the hell is my younger brother?  I'm the youngest of my family.<br /><br />B. This is what trully irritates me about Christians:  As long as it's okay in your Bible, you can do it?  You see, you're walking around trusting another source to be correct (And more than likely for the sole reason that your parents told you it was correct).  Going by this logic, you can persecute homosexuals, non-Christians, promote slavery, and if you're Catholic, you can promote even more immoral acts.<br /><br />I could go on about how God has condoned sex outside of wedlock (Or atleast it apears as such), condones beating your slaves, condones killing homosexuals...  There's a long list of absolute crap that spews from the Bible.<br /><br />NOTE: I don't hate what Jesus says about life, I hate what everyone else in the Bible says about life.  Indeed, in order to be a true Christian (Being someone who wants to be like Christ), I would imagine you'd have to disregard almost all of the Bible.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23446,
		"title": "Odd Topic Change. . .",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-20T01:40:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />I could go on about how God has condoned sex outside of wedlock (Or atleast it apears as such), condones beating your slaves, condones killing homosexuals... There's a long list of absolute crap that spews from the Bible.[hr][/quote]<br />Could you list the Bible references?  (Just the ones you've specified there)<br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i>You see, you're walking around trusting another source to be correct <b>(And more than likely for the sole reason that your parents told you it was correct).</b>[hr][/quote]<br />Or maybe it could be because you yourself have done an in-depth study of what the Bible truly is about, and God has opened your eyes to the truth. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i>Going by this logic, you can persecute homosexuals, non-Christians, promote slavery, and if you're Catholic, you can promote even more <b>immoral acts.</b>[hr][/quote]<br />Oh, by the way, what moral standard is this?  If something is declared immoral, it seems as though there must be some moral standard by which to judge. . .[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 23447,
		"title": "hmm",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-10-20T04:21:00.000Z",
		"content": "Didn't the British church recently release some statement that parts of the Bible were not \"literally true\"?  <br /><br />The breakdown had a lot to do with political correctness--i.e. the parts of the bible which said woman was created from the rib of a man, and later that women were subservient to men, were stated to be untrue, but the whole virgin-birth thing, the burning bush on the hill and so on were all left as Biblical fact.<br /><br />Anyone know more about this?"
	},
	{
		"id": 23448,
		"title": "Re: hmm",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-20T10:49:28.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]A. Who the hell is my younger brother? I'm the youngest of my family.[hr][/quote]<br /><br />That was you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]This is what trully irritates me about Christians: As long as it's okay in your Bible, you can do it? You see, you're walking around trusting another source to be correct (And more than likely for the sole reason that your parents told you it was correct). Going by this logic, you can persecute homosexuals, non-Christians, promote slavery, and if you're Catholic, you can promote even more immoral acts.[hr][/quote]<br /><br />Many of us rely on other sources all the time to decide whats moral, either our own religion, or society at large. What is a belief system if it does not have predefined rules and limits? Solid, analtering christianity worries me though as beliefs are never <i>questioned,</i> that is the one gift we paid such a high price for, free will, why don't we use it?<br /><br />Frankly, I've never seen slavery or immoral acts endorsed, and I'm not sure on the gay persecution part either, just where is it anyways?<br /><br />Frankly, I think a lot of issues that arise occur because some parts of the bible [especially levidicous and exodus] were desigend to help a primitive, male dominated society survive. I do believe some country banned women wearing pants because of one bible verse which uses the example of a women trying to wear mens clothes as an illustrative example of 'don't try to be what you're not'<br /><br />Another problem is overinterpretation. You can only do this when your religion has great power over peole, like Cathloicisim and Islam today. The entire contraception thing is based on one single story, no commands or smiting, just one verse that was blown out of proportion. Idiots.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I could go on about how God has condoned sex outside of wedlock (Or atleast it apears as such), condones beating your slaves, condones killing homosexuals... There's a long list of absolute crap that spews from the Bible.[hr][/quote]<br /><br />I want to hear it, do go on.<br /><br />[quote]<b><i>Quote:</i></b>[hr]NOTE: I don't hate what Jesus says about life, I hate what everyone else in the Bible says about life. Indeed, in order to be a true Christian (Being someone who wants to be like Christ), I would imagine you'd have to disregard almost all of the Bible.[hr][/quote] <br /><br />Thats why they call it the new testament, did not jesus himself say that this was a new covenant? That all that which went before was null and void? Is that not why we are free to eat [unclean] pigs and such, or not bannish women from the camp when the menstruate? [Origionally I believe, hygene advice, it made sense for a band of travelling nomads.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Didn't the British church recently release some statement that parts of the Bible were not \"literally true\"?[hr][/quote] <br /><br />Various churches have at many times excused parts of the bible, such as the catholic church recanting the fact that communion wine turns into christs blood when you drink it. [Maybe the good lord was being symbolic for once? Gasp!]<br /><br />Basically they said that a large part of the stories, the holes in jesus hands, the miracles, you know, the unbelieveable stuff, a lot of that <i>might</i> not be true. It was a good attempt at Mac Religion, getting the most believers, irrespective of how much they believed. [You know, I think God warned about watering down the bible...]<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23449,
		"title": "Re: hmm",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-20T21:59:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />That was you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img] -LL<br />[hr][/quote]<br /><br />Seriously, where did you see me?  I don't live in your state and have never posted my picture on <i>any</i> forum.<br /><br /><br />On a final note, I'll start a new thread tomarrow with my verses, links to complete context, and my arguements against Christianity by and large.<br />~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23450,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-20T23:49:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]This is what trully irritates me about Christians: As long as it's okay in your Bible, you can do it? You see, you're walking around trusting another source to be correct (And more than likely for the sole reason that your parents told you it was correct). Going by this logic, you can persecute homosexuals, non-Christians, promote slavery, and if you're Catholic, you can promote even more immoral acts.[hr][/quote]<br /><br />Ah... that would be protostants; they have something Catholics do not have; Sacred Tradition.<br /><br />Did you know: The bible was not written for about 120 years after Christ's death? The whole bible was carried down towards us by word of mouth.<br /><br />A theological truth that Catholics beleive (taking advantage of Looglo's admiration of christ's teachings); Jesus told his disciples; \"I will be with you, even to the end of days.\"<br /><br />This means that christ will perserve the church. If you look back, you will find that all christian churches have their roots in the Catholic Church, and even the early church fathers called their church \"Catholic\".<br /><br />I really would like to see your 'crap': I can't wait to counter it... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] .<br /><br />[quote]<b><i>Quote:</i></b>[hr]Seriously, where did you see me? I don't live in your state and have never posted my picture on any forum.[hr][/quote]<br /><br />Gaa!!! Don't you get the joke?<br /><br />[quote]<b><i>Quote:</i></b>[hr]On a final note, I'll start a new thread tomarrow with my verses, links to complete context, and my arguements against Christianity by and large.[hr][/quote]<br /><br />And I shall win; for good always triumphs over evil in the end. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23451,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-21T07:10:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Ah... that would be protostants; they have something Catholics do not have; Sacred Tradition.[hr][/quote]<br />The Catholic Church teaches that there are two sources for its teachings: tradition and the bible, so I'm not sure what you meant by that.<br />[quote]<b><i>Quote:</i></b>[hr]Thats why they call it the new testament, did not jesus himself say that this was a new covenant? That all that which went before was null and void? Is that not why we are free to eat [unclean] pigs and such, or not bannish women from the camp when the menstruate?[hr][/quote]<br />I've always thought that was neat. Christians have this whole holy book, and most of it is rendered irrelevant by Jesus's coming. Yet somehow Christians still try to justify themselves with Old Testament verses. Do they apply anymore or not?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23452,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-21T08:35:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Seriously, where did you see me? I don't live in your state and have never posted my picture on any forum.[hr][/quote]<br /><br />On a chatroom, I'm not sure if it was you, your brothers were also present in it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Christians still try to justify themselves with Old Testament verses. Do they apply anymore or not?[hr][/quote]<br /><br />Heck no. After all, it gives advice for selling your daughter into slavery. Aside from the verses designed more as a guide to living in a primitive society [whic we definitely don't need now.] there is plenty of good advice for the taking. I'd prefer justification on several verses expressing a general principle, rather than a solitary specific verse.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23453,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-21T15:03:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Did you know: The bible was not written for about 120 years after Christ's death? The whole bible was carried down towards us by word of mouth.[hr][/quote]<br />You mean as a whole or as serperated books. In the last case you maybe correct, but most books even of the new testament where written before 100 A.D.<br /><br />[quote]<b><i>Quote:</i></b>[hr]This means that christ will perserve the church. If you look back, you will find that all christian churches have their roots in the Catholic Church, and even the early church fathers called their church \"Catholic\".[hr][/quote]<br />I dare to differ. In my opinion the Orthodox christians were really the first, after all it's the religion of the eastern Roman empire, the first christian nation in the world.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23454,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-21T20:01:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />This means that christ will perserve the church. If you look back, you will find that all christian churches have their roots in the Catholic Church, and even the early church fathers called their church -Najawa<br />[hr][/quote]<br />Nice to see you state things that can be backed up by historical fact. [sarcasm]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />And I shall win; for good always triumphs over evil in the end.  <br />[hr][/quote]<br /><br />I was actaully not going to post it, but after that ignorant comment...<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />On a chatroom, I'm not sure if it was you, your brothers were also present in it. LL<br />[hr][/quote]<br />...  After reading someone's post, I'll just assume people from other countries have really odd senses of humour.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23455,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-21T20:09:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />The whole bible was carried down towards us by word of mouth.[hr][/quote]<br />What do you mean by that?  Maybe I'm not understanding that correctly because there are numerous places where the New Testament refers to what is <i>written</i> in the Old Testament.<br /><br />Example:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Luke 4:16 (speaking of Jesus):</i><br />And He came to Nazareth, where He had been brought up: and, as His custom was, He went into the synagogue on the sabbath day, and stood up for to <b>read</b>.[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>lemur821:</i><br />Christians have this whole holy book, <b>and most of it is rendered irrelevant by Jesus's coming.</b>[hr][/quote]<br />What makes you say that?"
	},
	{
		"id": 23456,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-21T21:03:34.000Z",
		"content": "the bible is poetry.  its full of metaphor.  the problem with christianity today is that it's taken way to literally.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 23457,
		"title": "Re: Americans (Boy; we sure went off topic):",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-22T12:21:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And I shall win; for good always triumphs over evil in the end.[hr][/quote]<br />Of course. Never mind the fact that the above statement is incredibly nive - how would you go defining good and evil anyway? There is no situation where there is only one perception of what is good or evil.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23458,
		"title": "Americans (Right?)",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T18:31:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The Catholic Church teaches that there are two sources for its teachings: tradition and the bible, so I'm not sure what you meant by that.[hr][/quote]<br /><br />Protostants don't have Tradition, though, they just have the bible.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Of course. Never mind the fact that the above statement is incredibly nive - how would you go defining good and evil anyway? There is no situation where there is only one perception of what is good or evil. [hr][/quote]<br /><br />And thus nothing is certian!!! Ga!!! Truth exists... or my user name isn't Najawa!!! (Which, with a lack of absolute truth, that would be true [Ga; see; no truth is a contradiction of itself {\"There is no such thing as truth\" is a true statement!!!}])<br /><br />-- NAJAWA --"
	},
	{
		"id": 23459,
		"title": "Re: Americans (Right?)",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-22T19:42:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />And thus nothing is certian!!! Ga!!! Truth exists... or my user name isn't Najawa!!! (Which, with a lack of absolute truth, that would be true [Ga; see; no truth is a contradiction of itself {\"There is no such thing as truth\" is a true statement!!!}])<br />[hr][/quote]<br /><br />I sometimes wonder if the only reason people become Christians is because they can't determine right or wrong for themselves.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23460,
		"title": "Re: Americans (Right?)",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-22T19:58:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />I sometimes wonder if the only reason people become Christians is because they can't determine right or wrong for themselves.[hr][/quote]<br />Well, if everyone determined what was right and wrong for themselves (which perhaps a lot of people do), there could be a lot of trouble (which perhaps. . . there <i>is</i>).<br /><br />For instance, if there is no law against murder. . .<br />Let's see. . .  Suppose Najawa decided it was right to kill LordOfGloBox, even though LordOfGloBox decided it was not.  If Najawa had a way to kill LordOfGloBox--and he killed him--would it be right?  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 23461,
		"title": "Re: Americans (Right?)",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-22T20:01:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]    lemur821:<br />    Christians have this whole holy book, and most of it is rendered irrelevant by Jesus's coming.<br />[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]What makes you say that?[hr][/quote]<br />All that \"new covenant\" stuff.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Najawa:<br />Protostants don't have Tradition, though, they just have the bible.[hr][/quote]<br />Ah, I was confused when you said the exact opposite earlier.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23462,
		"title": "Grr...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T22:23:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, if everyone determined what was right and wrong for themselves (which perhaps a lot of people do), there could be a lot of trouble (which perhaps. . . there is).[hr][/quote]<br /><br />It would be wrong no matter how much I wanted him dead!!!<br /><br />Darn...<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-annoyed.gif[/img]:\"&gt; <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]  *tries to smile*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  *fails*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]  *tries to smile*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-bloody.gif[/img]  *fails miserably*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  *washes face*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]  *tries again*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23463,
		"title": "Re: Grr...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T12:47:52.000Z",
		"content": "LL: Oookay.<br /><br />LoGlo: LL! I've found God!<br /><br />God: Yes, I was completely lost, and then he found me and was good enough to give me directions to Belfast.<br /><br />Bush: Hey! Wasn't this about Americia?<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23464,
		"title": "Re: Grr...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T13:49:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />For instance, if there is no law against murder. . .<br />Let's see. . . Suppose Najawa decided it was right to kill LordOfGloBox, even though LordOfGloBox decided it was not. If Najawa had a way to kill LordOfGloBox--and he killed him--would it be right?  <br />[hr][/quote]<br /><br />Law and religion are two entirely seperate things.  The law protects people, religion is a way to find morals.<br /><br />I beleive in feeling conscience, not reading a book.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23465,
		"title": "Re: Grr...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T14:40:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]For instance, if there is no law against murder. . .<br />Let's see. . . Suppose Najawa decided it was right to kill LordOfGloBox, even though LordOfGloBox decided it was not. If Najawa had a way to kill LordOfGloBox--and he killed him--would it be right?[hr][/quote]<br /><br />By our laws Najawa is in the wrong. By Glo's morals, he is also wrong. By some other laws and morals, Najawa is right. Remember, all Hitler did was legal and moral in a good part of Nazi Germany.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I beleive in feeling conscience, not reading a book.[hr][/quote] <br /><br />But if you'd never read, how would that impact the decisions you make when your consience feels?<br /><br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23466,
		"title": "Re: Grr...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T23:28:28.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] But if you'd never read, how would that impact the decisions you make when your consience feels?<br />[hr][/quote]<br /><br />So only people who read the Bible have consciences?  That's rich, because I seem to remember feeling bad about things long before I was old enough to read the Bible.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23467,
		"title": "Re: Grr...",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-24T00:47:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>LordOfGloBox:</i><br />The law protects people, religion is a way to find morals.[hr][/quote]<br />Hmm. . . Ok, even if there is a law against murder, how did it protect LordOfGloBox from being murdered by Najawa? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Najawa:</i><br />It would be wrong no matter how much I wanted him dead!!![hr][/quote]<br />Najawa's <i>morals</i> keep him from killing LordOfGloBox, not the law."
	},
	{
		"id": 23468,
		"title": "Re: Grr...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-24T02:22:31.000Z",
		"content": "I feel a lot more comfortable with deciding on a set of morals myself than letting a religion decide them for me.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23469,
		"title": "Re: Grr...",
		"author_id": 1485567,
		"author_name": "GMixer",
		"timestamp": "2005-10-24T03:22:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Xtraverse:</i><br />I feel a lot more comfortable with deciding on a set of morals myself than letting a religion decide them for me.[hr][/quote]<br />That's great, but if everyone decides their own set of morals, whose to say which one is the \"best\"?  Maybe my morals allow me to steal your car, so for me, it's fine:  no one can punish me for it because my morals are just as good as anyone else's; we can all decide for ourselves what is right and what is wrong.<br /><br />What could happen then is, whoever is bigger and meaner than everyone else gets to make up the rules:  his morals are what everyone must follow (to some extent) because he's big enough to enforce them.  In other words, there is no absolute authority.  Very interesting [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 23470,
		"title": "Re: Grr...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-24T05:14:55.000Z",
		"content": "I didn't say that everyone should act on their own set of morals, although what you proposed is in essence what happens in our world.<br /><br />A society's institutions reflect the values of that society.  For example, in Greece most drugs are not restricted very harshly, however they have very severe laws against hash.  This is because much of Greece has a historical ill will with Turkey, and hash over there is considered largely a Turkish drug.<br /><br />In a society that is set up properly, the values (that the laws and institutions reflect) would be those that are held by the collective majority.  However, in anarchy or a fascist government, whoever is \"bigger and meaner\" and takes control would be able to make all of the decisions regarding morality.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23471,
		"title": "Re: Grr...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-24T10:02:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]So only people who read the Bible have consciences? That's rich, because I seem to remember feeling bad about things long before I was old enough to read the Bible.[hr][/quote] <br /><br />What the hell are you talking about? How in Gods Earth did you get that out of my comments? For chrissake, there are actually other books beside the Bible you know. All I was saying is that if you had never read anything about morals, laws, standards, what would you be? How has what you've read [from any source, just to repeat, not only the bible, TV too.] changed your perceptions? Have you ever read something and said 'Oh, I never looked at that in that way, thats something to think about'?<br /><br />[quote]<b><i>Quote:</i></b>[hr] Ok, even if there is a law against murder, how did it protect LordOfGloBox from b<br />eing murdered by Najawa[hr][/quote]<br /><br />It doesn't. Laws are, in truth widely accepted standards that people are either expected to obey, or be perseuded to by the consequences that follow.<br /><br />What protects Glo is the fact that Naj knows he will face consequences if he comits murder. A good deal of protection is also provided by Naj's personal morals, which tell him murder is wrong. If you think murder is right, laws are much less effective.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I feel a lot more comfortable with deciding on a set of morals myself than letting a religion decide them for me.[hr][/quote] <br /><br />Perhaps. What morals do you dislike religion dictating to you? Where are the conflicts? I always try to work out these conflicts, a philospohy that has worked for me for 10 years.<br /><br />Quite frankly, I'd like to quote the late Reverend Burnside: 'To hell with morals and the preachers of the chains of control be dammed! When every man does what he knows is right then we will have no church, God will be in the streets.'<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23472,
		"title": "I likey quote.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-24T13:30:21.000Z",
		"content": "[hr]<b>LevelLord</b> Quite frankly, I'd like to quote the late Reverend Burnside: 'To hell with morals and the preachers of the chains of control be dammed! When every man does what he knows is right then we will have no church, God will be in the streets.'<br />[hr]Amen to that.<br /><br />As far as I can see there are no absolutes when it comes to morality. However, there are benefits for doing what you know is right, rather than what you think will get you what you want. We bring about our own undoing when we set in motion schemes to bring down our fellow humans in the name of our own insecurities.<br /><br />Let me offer another way of looking at right and wrong, just and unjust. One of the most fundamental things most self-help and spiritual teachers will tell you is that we are each responsible for our own reality, that our thoughts bring to us the events and circumstances of our lives.<br /><br />This poses more questions than it answers, though. Why are some born better off than others if the playing ground is so even? The most suitable explanation I can offer is that we, as our souls, rather than the shells we inhabit, determine what happens in our lives. In our current state, these decisions are made unconsciously for the most part, and thus very indirectly and haphazardly.<br /><br />I have earned a fair degree of control over my reality to date, and having seen what thought is capable of I firmly believe in that we are indeed fully responsible for our lives.<br /><br />I do not have anything more, as far as personal experience goes, than a string of encounters with what may or may not be spirits of those who have gone before (and some who claim not to have) to go on as to whether or not there is anything at all after death, let alone reincarnation. Nonetheless, the foregoing conclusion infers this, or something very similar, must be how it works.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23473,
		"title": "Re: I likey quote.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T02:44:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I feel a lot more comfortable with deciding on a set of morals myself than letting a religion decide them for me. [hr][/quote]<br /><br />Well... in that case:<br /><br />LL: I think that blowing down empty buildings (that do not belong 2 you) is not morally wrong, as long as there is nobody in them<br /><br />Harvey: I think that blowing down buildings is only morally acceptable if there are people in them<br /><br />Spleen: I think that blowing down buildings, even if there are people in them is morally acceptable<br /><br />Unfleexable: I think that blowing down a building if; 1) There are more that 40 people 2) They can't susspect it 3) The bomb blows up other buildins as well<br /><br />They may all have picked their morals... but are they right?<br /><br />Najawa: Blowing down buildings is only morrally acceptable if you own the building, and the rights to explode the building, and there are no people in the building.<br /><br />-- NAJAWA --"
	},
	{
		"id": 23474,
		"title": "Re: I likey quote.",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-10-26T02:49:58.000Z",
		"content": "for those americans who have read this thread<br />thank you for being so understanding<br /><br />i admit i was out of line on the subject of americans who support bush, i will try to assure that this racist abuse will not happen again, i'm not saying i hate america anymore it's just i don't think i will be travelling there, american has too many problems, iraq, gun control, crime etc."
	},
	{
		"id": 23475,
		"title": "The county:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T03:55:18.000Z",
		"content": "America; as a county, is a pretty nice place.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Iraq, gun control, crime etc. [hr][/quote]<br /><br />Very minor problems. I have never been robbed, and I live here!!! I have never seen an actuall gun, exept in a museum.<br /><br />No problems here. Come visit sometime.<br /><br />-- NAJAWA --"
	},
	{
		"id": 23476,
		"title": "Re: The county:",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-10-26T04:28:32.000Z",
		"content": "i respect you americans at least now i do<br /><br />but the reality is that i am staying well clear of the united states, i don't agree with the american political system"
	},
	{
		"id": 23477,
		"title": "Re: The county:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T04:35:51.000Z",
		"content": "Okay... suit yourself...<br /><br />But boy... how I would very much like you to try Wisconson Cheese in WI!!!<br /><br />Even out of state, cheese tastes aful compared to WI!!!<br /><br />I'd hate to think of it all the way in Australia!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23478,
		"title": "Re: The county:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-26T10:19:30.000Z",
		"content": "Actually, Oz makes some of the worlds best chese.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23479,
		"title": "Re: Grr...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-26T22:29:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />What the hell are you talking about? How in Gods Earth did you get that out of my comments? For chrissake, there are actually other books beside the Bible you know. All I was saying is that if you had never read anything about morals, laws, standards, what would you be? How has what you've read [from any source, just to repeat, not only the bible, TV too.] changed your perceptions? Have you ever read something and said 'Oh, I never looked at that in that way, thats something to think about'? LL<br />[hr][/quote]<br /><br />I dunno, maybe from THIS:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />But if you'd never read, how would that impact the decisions you make when your consience feels?<br />[hr][/quote]<br /><br /><br />At any rate, I agree.  My point is this: When we are born, we have none of societies prejudices, but as we go on we acquire them to fit in, but at times society also shows us how wrong those prejudices are.  The only time we break away from those morals is by using our consciences -- not a book, a movie, or a CD.  They are only the medium that makes our conscience think.<br /><br /><br />'To hell with morals and the preachers of the chains of control be dammed! When every man does what he knows is right then we will have no church, God will be in the streets.'<br /><br />Amen!~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23480,
		"title": "Re: Grr...",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-11-07T23:32:29.000Z",
		"content": "i have decided to soften my policy on america ever more<br /><br />i will probally visit once bush is removed from power after all i have always wanted to goto a star trek convention &amp; most of them happen over there"
	},
	{
		"id": 23481,
		"title": "Re: Grr...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-08T02:42:23.000Z",
		"content": "You're a trekkie?<br /><br />Gosh, and here I was thinking you were a harmless Keen fan. I didn't know you swung that way.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23482,
		"title": "Re: Grr...",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-11-08T03:00:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You're a trekkie?[hr][/quote]<br /><br />yep &amp; damn proud one"
	},
	{
		"id": 23483,
		"title": "Re: Grr...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-08T20:38:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />yep &amp; damn proud one <br />[hr][/quote]<br /><br />I'm sorry.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23484,
		"title": "Re: Grr...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-08T21:32:09.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Hmmm, this is a new fact for me too, but I'm not shocked or surprised.<b>Eat your veggies!</b>"
	},
	{
		"id": 23485,
		"title": "Re: Grr...",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-11-09T08:27:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Globox:</b> I'm sorry.[hr][/quote]<br />For what?--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 23486,
		"title": "Re: Grr...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-09T11:27:11.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Hmmm, this is a new fact for me too, but I'm not shocked or surprised.[hr][/quote] <br /><br />Well, in retrospect, me neither. ST is an Americians ideal Americia; it is what liberals stand for, a woman in charge, blacks in the crew, as well as the disabled, a harmonious blending of cultures and creeds, which nonetheless are predominantly white, speak english and relatively well off.<br /><br />And of course they spread peace, even if they have to do it at phaserpoint [Which they don't want to, being freedom lovers and all, but it just seems that everyone wants to blow them up, so they have to go to war with all these people.]A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23487,
		"title": "Re: Grr...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-10T05:51:37.000Z",
		"content": "Woopie!!! Just call ahead, and my mom will bake cookies!!!<br /><br />(No rough language around the lil' tikes though, they'll repeate everything they here; \"Dan you!!!\") [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://www.najawa.com/LLMod.jpeg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	}
]
