[
	{
		"id": 1063,
		"title": "These topics are unknown and need to be destroyed.",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-25T21:04:30.000Z",
		"content": "I think we need to delete the topics that are missing the dozens of comments that were made in them.<br /><br />Better yet, we could just delete everything but the starting comment (which seems to have elevated importance and wasn't destroyed), and then we can have a big deja vu moment as we look at the topics, AGAIN.<br /><br />Wejedyathhakagishhh...?<br />I mean what do you think?<br />[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 24700,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-25T21:58:30.000Z",
		"content": "They might still come back. Then again, it IS EZboard. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img] -Genius314"
	},
	{
		"id": 24701,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T00:13:49.000Z",
		"content": "come back... hehe... haha... waaahaahaahaa!!!!!!!!!!!! fat chance!!!!!!  waaahaahaahaa!!!!!!<br /><br />Needless to say, I wouldn't expect it.<br />It's not like they would keep hard backup copies of every forum, unless they do for some parts. For instance we know the amount of posts that's ever been posted in each forum, and we know the first message of most old posts that you see.<br /><br />Since I wasn't here when the ezboard attack happened, were there any recent posts that got saved? Or was it blank slate?<br /><br />Either way we still have a load of crap all over the forum, and someone's gotta pick it up. *coughadminsneeze*[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 24702,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-07-26T01:59:18.000Z",
		"content": "agreed it is very annoying when you start to read a thread &amp; see an unknown postings, i agree with alecswrld about this, why can't we delete these topics or even better move this board to a phpbb on a different server so hopefully it won't happen again[url=http://www.dosvault.tk][img]http://venus.walagata.com/w/thedosvault/sig/tdv_banner.jpg[/img][/url]<br /><br /><b>WIPE OUT BUSH! WIPE OUT HOWARD!</b>"
	},
	{
		"id": 24703,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T03:26:31.000Z",
		"content": "I don't really know if the server itself is the problem. Any boards can be attacked. And when you think about it, there's a lot less old, molding posts around gathering dust and being thrust to the top after years.<br /><br />However we do need to delete these unknown posts, because they're cluttering the board and when people look at older posts (those are the old posts now) they won't have to browse around  for topics that aren't \"unknown\".[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 24704,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-26T14:16:30.000Z",
		"content": "\"Any boards can be attacked.\"<br /><br />Yes, but people are more likely to attack a more popular board, not just small ones. And its also EZboard.-Genius314"
	},
	{
		"id": 24705,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-26T14:50:53.000Z",
		"content": "Well, they don't bother me, and since this board is going to switch sometime in the future....<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24706,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T16:22:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]this board is going to switch sometime in the future....[hr][/quote]<br /><br />Well, in that case, it really doesn't matter. What board are we planning to switch to and when?[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 24707,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-26T16:41:09.000Z",
		"content": "phpBB (on spatang maybe?) and some time in autumn.-Genius314"
	},
	{
		"id": 24708,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-07-26T17:32:17.000Z",
		"content": "1. Who cares?<br />2. Who wants to delete <b>ALL</b> unknown post. I certainly wouldn't if I was a mod or admin.<br /><br />So it's not going to happen.-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 24709,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-26T17:47:21.000Z",
		"content": "To #2; at least I wouldn't. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />\"Well, in that case, it really doesn't matter. What board are we planning to switch to and when?\"<br />Yeah, I guess it's pretty much what Genius314 said. This is what most probably'll happen.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24710,
		"title": "Re: These topics are unknown and need to be destroyed.",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T20:08:34.000Z",
		"content": "phpBB looks a lot better than ezboard.<br />is it more secure?[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 24711,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-26T20:25:20.000Z",
		"content": "I don't know how much EzBoard's security has changed in the past 6 years, but there was a Sonic the Hedgehog fan-board I was a part of, on EzBoard, about that long ago... and the whole thing went to hell basically because of the signatures.  It started similar to what we've got here--big, animated images.  But somewhere along the line, it went to flash, embedded sounds, and down to raw HTML being used in the signatures.  HTML which did stuff like open new windows, re-direct whoever opened any page with the signature, closed browsers, open infinite-loop stuff, etc.  It was really ugly.  Not to mention the table-breaking images, random &lt;BR&gt; and &lt;HR&gt;'s added everywhere... basically the whole board started to look like a broken php script...except this was right when php was first becoming mainstream.  <br /><br />Either way, the community moved to a few different bulliten boards, and eventually settled on, I believe, vBulliten.  But by that time, the malicious members had already had their fun, and weren't so keen on hacking.  But really, I believe that a dedicated hacker could bruise just about any message board out there, just because of the way they're built.  But I'd also say that EzBoard is probably the easiest to break.  :-P"
	},
	{
		"id": 24712,
		"title": "Well...",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-07-26T22:08:55.000Z",
		"content": "I recall reading ezboard being finished with their \"backup\" stuff.<br />Of course they didn't have any real backups, or they did, until the hacker deleted those as well.<br />I'd like to really dislike ezboard for that, letting themselves be hacked so easily...<br />But they said they had a suspect, a former employee who knew the right passwords, and apparently had some kind of grudge.<br />I'd personally much rather believe in common decency in my fellow humans as well, so I can't really hold if against them if they don't change passwords everytime somebody stops working there.<br /><br />Anyway, all backups come from low level memory dumps, meaning hard work, also meaning only a fraction of everything will be retrievable.<br />At least, that's what I recall reading, and even then it's a subjective view of the matter.<br />There are quite a bunch of other reasons for me to dislike ezboard, or at least the (lack of) features related to those reasons.<br /><br />Uhm, my point being...<br />I don't think we'll be seeing any more missing posts return, this is it.<br />(Probably still a good idea to double check before deleting everything.)Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	}
]
