[
	{
		"id": 248,
		"title": "Community Project",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-02-08T20:28:19.000Z",
		"content": "We need something to increase activity. How about a project?<br />Post ideas for what it could be here.<br /><br /><br />My idea was to remake the Keen games with extra mini games and awards to win, and extra levels and stuff. We could use Z-1's engine, and submit remade graphics.<br /><br />My other idea was to make a community Keen RPG. This'll be harder because we don't have an engine for it.<br /><br />Other ideas are accepted, but only one will be chosen.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 6702,
		"title": "Re: Community Project",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-02-08T21:56:43.000Z",
		"content": "Why we need to increase the activity? I mean if there were people with good programming/graphical skills and with enough free time, there will be activity. If there isn't activity here, then this means that no one who can code got time for that.<br /><br />As for ideas, I have some for episode 7 in the original style of CK series for a long time, but who cares .. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img]  ----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 6703,
		"title": "Re: Community Project",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-02-09T00:29:09.000Z",
		"content": "Its not that our community doesn't have the means, its just that we don't have the *time*<br /><br />Just look at what TMST's done, with all his spare time [Well, that left over from entertaining female fans in his room]<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6704,
		"title": "Re: Community Project",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-02-10T11:02:43.000Z",
		"content": "Yeah.. Most of people just don't have the time. Some that have time can't just get anything done no matter how they try (me). Some have time but they have no skills. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
