[
	{
		"id": 769,
		"title": "Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-10T00:56:25.000Z",
		"content": "What do you think about posting some information about the computers you used/are using for playing Keen on? For example, the specs, operating system(s), desktop screenshots, photos, etc. Just an idea, since I haven't seen this kind of topic here before.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 19998,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-10T02:08:11.000Z",
		"content": "I'm pretty sure we've had topics like this before, but another one can't hurt.<br /><br />Right now I'm using DOSbox on my fairly new Linux laptop, but I recently purchased an older machine ($60 for a dual 200 MHz machine with hot-swappable SCSI drives -- I remember spending thousands for much less) I've got DOS and Linux on it, but I haven't gotten around to installing Keen yet. I'm still having trouble getting digital audio to work on my SB16, and I'm starting to think the card itself may be to blame. Perhaps a new one is in order.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19999,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-10T23:09:24.000Z",
		"content": "Wow, we've got a dual P200 at work with a couple of 4.3GB hotswap SCSI drives and a tape drive, and I can't give it away...I'm just waiting for the next skip/dumpster to appear outside and then in it goes [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 20000,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-12T02:16:49.000Z",
		"content": "Well send 'er my way!<br /><br />Kidding, of course. That computer could never swim to America.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20001,
		"title": "Re: Your Keen-o-matics",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-12-12T04:59:42.000Z",
		"content": "I killed the motherboard of my previous Dual-P200 (which I'd upgraded to Dual-Celeron 500). Unfortunately it was also the only machine I had with SCSI ports so I actually had to borrow a computer from my cousin to get the data off (hmm... that's been barely half-done for at least a month now, should probably finish it sometime).<br /><br />I'd take that critter off your hands if it wasn't for the awkward geography. Shipping costs negate the value of remotely acquiring old machinery."
	},
	{
		"id": 20002,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-12T13:11:44.000Z",
		"content": "Yeah it is a bit of a beast (full AT tower) so shipping probably would be a bit expensive - I did get a 19\" monitor shipped interstate (which weighs about the same) for $25 but I don't think most couriers would do it that cheaply.<br /><br />It's a shame really, 'cos it's a pretty cool box if it wasn't so old...<br /><br />Oh, and I'm cleaning out my office at the moment so if anyone wants any old manuals, disks, etc. for outdated office software I've got boxes of it (WordPerfect 6.0 for DOS anyone?  No?  Lotus Notes?  Legit license for Win95 + installation floppies??? heh)  My stack of 3.5\" floppies is almost two metres tall now.  I even found an MSOffice CD that didn't have printing on the top, it had a full hologram over the CD surface.  I've never seen a CD like that before - I'll have to keep that one [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 20003,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-12-12T16:03:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Wow, we've got a dual P200 at work with a couple of 4.3GB hotswap SCSI drives and a tape drive, and I can't give it away...I'm just waiting for the next skip/dumpster to appear outside and then in it goes[hr][/quote]<br /><br />Do I feel like getting on a CityCat with it?  Nope. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />(my first attempt at that sentence was:<br />\"Do I feel like getting on a CityCat with a big-ass box?\"<br />I thought that might be kind of suss.  My next attempt was:<br />\"Do I feel like getting on a CityCat with a big-ass tower?\"<br />This was even worse.  In the end, I just gave up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] )------------------<br />[url=http://www.szevvy.net]www.szevvy.net[/url], for all your Wombat needs.  You know you want to.<br />A member of the LevelLord fan club."
	},
	{
		"id": 20004,
		"title": "Re: Your Keen-o-matics",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-12-12T19:47:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Malvineous</b> I even found an MSOffice CD that didn't have printing on the top, it had a full hologram over the CD surface. I've never seen a CD like that before - I'll have to keep that one [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [hr][/quote]I was under the impression that all MS software released nowadays has holographic disk labels - my copy of MS Office does, as do most of the disks in the giant pile of free trial disks that I persuaded Microsoft to send to me so I could sell them on eBay... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] [url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 20005,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-12T22:10:51.000Z",
		"content": "<i>Do I feel like getting on a CityCat with it? Nope.</i><br /><br />Not to mention that you pretty much need two people to carry it.  Heh, that would look funny on the CityCat - someone points out that you only need a PDA or a laptop to use the ferry's wireless network, but you've decided to bring a full server on board... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br /><i>I was under the impression that all MS software released nowadays has holographic disk labels</i><br /><br />Oh, maybe it does, I haven't seen any new MS CDs for years - this one was an Office 2000 trial."
	},
	{
		"id": 20006,
		"title": "Re: Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-13T02:11:49.000Z",
		"content": "My family has some kind of OEM-customers-complex, so all my computers are, unfortunately, manufactured. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   At least all of them are mine. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   Except one, now... well, back to the topic.<br /><br />I still have my \"first\" computer near my desk, covered by dirt and trash (sometimes). I used to play Keen6 on it (using Win95 DOS mode) when I was just 9 years old, but a crash... er, *cough, cough*. It had a Pentium 166 MHz processor, 16 megs of RAM, and a 1.2 GB hard disk drive, with Windows 95 OSR2 (pre-)installed. After two years I added 16 MB more of RAM with no purpose at all. This computer was used by me until its screen exploded (15 inches CRT).<br /><br />Then I bought my second computer, which is now *supposedly* used by my father, although the last time I saw it was covered with dust. It has a Celeron 1300 MHz, 256 MB of RAM, and a ~40 GB HDD. It came with a non-functional floppy disk drive, by the way. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img]   After rediscovering Keen, I played it on that computer using WinXP+VDMSound, WinXP+DOSBox and finally, <br />Linux+DOSBox. I used it with a 15 inches CRT screen (at 800x600 at 85 Hz)<br /><br />Now I have my third computer, and at the same time I bought it, I had to give my second computer to my father. It's a Pentium IV 2.93 GHz (I was very happy after realizing I could run DOS games faster with it and DOSBox) with 1 GB of RAM and a ~160 GB HDD. It has some fancy buttons &amp; stuff, nothing interesting for me, but at least it works well for software-development, Keen modding, graphic editing &amp; designing, and gaming purposes. I'm using it with a 17 inches LCD screen (at 1280x1024 px, wow!   awesome graphics! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  )<br /><br />The downside of this last computer is I can't run my old SUSE Linux 10.0 on it without a bunch of hardware incompatibility issues. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   I hope the next time I can download huge CD images, propers drivers will be avaiable. I'm still trying to survive in the Windows (R) World (TM). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  <br /><br />IMKO, DOSBox is the best thing since sliced bread. I use it for running Keen and other DOS games with this computer.<br /><br />And the first and third/current computer look like...<br /><br /><b>First</b><br />[img]http://i144.photobucket.com/albums/r176/shadowm2006/oldkom.jpg[/img]<br /><br /><b>Third</b><br />[img]http://i144.photobucket.com/albums/r176/shadowm2006/mykeenomatic.jpg[/img]<br /><br />I'm using my second computer's keyboard with my current machine, because it has some advantages. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  <br /><br /><br />[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20007,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-13T09:52:38.000Z",
		"content": "Wow, a friend of mine used to have a computer with the same case as your first one - only his was a Pentium 75 and according to the label on the top it had an 800GB hard disk (which was of course only 800MB.)<br /><br />And your comment about 1280x1024 means I can't resist mentioning my 3200x1200 set up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />As to your comment about SUSE, why don't you just compile your own kernel?  All the Linux drivers are stored in the kernel and it's a much smaller download compared to a whole new distro.  I've often had to compile my own kernel for a Linux *installation*, e.g. when the install system doesn't recognise SATA disks - just compile a kernel with the right SATA driver built in, reboot and suddenly your hard drives appear in the installer [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 20008,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-12-13T21:22:14.000Z",
		"content": "my FIRST working pc is a ibm-xt model2 [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img]  with a 5 1/4\" floppy drive 20mb hard drive [same size of a cd drive] 640kb ram {with keen dreams}<br /><br />then my [now dead] sgs thomson 486 dx2 12mb ram ~600mb [fat 16] hd 3 1/2\" floppy drive cd drive <br /><br />my [now dead too] p2 64mb [upgraded to 96mb ram] 8mb vram [onboard gpu] 4gb hd 3 1/2\" floppy drive cd drive <br /><br />my p4 [not working atm] 512mb nvidia geforce fx5200 160gb hd<br />3 1/2\" floppy drive dvd drive broken cd burner from p2 [is gonna be replaced by a dvd burner] zip drive [still needs to be installed] <br /><br />my laptop using it atm amd turion 64 512 mb ram nvidia go force 7300 80gb hd dvd burner <br /><br />my hp 486 sx 16 mb ram 3 1/2\" floppy drive<br /><br />my ibm aptiva 486 sx 2 32mb ram 2gb hd 3 1/2\" floppy drive cd drive<br /><br />my pb p1 48mb ram 2mb [onboard gpu] 3 1/2\" floppy drive cd drive<br /><br />a short list of all my pc i have or had there where 2 others but i don't know what kind of pc those were[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 20009,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-13T23:36:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Wow, a friend of mine used to have a computer with the same case as your first one - only his was a Pentium 75 and according to the label on the top it had an 800GB hard disk (which was of course only 800MB.)<br /><br />And your comment about 1280x1024 means I can't resist mentioning my 3200x1200 set up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  [hr][/quote]<br />Hah, I had that same case too. Except my Pentium 75 was coupled with a 1.2 Gig hard drive. Now that was capacity. Eventually we got a screaming P133, but our motherboard only supported running it at 100 MHz.<br /><br />Would this be a bad time to mention that I'm running at 800x600 half the time? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img] ________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20010,
		"title": "Re: Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-14T01:04:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Malvineous:</b> And your comment about 1280x1024 means I can't resist mentioning my 3200x1200 set up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   [hr][/quote]<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]   Wow!!! But IMKO 1280x1024 is perfect for running DOS games with DOSBox at its maximum resolution (near 1024x768 with scaler \"normal3x\"). Since my current machine also has a integrated graphics device with some dumb 3D acceleration capability and 64 MB V-RAM (yeah, decreasing avaible system RAM), I'll see if DOSBox can use OpenGL for drawing instead of DirectDraw.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Malvineous:</b> As to your comment about SUSE, why don't you just compile your own kernel?[hr][/quote]<br />I tried that. SUSE 10 comes with patched kernel 2.6.13(-15). I compiled my own 2.6.17 kernel, but it caused some strange issues... so, I'll try again (with a newer kernel) when my hard disk is repaired/replaced (bad sectors, HDD too new to be dying), and I'll be on vacation (excelent opportunity to try some new drivers and stuff).<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>memsys:</b> my FIRST working pc is a ibm-xt model2 [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img]   with a 5 1/4\" floppy drive 20mb hard drive [same size of a cd drive] 640kb ram[hr][/quote]<br /><br />I remember I saw an old computer with a *big floppy disk drive* with a *big floppy (but *really, really FLOPPY*) disk* inside. It was abandoned in some school class-room, but I could touch the 5.25\" FLOPPY DISK! It was year '99, that's why that computer was abandoned. I've ever since told jokes about the name of \"floppy\" disks to those who didn't know the old big floppy disks.<br /><br /><br />As I said, my second computer had a 15\" CRT display. It was capable of displaying at 640x480 - 1024x768 px resolutions. The only problem with maximum resolution was the refresh rate. It didn't support more than 60 Hz (Vertical RR) at 1024x768, but it supported 85 Hz at 800x600, so I used the last setting (and even managed to set-up a framebuffer console under Linux for that resolution/r. rate combination!).<br /><br />60 Hz V. Ref. Rate causes me vision problems and headaches in 15 minutes. So I just can't use CRT monitors at resolutions which don't support high vertical refresh rates. Fortunately, LCD displays don't cause me problems if the brightness level is properly adjusted. So I can now use this 1280x1024 resolution, but I used 800x600 for many years, and have still some problems to get used to this big screen.<br /><br />I can't imagine DOSBox (windowed) in a 3200x1200 screen... hey, wait a minute! Those numbers are not similar enough. Is this a multiscreen set-up, or a wide-screen extended resolution mode or something?<br /><br /><b>EDIT:</b><br /><br />As a bonus... <br />[img]http://shadowm2006.sitesled.com/images/desktop.jpg[/img]<br /><br />With such a big desktop I can have more app links than I've ever had! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20011,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-14T22:33:36.000Z",
		"content": "<i>I can't imagine DOSBox (windowed) in a 3200x1200 screen... hey, wait a minute! Those numbers are not similar enough. Is this a multiscreen set-up, or a wide-screen extended resolution mode or something?</i><br /><br />Ha, I was wondering whether anyone would notice - yes, it's two monitors (a 19\" and a 21\") both running at 1600x1200@80Hz (the 19\" is capable of reaching 85Hz at that res, but I have to run them both at the same refresh rate or the magnetic fields interfere.)  And like you, anything below 70Hz gives me headaches too.<br /><br />Since they're CRTs I have DOSBox set to switch to 320x200 on whichever monitor I run it on - I prefer that because even though it's quite pixellated it reminds me of how the games used to look.<br /><br /><i>As a bonus... My Win-desktop(TM) (204 KB JPEG file)  With such a big desktop I can have more app links than I've ever had!</i><br /><br />Heh, when I load that image in my web browser I don't even have to scroll to see the whole picture [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 20012,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-12-15T00:58:48.000Z",
		"content": "Hmm... I can't really play Keen too much anymore. Its either no sound, or super-slow DOSbox. Hopefully I'm gonna be getting a new motherboard soon, along with a dual-core processor. That'll speed things up nicely (I hope. At least its better than this old Pentium 3...)<br /><br />I'm running Windows ME right now. I hate it. I'm probably going to get Vista as soon as possible (seeing as I don't want to switch to anything except windows, and I have problems with XP and 2000).<br /><br />My desktop... I have a plain blue-green (0 red, 100 green, 150 blue) background. My resolution is 2560x1024, with two 17\" CRT's, one is slightly higher up than the other, because its on top of a raised part of the desk.<br /><br />Ok... Now for some reason, when I go fullscreen in DOSbox, my desktop gets messed up, and goes to 16 colors and a really small resolution. Even after closing DOSbox, it still is messed up, and I have to change the resolution back and fix all my icons.<br /><br />I've considered making an actual Keen-o-Matic. I've probably got enough old computer stuff to build something like what I used to play Keen on. Actually, I've got the perfect place for it... this old shelf unit that I stopped using a while ago, and was gonna get rid of. I guess it might have a use after all.<br /><br />Phew. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20013,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-15T08:43:17.000Z",
		"content": "Yikes! Windows ME? There's a tale from computer hell. Surely you could find 98 somewhere to upgrade. Or even 2000.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20014,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-12-15T23:16:41.000Z",
		"content": "I <i>had</i> 98, but then I thought it'd be a step up with ME. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br />Dumbest mistake ever.<br />Right now, though, I'm not gonna switch to anything else until I see what Vista is like. If its good, I'll definately upgrade.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20015,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-12-15T23:37:10.000Z",
		"content": "you need 2gb ram to run vista smooth [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  and i'm done with winblows 2 reasons i dont use linux yet games and my mom [url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 20016,
		"title": "Re: Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-16T00:29:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>memsys:</b> you need 2gb ram to run vista smooth [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  and i'm done with winblows 2 reasons i dont use linux yet games and my mom[hr][/quote]<br /><br />2 GB RAM??? I thought it was 4 GB [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Just kidding.<br /><br />I read Windows Vista requires *at least* 512MB for the *minimum* functionality, but you know, when Microsoft tells you the minimum requirements for something, its telling you how much memory you must have to have it running as fast as a snail. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  I guess WinVi would need 15 minutes to boot up with 512 MB.<br /><br />It seems that this new windows version can also increase your memory by adding a paging file to USB 2.0 Disks, if your system supports USB 2.0. (Well, I *think* they're talking about USB 2.0 when they say \"special USB hardware\".)<br /><br />You need exactly 1 GB RAM to run Vista as you used to run Windows XP with 512 MB. However, for using the extended Aero (tm) desktop manager and stuff, you must have more than 1 GB RAM, and at least 128 MB Video-RAM (not integrated).<br /><br />I'm waiting for next xmas, we'll probably hear about over 100 critical security bugs in Windows Vista that will be corrected by then (WinVI Service Pack 1 or something [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] ). I'll upgrade to Vista *only* if it's really worth installing, so I'll probably keep the bad old WinXP SP2 for a long time installed on this computer. Besides, WinVI only means more application-compatibility/development issues. I don't need that just now that I'm developing software. It seems they've changed a lot of things we've known (and \"enjoyed\") since Windows 95.<br /><br />I'll probably have some GNU/Linux distribution installed on this computer by next March, too. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  It'll be fun to tweak low-level system settings again. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br /><br />[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20017,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-16T09:58:14.000Z",
		"content": "I'm surprised everyone's so keen on Vista - yes, let's all make our PCs run slower than they do now [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />It makes you wonder *why* your bare operating system needs a minimum of 512MB RAM to run...imagine how much useless stuff it will keep loaded all the time.  Probably stuff like that commercial grade SQL server it will use to store your system settings.<br /><br />That's an interesting point about putting a paging file on a USB 2.0 disk though (but it would slow things down too - USB2.0 is a lot slower than SATA or even PATA/IDE.)  Kinda makes you think about how Linux has not only been able to do that for years, but it can also put its paging file on another PC over the network (great if you're running Linux on a computer with no disk drives, hard, floppy, USB or otherwise.)  I don't think we'll ever see a version of Windows that flexible..."
	},
	{
		"id": 20018,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-16T10:42:38.000Z",
		"content": "Actually it's not a page file that goes on the drive -- it's a prefetch cache that Vista loads the pages it thinks you will need onto. For a sequential transfer the hard drive would be much faster, but the idea is that by exploiting the flash drive's fast random access times the interface can be more responsive. From a technical and security standpoint Vista has enough cool stuff in it to make any computer geek salivate. I have a hunch that it's going to be hard to tell any of this is going on behind the scenes. It seems like Microsoft tends to do great stuff in some areas, but do something else that makes all the effort a waste.<br /><br />EDIT: Well, yes it's a page file, but it's a page file meant to store the pages you will need rather than those there was no space for in memory.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20031,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-12-16T18:33:19.000Z",
		"content": "there is NO way you can let me run vista unless you put a gun to my head or give me lotta $$$$$$$$$$$$$$$$$$$$$$$$$$$$<br />and i will propably throw it of as soon as possible<br /><br />edit stupid stupid typo[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 20019,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-16T23:51:08.000Z",
		"content": "I wouldn't have thought you'd want to put any sort of paging file on a *flash* drive though (I was thinking of an external hard disk.)  Frequent writes to a flash disk is supposed to be an excellent way of killing it...<br /><br />Of course maybe the \"special USB hardware\" is just extra RAM (not flash) that you can attach via USB - who knows.<br /><br /><i>From a technical and security standpoint Vista has enough cool stuff in it to make any computer geek salivate.</i><br /><br />I'd be surprised if that happening to any Linux geeks - *maybe* because of Aero, but not much beyond that [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 20020,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-17T00:27:12.000Z",
		"content": "Actually the idea is to use a regular usb keychain flash drive for this. I believe Microsoft is eventually going to have manufacturers building the same sort of thing into the motherboard.<br /><br />I'm at least one Linux geek who is impressed by a lot of the stuff in Vista. It's new memory management ideas (including the one under discussion here) and the Monad shell (not actually shipping with Vista) are pretty cool, no matter which system you prefer to run.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20021,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-17T10:23:34.000Z",
		"content": "That can't be right - the idea of a swapfile is to store data from memory to make more room in the RAM - it doesn't make sense to build extra space for the swapfile onto the motherboard when you could just add more RAM and reduce the need for a swapfile completely.<br /><br />I still maintain that if you're overly impressed with Vista you don't know Linux well enough [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img]   I wonder how long it will take until the first security exploit is announced...?  (seriously - Microsoft's improved security vs the cracking community's ingenuity, it'll be interesting one way or another.)"
	},
	{
		"id": 20022,
		"title": "Re: Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-17T15:03:20.000Z",
		"content": "Microsoft will release some games for the newest XBox and Windows Vista. And since there are a lot of people who love those games...<br /><br />I have no intention to develop software that will work with Windows Vista (yet). It is some kind of micro-boycott. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  <br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>lemur821:</b> I'm at least one Linux geek who is impressed by a lot of the stuff in Vista. It's new memory management ideas (including the one under discussion here) and the Monad shell (not actually shipping with Vista) are pretty cool, no matter which system you prefer to run.[hr][/quote]<br />That shell thing can't be superior to the almighty Bash shell for UNIX systems! Remember that MS batch files language is very limited in comparison to Csh, Bash, and other *sh, scripting languages. If you don't know what I'm talking about, then you probably don't know Linux as well as I do. (Note that I'm (or I was???) still a Linux beginner.)<br /><br />And about Aero, who needs that dumb babyuser-friendly user interface? In my opinion, KDE is more classy, customizable and nice, if you want a Windows-user-friendly User Interface (UI). And I think that if you want an Aero-like user interface, buy a Mac and you'll be happy. <br /><br />I'm another person who drools when looking at the new features of this OS. But, then I think: \"spyware, viruses, security threats, system crashes?\" No, I don't want that. I've somehow managed to stabilize this WinXP installation while I wait for installing GNU/Linux, and I don't want to end my happiness. And I maintain my point: \"Vista = Incompatibilities + ProblemsForSoftwareDevelopers\".<br /><br />BTW, can you believe it? I was playing Duke3D (eDuke) the other day, and switching to another window caused a STOP 0x82 on Windows kernel!!? That's why I \"love\" Windows so much! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img]  [hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20023,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-12-17T21:29:36.000Z",
		"content": "Hmm... ok. Now i feel stupid using Windows. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br />Well, I've ALWAYS felt stupid using Windows, but now I really want something else...<br />Hmm, Mac's are too expensive (and I dont want to change computers now.) Is there any way to run any version of OS on a PC? Probably not...<br /><br />As for Linux... Is there any way to demo it without uninstalling Windows (or possibly messing something up?)<br />How similar/different is the interface from Windows?<br />I'm gonna take a look at this... It's GOT to be better than Windows.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-redeyes.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20024,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-17T22:18:24.000Z",
		"content": "The new Mac OS for Intel Macs is supposed to be sort of compatible with normal PCs, so there's a possibility there.<br /><br />There are also plenty of Linux distros that will run with Windows, probably the easiest is to grab Knoppix which runs entirely off a bootable CD.  IMKO all the GUIs for Linux still need quite a bit of work to bring them up to Windows' quality, but the overall system stability is well worth the current limitations (the PC I'm using now has been running continuously without a restart for 87 days, 10 hours, 35 minutes as I write this - try doing that with a Windows box.)<br /><br />Oh, and if you're after decent Bash-like scripting in Windows, it's there, it's just not obvious (look up cscript or wscript - you write your scripts in VB or JScript.  It's actually surprisingly good.  More like a mini-programming language than a scripting language, but still.)"
	},
	{
		"id": 20025,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-12-17T22:58:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr](the PC I'm using now has been running continuously without a restart for 87 days, 10 hours, 35 minutes as I write this - try doing that with a Windows box.)[hr][/quote]<br /><br />Holy sh- that's amazing!! I'm lucky if Windows lets me go for 2 hours without rebooting.<br /><br />Ok, I've done a little research... I now understand the whole \"distribution\" thing. Um, but now its kinda confusing which one to get.<br />I'd really like a free one. Fedora Core seems to be the only one I can find. Yet it doesn't have any screenshots of it.<br /><br />What I'm looking for:<br />-Dual monitor support<br />-Support for Pentium III and/or Athlon 64 processor (since I have PIII now, and might switch to A64 soon.)<br />-Windows-style interface: I've seen several different styles of menus and stuff. Mainly I'm looking for a Start menu kind of thing, and thats it.<br />-I still want most of my programs to work... And can the standard programs that come with Windows (Paint, Notepad, GIFAnimator) still work in Linux? Or is there at least similar ones for Linux?<br /><br />Yeah, so right now, I'm pretty confused about all of this. I'm gonna probably have Windows and Linux together, just to be safe, but I need a simple guide on which distribution to get, and how to install it alongside Windows.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20026,
		"title": "Re: Your Keen-o-matics",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-17T23:47:06.000Z",
		"content": "Dual monitor support: I don't know, but I think any distribution with XFree86 or X.org should support dual monitor set-ups. And that is almost all major distributions. Those things (XFree86/X.org) are the graphical environment core (like USER.EXE, GDI.EXE and VWIN32.VXD on Windows ME).<br /><br />Suport for Pentium III: piece of cake, it comes ready.<br /><br />Suport for Athlon 64: I don't know what kind of processor this is. It doesn't matter anyway, the Linux Kernel that comes precompiled with major distributions should work. Note that some distributions come precompiled for 32-bit processors. If you want to take advantage of 64-bit CPUs, and you aren't afraid of losing 16-bit application compatibility, then you've got to download a 64-bit edition of the distribution.<br /><br />Windows-style interface: KDE. I love it.<br /><br />Most of your programs to work...:<br /><br />- Paint: The GIMP, KOffice.<br />- Notepad: Emacs, KDE KWrite/Kate, GNOME GEditor<br />- GIFAnimator: I don't know.<br />- To make Win32 apps run on Linux: WINE compatibility layer. (note, not all Win32 apps work very well with WINE, it's better to use their Linux counterparts).<br /><br />I have Windows and Linux running together without any problems. It's safe as long as you partition the disk wisely during the distribution setup program.<br /><br />I started with SUSE Linux 9.3. Then I continued with 10.0. I'm still using 10.0, but then I got a Knoppix DVD for free with a magazine, and I recommend it for you, excelent for those who need to step carefully into the GNU/Linux world.<br /><br />I'm sure somebody knows what's the open-source alternative to GIFAnimator.<br /><br />Remember, DOSBox runs on Linux too (and better than on Windows, I must say!).[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20027,
		"title": "Re: Your Keen-o-matics",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-12-18T00:14:04.000Z",
		"content": "I shaved off 20Gb of toy partitions on this 80Gb HDD I have for the purpose of experimenting with various OSes. Last time I tried Linux, a few months ago, I was using Slackware 10.2, which was quite comfortable, but there were some issues running later versions of Wine and some configuration stuff that I broke, which made things a bit difficult to work with. I now have Zenwalk installed, which is based on Slackware but with the latest versions of everything--Patrick Volkerding, Slackware's creator, has this perfectionist \"it's not ready yet\" policy when it comes to a lot of newer stuff like the 2.6.x kernel (it still runs 2.4.x by default).<br /><br />Zenwalk was simple to install, and everything pretty much worked straight off, as opposed to Slackware which had me messing around with the configuration just to get the scrollmouse and proper resolutions working.<br /><br />There are a few minor things that keep me using Windows at the moment:<br />- Gaming. I'm gonna download the CVS of Cedega and give that a whirl, though<br />- I'm used to the interface and often have projects that need to be done quickly without having to learn how to do things differently<br />- the NTFS partition on my 250Gb HDD whose contents I need to somehow copy onto another drive so I can convert to EXT to make it avaialble to both Windows and Linux. I can read it from Linux at the moment, but the NTFS driver is still experimental when it comes to writing so I'm not game to risk it.<br /><br />[hr]<b>Genius</b> Windows-style interface: I've seen several different styles of menus and stuff. Mainly I'm looking for a Start menu kind of thing, and thats it.<br />[hr]KDE, Gnome and XFCE are all capable of Windows-style taskbars, and are much more flexible and interesting. I've not worked out how to get Windows' nice drag-and-drop method of adding new quick-launch/program menu shortcuts, which really makes life a lot easier, but I'm sure it's possible. <br /><br />[hr]<b>Genius</b> I still want most of my programs to work... And can the standard programs that come with Windows (Paint, Notepad, GIFAnimator) still work in Linux? Or is there at least similar ones for Linux?<br />[hr]There are far better programs than Notepad that come standard with most distros. [url=http://kolourpaint.sourceforge.net/]KolourPaint[/url] is a brilliant KDE-based MS Paint replacement, which has extra features like SHORTCUT KEYS! Too bad it's not cross platform--this kind of program is desperately needed for Windows as well. I'm not sure about GIF software, but it's definitely out there.<br /><br />[hr]<b>Genius</b> Fedora Core seems to be the only one I can find.<br />[hr][img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]   Apart from Slackware and Zenwalk, I've heard good things about Arch Linux and Ubuntu. I tried DSL and Puppy, which are tiny distributions intended to fit on a USB flash drive or business card sized CD, but they're absolutely horrible if you want to do anything useful. I'm going to investigate Linux from scratch at some point and build my own Linux installation from the ground up, but I need more experience using Linux before trying that (besides that, I believe it's necessary to have an existing copy of Linux installed before undertaking LFS).<br /><br />www.distrowatch.com is a good place to start.<br /><br />As for my Keen-o-Matics, I'll be writing something up on that subject as soon as I get the new layout finished on my site."
	},
	{
		"id": 20028,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-12-18T02:23:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I've heard good things about Arch Linux and Ubuntu.[hr][/quote]<br /><br />Yeah, I just spent 2 hours downloading the ISO for Ubuntu. I'll probably wait until tomorrow to partition my drive and install it. If I don't like it, I'll try one of the others.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  Ok thanks for the help. I think we should get back on topic now. I'll figure this out myself.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20029,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-18T06:54:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]That can't be right - the idea of a swapfile is to store data from memory to make more room in the RAM - it doesn't make sense to build extra space for the swapfile onto the motherboard when you could just add more RAM and reduce the need for a swapfile completely.[hr][/quote]<br />There are several reasons -- first is that even now, most PCs ship with a limited amount of RAM. 2 gigabytes is a lot, and adding another two is around $200 to $400 U.S., right? Not to mention the size limits of the architecture. A two gigabyte stick of flash memory? $30. That's pretty compelling if you're looking to put some data in a place where you can get to it quickly. Also, don't forget that RAM needs to be powered all the time, meaning that you can't use it when hibernating. You have to write everything you think you'll need upon resume to the disk, then load it all back in. Now what if you had another couple of gigabytes that would just be there for you as soon as you resumed? Pretty handy. And don't forget that many people are using mobile systems. The more data you can have in ram or additional flash, the less you need to spin up the hard disk and kill your battery.<br /><br />Also, don't forget that Vista does more than load what you need into memory -- it loads what it thinks you <i>will</i> need. The more space it has to do this the more likely it is to respond right away to your next request. Depending on what you do often and your storage space, entire applications might be preloaded. At the very least there could be enough loaded for the hard drive to finish seeking to the rest, meaning a faster response.<br /><br />If this were just about swap I'd agree with you, but it's not intended primarily to hold a swap file. A couple gigabytes of memory is enough for almost anyone. If you really need more, then you really need more, and nothing else will do. On the other hand once you start trying to anticipate and prepare for what you will need other forms of storage, such as flash memory, start to look attractive based on their lower cost, non-volatility, and speed compared to a hard drive (50 s access time on a PCIe bus).<br /><br />[quote]<b><i>Quote:</i></b>[hr]That shell thing can't be superior to the almighty Bash shell for UNIX systems! Remember that MS batch files language is very limited in comparison to Csh, Bash, and other *sh, scripting languages. If you don't know what I'm talking about, then you probably don't know Linux as well as I do. (Note that I'm (or I was???) still a Linux beginner.)[hr][/quote]<br />I live in the shell. Try doing some bash scripting then look into PowerShell and you'll never want to write something like the following (real code) again:<br />[pre] find $( echo $MANPATH | tr \":\" \" \" ) -type f 2&gt; /dev/null | grep -o \"[^/]*$\" | sed -e 's/\\.[[:alnum:]]*\\.gz/\\ /g' | sort -u[/pre]<br />PowerShell is object oriented and provides hooks into the low-level parts of the system, meaning that awk and sed don't have to be your most used tools, and code can actually be readable more than a few hours after you write it.<br /><br />Aero doesn't actually excite me much after having played with Beryl/Xgl. The power of OpenGL coupled with the traditional excellence of Linux's window managers is an unbeatable combination. The things I am excited about are SuperFetch (as described above), PowerShell, and the long-overdue UAC, in that order. UAC is mostly exciting because the majority OS is finally getting a semblance of decent security, not for its own merits, but the other two are genuinely new and exciting technologies. I also like the sound of the new driver model.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20030,
		"title": "Re: Your Keen-o-matics",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-18T07:12:43.000Z",
		"content": "Oops, I meant to add some newbie hints for Linux to the end of that last post, but since it's so long already I'll start another.<br /><br />Ubuntu is a good distro to start with. Most distros would be all right but I see it as the \"safe\" newbie choice just because it's so common. Arch (mentioned above somewhere) is a great distro, but you'll have to install all the software you want explicitly from the command-prompt package manager. This is no hardship if you know exactly what you want, but if you're new it might be better to start with a more \"bloated\" distro that will give you more software to play with by default so you can get a feel for the landscape.<br /><br />I also caught a question about interfaces compared to Windows. That's a pretty hard one to answer since there are so many choices. Most basic is the command line, and there are even three good options for this (although bash is certain to be the default). All of them are better than the Windows command line. Almost any distro (except for Arch Linux [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]  ) includes some sort of desktop environment. Usually KDE or Gnome, but sometimes XFCE. All of these are better than the Windows desktop. GUI based configuration is somewhat lacking in comparison, not that I personally mind editing config files. An advanced user might want to forego the big desktops and just use a window manager with terminals to get everything done. This is my preferred way to work.<br /><br />You'll probably be doing a lot of experimenting before you find your favorite way to do things. Have fun and ask questions!________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	}
]
