[
	{
		"id": 951,
		"title": "This place has turned into almost complete crap",
		"author_id": 1486058,
		"author_name": "BlueIllusionX",
		"timestamp": "2005-11-19T12:32:17.000Z",
		"content": "I've been here for a long time, since the end of my grade 7 year which was 7 years ago.  I never posted much and still dont to this day.  A while ago there were great posts to read and many good things to think about. But now adays all we see is random shit thrown on this board.  There has been tons of lame ass role playing by a bunch of people. I mean for an online forum i actually felt embarrassed just reading them. My stomach turned inside out reading these little epics.   many usless posts have popped up with a bunch of jibberish that didnt make any sense, or was just pointless info that nobody could contribute to.  This place is slowly becoming a waste of space.  Does anyone else agree with me on this? how about the older people here, im sure you have a take on this too but either havent read much or just dont care to post.  I usually wouldnt care to post what i think, but man this place is just turning into a hell house."
	},
	{
		"id": 22754,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-19T14:08:00.000Z",
		"content": "Completely agree. As well, sadly there isn't much I can do to that since I can't order any punishments. The only thing I'm able to do is to lock and remove such topics (although even that isn't possible in every forum section) and tell them to stop. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br />Anyways, thanks for that post.<b>Eat your veggies!</b>"
	},
	{
		"id": 22755,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-19T14:47:04.000Z",
		"content": "You are right, we all need a little holiday from Keen but not this much, and it seems that only a few of us create something keenish nowadays... I can't do as much as I'd like to either, as I have many other things to do at the moment (for example study) but posting \"random shit\" is not what I do. I hope.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22756,
		"title": "Re:  Re: This place has turned into almost complete crap",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-11-19T15:25:00.000Z",
		"content": "We've hardly heard any news on any mods in ages. We need to get our asses in gear. We need some XkyKeen4. We need to get rid of Harvey. We need <i>something</i>.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 22757,
		"title": "Re:  Re: This place has turned into almost complete crap",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-19T15:44:32.000Z",
		"content": "True.<br />I've been working on mods, but I just can't accomplish anything.<b>Eat your veggies!</b>"
	},
	{
		"id": 22758,
		"title": "This place IS complete CRAP!",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-19T18:16:44.000Z",
		"content": "Edit: I got mad."
	},
	{
		"id": 22759,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-19T18:22:26.000Z",
		"content": "Hate to say it, but I told you so...<br /><br />What can we do? Nothing, the only one who wants to keep the mess out of the forum is Keenrush. I don't see any other crew member do anything to the forum. <br /><br />And Galaxieretter, you know that you're a stimulating Najawa to go on like this?<br />[img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img]<br />Playing his little games is just the stupidest thing you can do.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22760,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-19T18:44:10.000Z",
		"content": "True.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22763,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-19T19:27:35.000Z",
		"content": "I've started simply deleting Harvey's posts that have no value.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22761,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-19T19:34:48.000Z",
		"content": "But why making things so complex if there is someting like a post limit and a topic open ban?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22764,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-19T19:58:11.000Z",
		"content": "There just isn't a lot going on though. Z-1 has his game in progress, but there's not much to say about it until its released. There's CloneKeen, but, while cool, it doesn't provide any new material to talk about. There aren't many mods happening now, for whatever reason. I guess the forum has had better times, but if there's a lull in actual Keen related activity there's not much we can do about it. We can't control when inspiration hits people. Maybe in a little while we'll start producing more Keen output. This could just be a momentary dull spot.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 22765,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-19T21:08:51.000Z",
		"content": "Stop Harvey, you're the evil for trying to destroy the community..<br /><br />Anyways, I'm sure this is just a momentarily dull spot, lemur. Sometimes we get more stuff, and sometimes less.<br /><br />And yeah, as Djaser suggested, why not use post limit or banning? Harvey has earned a limit (or ban, if I could decide).<br />Edit: And Najawa could use a temporary limit. That'd limit the annoyance a bit.<b>Eat your veggies!</b>"
	},
	{
		"id": 22762,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486058,
		"author_name": "BlueIllusionX",
		"timestamp": "2005-11-19T21:16:53.000Z",
		"content": "nah z hyphen one, you dont post random crap, your game is one of the reasons why i stay here. Im trying to write my own keen game in c++. I want to finish off episode 2 and 3 of my keen series Masked Crusades. i made the first ep in mmf, but i wanted a multiplatform one and your game gave me some great ideas to do it. but yea, i think there needs to be some clean up here. because this is just ridiculous."
	},
	{
		"id": 22766,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-19T21:44:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]stimulating Najawa [hr][/quote]<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  <br /><br />Okay... I submit: Could you please gimmi a post restriction?<br /><br />I can't beleive I am doing this, but until my posting habits improve, I will do this little penance.<br /><br />Please, and kinda be generous.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />I do agree that we are becoming quite a crap joint... I guess the best I can do is begin with my habits; starting now.<br /><br />NO MORE WITTY COMMENTS... unless the person truely deserves it.<br /><br />[hr]<br /><br />Um... ty whoever gave me the limit; I can only respond by editing.<br />-------------------------------------------<br /><br />Well, I don't have a finger disorder; I just need a life. I just read the topics, and haven't posted yet!!!<br /><br />BTW - What am I restricted to? When I'm restricted, I am only able to see a page saying, \"You have reached you maximum posting level\", but when I edit a post, it says I have no restriction.<br /><br />Grr...<br /><br />Oh well; this should help me make more responsible postsProud Leader of the \"Tough Guys Wear Pink\" Society<br />--------------------------------------------------<br />Tough Guys Don't Follow Fads; the set them!!!<br />Kudos to Trensetters!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 22767,
		"title": "not an addiction",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-11-20T01:40:16.000Z",
		"content": "Uh, najawa? It's not like it's hard to stop posting annoying roleplays, ecspecially when everyone's already told you to cut it.<br /><br />I mean, get a spine man! There are people out there desperately trying to get off of alcohol, drugs, and smokes and you can't even control your fingers.<br /><br />However, if you really do have some sort of hand disease, I suggest we push for a post limit immediately.<br /><br />Edit: Holy cow. 404 post error.[hr]<br />\"Don't ask, don't tell.\" -ME<br />[img]http://img447.imageshack.us/img447/4808/dimesterrulez24aa.gif[/img]"
	},
	{
		"id": 22822,
		"title": "yea true",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-11-20T02:32:51.000Z",
		"content": "Ive been here along time and dont post much, but yea BlueIllusion appears to be right"
	},
	{
		"id": 22823,
		"title": "Re: This place has turned into almost complete crap",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-11-20T03:06:32.000Z",
		"content": "I completely agree with BlueIllusion. I've been here since 2001, and I can't remember there ever being so much useless stuff here (although there was Unfleex and LL's spam-a-thon a few years ago which eK promptly ended). <br /><br />I think offenders should get the 'Unfleexable Punishment'.<br />--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 22768,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-20T03:44:02.000Z",
		"content": "It's a question of relevance and enthusiasm.<br /><br />Up until 2001, we still had the \"10th anniversary!\" to look forward to; during the years immediately afterward, modding was just blossoming into an art form, and we were excited about it.  What're we looking forward to, now?<br /><br />There aren't any secrets left to find in the original games; all the mods released up to this point have been completed and scrubbed clean; Keen:Galaxy modding is a mind-numbingly difficult undertaking.<br /><br />We're just in a slump right now.  2005 seems to be a rough year for us.  Just wait until the first Keen4 mods come out--people will snap back to attention.<br /><br />Hell, I'm STILL excited about Spleen's Essence of Mayhem--even if the odds of it getting done are about as likely as KeenRush putting out a full mod in the next 2 months.  But I'm still eager to see what Spleen's been doing.  He's a creative guy.<br /><br />I'm looking forward to z-1's next release of artwork.  He takes his sweet time, but he produces work which is clearly leaps and bounds above the average fangame's content.  He's got smarts, skills, and a passion about his work that few do.  I can't wait for him to wow us with another screenshot.<br /><br />There's several miniature projects which are finally maturing--the open-source clones, the possibility of recording movies, the little utilities which help us manage our Keen-related things.<br /><br />LevelLord's been writing a small epic of a fan-story... and while I can't fully approve of the entire thing, it's kept me coming back here during a time I've been tempted to just vanish.  <br /><br />Yes, it's true that we've got some newbies on the board who can be considered annoying.  Sure, some of them deserve post limits until they get a better understanding of what this board is truly about.  Maybe a few posts need to get deleted, a few threads butchered.  But damnit you guys, this is the only Keen Community out there, and whining about it isn't going to fix things.  <br /><br />Let's take some action.  :-)<br /><br />Edit: I think it might help if we were able to communicate with each other aside from the board.  I've spoken to Ilsoap, Nicksoft and Spleen a few times on MSN Messenger, and I've had a few brief conversations with Stealthy and a few other people who don't even post on the PCKF on AOL Instant Messenger. [img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 22771,
		"title": "Re: not an addiction",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-20T06:56:22.000Z",
		"content": "If anyone saw my one post before I edited it, you can tell I am more than a little mad about this. I swear... if this continues I might start stop coming to the PCKF altogether. <br /><br />Sure it is nice to complain about the state of the forum but why isn't anyone DOING anything about it. Even though we can't remove the crappy spam topics ourselves we can still do something. This is probably going to fall on deaf ears but this is what I say we, the people who post, do about this.<br /><br />1.) When someone posts a spam topic, DON'T RESPOND! Heck don't even open the topic! That is what I did with Harvey's, topics. When I see them I make myself not even open it. Posting will just keep the pointless thread alive longer.<br /><br />2.) DON'T POST in the pseudo-philosophical threads. Just don't.<br />Don't start them, don't post in them, don't read them. Topics like that are an easy way to rip apart a community.<br /><br />3.) Skip Nawaja's and Harvey's posts. (I am serious about that, I'm not trying to be mean.)<br /><br />4.) Don't start topics about religion. Some things that were said were obviously not thought through. People could be hurt by the things that are said in those topics. You might say \"Oh well\" but this ISN'T the place to argue about religion. Even if it IS the  Miscellaneous forum.<br /><br />5.) Don't diss someone's country or express hate for what one country is doing. I was insulted by what some people assumed I believed in before.<br /><br />6.) When you start a new topic THINK if anyone would even CARE about what you have to say. I think I might of started, at MOST, like 10 topics.<br /><br />And last but most importaintly...<br /><br />7.) Make Keenrush an administrator.<br /><br />I'm sure if we do these things that the quality of the forum will go up tremendously. I also agree with Xky Rauh on the Ims. I have contacted a few members outside of the forum through Ims or email. It would be cool, though, to know more forumer's ims.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22772,
		"title": "Re: not an addiction",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-11-20T08:01:01.000Z",
		"content": "I agree with all of your points, Gal. I already follow most of them anyway.<br /><br />They should be kept somewhere (like the Rules page) as guidelines for new members (or anyone in general, I suppose) to follow.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 22769,
		"title": "feh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-20T08:53:48.000Z",
		"content": "I think you're letting it get to you too much.  There's no need to turn this into an Internet Soap-Opera.  :-)  <br /><br />I hardly ever contribute to the philisophical/religious stuff, anyway."
	},
	{
		"id": 22775,
		"title": "Re: not an addiction",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-20T10:42:20.000Z",
		"content": "\"What're we looking forward to, now?\"<br />'20 Years of Keen' [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] <br /><br />And yeah, as Xky said, there's still a lot going on. I'm waiting for that Spleen's mod too.. As Xky said, start makin' stuff! We already most probably have more versatile fan stuff that any other game community has ever done. I'm very proud of that, and can't wait to see the stuff made in future. More!<br /><br />*wonders how to get a mod done in 2 months*<b>Eat your veggies!</b>"
	},
	{
		"id": 22773,
		"title": "Re: not an addiction",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-20T18:45:54.000Z",
		"content": "Okay... I may now have a posting restriction, but I must post here, and now:<br /><br />Okay... Xky has a good question; what the heck <b>are</b> we waiting for?<br /><br />We need something worth waiting/preparing for... but what.<br /><br />We have had a boost in mods this past year, but that tide is slowly returning to sea. I feel it may return in another wave, but that is not what we're waiting for.<br /><br />Our fan games are getting a bit more suffisticated, and thus worth playing; one thing to look forward to.<br /><br />1) Fan Games?<br /><br />Fan Art is rolling in, but it isn't something you log on just to see; I mean, who looks for the next painting of Keen's face? It may look neat, but it just isn't what keeps us going.<br /><br />Roll Playing? Nope; it is starting to suck.<br /><br />Fan-fiction? Yes, this may be it. I joined PCKF for it, and LL has let me down; what happens next?!<br /><br />2) Fan-fiction?<br /><br />3/14/06 - We need to set up a theme; what contest shall we start for 3/14? Fan-fiction contest? Modding (idk, we did have the 1 lvl mod thing last year; neat, but not really that repeatable)? Fan-art? Or even; a 'best emotiakeen revamp contest?!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]   <br /><br />3) 3/14 contest?<br /><br />We need something to keep us going. We've seen big boosts in fan-sites in the past; most of the good ideas have been taken, so I'm not sure we are going to be looking for a fansite revival.<br /><br />4) Keen's 15th aniversary?<br /><br />We need something worth talking about. These religious/controversial topics are starting to drag thje board down with it. I am likeing the more technical conversation, even if I am not able to reply to it all.<br /><br />We need to come up with a turn-around. I think we have resorted to this crappy conversation, because we are running out of things to talk about; I mean, we need something more interesting.<br /><br />Imko; Fan-fic, story-plots, fan-games, and mods can make for interesting conversation.<br /><br />5) Better Conversations... YES!!!<br /><br />We need to have something in which the forumer is actively engaged in; we need more conversations; I have to post up my fan-fiction...<br /><br />6) Najawa's fan-fic? (kidding)<br /><br />Well, that's all I can think of; now you must decide what to do. I am working on my posting habits.<br /><br />BTW - I gave myself a posting restriction; now Harvey - You do the same, or I will dub you a mential wimp, and IP Ban you from my entire site... and I am considering a nice revamp in the next few weeks (The IP Ban would lock you out of my entire site!!!)<br /><br />C'mon Harvey, they may like us better if we can overcome our faults.<br /><br />Well, c'ya!!!<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br />[hr]<br />\"General Loquacious\" - I thought you didn't get coustum titles until you've been on the board for over 6 months; I joined in August, and thus shouldn't get a title till Febuary...<br />[hr]<br /><br />Oh!!! Neato!!! I start my post restriction off on the right note: This is my perfect post!!! <b>777</b>!!!<br /><br />And loquacious; my teacher says that about me all the time!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  Tough Guys Can Fix There Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 22776,
		"title": "Re: not an addiction",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-11-20T19:15:34.000Z",
		"content": "Personally I have almost no problems with the fourms right now except for the spam posts but I can see why alot of people are complaining. I do have an idea that maybe we could have like a pointless post place like other boards have which you could have fun and post anything random you want though it could create problems with maybe arguements and stuff but its just an idea. <br />Besides I see that theres alot of great projects coming out and I'll be here for a long time working on dimension chaos so thats one project that will never die. I also agree that we should have Keen rush as an admin since hes always posting and could be great at patroling the boards stopping the spam and stuff. Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 22770,
		"title": "Re: feh",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-20T19:25:21.000Z",
		"content": "Custom titles are given to people early if admins believe that they are \"special\" enough to deserve them - like Unfleex's \"Commodore Postpostpost\" title about two years ago.<br /><br />Personally, I think it's a good thing that you've decided to ask for a post limit - it will show other forumers that you can be more mature, as well as preventing you from spamming.<br /><br />Not very long ago, I posted in a similar reckless manner. I prevent myself from doing so now by considering carefully every time I make a post: do I need to make this post? Does this contribute to the thread, and does it say anything new? Could it be considered offensive or inappropriate? (That always gets me, sadly) Remember that you don't have to post, and the back button is always there until you click \"Add Reply\".<br /><br />Frankly, I would love to contribute to the community; I just don't have the skills necessary to provide anything that isn't there already. Maybe someday, though...[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22774,
		"title": "Re: not an addiction",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-20T20:42:34.000Z",
		"content": "Hmmm, I'm sure you could do something, grafix. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Anyways, as Najawa said, something 3/14 competition would be neat. No idea what, though. One level mods were cool.<b>Eat your veggies!</b>"
	},
	{
		"id": 22777,
		"title": "Re: not an addiction",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-21T00:20:57.000Z",
		"content": "If anyone'd like to, just add me to your msn list. My e-mail there is z-szemetes @t freemail [dot] hu . Talking on msn would be a good idea, but geographical distance makes things difficult. Who the hack made up time zones anyway? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  I stay up late too much even now. I'm a bit shy with \"strangers\" too, so it's hard for me to start a conversation, another thing is my english in real-time.<br /><br />If this solves the problem I'm open for the solution, but I don't think this is gonna be so easy.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22778,
		"title": "Keen Lives!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-21T01:03:57.000Z",
		"content": "Heh, it's amazing how often MSN conversations turn into spam in a convo involving three or more Keeners (especially Levellord). Still, it's a great medium for collaborating on projects and discussing minor details that would be a waste of space on the forums, plus it's far more accessible and convenient than the IRC channel. We need more Keeners on MSN (especially KeenRush).<br /><br />Maybe we need a site somewhere to list our IM usernames/addresses/numbers... it takes alot of effort to go through everyone's profiles to find them.<br /><br />Yes, the content of this forum lately has taken a bit of a downhill slide. I think we've almost got the controversy out of our system, though, and the newbies are starting to blend in better (though I'm still baffled by Harvey's antics).<br /><br />There are plenty of projects in the works, and much to look forward to (including new hope of the Keen source being released). I've been fairly busy lately with non-Keen stuff and although I visit the forum almost constantly I hardly feel like posting most of the time. However, my off-topic endeavours will make for a Keen summer, as you shall see when I get around to taking a few pictures and explaining my absence.<br /><br />Another thing to look forward to is the next release of Keenfx, which will include full support (yes, including sounds of any length) for Keen2-3 and a few extra features that will hopefully make it much easier to use.<br /><br />[hr]<b>Xky</b> Hell, I'm STILL excited about Spleen's Essence of Mayhem--even if the odds of it getting done are about as likely as KeenRush putting out a full mod in the next 2 months. But I'm still eager to see what Spleen's been doing. He's a creative guy.<br />[hr]Never fear--it's still in the works. As is my 1LM, though I keep changing my mind about what it's going to be... I've been dying to release it all year so y'all can see the nifty little tricks I've used and the map level, but I hit a whole bunch of snags and it's been delayed, on hold, spun around and tweaked for 10 months.<br /><br />Also, I agree: KeenRush for Modd0r! This place needs some spring/autumn//nearly summer/winter cleaning.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22782,
		"title": "Re: not an addiction",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-21T01:06:16.000Z",
		"content": "I'm going to crawl away somewhere and cry for a while now.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22781,
		"title": "Re: not an addiction",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-11-21T02:24:09.000Z",
		"content": "I'm all for msn convs. I already have 2 keeners on my msn list so far and I find the program useful and easy to use for chatting to others.Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 22779,
		"title": "Re: Keen Lives!",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-21T09:57:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Maybe we need a site somewhere to list our IM usernames/addresses/numbers...[hr][/quote]<br />We used to have a Keeners contact/address list, back when I joined in 2003 - I seem to remember that they sent out an email to each new forum member. What happened to that?[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22783,
		"title": "Goodbye",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-21T11:17:19.000Z",
		"content": "Well; after much thinking and viewing of posts I have evaluated my contribution to this community and I have come to the conclusion that it consists of crappy role plays, pointless debate and offtopic posting. I don't think I have made one positive contibution to this community in the entire past year.<br /><br />As such I am handing my account and few remaining Keen projects over to Sarah [Spleen, get that soundfile finnished.] and stopping posting, I'm not sure for how long. <br /><br />Thankyou for tolerating me this long, goodbye.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22784,
		"title": "Aloha.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-21T13:27:16.000Z",
		"content": "No contribution to the community? What about the fanfic? Countless innovative patches (even the pointless ones)? A mod production rate unequaled by any other? Not to mention the Halloween mod--your best work yet, from what I've gotten around to playing so far. A few spam and off-topic posts are a small price to pay.<br /><br />That post had better not be serious. You disappear and I'll have to start spamming you with poorly written poetry.<br /><br />[hr]<b>Levellord</b> I'm going to crawl away somewhere and cry for a while now.<br />[hr]Aww, I meant it in the nicest possible way.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  I find those spam-filled MSN convos rather entertaining for a while.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br /><br />As for the sounds, there are 8 or so remaining (enemy deaths, door opening, Keens left, gun click, shot hit, teleport [I don't remember if that one was required or not]). Next time you're online I'll send you what I've got so far.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />On the topic of roleplays... they did get out of hand for a while. Initially they were hilariously funny (especially Levellord's), and occasionally a few gems show up (mostly Levellord's), but now that they've been mainstreamed their comedy value has drooped to an appalling level (mostly Harvey's).<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22780,
		"title": "Re: Keen Lives!",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-21T16:34:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]As such I am handing my account and few remaining Keen projects over to Sarah [Spleen, get that soundfile finnished.] and stopping posting, I'm not sure for how long.[hr][/quote]<br />WHAT!? No! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]Thankyou for tolerating me this long, goodbye.[hr][/quote]<br />NOT what I was expecting, or wanted, to hear.<br /><br />Whatever screw this.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22790,
		"title": "...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-22T00:43:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />It's a question of relevance and enthusiasm.<br /><br />Up until 2001, we still had the \"10th anniversary!\" to look forward to; during the years immediately afterward, modding was just blossoming into an art form, and we were excited about it. What're we looking forward to, now?<br /><br />There aren't any secrets left to find in the original games; all the mods released up to this point have been completed and scrubbed clean; Keen:Galaxy modding is a mind-numbingly difficult undertaking.<br /><br />We're just in a slump right now. 2005 seems to be a rough year for us. Just wait until the first Keen4 mods come out--people will snap back to attention.<br /><br />Hell, I'm STILL excited about Spleen's Essence of Mayhem--even if the odds of it getting done are about as likely as KeenRush putting out a full mod in the next 2 months. But I'm still eager to see what Spleen's been doing. He's a creative guy.<br /><br />I'm looking forward to z-1's next release of artwork. He takes his sweet time, but he produces work which is clearly leaps and bounds above the average fangame's content. He's got smarts, skills, and a passion about his work that few do. I can't wait for him to wow us with another screenshot.<br /><br />There's several miniature projects which are finally maturing--the open-source clones, the possibility of recording movies, the little utilities which help us manage our Keen-related things.<br /><br />LevelLord's been writing a small epic of a fan-story... and while I can't fully approve of the entire thing, it's kept me coming back here during a time I've been tempted to just vanish. <br /><br />Yes, it's true that we've got some newbies on the board who can be considered annoying. Sure, some of them deserve post limits until they get a better understanding of what this board is truly about. Maybe a few posts need to get deleted, a few threads butchered. But damnit you guys, this is the only Keen Community out there, and whining about it isn't going to fix things. <br /><br />Let's take some action. :-)<br />[hr][/quote]<br /><br /><br />You are absolutely right... I have been trying to figure out in whta very limited time I have to program games, but unfortunetly I am very bad at it...  Otherwise I would have made a whole bunch of games already....<br /><br />*sigh*"
	},
	{
		"id": 22785,
		"title": "Re: Aloha.",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-11-22T02:26:52.000Z",
		"content": "Actually I have an idea of maybe having a weekly online gaming event where we could play a popular fps or something. That could be fun. And I sure hope LL didnt leave the boards. The boards wouldnt be the same without LL.Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 22786,
		"title": "Stuff.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-22T03:58:24.000Z",
		"content": "[hr]<b>Adam</b> play a popular fps or something.<br />[hr]*shudder*<br /><br />[hr]<b>Adam</b> And I sure hope LL didnt leave the boards.<br />[hr]Looks like she's taken some time off. Apparently she's been bombarded by a few unpleasant events in the past week and it all finally got to her. Her friend Sarah has taken over her computer for a while, along with her MSN account and Keening projects.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22791,
		"title": "Re: ...",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-11-22T05:07:04.000Z",
		"content": "why would she hand over her computer to someone else instead of just staying off it for awhile? this seems odd to me.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 22787,
		"title": "Re: Aloha.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-22T05:11:27.000Z",
		"content": "grafix, are you talking about this: [url=http://spatang.com/memblist.htm]spatang.com/memblist.htm[/url] ?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22788,
		"title": "Re: Aloha.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-22T05:11:51.000Z",
		"content": "Oh... she had her reasons... I talked with Sarah a bit; she'l be back.<br /><br />She just had a rough weekTough Guys Can Fix There Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 22792,
		"title": "Re: ...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-22T07:15:53.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  Hopefully soon, I started to get worried already. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Talking about talking, I'd like to chat with fellow Keeners but I don't want to use MSN.. :\\ Well, perhaps I just have to in case you won't use IRC clients..<b>Eat your veggies!</b>"
	},
	{
		"id": 22821,
		"title": "Re: not an addiction",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-11-22T08:31:35.000Z",
		"content": "i agree, lets kill this forum and pretend keen never existed---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 22789,
		"title": "Re: Aloha.",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-22T08:46:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]grafix, are you talking about this: spatang.com/memblist.htm ?[hr][/quote]<br />Yes. Looks like it hasn't seen an update for a long time...[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22793,
		"title": "Re: ...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-22T11:25:08.000Z",
		"content": "Wow it still exists and look even S3 is listed. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22794,
		"title": "Communication!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-22T11:59:35.000Z",
		"content": "Why don't you want to use MSN, KR? Sure, it's Microsoft, but it's free. There are ads and some annoying features by default, but I can direct you to some utilities to remove them and tweak it to your liking. There are also third-party programs through which to use the service (alongside several others) if you still find the program that repugnant.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22795,
		"title": "Re: Communication!",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-22T13:03:29.000Z",
		"content": "<i>\"Why don't you want to use MSN, KR? Sure, it's Microsoft, but it's free.\"</i><br /><br />Nooo, [url=http://psi.affinix.com]pick something open-source[/url], MSN is too hard to get going under Linux [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   I have my own Jabber server, I'd be happy to create accounts for people on this forum along the lines of \"username@shikadi.net\"..."
	},
	{
		"id": 22807,
		"title": "Re: ...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-22T17:46:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]MSN is too hard to get going under Linux [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] [hr][/quote]<br />What? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  Just use GAIM - it's easy as rolling off a log to set up so long as you install it from a package. (Even compiling it's not that bad)<br /><br />Anyway, the only thing keeping me from using Jabber is that none of my current contacts have a Jabber account. Converting them would be near impossible, since most of them have friends have accounts on MSN/AIM, who have friends.. et cetera. Also, they would argue that winks and nudges make it somehow \"better\"... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] [url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22804,
		"title": "Re: Communication!",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-11-23T00:17:25.000Z",
		"content": "Im available on AIM, MSN, ICQ, and Yahoo! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br /><br />If anyone wants to chat, I'm completely cool with that. My screen names and such are in my profile.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 22796,
		"title": "Re: Communication!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-23T01:06:14.000Z",
		"content": "I do not understand what meber lsit has anything to do with this --although it is an old lsit that should be updated...<br /><br />At any rate, there is nothing that we could or should do to stimulate the Keen forum.  New things will enter the society, or it will fail.  But forcing crappy ideas across the forum will pile-drive this forum faster than anything else could.<br /><br />Like Xky said, the K4 Mods are going to come out soon.  If it is effective, I may create one myself.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22808,
		"title": "Re: ...",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-11-23T02:04:11.000Z",
		"content": "the reason why this forum is depleting is because its based on Commander Keen, a very old game which no one plays or practically remembers any more. Unlike other forums where more and more people take note of it and join, its the complete opposite here.---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 22805,
		"title": "Re: Communication!",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-11-23T02:07:15.000Z",
		"content": "Shhh![img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 22797,
		"title": "grr",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-23T02:42:00.000Z",
		"content": "This place is not dying--there's just some overreaction to the newbies.  We were all kids once; just because some of us are getting older is no reason to become intolerant."
	},
	{
		"id": 22809,
		"title": "Re: ...",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-11-23T03:13:04.000Z",
		"content": "i agree[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 22806,
		"title": "Re: Communication!",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-23T11:15:06.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]This place is not dying--there's just some overreaction to the newbies. We were all kids once; just because some of us are getting older is no reason to become intolerant. [hr][/quote]<br /><br />What a boring knockdown argument. That you're a new and young is no reason to disbehave yourself.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22798,
		"title": "Re: grr",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-24T01:21:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />This place is not dying--there's just some overreaction to the newbies. We were all kids once; just because some of us are getting older is no reason to become intolerant. <br />[hr][/quote]<br /><br />I would disagree.  I do not think it is coming because of newbie posters.  I think it is happening because in reality: nothing is happening with CK.  There are no new interesting Mods, no new posters, obviosuly no new CK games, the fan games aren't usuallu worth the d/l time... And really, like I said before, this forum is not that active.  If something were to occur that would bring in more fans then we would make a triumphant come-back --unfortunetly, this will more than likely never occur.<br /><br />We should accept the fact that all great games will lose fans and come to a close.  I'm not saying it will happen right now, or maybe within the next ten years even, perhaps, but it will happen sometime.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22810,
		"title": "Re: ...",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-11-24T01:48:57.000Z",
		"content": "Thats right. If iD or someone released a new version of Keen which was actually 'good' i bet people would come pouring in.---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 22811,
		"title": "Deep breath...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-24T03:22:24.000Z",
		"content": "Globox, I don't know what you're talking about. It's bad enough all these \"Scene is dying\" posts I keep reading at pouet.net while all around them all sorts of amazing demos are being released, and countless demo parties are taking place across the world, without Keeners starting with this rubbish.<br /><br />I have two mods in progress, Xky is pioneering the (full) Keen4 mod scene, and Levellord has about three or four seasonal mods coming up in the next few months, and from what KeenRush has been willing to show me there's nothing to fear there but his finger hovering over the Del key.<br /><br />We have Z-1's Keen4-style engine and rougueeve's open-source Keen1-3 engine, both of which will bring Keen to more platforms and potential Keeners than ever before, not to mention the modding capabilities. And Zach has yet another fangame in the works.<br /><br />We have a central website for all Keen games, utilities and information, and another that has the potential to be a central source for modding information, run by a well-known and reliable Keeners, as well as countless other fansites.<br /><br />And we're only just starting to get some regular live messenging happening between us. Once that becomes more integrated, there'll be all sorts of collaboration taking place, and that means only good things for future projects.<br /><br />Please will y'all just stfu with all the 'end of the world' junk and actually think about what we have before you start despairing for the health of the community!?<br /><br />[hr]<b>Malvineous</b> 'd be happy to create accounts for people on this forum along the lines of \"username@shikadi.net\"...<br />[hr]That would be awesome. I'm in for that if you can set it up. I downloaded Psi, but I don't know how it works. Can it be used to chat over other chat services the way Gaim and the like do? And we can access the IRC channel through it too, right?<br /><br />If we can get that setup, an announcement could be added to the top of the forum as part of the IRC bit.<br /><br />Also, I've been thinking... when we move (or even beforehand), we could setup a central Keen website where we can post news and keep track of the events that take place, new prods, and so forth, of which the forum could be a part.<br /><br />It wouldn't be a place like Spatang to store all the works and such, but more like a front end for the community to let people know what's going on, and link to relevant sites and threads. It wouldn't replace the Keen Newsletter, either--it could actually help expand it.<br /><br />There's alot we can do with the Keen world now. It's quiet at the moment, but as they say, it's always darkest before dawn.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22799,
		"title": "haha",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-24T06:03:31.000Z",
		"content": "You mean... resurrecting the Keen Newsletter?  *gasp*  Spleen the Necromancer!"
	},
	{
		"id": 22812,
		"title": "Re: Jabber",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-24T12:28:48.000Z",
		"content": "<i>\"That would be awesome. I'm in for that if you can set it up. I downloaded Psi, but I don't know how it works.\"</i><br /><br />Sure, it's already up and running, I've been using it for about six months now without any problems.  Just send me an e-mail at malvineous@shikadi.net and let me know what you want as \"yourname@shikadi.net\" and I'll set up an account for you.<br /><br />As far as Psi goes, click on the main Psi menu, choose Account Setup, add a new account (don't tick 'register new account') then the Jabber ID will be yourname@shikadi.net once I've created the account.  The Resource is like a location, because with Jabber you can be logged on to the same account multiple times - e.g. I have a 'Home' and 'Work' resource so I can be logged on twice.  If you're logged on more than once, messages will go to the account with the largest number in priority.<br /><br />That's about it, but you'll probably want to tick 'Automatically connect on startup' and 'Automatically reconnect if disconnected' on the Preferences tab.<br /><br /><i>\"Can it be used to chat over other chat services the way Gaim and the like do? And we can access the IRC channel through it too, right?\"</i><br /><br />Psi itself can't, it's Jabber only, however Jabber servers can talk to other networks, so e.g. you can add ICQ people as if they were Jabber contacts.  I haven't set shikadi.net up to do this however, so if you want this functionality you're probably better off using Gaim - which IIRC supports the Jabber network anyway so you can still use yourname@shikadi.net with other Jabber people like me.<br /><br />Jabber does have a built in chat room function though, which is pretty much identical to a barebones IRC channel.  It's probably easier to use than IRC as you've already got a guaranteed nick and it's quicker to join (especially if you're running a client like Psi) however it lacks IRC things like colours and bots and the like, so I'm guessing people here will probably prefer IRC.  There's probably some way of linking Jabber and IRC together though, so I'd be happy to look into it if there's interest."
	},
	{
		"id": 22817,
		"title": "Re: Deep breath...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-24T14:49:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Globox, I don't know what you're talking about. It's bad enough all these \"Scene is dying\" posts I keep reading at pouet.net while all around them all sorts of amazing demos are being released, and countless demo parties are taking place across the world, without Keeners starting with this rubbish.<br />[hr][/quote]<br /><br />Right. but we've all seen a hundred Mods before.  Honestly, I can only stand them for about 10 minutes at a time.  Sure some of them can be fun, but how much can you do with the K1-3 Engine?<br /><br />Now like you said, when Xky gets out that K4 mod, we'll have some people getting back into Keen.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22800,
		"title": "Re: haha",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-24T15:55:05.000Z",
		"content": "Well, personally I can stand them for hours and hours. And you can do quite a lot with Keen 1-3 engine, more than enough for me..<b>Eat your veggies!</b>"
	},
	{
		"id": 22813,
		"title": "Re: Jabber",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-24T18:06:02.000Z",
		"content": "I've always dreamed of making dosclassics a sort of Keen portal where people can post articles, downloads and a forum.  All the architecture is in place, but no one adds their downloads [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] [url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22818,
		"title": "Re: Deep breath...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-24T18:54:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I've always dreamed of making dosclassics a sort of Keen portal where people can post articles, downloads and a forum. All the architecture is in place, but no one adds their downloads [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] [hr][/quote]<br />What? I didn't know that...-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22801,
		"title": "Re: haha",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-24T22:54:52.000Z",
		"content": "I think Beyond the Pogo/DosClassics would be more popular if it was integrated into the PCKF - something to consider if/when we move?<br /><br />And speaking of instant messaging: [url=http://www.meebo.com]Meebo[/url]. MSN, AIM, YIM <i>and</i> Jabber - all without leaving your browser. It isn't even a fancy Flash/Java app: it's all Javascript. Useful if your school/workplace has already blocked the other alternatives.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22814,
		"title": "Re: Jabber",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-24T23:04:21.000Z",
		"content": "If there was a forum, why don't we move there? I don't see why is moving hard anyway.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22819,
		"title": "Re: Deep breath...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-25T01:05:46.000Z",
		"content": "I don't control what happens to this forum, it's up to chogall, and he is setting up a phpBB to be at www.cc314.com as far as I know.  I'm not really sure when though, because he keeps paying for more time here at ezBoard.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22802,
		"title": "Re: haha",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-25T10:24:33.000Z",
		"content": "Paying?<br /><br />*vomits*<br /><br />He'd be paying for both, then.<br /><br />Just email/IM him, and tell him to make you an admin. You'd get the PCKF moved in no time.<br /><br />Or... we could just wait. As long as he's paying...Tough Guys Can Fix There Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 22815,
		"title": "Re: Jabber",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-26T05:48:50.000Z",
		"content": "uh...what?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22820,
		"title": "Re: Deep breath...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-26T13:46:30.000Z",
		"content": "Yeah Xtraverse for admin!<br /><br />*thumbs up-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22803,
		"title": "Re: haha",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-27T16:00:58.000Z",
		"content": "lol... Are you guys talking about moving it to a different forum provider or something? o0~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22816,
		"title": "Re: Jabber",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-27T16:33:13.000Z",
		"content": "Somebody asks about that every month or so.<b>Eat your veggies!</b>"
	}
]
