[
	{
		"id": 608,
		"title": "Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-26T09:42:27.000Z",
		"content": "Djaser has asked whether I will be creating a section in the [url=http://wiki.commanderkeen.org]KeenWiki[/url] for the GBC episode of Keen.<br /><br />I wasn't planning to, but before anyone else does I thought it would be a good idea to ask the community what they think.  Given that Tom Hall wasn't too fond of the GBC edition (as I'm frequenty reminded by KR's signature [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ) and it's not really \"classic Keen\" I'll be voting against a GBC section, but I'm interested in what everyone else thinks.<br /><br />So, should the GBC episode feature in the KeenWiki?"
	},
	{
		"id": 15996,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-26T10:25:01.000Z",
		"content": "I don't see why one would not have a Keen GBC Keen section it's a official game and part of Keens history whatever you like it or not. The reasoning not including it on the wiki because it doesn't use Toms ideas and has it's approval is invalid. After all the wiki will include pages for every Keen mod, they were never individual approved by Tom and do not use his idea's.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 15997,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-26T12:14:31.000Z",
		"content": "True, but each mod will be restricted to its own page - a creature created in a mod would not be listed in the official Keen creature list.  If we were to include the GBC episode I would expect that it would \"merge\" with the other official games, and it's this merging that I'm not so keen on.<br /><br />Given that there is almost no discussion about the GBC episode on this forum, I'm inclined to think it's not very popular even among Keen fans - and if it's unpopular, who's going to maintain the pages for it in the wiki?"
	},
	{
		"id": 15998,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-26T12:24:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]If we were to include the GBC episode I would expect that it would \"merge\" with the other official games, and it's this merging that I'm not so keen on.[hr][/quote]<br />But it won't be such a big deal as most objects and characters of the GBC Keen are alternations from the first series.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Given that there is almost no discussion about the GBC episode on this forum, I'm inclined to think it's not very popular even among Keen fans - and if it's unpopular, who's going to maintain the pages for it in the wiki? [hr][/quote]<br />We'll have to wait and see but I don't for see much problems. Let us not forget that images for creatures and objects are already available for use on other websites and because most GBC stuff are alternations the most important thing that needs to happen is add some stuff on existing pages.<br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 15999,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-26T12:44:34.000Z",
		"content": "If it only means adding an extra paragraph or so to existing pages then that doesn't bother me, I guess what I'm really afraid of is \"polluting\" the wiki with new creatures and new places that nobody is familiar with.  Again, I'm not so fussed if it's \"fenced off\" in its own GBC section, but I'm not so sure about mixing all these strange things in with the existing sections..."
	},
	{
		"id": 16000,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-26T12:56:42.000Z",
		"content": "No, I don't consider it a valid Keen game, it has nothing to do with Keen. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  It's so bad and messes up the story line so horribly, as well. (Not that it has any story! (I know it has, but its story is the worst I've ever seen.)) And yeah, Tom doesn't like it either, and had nothing to do with it.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16001,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-26T15:38:26.000Z",
		"content": "No, no, no, no! It doesn't deserve it! It's heretic!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] <br /><br />No, seriously speaking, we should have at least a small summary of it, as a little reference, but no further details (except, perhaps, for creature appearances in that heretic game).------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 16002,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-26T16:13:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] it has nothing to do with Keen.  [hr][/quote]<br />Nothing?<br /><br />[quote]<b><i>Quote:</i></b>[hr]messes up the story line so horribly, as well.[hr][/quote]<br />That's a second lie.<br /><br />[quote]<b><i>Quote:</i></b>[hr](Not that it has any story! [hr][/quote]<br />Third lie.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And yeah, Tom doesn't like it either,[hr][/quote]<br />He has never ever said that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]and had nothing to do with it. [hr][/quote]<br />Indirect, he certainly did.<br /><br />What I was afraid of already happened. People want to exclude the game only based on their taste. I thought a Wiki was supposed to give a neutral point of view and not be some propaganda machine that ignores everything that was not made by god (Tom Hall) like it never existed. <br />Seriously, get real!<br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16003,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-01-26T18:14:44.000Z",
		"content": "It is Keen. This is a Wiki, which means it's intended as a place full of information about everything Keen, whether it's good or not. Unofficial games and mods are here too. Then there are people willing to read up to what Keen GBC's all about.<br /><br />So I vote yes, of course it should be added. As in other Wikis (like Wikipedia) there is certainly no need to merge other info about it in other categories, either.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 16004,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-01-26T19:38:46.000Z",
		"content": "It should be mentioned somewhere, but only one page is really necessary.<br />I don't like it, and a lot of other people don't like it.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 16005,
		"title": "said",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-01-26T22:26:02.000Z",
		"content": "I think the official line, Djaser, was that Tom did not \"consider the GBC game canon by any means.\"  KeenRush had it in his signature with bolds and underlines for a while.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />It deserves to be mentioned, at the very least as an attempt to revitalize the character, even if it was poorly conceived.  It's tough to do platform gaming right these days... so much has changed in what people look for in their games."
	},
	{
		"id": 16006,
		"title": "Re: said",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-26T22:55:49.000Z",
		"content": "Correct.<br /><br />BTW, KR still has it in his sig.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 16007,
		"title": "Re: said",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-27T00:52:25.000Z",
		"content": "Yes, and I will still keep it as my signature. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  From that I thought that Tom doesn't like it, and probably I'm not far off.<br /><br />Anyways. Yes, the GBC plot happens after the originals, but it's pretty lame story and if it were considered canon, TUIT after that would feel pretty pointless, as would any new Keen game.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Not to mention the energy crystals or whatever they were.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />And. What had Tom to do with this game? As far as I know he had nothing to do with it. Wikipedia says that the game 'did not involve any of the original Keen developers'. Of course that info may be invalid, but I don't believe so.<br /><br />It's called a Keen game only because iD still owns the rights and gave permission for David A. Palmer Productions to make the game.<br /><br />But anyways, if someone wants to make a Keen GBC wiki I don't oppose them making a separate wiki. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16008,
		"title": "Re: said",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-01-27T00:57:29.000Z",
		"content": "It might not work well to create a wiki for a single game, though. And I don't think a game should be excluded from the wiki just because people don't like it. But it seems like a lot of people are adamant about this...------------------<br />Nothing in particular"
	},
	{
		"id": 16009,
		"title": "Re: said",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-27T01:30:30.000Z",
		"content": "I suppose it depends on how you define the wiki.  Is it a complete Commander Keen-brand wiki, or is it a \"Tom Hall's vision of Keen\" wiki?<br /><br />At any rate I do agree that we should have a single page mentioning this episode, but if we did that I'd be concerned that it would bring more pages along with it that would fill up the categories (like the item lists) with non-canon things, which would reduce the usefulness of those lists for those who want to browse through the \"real\" Keen universe."
	},
	{
		"id": 16010,
		"title": "Re: said",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-27T02:34:55.000Z",
		"content": "Then simply don't link them into those lists; it can be unofficial policy. I don't really see the problem; I really want to know about GBC Keen.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 16011,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-01-27T02:36:24.000Z",
		"content": "It's an official Keen game, and should be considered as such, period.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16012,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-27T19:32:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] I think the official line, Djaser, was that Tom did not \"consider the GBC game canon by any means.\" KeenRush had it in his signature with bolds and underlines for a while. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [hr][/quote]<br />I know that, but it means that he doesn't consider the game as a sequel. I don't think it was ever meant to be one but that's an other 'old'  discussion. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Anyways. Yes, the GBC plot happens after the originals, but it's pretty lame story and if it were considered canon, TUIT after that would feel pretty pointless, as would any new Keen game..[hr][/quote]<br />Do you honestly expect that if Tom would made a new game that he would pick up a story line from sixteen years ago? I wouldn't expect it from anyone else either.<br /><br />[quote]<b><i>Quote:</i></b>[hr]It's called a Keen game only because iD still owns the rights and gave permission for David A. Palmer Productions to make the game.[hr][/quote]<br />That's right and in the same way TUIT would be called a Keen game because ID would have sold the right to Tom Hall. Your point is?<br /><br />[quote]<b><i>Quote:</i></b>[hr] What had Tom to do with this game? As far as I know he had nothing to do with it. Wikipedia says that the game 'did not involve any of the original Keen developers'. Of course that info may be invalid, but I don't believe so.[hr][/quote]<br />Almost everything in the game were re-used ideas of the pervious Keen games. Therefore he's indirectly involved. <br /><br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16013,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-28T00:13:13.000Z",
		"content": "I, hereby, nullify my former vote, and my answer is YES. It MUST feature with its own section. And additionally, we can add something like:<br />------------<br />Robored<br />BLAHBLAHBLAH KEEN5 BLAHBLAH<br />It is smaller and less frightening in Keen GBC. (Screenshot if somebody can get one) It blahblah GBC blahblah.<br /><br />Period.<br />-----------<br />That.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 16014,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-28T01:13:41.000Z",
		"content": "Indeed; while we may not consider this cannon, that can be added into the wiki. There is simply no debate, it is Keen related and therefore should have its own section and articles. The Germans didn't edit the Nazis out of history, even though they deeply dislike them, and we shouldn't edit this out of our wiki just because it's a terrible and useless game.<br /><br />TMST even featured it in his 'Keen 10 Years on' paradoy, so I think we can tolerate it.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 16015,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-28T07:02:23.000Z",
		"content": "The Germans certainly didn't edit the Nazis out of history, but if they wrote a history book focussing on all of Germany's friendliest encounters with other nations then you could understand if there was no mention of the Nazis.<br /><br />I'm not saying that we should ignore the GBC episode, just that it's not relevant to what I consider \"Commander Keen\" - but it is a community wiki, and it looks like the majority of people want it so I'm not going to stand in the way.<br /><br />How should we proceed?  I suggest we coordinate it here first so we don't end up with ten different pages covering the same content...<br /><br />What's the name of this episode?  (e.g. Keen 1 is \"Marooned on Mars.\")  Once I find out the name of the GBC episode I'll create a page for it in the same fashion as the other episodes and link to it on the front page, then get out of the way [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 16016,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-01-28T08:47:00.000Z",
		"content": "I think it should be included in the Wiki, but in it's own category, such as non-Tom Canon, post-id era, non-id, etc. Similar to the way Wikiepedia categorized it ( [url=http://en.wikipedia.org/wiki/Commander_Keen]en.wikipedia.org/wiki/Commander_Keen[/url] ).<br /><br />BTW, how would it fit in a timeline? Pre or post TUIT? Prequel? In-between game? Or just on the side? Though Wikipedia just has it on the side, while giving the other games episode numbers.<br /><br />I also believe that the story is better than that of Keen Dreams. Though I've never played the game, if I was to I wouldn't ever think of it the same way as the other ones."
	},
	{
		"id": 16017,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-28T14:35:19.000Z",
		"content": "Sigh.. Well, if you guys insist..<br /><br />I'd suggest it to be considered as non-canon game, as in my opinion Tom's Keeniverse is the only real Keeniverse (and Tom doesn't consider it canon).<br /><br />Perhaps the articles that are about enemies also seen in Keen GBC (I guess it could be called 'Keen GBC' in KeenWiki) could mention that the enemy is also seen in Keen GBC, and so on. Just somehow indicate the wiki is mainly for the PC games, I dunno..<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yawn.gif[/img] <br /><br />\"Do you honestly expect that if Tom would made a new game that he would pick up a story line from sixteen years ago?\"<br />I do. I'm sure he has shaped it quite nicely during all these years. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] <br /><br />\"Your point is?\"<br />My point was that it doesn't have the Keen spirit at all, and it can be called 'Commander Keen' only because they are legally able to do so (and yes, this is my opinion).<br /><br />\"Therefore he's indirectly involved.\"<br />I guess I could say I did co-operate work with Tom Hall in Episode Smile, as I was using his invention Commander Keen as my main character. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  That'd look good in readme. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16018,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-28T16:44:23.000Z",
		"content": "I didn't say he worked on it, I said he was indirectly involved. And yes in my opinion that would also count for your mod but let's not forget that's not an official production.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16019,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-28T16:58:17.000Z",
		"content": "Better category name: \"external game\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] ------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 16020,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-01-28T20:24:43.000Z",
		"content": "The Keencyclopedia made no specific distinction between GBC and the other games and it worked out fine. Whether or not it's a good game, it's part of the history of Keen and there's no reason it should be included any differently than it was for the Keencyclopedia.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 16021,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-29T00:08:13.000Z",
		"content": "Exactly. We need *everything* about Keen, we're not going to hide some stuff away in the corner because some people don't like it.<br /><br />Now let's put up that category!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 16022,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-01-29T13:42:53.000Z",
		"content": "Okay, there's a link on the wiki main page now for Keen GBC.  I would still like it to remain somewhat separate to the rest of the wiki (e.g. I would hope those crystals or whatever they are don't get listed in the Keeniverse category - but of course it's fine to list them in the 'Keen GBC items' category.)"
	},
	{
		"id": 16023,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-06-30T08:29:32.000Z",
		"content": "I voted that it should.  I've never played it, and I admittedly have no interest in doing so, but it IS an official episode and it thusly can't be excluded."
	},
	{
		"id": 16024,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-06-30T12:50:27.000Z",
		"content": "Err...you should check the post dates in this forum - this was decided five months ago and there's already a ton of GBC info on the wiki...although it's not very well maintained - I guess all the people who voted for it aren't so great at putting their money where their mouth is... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16025,
		"title": "Re: Should the GBC episode feature in the KeenWiki?",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-06-30T17:17:26.000Z",
		"content": "Oopsie. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]"
	}
]
