[
	{
		"id": 939,
		"title": "KQIX Shuts Down",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-29T02:18:26.000Z",
		"content": "I've just noticed that [url=http://www.kqix.com/]King Quest 9[/url], the best King Quest fangame was shut down two months ago. It was a free, fan made game for fans, and looking at the screenshots you can see that it was quiet professional. I'm really sad about this, as I was looking forward to that game. I don't think that the owner of the trade name wants to do a game based on the series...[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22642,
		"title": "Re: KQIX Shuts Down",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-11-29T05:15:04.000Z",
		"content": "Wow, I hadn't seen this KQ fangame before. The website alone looks quite professional. And going by the screenshots, this game would have been fun to play.<br /><br />Ah well... we've still got the Kings Quest re-releases to look forward to (well, I do, at least. I'll finally get a chance to legally own the games).--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 22643,
		"title": "Re: KQIX Shuts Down",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-29T16:47:05.000Z",
		"content": "I don't know how a company producing a free fangame that didn't aim to make any money managed to afford or organise a 40+ strong team to develop and market said game, especially when the concept was not their intellectual property and they had not licensed it. From what I can tell, their team is made up of volunteers and they knew from the start that Sierra would shut them down - so why did they put so much effort into it? It's a mystery to me...[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 22644,
		"title": "Re: KQIX Shuts Down",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-29T20:20:32.000Z",
		"content": "It is not a real company and I bet most of the team were not working on it too much, just helping...<br /><br />[quote]<b><i>Quote:</i></b>[hr]so why did they put so much effort into it? It's a mystery to me...[hr][/quote]It happens when some people try to make something good, and not for profit. They got a bit sentimental and I bet they just lied to themselves about that they were to be shut down. You cannot blame people for being optimistic for something they love.<br /><br />I can't really blame the company either. It's about their reputation, but it is still sad.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22645,
		"title": "Re: KQIX Shuts Down",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2005-12-14T19:26:27.000Z",
		"content": "If anybody is interested, Vivendi gave Pheonix Online a fan license to continue making the game(which is good news for me cause I'm as much a King's Quest fan as I am a Commander Keen fan.)  The funny thing is they aren't even going to make them change any characters or the storyline or anything, but the only thing they have to change is the title from King's Quest IX: Every Cloud has a silver lining, to just The Silver Lining.  I heard on the KQ9 website(you can probably find it just by googling it) that they had decided to consider the fan license almost 3 months ago, but it just took this long to become public.  I guess these thing always take time.  Maybe Keen 7 has hope after all..."
	}
]
