[
	{
		"id": 1453,
		"title": "Tyrian",
		"author_id": 1486530,
		"author_name": "I Am Keen",
		"timestamp": "2004-09-04T22:33:19.000Z",
		"content": "I'm sure that many posts have been started about Tyrian, but it is such a sweet game that I will start another.  Check this out: http://www.freewebs.com/worldtreegames/<br />As you can see, Tyrian 2000 has been released as freeware in all its (soundless) glory!  Tyrian is an old space shooter from the early nineties that was slightly revamped in the late nineties.  Since then, its copyrights have jumped around a few times, only to find a home back in the hands of its original owner!  Hurrah!  That page also has downloads for the unfinished unreleased Tyrian games for Game Boy Color and game Boy Advance.  You need an emulator for them, so I haven't tried them yet, but they are supposedly very cool.<br /><br />Also, if you go to http://members.iinet.net.au/~vannevar/tyrian/ you will see that Tyrian even has a little community.  Not that I am a part of it or anything, but isn't it nice that it has a group?  It says nothing regarding the old legend Tyrian 3D though.  I remember hearing about that back in the day and when i Googled for it, all i found was this page (http://xsoft.esmartbiz.com/) and then a mention of it in another topic I made a few years ago here.  Crazy, huh?  Oh well.  Tyrians are all sweet games.  Have a fun time, everyone!maybe then i'll fade away and i'll have to face the facts.  its not easy facing up when you're whole world is black."
	},
	{
		"id": 30296,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 30297,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	},
	{
		"id": 30298,
		"title": "Unknown",
		"author_id": 0,
		"author_name": "Anonymous",
		"timestamp": "2004-12-31T22:00:00.000Z",
		"content": "(This post is missing and can not be restored)"
	}
]
