[
	{
		"id": 860,
		"title": "The Greatest Gift",
		"author_id": 1486154,
		"author_name": "thenewmoonsidianX",
		"timestamp": "2006-03-04T21:54:17.000Z",
		"content": "First of all, let me say that I'm a Christian (and a very happy one, at that) and recently, I've felt called to give anyone on these forums who wants it an invitation to become one too.<br /><br />I'll keep this message short and simple.  I have a Friend named Jesus who took the punishment for my sins, your sins, and everyone else's sins in the whole world.  None of us deserve to have them taken away and forgiven, but He did it anyway, entirely out of love and as a gift, \"so that whosoever believes in him should not perish but have everlasting life\" (John 3:16).  And you can receive the greatest gift ever - eternal salvation for free - for yourself right now.<br /><br />All you have to do is bow your head wherever you are and accept Jesus as your personal Savior, and rest assured that you are saved.  And once again, this is simply an invitation.  Anyone who doesn't want it doesn't have to become a Christian, but everyone who does will be infinitely glad they did."
	},
	{
		"id": 21622,
		"title": "Re: The Greatest Gift",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-05T01:00:05.000Z",
		"content": "I've a bad feeling the anti-religious persons of this board will go mad about this.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />But anyways, pretty good post, cheers. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Agree..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21623,
		"title": "Re: The Greatest Gift",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-05T02:13:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />First of all, let me say that I'm a Christian (and a very happy one, at that) and recently, I've felt called to give anyone on these forums who wants it an invitation to become one too.<br /><br />I'll keep this message short and simple. I have a Friend named Jesus who took the punishment for my sins, your sins, and everyone else's sins in the whole world. None of us deserve to have them taken away and forgiven, but He did it anyway, entirely out of love and as a gift, \"so that whosoever believes in him should not perish but have everlasting life\" (John 3:16). And you can receive the greatest gift ever - eternal salvation for free - for yourself right now.<br /><br />All you have to do is bow your head wherever you are and accept Jesus as your personal Savior, and rest assured that you are saved. And once again, this is simply an invitation. Anyone who doesn't want it doesn't have to become a Christian, but everyone who does will be infinitely glad they did.<br />[hr][/quote]<br /><br />You do realize that only culturally ignorant people don't know how to 'get saved'?<br /><br />Oh f*ck it.<br /><br />You want to discuss Christianity and why I should get saved?  I'm all ears.  Tell me why I should get saved.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21624,
		"title": "sf",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T02:42:52.000Z",
		"content": "Looks like someone decided the boards were too quiet again."
	},
	{
		"id": 21625,
		"title": "Re: sf",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2006-03-05T05:42:54.000Z",
		"content": "Please don't tell Globox how to get saved."
	},
	{
		"id": 21626,
		"title": "Re: sf",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-05T06:54:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You want to discuss Christianity and why I should get saved? I'm all ears. Tell me why I should get saved.[hr][/quote]<br /><br />Because if you aren't who will argue with me for eternity?<br /><br />Okay; seriously:<br /><br />A purpose to the universe, life and everything, a reward for your work and eternal life, and all for a simple little belief what have you got to lose?<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]Please don't tell Globox how to get saved.[hr][/quote] <br /><br />*One day in heaven...*<br /><br />Spike: LL! How the hell did you get here?<br /><br />LL: I gots hit by a meteor and they wouldn't let me stay down below.<br /><br />*Much thunder and ligthening, Globox is flug at high speed, and slightly charred into a cloud*<br /><br />GOD: For the love of me! Will you *shut up!*<br /><br />Glo: And that *another* thing; whats with all the clouds? From what I recall this as a concept of heaven was only introduced in the 18th century, and that brings me to what we were discussing earlier about angels...<br /><br />GOD: Arrggh! Satan? SATAN! Get your dammed butt up here! I though he was under *your* juristriction?!<br /><br />Satan: *Emerges from sulphurus pit* But do I really exist? I mean, I'm not mentioned at all in the old testamnet; what if I'm really just an anthropomorphic personification of a belief in...<br /><br />LL: Hey, you wanna go play against Spleen in a rousing game of Keen 3D multiplayer?<br /><br />Spike: Yeah, why not; he belives he can beat us by tapping our shared consiousness.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21627,
		"title": "Re: sf",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-05T08:28:52.000Z",
		"content": "Is belief required to be \"saved?\"[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21628,
		"title": "Re: sf",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T09:04:35.000Z",
		"content": "Oh wait, here's where the Commander Keen 3D: The Afterlife is Toast (Single/Multi-player version) [Mind-meld console] was supposed to go.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 21629,
		"title": "w00tz",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-05T09:40:46.000Z",
		"content": "Wow, haven't seen a roleplay of that quality here for a long time.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />I prefer to take what Jesus taught and put it to practical use--he basically shows us the way to instant manifestation, and that we 'will do all these things and more' is an incredible promise.<br /><br />The whole 'Jesus Saves' and 'Eternal Life' are overused statements that have been hollowed of all meaning, IMKO. I could use the term clich, but that just doesn't quite capture it.<br /><br />\"Do what you will, but if you do something bad you should at least be sorry, otherwise you won't get any dessert.\" I just don't buy that. That kind of thing never worked on me when I was a kid, and it won't work on me now.<br /><br />If I notice a pattern of action or thought isn't bringing me the results I desire, I simply establish a different pattern. Jesus is one source I borrow from, but far from the only one.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 21630,
		"title": "Re: The Greatest Gift",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-05T12:24:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]A purpose to the universe, life and everything, a reward for your work and eternal life, and all for a simple little belief what have you got to lose?[hr][/quote]<br />It's a lot you have to believe in:<br />- that genoicide can be a good thing<br />- that you are nothing then a servent of Jesus<br />- that you're a bad person because of your many sins<br />- that homosexuals should be given the penalty of dead<br />- that you'll be save but your closes friends who don't believe will burn for eternilty<br />- Slavery is all right<br />- unbelievers should be killed<br /><br />etc. etc.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 21631,
		"title": "Church, Not Christ",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-05T13:08:23.000Z",
		"content": "Jesus has nothing to do with those things, it's the Churches that read that sort of thing into the Bible. Any church that preaches such hateful nonsense is wholly Anti-Christian by definition.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 21632,
		"title": "Re: Church, Not Christ",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-05T13:23:02.000Z",
		"content": "He has with half of them but I see your point though, a lot this stuff is written in the old testament and Jesus said different things. But why did he, I understand his mission but that doesn't mean everything written in the old testament is suddenly invalid. That doesn't make sense.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 21633,
		"title": "Re: Church, Not Christ",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-05T14:08:00.000Z",
		"content": "It's rather amusing that an atheist and a godhater reads the Bible as any fundamentalist would read it.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br />I don't personally know anyone that thinks the Bible is an absolute truth from word to word. And yes, most quite ignore the OT almost entirely.<br /><br />And, anyways, why couldn't God change His opinion or plans or whatever? You (Djaser) seem to see God as an unstoppable machine that has decided something and then loops that forever.<br /><br />I'm not sure whether all the accounts in the Bible where God's pattern of thoughts or actions are described can be considered 100% valid..<br /><br />And yeah, agree with Spleen.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21657,
		"title": "Re: The Greatest Gift",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-05T14:38:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It's rather amusing that an atheist and a godhater reads the Bible as any fundamentalist would read it.. [hr][/quote]<br />Bullshit, I read the bible as it is written and exaggerate a bit but it's still is what there is written. Fundamentalists read the bible different from what I do, half of my family are fundamentalists so I know what I'm talking about it. It's even more funny that when you just say what is written in the bible that some people call you a fundamentalist, or do you only take the thing in the bible for real that you really like from a personal point of view? Now that makes you a real christian!<br /><br />[quote]<b><i>Quote:</i></b>[hr]I don't personally know anyone that thinks the Bible is an absolute truth from word to word. And yes, most quite ignore the OT almost entirely.[hr][/quote]<br />See my previous question. What use does the bible have if you ignore parts of it, then it's not the word of God anymore.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And, anyways, why couldn't God change His opinion or plans or whatever? You (Djaser) seem to see God as an unstoppable machine that has decided something and then loops that forever.[hr][/quote]<br />He is perfect because he is God so he can't make mistakes. If he isn't then why is he better then humans?<br />-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 21658,
		"title": "Hmmm",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-05T17:42:07.000Z",
		"content": "\"... or do you only take the thing in the bible for real that you really like from a personal point of view?\"<br />Well, definitely not. I just don't believe God has written it by Himself. I believe some of the writers were influenced by God, got kinda order or impulse to write it, but were never controlled by Him and hadn't any divine commandment to write exactly something and so on. I just don't see it's something holy collection chosen and written by God word by word, mainly because of:<br />[url=http://www.google.com/search?q=bible+contradictions]www.google.com/search?q=b...radictions[/url]<br /><br />And, I'm pretty sure there are scriptures that aren't even by His influence, stuff that is just made up by some man to gain power or whatever desired. As well, I'm sure the actual text has changed, it has been modified for various purposes (probably by the church institution to gain power), and there are errors that have appeared because of various translatings and such. As well, I believe there are many things that the original/first Christians believed in and considered important, but they're missing for some reasons, perhaps even considered heretic now.<br />Bottom line is that I don't believe it's something perfect collection of books written by God Himself.<br /><br />Naturally I may be wrong. But I try to base my life on what Jesus has teached and so on, not what some contradicting books exactly say. For me God is the ultimate good, and Jesus part of that while being a perfect human as well. I belive Jesus is the Saviour, and loves everyone. I'm inclined to think everyone'll 'join the party' eventually. Not even sure if there is any other kind of afterlife than heaven. I believe life has important meaning and such, and not that human is created to praise God 24/7 for all eternity. Probably the Bible doesn't even say anything like that. If it says, that's probably the belief of the certain person who has written that specific book or the belief has been his community's. Might even be that he personally gained some power from it or anything. All history is full of lies and scams. Anyways, these are things I believe in and consider important. Jesus saves, no Bible is really required.<br /><br />And, I really don't care whatever you say against this. Besides I'm not the only one thinking this way. And well, it doesn't really matter even if it all would be written by God word by word, I still try living according the Bible, and most importantly, base my faith in God itself instead of some books.<br /><br />Besides, there are different ways to interpret the Bible, as said. Some Christians take it literally, others read it by considering not everything true in it but there being some common truth in it such as Jesus being the Saviour that loves everyone etc..<br />Not to mention that there are dozens of forms of Christianity..<br /><br />Edit:<br />\"What use does the bible have if you ignore parts of it, then it's not the word of God anymore.\"<br />See above.<br /><br />\"He is perfect because he is God so he can't make mistakes. If he isn't then why is he better then humans?\"<br />Who said anything about mistakes? Not me at least. Changing one's plans or opinions isn't always because of mistakes. At least in my case. And if you mean that God has made a mistake if He changes His plans, I have to disagree. I'm sure God has a free will as well.. He can choose whatever he wants to. And what makes you think God should even do anything at all? He could make mistakes if He has modified Himself capable of that. And naturally it's only your idea of error. It could be perfect plan that just goes that way and you can't understand it. We can't really explain God with our words and terms, anyway.<br /><br />Another edit: Just to note that my beliefs are changing during the time. Perhaps in a few years I think Bible has no contradictions at all.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21659,
		"title": "Re: The Greatest Gift",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-05T19:02:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] I just don't see it's something holy collection chosen and written by God word by word, mainly because of:<br />www.google.com/search?q=b...radictions[hr][/quote]<br />Exactly this is one of the main reasons why I will never be a christian again.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And, I'm pretty sure there are scriptures that aren't even by His influence, stuff that is just made up by some man to gain power or whatever desired.[hr][/quote]<br />Do you mean later additions or scriptures written in the time that the bible was written. I'd like to see some examples of books you think are written with that purpose.<br /><br />[quote]<b><i>Quote:</i></b>[hr]As well, I'm sure the actual text has changed, it has been modified for various purposes (probably by the church institution to gain power), and there are errors that have appeared because of various translating and such.[hr][/quote]<br />Translation errors indeed exist but they don't explain all contradictions in the bible. Also the church has selected which books would be included in the bible but I don't believe, unless you have prove, that they changed the text to gain power. If they did it would be know, the bible has been studied for a very long time by scientists. <br /><br />[quote]<b><i>Quote:</i></b>[hr]As well, I believe there are many things that the original/first Christians believed in and considered important, but they're missing for some reasons, perhaps even considered heretic now.<br />Bottom line is that I don't believe it's something perfect collection of books written by God Himself.[hr][/quote]<br />Agreed on that, later more on this.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Besides, there are different ways to interpret the Bible, as said. Some Christians take it literally, <b>others read it by considering not everything true in it but there being some common truth in it such as Jesus being the Saviour that loves everyone etc..</b><br />Not to mention that there are dozens of forms of Christianity..[hr][/quote]<br />Like I said before, that's just taken thing for granted that you like from a personal point of view. Nice but most of them are closer to being agnostic then a Christian.<br /><br />\"He is perfect because he is God so he can't make mistakes. If he isn't then why is he better then humans?\"<br />Who said anything about mistakes? Not me at least. <br />[quote]<b><i>Quote:</i></b>[hr]Changing one's plans or opinions isn't always because of mistakes.[hr][/quote]<br />Agreed on the part about plans but not about the part of opinions. You can only change your opinions if they are wrong, why else would you do that?<br /><br />[quote]<b><i>Quote:</i></b>[hr]And naturally it's only your idea of error. It could be perfect plan that just goes that way and you can't understand it. We can't really explain God with our words and terms, anyway.[hr][/quote]<br />No it's not; first forcing the Jews to commit genocide and then preach love and peace is just insane, suddenly the killing in the name of was a crime. <br />It's worse; those contradictions make it impossible to say what's right and what's wrong. You could just choice if you want to kill in the name of God or bring peace in the name of God, it's all written in the holy book anyway. Like you said the bible isn't a perfect collection of Gods point of view plus that the early Christians from the first century had different ideas then the Christians nowadays makes it impossible to believe the right way because you don't know how! You're saying it yourself in your whole post. Who knows for sure if I'm not a good Christian in Gods eyes and you're not a bad sinner?<br />-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 21634,
		"title": "Re: Church, Not Christ",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T22:29:28.000Z",
		"content": "I think Jesus is understood by many as having made invalid much of the stuff in the OT  The OT itself is quite questionable, just look at the front page of www.evilbible.com.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I don't personally know anyone that thinks the Bible is an absolute truth from word to word.[hr][/quote]<br /><br />Oh, I wish I didn't either.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And, anyways, why couldn't God change His opinion or plans or whatever?[hr][/quote]<br /><br />He could simulate change over time, but being omniscient, he would have known everything from the start.  Furthermore, if he was independent of time, he wouldn't even change as result of it.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 21635,
		"title": "Re: Church, Not Christ",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-05T23:44:44.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't personally know anyone that thinks the Bible is an absolute truth from word to word.[hr][/quote]<br />Unfortunately, there are a lot of people you don't know who do.<br />Scriptures from all religions annoy me because people take them so bloody seriously and much of what they say becomes outdated quickly or never should have been there in the first place.<br /><br />It is true that a lot of hate and intolerance stems from religion, but it is hard to say whether there would still be as much hate and intolerance without religion.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21636,
		"title": "Re: Church, Not Christ",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-06T01:13:40.000Z",
		"content": "I'm guessing there'll be less stupidity, at least.  All the Europeans (and many others) are just watching oogled [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]  at the legal battles about teaching Intelligent Design in public school, like \"how could Americans be so dumb?\"  And seriously, they're right.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 21637,
		"title": "Re: Church, Not Christ",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-06T04:26:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Please don't tell Globox how to get saved. <br />[hr][/quote]<br />I smiled on the inside when I read this.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21638,
		"title": "Re: Church, Not Christ",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-06T09:22:08.000Z",
		"content": "\"Do you mean later additions or scriptures written in the time that the bible was written. I'd like to see some examples of books you think are written with that purpose.\"<br />How do I know? I just assume that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  Perhaps not entirely books but some parts or them or something. I just mean there might be stuff that is written by someone for more personals than religious reasons, without God's influence. I can't prove this, of course. But the church institution itself choosing which books to include in the Bible shows at least something already..<br /><br />\"Like I said before, that's just taken thing for granted that you like from a personal point of view. Nice but most of them are closer to being agnostic then a Christian.\"<br />Hmmm, whatever. But can't see them being agnostic at least, since I do believe that God exist.<br /><br />\"Agreed on the part about plans but not about the part of opinions. You can only change your opinions if they are wrong, why else would you do that?\"<br />Why would omnipotent and omniscient really do anything? It's as much a mystery as this opinions thing. I don't really know! It's too metaphysical to think about it.<br /><br />\"It's worse; those contradictions make it impossible to say what's right and what's wrong. You could just choice if you want to kill in the name of God or bring peace in the name of God, it's all written in the holy book anyway.\"<br />Yeah, and it has been already done during the history. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] <br />Yes, it may be problematic, but again, I try to do as Jesus has taught.<br /><br />\"Like you said the bible isn't a perfect collection of Gods point of view plus that the early Christians from the first century had different ideas then the Christians nowadays makes it impossible to believe the right way because you don't know how! You're saying it yourself in your whole post. Who knows for sure if I'm not a good Christian in Gods eyes and you're not a bad sinner?\"<br />Well, there'd be certain irony on that, then. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  You're right, one can't be that sure about it. But there has really never been anybody with perfectly correct belief (except Jesus, but dunno if that counts in this case) I guess. I guess in this case one has to choose which way is more according to the latest 'official info', in this case Jesus' teachings.<br />But yes, one can't know the exactly correct belief.<br />All the Catholics might be heretic because of their belief in saints and popes.<br /><br />Needless to say, I don't consider the church institution itself very necessary, nor holy. If it really is, then people really have severely misused it.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21639,
		"title": "Re: Church, Not Christ",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-06T20:10:15.000Z",
		"content": "I guess we (almost) agree then, right now I have nothing important to say against your post anyway.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 21640,
		"title": "... Back briefly once again.",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2006-03-31T19:28:47.000Z",
		"content": "I was browsing through the forum and found this.<br /><br />The complete story is this.<br /><br />Hell was originally created for Satan and his fallen angels, but basically anyone who disobeyed God could go there.<br /><br />God gave man the choice to disobey or not to disobey and live in perfection forever. He made the tree of Knowledge of Good and Evil to give Adam the choice. There was nothing special about the tree, it was just that God was giving Adam his free will.<br /><br />But Adam, knowing it was forbidden, and being tempted by Eve, bit the apple, disobeying God and allowing sin and rebellion into the world. There never would've been death if Adam hadn't bit the apple.<br /><br />So basically whoever was guilty of breaking even one of God's laws was guilty of sin and had to be punished. But if you could find a substitute to take your place in Hell, then you wouldn't have to go. Problem is, I have so many of my sins I can't substitute for you and you have so many of your sins you can't substitute for me. The only person who was willing and able was Jesus Christ.<br /><br />2000 years ago, God the son came to earth as a man to eventually die on the cross, go to Hell for three days then rise again. This payed the price for everyone's sin.<br /><br />All you have to do is accept Jesus Christ, ask God's forgiveness and invite Jesus into your heart and you will be saved from eternal punishment. Even though we fell into sin at the beginning of the universe, God was willing to send his only son to die on the cross. All because he loves us deeply with passion, as a father loves his many children.<br /><br />There are bad people and good people wether they are Christians or not, the difference is that Christians are saved (they prayed the sinner's prayer) and are born-again in the spirit, so they won't have to pay the price for their sins.<br /><br />I dare you to say God isn't a merciful God or he's bad in anyway. Some people ask \"Why do bad things happen to good people.\" Some say that God's not fair and they are totally right. If he was fair, I would get what I deserve: eternal punishment.<br /><br />That's all I've got to say on that.<br /><br />Now about some insignificant topics. Yes, the bible is completely correct cover to cover. There are no contradictions.<br /><br />[url=http://www.drdino.com/]www.drdino.com/[/url]<br /><br />[url=http://www.lifechurch.tv/]www.lifechurch.tv/[/url]<br /><br />Those guys on those two site cover almost all of those smaller insignificant topics and give you correct answers to questions.<br /><br />At the lifechurch.tv site go to the Q&amp;A series to learn some things. Kent Hovind at drdino.com addresses the lie about there being contradictions in the bible, showing that there are no contradictions by studying the bible.<br /><br />Alright, I'm done. Flame me. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-Dreamer"
	},
	{
		"id": 21641,
		"title": "Re: ... Back briefly once again.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-04-01T17:24:04.000Z",
		"content": "It's Kent Hovind, my favorite lunatic![url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21642,
		"title": "Re: ... Back briefly once again.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-04-03T20:37:28.000Z",
		"content": "I have this cool program that saves my screen.<br />Also I don't (currently) feel like reading this thread, although I did race through it, and read the shorter posts properly even. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />Finally, I don't personally need saving, yay!Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 21643,
		"title": "Re: ... Back briefly once again.",
		"author_id": 1486154,
		"author_name": "thenewmoonsidianX",
		"timestamp": "2006-04-17T00:30:57.000Z",
		"content": "Glad to hear that some other people on these forums are Christians. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   Dreamer went into the whole explanation of why we need to get saved a lot slower and deeper than I did, so read his post if you want a more detailed version of the story with more explanation."
	},
	{
		"id": 21644,
		"title": "Re: ... Back briefly once again.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-17T05:20:33.000Z",
		"content": "Well, as a Jehovah's witness I have an interesting outlook on hell, which is basically that God isn't going to give you eternal torment and fire, thats nowhere near his loving nature. We view hell as a last resort, God will only place there people who absolutely refuse his prescence and values, after all, he *wants* as many people saved as possible; do you think he's gonna throw away a perfectly good soul over a few technicalities? No, he's gonna try as hard as he can to get them saved. I think a lot of atheists are going to be quite surprised when they pass away, after all, a lot of them appear to me to be quite christian.<br /><br />Also, hell to us is merely nonexistence, the  origional greek is She'ohl = and hai'des both are used over 70 times and relate to death. Now when a specific place is used, such as a gravesite, the bible uses different words. We also hear how it has 'opened its mouth wide, beyond bounds' [Proverbs <b>3</b>0: <b>15</b> .16] this and other passages lead us to believe it is the common 'burial ground' of dead mankind, where the dead go in their sleep of death [Its complex and hard to explain] This then is not hell, but a place where those awaiting ressurection lie.<br /><br />Now another place is used, for those who will recieve no resurrection [restoration to life and existence] this is 'Gehenna' [Matthew 5:30, 10:28, 23:33] This then would be the traditional 'hell' and we believe it merely to mean total and utter oblivion. Isn't this better than an eternity of tourture amongst flames? I think this is much closer to what God would do. He s not after all, evil or malignant.<br /><br />I'm sorry if little of this makes sense, I'm not a good explainer, you'll have to ask more pecific questions.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21645,
		"title": "And one more thing...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2006-04-17T19:45:53.000Z",
		"content": "For those who have read The Da Vinci Code. Check out this website.<br /><br />http://about-jesus.org/<br /><br />Just read through that.-Dreamer"
	},
	{
		"id": 21646,
		"title": "Re: And one more thing...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-17T21:38:03.000Z",
		"content": "Pretty good posts Dreamer and LL.<br /><br />To LL: What's that 'sleep of death'?3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21647,
		"title": "Re: And one more thing...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-04-18T20:59:42.000Z",
		"content": "To die,  to sleep <br />No more; and by a sleep, to say, we end<br />The heart-ache, and the thousand natural shocks<br />That flesh is heir to; 'tis a consummation<br />Devoutly to be wish'd. To die  to sleep <br />To sleep? perchance, to dream. Ay, there's the rub;<br />For in that sleep of Death what dreams may come,<br />When we have shuffled off this mortal coil,<br />Must give us pause.<br /><br />[quote]<b><i>Quote:</i></b>[hr]All you have to do is accept Jesus Christ, ask God's forgiveness and invite Jesus into your heart and you will be saved from eternal punishment[hr][/quote]<br />What does \"accepting Jesus Christ\" entail?  I can't force myself to believe something.  While I go to church every week and am quite familiar with religion, I can only pretend to believe in the Christian God.  My mind knows that I don't really.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21648,
		"title": "Re: And one more thing...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2006-04-19T02:43:13.000Z",
		"content": "I'm sorry LL, but the bible says otherwise about hell. 9 through 11 are the key verses but I put this all into context for you.<br /><br />Revelation 19:6-7<br /><br /> 6And I saw another angel fly in the midst of heaven, having the everlasting gospel to preach unto them that dwell on the earth, and to every nation, and kindred, and tongue, and people, <br /><br /> 7Saying with a loud voice, Fear God, and give glory to him; for the hour of his judgment is come: and worship him that made heaven, and earth, and the sea, and the fountains of waters. <br /><br /> 8And there followed another angel, saying, Babylon is fallen, is fallen, that great city, because she made all nations drink of the wine of the wrath of her fornication. <br /><br /> 9And the third angel followed them, saying with a loud voice, If any man worship the beast and his image, and receive his mark in his forehead, or in his hand, <br /><br />10The same shall drink of the wine of the wrath of God, which is poured out without mixture into the cup of his indignation; and he shall be tormented with fire and brimstone in the presence of the holy angels, and in the presence of the Lamb: <br /><br /> 11And the smoke of their torment ascendeth up <b>for ever and ever</b>: and they have no rest day nor night, who worship the beast (anti-christ) and his image, and whosoever receiveth the mark of his name. <br /><br /> 12Here is the patience of the saints: here are they that keep the commandments of God, and the faith of Jesus. <br /><br /> 13And I heard a voice from heaven saying unto me, Write, Blessed are the dead which die in the Lord from henceforth: Yea, saith the Spirit, that they may rest from their labours; and their works do follow them. <br /><br /><br />You think that people just cease to exist huh? Let's skip to the 20th verse.<br /><br /><br /> 20And the beast was taken, and with him the false prophet that wrought miracles before him, with which he deceived them that had received the mark of the beast, and them that worshipped his image. These both were cast alive into a lake of fire burning with brimstone.<br /><br /><br />The key word there is alive. They were totally conscious and later in revelation it's says that those who have not accepted Jesus Christ or those who have taken the mark of the beast will share this torment.<br /><br /><br />Revelation 21:6-8<br /><br />6And he said unto me, It is done. I am Alpha and Omega, the beginning and the end. I will give unto him that is athirst of the fountain of the water of life freely. <br /><br /> 7He that overcometh shall inherit all things; and I will be his God, and he shall be my son. <br /><br /> 8But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.<br /><br /><br />So, LL, the bible says what the punishment is. But God does not want us to go there. Remember? He gave man free will and he disobeyed God, letting sin enter mankind and every other thing in this world. Because of man's disobedience, we have to share the devil's torment.<br /><br />But God does not want that. That's why he sent Jesus Christ, the perfect sacrifice for our sins, to take our punishment. So we wouldn't have to go there. All you have to do is accept his sacrifice, ask God to forgive you and you will be saved.<br /><br />Read carefully, Xtraverse.<br /><br /><br />John 14:6<br /><br /> 6Jesus said unto him, I am the way, the truth, and the life: no man comes unto the Father, but by me.<br /><br /><br />Acts 4:12<br /><br /> 12Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved.<br /><br /><br />John 1:12<br /><br /> 12But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name:<br /><br /><br />Romans 10:9-10<br /><br />9 If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead, you will be saved. 10 For with the heart one believes unto righteousness, and with the mouth confession is made unto salvation.<br /><br /><br />It's your choice to believe.<br /><br /><br />Hebrews 11:1<br /><br /> 1Now faith is the substance of things hoped for, the evidence of things not seen.<br /><br /><br />1 John 1:9<br /><br /> 9If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.<br /><br />If any of you on this board would like to accept Jesus Christ as your Lord and savior, go here: [url=http://www.wayofthemaster.com/goodperson.shtml]Link[/url]<br /><br />It will also make it a bit clearer. Remember, if the Bible is true, then obtaining eternal life couldn't be any easier.<br /><br />-Dreamer"
	},
	{
		"id": 21649,
		"title": "Re: And one more thing...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-19T06:52:55.000Z",
		"content": "Dreamer, LL thinks you are a fundie.-----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 21650,
		"title": "Re: And one more thing...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-20T02:24:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]To LL: What's that 'sleep of death'?[hr][/quote]<br /><br />You could call it nonexistence, that is, when you die you are not 'up in heaven' looking down at us, but rather not i existence until the judgement day. Like a sleep, you are not aware of the world around you, like a candle flame that is blown out, you are not here anymore, awaiting resurrection.<br /><br />Jesus equates sleep and death when talking about Lazarus, he says: 'Lazarus our friend has gone to rest' and 'Lazarus has died' [John 11:11-14] Not that there is no mention of him either in a burning hell nor glorious heaven.<br /><br />[quote]<b><i>Quote:</i></b>[hr]What does \"accepting Jesus Christ\" entail? I can't force myself to believe something. While I go to church every week and am quite familiar with religion, I can only pretend to believe in the Christian God. My mind knows that I don't really.[hr][/quote]<br /><br />Well, I personally think God's not going to waste a perfectly good soul. You'll get a surprise when you pass away methinks.<br /><br /><br />@Dreamer, so you're sayng God allows people to be burnt alive forever? I think it'd be better just to snuff em out of existence, but whatever you need to tell yourself in order to get out of bed and stone people.<br /><br />We can see that King Solomon said: 'As for the dead, they are <i>consious of nothing at all </i>' enlargin on that truth by saying that the dead cannot love nor hate and that 'there is no work, nor devising no wisdom in [the grave'] [Ecclesiates 9:5, 6, 10] Simalarly Pslam 146:4 says that when a man dies 'his thoughts do perish'  The life we enjoy is as short and flickering as the flame of a candle, when it blows out, it does not *go* anywhere, it simply perishes.<br /><br />[url=http://www.watchtower.org/library/w/2002/7/15/article_02.htm]www.watchtower.org/librar...cle_02.htm[/url] is a nice site, though not as good as talking to a witness themselves.<br /><br /><br /><br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21651,
		"title": "Re: And one more thing...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-04-20T21:23:21.000Z",
		"content": "That would be nice.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21652,
		"title": "Re: And one more thing...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-20T22:38:56.000Z",
		"content": "Cheers LL. That makes so much sense! The idea of hell is conflicting with other Bible parts if one looks at it in the traditional Christian way, that is, mainly through the Revelation. Not to mention that it's pretty absurd.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21653,
		"title": "Re: Church, Not Christ",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-04-29T08:15:26.000Z",
		"content": "Can Jesus load you again after he's saved you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 21654,
		"title": "Re: Church, Not Christ",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-30T01:58:54.000Z",
		"content": "But of course! He saves to disk!<br /><br />[img]http://nearingzero.net/screen_res/nz202.jpg[/img]A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21655,
		"title": "Re: Church, Not Christ",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-04-30T08:12:41.000Z",
		"content": "Yeah, it seems everyone who's read Hamlet gets reminded of that passage.  I myself was about to post it.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 21656,
		"title": "Re: Church, Not Christ",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-04-30T09:56:42.000Z",
		"content": "Wow, I had no idea Hamlet was made into a game![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	}
]
