[
	{
		"id": 618,
		"title": "Which one has better graphics?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-17T21:57:38.000Z",
		"content": "insert text here.<br /><br />No wait, I'll use the results here in some way. I want to know your general opinion about Keen graphics, it might be useful for modders like me.<br /><br />I won't vote for now. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 16166,
		"title": "Re: Which one has better graphics?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-17T21:58:57.000Z",
		"content": "EDIT: so I can't edit polls. I meant \"Which one has the best graphics\".<br />And no, please don't be ambiguous in your answers.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 16167,
		"title": "Best graphics vote",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-05-18T00:35:59.000Z",
		"content": "Wow, I really had to think about this one.<br /><br />I voted Keen6, and my ultimate reasoning for it was that it had the most comprehensive feel for a planet as an entity.  The runners up, in my mind, were Keen3, Keen2, and Keen5, though each episode has its own quirks that bother me.<br /><br />What really marvels me about Keen6's graphics is that it spans an entire planet--and an entire culture.  Just as Keen3 is a look at Vorticon life, Keen6 is a look at how the Bloogs and the other races of Fribbulus Xax coexist.  From the dark underground tangles of what appear to be organic vines or brain-tissue, to the humid crags and rocky outcroppings at the base of their waterfalls, to the industrialized manufacturing plants and technologically advanced sectors, Keen6 outlines a wide variety of structures, with several unifying themes. <br /><br />Lone eyes play a large part in Fribbulus Xax's design--they can be seen in the background in the Guard Posts, they top the trees, and they ornament the most prominent beasts that make up the world; Bloogs and Bobbas.  The fact that the buildings of the world were built by the Bloogs themselves, complete with massive lightswitches, huge screws, and a slightly off-kilter angle to things (like the doors) really resonated with me.  I appreciate the style of the environment.<br /><br />Keen3 would have been my next choice, for similar reasons; it detailed many aspects of life in the Vorticon world.  What denied them the top spot, in my mind, was the horrible pink-and-yellow spotted wallpaper, (that doesn't even tile correctly,) the seeming out-of-place-ness of the rockets/missiles in the background of certain levels, and the fact that the entire episode was so rushed feeling.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />Keen2, and 5, by comparison, change the scope of focus--both are confined to a single ship, and as such, are much more monothematic, but importantly diverse.  While I like that Keen5 got away with different colored floors, hazard stripes, and environmental changes, I truly appreciate the thought that went into Keen2 a bit more.  The fact that almost every level has the blue flooring in it at some point, reminding you that the entire ship is part of one gigantic entity, really blows my mind.  There is a general unity of function and design for things in the Vorticon ships that I enjoy.<br /><br />The two episodes I enjoy the least graphically are Keen1 and 4, because while they span entire environments, it does so in a strictly segmented way:  Here are the polar caps and the ice levels; here is the desert; here are the pyramids and the little domes.  The only connection between these locations is the world map--and don't get me wrong, I like variety, but having the variety strictly stapled to a specific level can be extremely frustrating.  Rather than being stuck \"In level 12,\" I get stuck \"In that Ice Level,\" which somehow feels more defeating, as the focus of my frustration is on the environment, rather than the entity that keeps defeating me.<br /><br />That said, there are definitely parts, graphically, of each of the episodes that I could stand to do without.  <br /><br />In Keen6, I've never liked the light-red-and-light-grey backgrounds in Bloogwaters Crossing.  It's horrible.<br />In Keen3, aside from the wallpaper background, I've never liked the way clouds and trees looked.<br />In Keen5, the Spindreds feel as if they're from a different game, and the green-and-cyan backgrounds distract from the gameplay.<br />In Keen2, there should never have been any levels with a dark cyan background.  That was an awful design decision.<br />In Keen4, I've never been a fan of the way the Berkeloids look, and the Isle of Fire, similarly, never struck me as a good idea.  <br />In Keen1, I don't understand why we need the bright yellow-and-white pillars.  They stand out too much.<br /><br /><img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  I tried to be specific about what I do and don't like in the Keen series.  I didn't include dreams because, graphically, watching Keen jump straight up hurt my eyes.  That animation alone discouraged me from playing Dreams more than once.  :P[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 16168,
		"title": "Re: Best graphics vote",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-05-18T01:48:52.000Z",
		"content": "I'd have to go with Keens 5, 4, and 1, in that order, on the grounds that their graphics pack more meaning per line. To me, the level of meaningful detail in a graphic is a big part of its quality.<br /><br />I find that in a lot of older games, the beginning (early episode in K1's case, Early series in 4-6's case, first episode in Jazz Jackrabbit, Tyrian, Terminal Velocity) nails a certain style, but later installments of the same game start to get a little iffy. Usually they introduce interesting new looks (The first level of Tyrian's episode 2 blows my mind) but at the same time fail to reach the same level as the previous installments. Usually this is becuase they add detail, but not meaningful detail.<br /><br />Keen 6 suffers from this less than many games, Keen 3 quite a bit, and Keen 2 a bit less than that. The walls around the Bloog Domes are an example. While I do like them, and I think they are a cool and unique bit of level design, they don't fit in my head like other level features do. Their meaningful detail is that they are gray, and the other details in them (their outline) aren't an important part of the concept. If you were to shift the pixels around a bit you would not change the tiles in any significant way, because the idea that they are bumpy would be preserved. Their meaning is in aggregate (the idea of a dome) rather than in each tile. As a level feature I give them a +, but as graphics they get a - for having an unspecific form.<br /><br />Keen 1, while primitive, is one of the cleanest looking games I've played, and it has a lot of class on that count. Even with its limited tile set, it manages to effectively contain several different atmospheres (big red rounded things, ice cities, dark little minor levels, and the strange brown secret level). Enough that I can't think of every one right now. I got a different sense of place from each one.<br /><br />Each tile manages to assert its own character, making them iconic. I know that I have a particular response to a shiny purple barrel, different from my response to a block of ice, although I can't articulate what that response is. The same goes for the inhabitants of Mars. Few video game characters are more iconic than yorps, for example. For me, playing Keen 1 is being jerked around by imagery that pokes hard at my imagination. It achieves this by including only details which count.<br /><br />Keens 2 and 3 seem to add a lot of detail to the tileset without adding much to its appeal, and this turns me off. The background in Keen 2, level 1, is a prime example. It's busy for no good reason.<br /><br />Keen 4 is a little less unique from level to level but still has several different types of level (pyramid/sandy, underwater, village, cave). Like Keen 1, it doesn't attempt to make things interesting at the expense of iconic visuals. Except for Crystalus, I think it reaches the same level that Keen 1 did.<br /><br />Keen 5 does it again. Like the other two, its graphics are simple enough that I can establish them in my mind as meaningful symbols (except for the frayed wire ropes that show up now and again).<br /><br />The games I rate highly present iconic symbols that are unambigously something of the Commander Keen world (yorps, poison slugs, the green level tiles in Keen 5). In the games whose graphics I like less, I have to take the graphics for what they are rather than for what they represent, because they are too big for me to hold a complete concept of them in my mind.<br /><br />In the Keen games these differences are very slight though. Other games (JJ1 ep. 2 lev. 1 is a prime example) are more guilty of this.<br /><br />EDIT: Just read Xky's comments in full. It's funny, the same things that turned him off (extreme diversity of theme) are exactly what I like. Iconic images resonate strongly with me, so when I get a game that manages to pack in a lot of them I generally like it a lot. I don't have any problem seeing them as part of the same world, because each one fits in my mind well enough that I can remember where I've been and envision where I'm going (in the case of a playthrough). My criticisms center primarily on unnecessary detail that increases the mental \"space\" required to hold an object without increasing the idea it conveys.<br /><br />I do mostly agree strongly with his specific comments though, except for the spindred.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 16169,
		"title": "Re: Best graphics vote",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-05-18T06:31:00.000Z",
		"content": "I think that Keen4 has the better graphics. I like the variety of enviroments: here is a level in the forest, here is one half in the sky, here is one underwater. The sudden changes set the levels apart, and most can be identified by a repeated set of graphics.<br /><br />---Freeyorp"
	},
	{
		"id": 16170,
		"title": "Re: Best graphics vote",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-18T14:21:12.000Z",
		"content": "Keen 6 style might be influenced by the fact it was a commercial, and not shareware, episode, with more levels and more ambients than Keen 5 or Keen 2/3.<br /><br />(Xky, dark cyan background in Keen 2? My memory might be tricking me, but I don't remember seeing such backgrounds except in unused blocks of the tileset.)<br /><br />Btw, I think the same about JJ1 E2 L1, Lemur. I think that the best graphics/levels in the game are those of E1 L3-L4.<br /><br />Keen 6's worldmap certainly's more realistic than Keen 1, 2 and 4's. Representing a whole world in a single side of the planet in those games was surely a bad idea.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 16171,
		"title": "well",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-05-18T20:50:14.000Z",
		"content": "Keen2's dark cyan backgrounds are in Weaponry B: [url=http://www.classicgaming.com/cc314/encyclopedia/maps/maps-k2-lvl12.html]here[/url]."
	},
	{
		"id": 16172,
		"title": "Re: well",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-19T00:58:37.000Z",
		"content": "Keen 2/5? 4/6? Eh? Odd way of categorizing things...[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 16173,
		"title": "What? Where's MY choice?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-19T03:07:33.000Z",
		"content": "My choice wasn't on the list! I vote Gameboy Keen!<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br /><br /><br />J.....K......."
	},
	{
		"id": 16174,
		"title": "Re: What? Where's MY choice?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-22T14:50:35.000Z",
		"content": "We are doomed... ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	}
]
