[
	{
		"id": 449,
		"title": "Yorps talking in ultrasound?",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2005-11-25T03:35:41.000Z",
		"content": "I was playing  keen 1 again recently, and as I went into that shrine with all those yorps, I noticed that the motion seemed to give the illusion that the yorps' mouths were moving. <br /><br />Moving mouths (well, open mouths, as they just seem to move), but no sound. Then I thought of the sound a yorp made when you stomp on it, or shoot it. <br /><br />So maybe, groaning, low groaning (for them), and they were talking in too high sounds for keen to hear (possibly)<br /><br />What do you think of this idea?<br /><br />[img]http://i16.photobucket.com/albums/b33/freeyorp101/sig2.png[/img]<br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 12916,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-25T05:25:49.000Z",
		"content": "I think that if yorps talked too high for Keen to hear then he never would have been able to identify a yorpish voice when it sounded in his head.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 12917,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-11-25T05:55:02.000Z",
		"content": "I always thought yorps were telepathic, because of the statues that talk in keen's head.<br /><br />And they don't make noises to high for you to hear them. When you bump into them they squeak, cute little squeaks.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 12918,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-25T06:07:17.000Z",
		"content": "Hehe, never thought about that. Interesting idea.. Hmmm, but yeah, I suppose they can make sounds that Keen can hear. Spot probably makes some strange sounds and Keen knows when to feed it and so on.<br />But who knows, what if they can do all of them? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 12919,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-25T10:20:14.000Z",
		"content": "Dr. Najawa, PKD (Popular Keen Degree):<br />[hr]<br />In the past: yorps have high pitch voices, and are also telepathic. They don't use this much, however, becuase their telepathic communication uses High Frequency FM radio waves. This means that Yorps can listen to the Radio with their heads. This is how Yorps could live so long isolated from the rest of society. A good example of this phenominon would be the Yorp in Level 13 of Keen.<br /><br />A yorp, when stomped on, makes a deep, \"Uhh, Foowe\"<br /><br />A deep grunt, but do to their high pitch, this sound is barely audible.<br /><br />Yorps, used to use their ability to speak via FM Radio, Yorps set up emergency towers to send off audible sounds which could be heard everywhere, even under ground, in case of dire emergency.<br /><br />In the year of 1814, while the Battle of Baltimore was being faught, and while Scott Keys sat locked up, and writting the U.S. National Anthem; 2 stray British Rockets left the stratosphere. These rockets bombed Mars, and set off, and damaged the alarms. The alarms could not be stopped, and most of the yorps lost this telepathicability. Some kept it, and lived in certian cities in Mars, better developing their telepathic abilities. Soon, they were able to make their radio waves vibrate on the very enamle of peoples teeth. Some became teachers, and were very effective. A student would start to wisper, and a voice in their head would say, \"I don't want to do this.\" The student would freak out so bad, he'd be good the whole year.<br /><br />The more masterful Yorps spent time meditating (which would mostly be listening in on infomercials on earth; especially during christmas, when all the commercials were basically about toys.<br /><br />When Keen Visited Mars, in 1991 (Though he frequenlty visits every now and then [Their was a big boost when modding became a hit in 2002 - 2003, when everyone was modding K1]), he met up with some of these yorps. They would wait, furthur back, so that the green pigment in thier skin looked grey, do to the shadows. They tried to help Keen, and thus saved Earth.<br /><br />Sidenote: Only one Garg is know to have been able to do this. He was ostrigized by his fellow Gargs, so he lives in a secret, abbandoned city, and will growl at anyone who passes by. Keen met this Garg once.<br />[hr]<br /><br />Well... that is my version. You may disagree, but it still was fun to write it.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Tough Guys Can Fix There Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 12920,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2005-11-26T02:48:22.000Z",
		"content": "Which garg was that najawa?<br /><br />If they were telepathic, then was the squeak also telepathic? The mouth movement doesn't seem to correspond to well to the sound.<br /><br />maybe some yorp's skin pigments went purple too (yorphious 2) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[img]http://i16.photobucket.com/albums/b33/freeyorp101/sig2.png[/img]<br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 12921,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-11-26T05:30:48.000Z",
		"content": "i like the creativity behind the idea! lol.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 12922,
		"title": "Re: Yorps talking in ultrasound?",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-27T00:39:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Which garg was that najawa?[hr][/quote]<br /><br />The only Garg statue there is in K1!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]If they were telepathic, then was the squeak also telepathic?[hr][/quote]<br /><br />Did you hear it? Then it must not have been telepathic.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The mouth movement doesn't seem to correspond to well to the sound.[hr][/quote]<br /><br />They are yorps; their vocal chords work much differently then ours (Stop making so many intelligent comments!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] )<br /><br />[quote]<b><i>Quote:</i></b>[hr]maybe some yorp's skin pigments went purple too (yorphious 2) [hr][/quote]<br /><br />Well, now that you mention it:<br />[hr]<br />Yorps used to be yellow, though their pigment was made to contrast their location. They used to live on Vortican IV, and because the planet was purple, they were yellow. Then, some were taken to Mars by Vorticans, and their skin turned green, a contrast of Red. Some went to Yorphus II, and their ship landed in urine ([img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] ). They became purple, and the urine had lasting effect on their pigment. They thus stayed purple, despite the blueness of Yorphus II.<br /><br />Then, their were the yorps Lucas, and Mark, who led the Lucas and Mark expidition to pluto. The cold mutinated the DNA of the explorers, and thus they turned white, and were composed mostly of snow (Armageddon II - Episode 1: Pluto Burns - By Najawa). These yorps developed a resistance to cold, but their weekness was water, which would freeze what little warmth they had left in their body, and thus they would melt into a pile of snow. The main weapon on Pluto is a P-87, a powerful supersoaker model which does damage to any species of fire, and ice being.<br />[hr]Tough Guys Can Fix There Own Problems!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Prisoner.jpg[/img]<br />*Under Self Inflicted Posting Restriction*<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 12923,
		"title": "Ultrasound",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-11-29T16:36:13.000Z",
		"content": "When I saw this topic, I thought you were going to say you have one of these: [url=http://en.wikipedia.org/wiki/Gravis_Ultrasound]en.wikipedia.org/wiki/Gravis_Ultrasound[/url] and you can hear the yorps talking."
	}
]
