[
	{
		"id": 680,
		"title": "Hello",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2007-09-21T00:05:12.000Z",
		"content": "hello everyone<br />it's has been a while i want everyone to know that i'm still here. but i now have other ambitions like money making programs i know they probalby waste time &amp; everything but i so hooked on them. i'm now doing a course which i thought when i flunked nelson park my life was over but i was wrong just because you may not have done as well during your teens doesn't mean that you are finished. i'm now trying to catch up on maths &amp; english which i ignored years ago as i was a rebellious teenager &amp; didn't want to learn anything. i still have my website job pay hasn't changed that much only went up 11 cents to $3.71 an hour. looking at moving website hosts as the st.l server keeps crashing all the time, checking out [url=http://www.crazydomains.com.au/]crazydomains[/url] their hosting starts at $54 a year which is really cheap in australia as most plains are over $20 a month. i am off to new zealand in janurary next year with a group of people. trying to save up $500 as spending money then the nightmare comes currency conversion. i shoudn't have to worry that much the aussie &amp; kiwi's dollars have a small weakness in the market but you don't lose that much, i'm still here but my email is now [url=mailto:rorboy1983@gmail.com ] rorboy1983@gmail.com [/url] so you can email me on that email address now, my website url is still [url=http://www.rorie1983.com]www.rorie1983.com[/url] but is currently unaccessible because of server problems, what have you others been upto since my absence?<b>Rorie</b>"
	},
	{
		"id": 18273,
		"title": "Re: Hello",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-09-21T06:41:56.000Z",
		"content": "Dude glad you're ok but you shouldn't put so much personal information on the internet.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 18274,
		"title": "Re: Hello",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-21T08:32:29.000Z",
		"content": "Hi, glad to see you around. Certainly agree that it's never too late to change things, good luck with that school work. What I've been up to? Well, I honestly can't remember. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18275,
		"title": "Re: Hello",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-09-21T18:57:09.000Z",
		"content": "Hmm... well good luck with that Rorie. Um... nice to see you back. Make some polls... I think DaVince misses them.<br /><br />What have I been up to? I would rather not say. Although something cool is coming up.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 18276,
		"title": "Re: Hello",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-27T11:04:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I think DaVince misses them.[hr][/quote]<br />lol no, you know that I was joking when I said that (I think...).____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	}
]
