[
	{
		"id": 826,
		"title": "Why I hate RPG's",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-27T16:36:46.000Z",
		"content": "To me, most role-playing games suck.  Period.<br /><br />Why?<br /><br />Because when I play a game, I'm playing it for three specific purposes:<br /><br />One: A good story.  I want to get lost in the universe of the game, I want to like the character and vicariously feel a part of his battles.  RPG's have the same basic storyline, but with different faces:  \"I'm a poor boy.  I have to save a princess.  I didn't know I had magical powers.  Yay, let's go fight some bosses.  Game over.\"<br /><br />Two: Controls.  I hate playing the same game over again.  That's why RPG's suck.  They practically have the same controls, and power ups.  I kill some guys, I get stronger.  Then, I go fight more guys to get stronger.  Then, I go fight more guys to get stronger.  It's like being an automaton.<br /><br />C: The scenery.  Games need to look asthetically pleasing.  They just need to.  You should be able to have different terrians, , and wildlife for each place you go to.  You are about to say, \"Well, RPG ARE FULL OF THAT!\"  No, they're not.  They all have:  a water world, a forest world, a desert world, a mountain world, a castle world, and a fire world.  That's a bare minimum.  I can't even care about the scenery after it's felt like I've been fighting copycats in a the previous RPG I played.<br /><br />BONUS: Versatility.  I like using various weapons, or atleast having various powers that I collect along the way.  RPG's kind of do this, but after the headache of battling the same fuclers a thousand times in a row, it hardly seems a fair trade.<br /><br />With that said, there are a fwe RPG's that I love, just for being RPG's that are, imo, original.<br /><br />Lord of the Rings: Two Towers for GBA.<br />Spike McFang for SNES.<br />Legend of Zelda (all)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21228,
		"title": "Re: Why I hate RPG's",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-27T16:41:55.000Z",
		"content": "I think those three arguments could be applied to the majority of FPSes as well. RPGs and FPSes are both targets for \"paint-by-numbers\" style cash-in games from publishers who want to make a quick buck - but as you mentioned, there are always a few games in both genres that shine.<br /><br />(Disclaimer: I play neither FPSes or RPGs on anything even resembling a regular basis, as I have no hand-eye coordination and can't stand the monotony of levelling up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] )[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 21229,
		"title": "Re: Why I hate RPG's",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-27T17:05:57.000Z",
		"content": "You have clearly played very few RPGs.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 21230,
		"title": "Re: Why I hate RPG's",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-27T20:19:46.000Z",
		"content": "I hate RPGs too. I haven't yet seen a story that'd interest me. And most seem to be pretty cash-in games today, as said.. They all look the same.. I can't understand what really interests people in those games. I guess it's about pretending to be something you can't be. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21231,
		"title": "Re: Why I hate RPG's",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-27T22:46:31.000Z",
		"content": "I can understand not liking RPGs, but you guys are listing flaws that are indicative of games of every genre.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 21232,
		"title": "Re: Why I hate RPG's",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-06-28T01:19:06.000Z",
		"content": "No he clearly played Final Fantasy.<br />Final Fantasy == suxage.<br /><br />An RPG stands for Roll Playing Game. Technically adventure games are an RPG. Monkey Island can be considered an RPG for example.<br />TECHNICALLY Commander Keen could be considered an RPG because you are taking the roll of Commander Keen.<br /><br />Also you are probably only talking about fantasy RPGs. Solar Winds is considered an RPG too and that is SciFi. So define RPG.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21233,
		"title": "Re: Why I hate RPG's",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-28T01:52:49.000Z",
		"content": "No, no you dummy. Playing a character does not consitute a technical RPG at all. RPGs <i>as a video game/computer game genre</i> are linear, plot-driven games where the abilities of the characters are dictated by numbers and statistics. Not all RPGs are fantasy games with orcs and wizards. Some are science fiction, horror, etc.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 21234,
		"title": "Re: Why I hate RPG's",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-06-28T03:01:17.000Z",
		"content": "I'm with Mr. Globox 100% here. Anime, too. Can't stand that."
	},
	{
		"id": 21235,
		"title": "Re: Why I hate RPG's",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-06-28T10:18:34.000Z",
		"content": "You need to play Fallout (all the way through). It <i>will</i> sour you on every other CRPG ever made, but it's worth the price.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21236,
		"title": "Re: Why I hate RPG's",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-28T16:43:44.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />I think those three arguments could be applied to the majority of FPSes as well. RPGs and FPSes are both targets for \"paint-by-numbers\" style cash-in games from publishers who want to make a quick buck - but as you mentioned, there are always a few games in both genres that shine.<br />[hr][/quote]<br /><br />I was thinking about saying that, but I thought I'd concentrate on RPG's.<br /><br /><br />But now that you mention it, FPS have the same problems, too.<br /><br /><br /><br />Why?<br /><br />Because most modern video-games aren't original, aren't creative, and they aren't witty.<br /><br /><br /><br />You guys could be right, I haven't played every single RPG, but I did list a few that I sincerely liked.  However, you can't deny me the fact that everything I just said was true.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21237,
		"title": "Re: Why I hate RPG's",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-28T19:31:19.000Z",
		"content": "WTF. It's true that RPGs often use similar formulas, but developers aren't going to create story-driven, elaborate video game quests for a 'quick buck'; that's reserved for retarded platformer games based on existing franchises. You're just singling out RPGs just because you don't like them. You're arguments apply to PRACTICALLY ALL GENRES OF VIDEO GAMES.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 21238,
		"title": "Re: Why I hate RPG's",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-28T21:47:11.000Z",
		"content": "I never said they weren't, just that RPG abuses the hell out of it more than all the others (Cept FPS, they're equal).<br /><br /><br />And what other genres, becides shitty sports games, make the same game over again and dare to call it a different one?<br /><br /><br />I mean, give me a break.  Tales of Symphonia is the only 'original' RPG --and it sucked. There's just nothing to do with RPG that hasn't already been done.  Playing one RPG is just like playing the previous one and the next one --only with a modified story and graphics.<br /><br /><br />And platformers are hardly retarded.  Rayman, Megaman, Zelda, Halo, and others atleast were original or added some new form of game play other than \"Press A, press A, press A, press B, press A, press C\" ... Oh I beat the game!<br /><br />They <i>atleast</i> require puzzle, maze, strategy, and shooting skills --combined-- to have a fun time.  The only thing that changes with RPG's is how impossible it is and how many times you whip the shit out of the same blob to increase your power.<br /><br />Atleast when you play play FPS you atleast get to view some new scenery you've never seen before!<br /><br /><br />Don't get me wrong, RPG mixed with adventure can sometimes make for a lovely time.  Like Spike McFang, the power ups are hard to get, and it requires a lot of blob-smacking to get stronger.  However, the sheer originality, new-style enemies, plot details, and new weapons made it good.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21239,
		"title": "long post...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-06-28T23:33:20.000Z",
		"content": "Ugh.  This is going to be a long post.<br />[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />One: A good story. I want to get lost in the universe of the game, I want to like the character and vicariously feel a part of his battles. RPG's have the same basic storyline, but with different faces: \"I'm a poor boy. I have to save a princess. I didn't know I had magical powers. Yay, let's go fight some bosses. Game over.\"[hr][/quote]<br />As compared to, say, Half-Life (\"Oh, I'm a humdrum scientist.  I didn't know aliens would invade.  Yay, let's go fight the boss.  Game over.\") or Sonic (\"Oh, I'm a hedgehog with attitude.  I didn't know the evil doctor would kidnap my friends and turn them into robots.  Yay, let's go kick his butt.  Game over.\") or even Asteroids (\"Oh, I'm a little spaceship existing in space for no real reason.  I didn't expect all these hunks of rock to appear.  Yay, let's shoot them all.  Game over.\"  <br /><br />If you reduce any story as heavily as you've chosen to, it's gonna seem pointless.  Reductive analysis tends to obfuscate the real development.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />Two: Controls. I hate playing the same game over again. That's why RPG's suck. They practically have the same controls, and power ups. I kill some guys, I get stronger. Then, I go fight more guys to get stronger. Then, I go fight more guys to get stronger. It's like being an automaton.[hr][/quote]<br />Again, compared to the same games:  Half-Life (kill monsters, get better weapon.  Kill more monsters, get better weapons.)  Sonic (Run fast to get items which help you run faster) or Asteroids (Shoot rocks to make more rocks appear which you also shoot) ... See where this is going?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />C: The scenery. Games need to look asthetically pleasing. They just need to. You should be able to have different terrians, , and wildlife for each place you go to. You are about to say, \"Well, RPG ARE FULL OF THAT!\" No, they're not. They all have: a water world, a forest world, a desert world, a mountain world, a castle world, and a fire world. That's a bare minimum. I can't even care about the scenery after it's felt like I've been fighting copycats in a the previous RPG I played.[hr][/quote]<br />Leaving the fact that you counted \"1, 2, C\" aside, Let's check out Half-Life for a moment.  If you're not in the discarded remnants of the Black Mesa facility, you're in the Xeno world.  That's about it.  Sonic the Hedgehog has the Water world, Forest world, Fire world, etc--those are <i>staples of varied environment</i> and have nothing to do with RPGs specifically.  Asteroids changed colors occasionally, I guess... <br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />And what other genres, becides shitty sports games, make the same game over again and dare to call it a different one?[hr][/quote]<br />Unreal Tournament's yearly installments; Metroid Prime is working on its third title; Mario Party's up to 7 or 8; We're all but guaranteed to see another Grand Theft Auto game; Metal Gear Solid has been spewing philosophy and way too many cutscenes down our throats for an upcoming 4th installment; Commander Keen had two damn-near-identical trilogies; Leisure Suit Larry followed the same guy for 7 or 8 games; Tetris has been re-made and re-marketted for years; Street Fighter 2 went through Championship Edition, Turbo, and a few other spin-offs; you already discounted sports games, but I COULD GO ON.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />I mean, give me a break. Tales of Symphonia is the only 'original' RPG --and it sucked. There's just nothing to do with RPG that hasn't already been done. Playing one RPG is just like playing the previous one and the next one --only with a modified story and graphics.[hr][/quote]<br />I felt that Tales was horribly derivative and uninspired, personally.  But while we're talking about previous ones with new stories and graphics, mind explaining to me the difference between Doom, Quake, and Eradicator?  How about Mario, Prehistorik Man, Jelly Boy, Rex Ronin, Awesome Possum, Aero-the-Acrobat, Bubsy the Bobcat, Crash Bandicoot, and Whirlo?  How about Castlevania and Metroid?  F-Zero and Wipeout?  Mario Kart and Crash Team Racing?  Sonic Shuffle, Fusion Frenzy, and Mario Party?  Smash Bros. and Power Stone?  Street Fighter 2 and Mortal Kombat?  ... Commander Keen and Cosmo?  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/><br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Still LordofGlobox:</b><br />And platformers are hardly retarded. Rayman, Megaman, Zelda, Halo, and others atleast were original or added some new form of game play other than \"Press A, press A, press A, press B, press A, press C\" ... Oh I beat the game![hr][/quote]<br />My mistake, you're absolutely right--I have to HOLD LEFT OR RIGHT while pressing \"A, A, A, B, A, C\" in order to win.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  Heaven forbid.<br /><br />...<br /><br />I can't believe you're so short-sighted as to pidgeonhole an entire genre because you haven't found a game that suits your tastes.  The same oblivious arrogance can be said about anything--and I mean ANYTHING.  Clothing, hair, food, music, entertainment, operating systems, cars, people, whatever.  <br /><br /><img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  Don't give up on the poor little RPG just yet.  I can agree with you that there is an awful lot of crap out there these days--but there's always been an awful lot of crap in the gaming world.  Back in the early 90's it was Platform games and 2d Fighters.  In the mid-to-late 90's it was First Person Shooters and Multi-CD RPGs.  Now that we're in the early 00's it's mostly about World War II and Cut Scenes that are WAY TOO LONG.  Give it another 5 years... we'll move on to something new.  <br /><br />This wasn't meant to be a personal attack on you, LordofGlobox, but your arguments completely failed to convince me that you've played enough RPGs to pan the genre as a whole the way you did.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 21240,
		"title": "Re: long post...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-06-29T00:28:30.000Z",
		"content": "While I agree with you 100%, Xky, I think your arguments are going to fall upon deaf ears."
	},
	{
		"id": 21241,
		"title": "Re: long post...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T01:05:32.000Z",
		"content": "LONG post.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br /><br />Quote:<br />--------------------------------------------------------------------------------<br />LordofGlobox:<br />One: A good story. I want to get lost in the universe of the game, I want to like the character and vicariously feel a part of his battles. RPG's have the same basic storyline, but with different faces: \"I'm a poor boy. I have to save a princess. I didn't know I had magical powers. Yay, let's go fight some bosses. Game over.\"<br />--------------------------------------------------------------------------------<br /><br /><br />As compared to, say, Half-Life (\"Oh, I'm a humdrum scientist. I didn't know aliens would invade. Yay, let's go fight the boss. Game over.&amp;quot[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]        or Sonic (\"Oh, I'm a hedgehog with attitude. I didn't know the evil doctor would kidnap my friends and turn them into robots. Yay, let's go kick his butt. Game over.&amp;quot[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]        or even Asteroids (\"Oh, I'm a little spaceship existing in space for no real reason. I didn't expect all these hunks of rock to appear. Yay, let's shoot them all. Game over.\" <br /><br />If you reduce any story as heavily as you've chosen to, it's gonna seem pointless. Reductive analysis tends to obfuscate the real development.<br />[hr][/quote]<br /><br />I've already said that FPS are having the same problem.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br /><br />Quote:<br />--------------------------------------------------------------------------------<br />LordofGlobox:<br />Two: Controls. I hate playing the same game over again. That's why RPG's suck. They practically have the same controls, and power ups. I kill some guys, I get stronger. Then, I go fight more guys to get stronger. Then, I go fight more guys to get stronger. It's like being an automaton.<br />--------------------------------------------------------------------------------<br /><br /><br />Again, compared to the same games: Half-Life (kill monsters, get better weapon. Kill more monsters, get better weapons.) Sonic (Run fast to get items which help you run faster) or Asteroids (Shoot rocks to make more rocks appear which you also shoot) ... See where this is going?<br />[hr][/quote]<br /><br />No actually, I don't.  The difference between those games and the standard RPG is this: Those games you had to win by doing something different.  All RPG's you win the same way: Attack monsters, get stronger.  Attack more monsters, get strong.  Rinse, repeat, do again.<br /><br />It's annoying.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br />Quote:<br />--------------------------------------------------------------------------------<br />LordofGlobox:<br />C: The scenery. Games need to look asthetically pleasing. They just need to. You should be able to have different terrians, , and wildlife for each place you go to. You are about to say, \"Well, RPG ARE FULL OF THAT!\" No, they're not. They all have: a water world, a forest world, a desert world, a mountain world, a castle world, and a fire world. That's a bare minimum. I can't even care about the scenery after it's felt like I've been fighting copycats in a the previous RPG I played.<br />--------------------------------------------------------------------------------<br /><br /><br />Leaving the fact that you counted \"1, 2, C\" aside, Let's check out Half-Life for a moment. If you're not in the discarded remnants of the Black Mesa facility, you're in the Xeno world. That's about it. Sonic the Hedgehog has the Water world, Forest world, Fire world, etc--those are staples of varied environment and have nothing to do with RPGs specifically. Asteroids changed colors occasionally, I guess... <br />[hr][/quote]<br /><br />Asteriods was an old game --you have to forgive them of such problems.<br /><br />And yes, most platformers do have similer levels --but you aren't standardly doing the same thing you did in the last game (IE, kill more fucling monsters).<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br />Quote:<br />--------------------------------------------------------------------------------<br />LordofGlobox:<br />And what other genres, becides shitty sports games, make the same game over again and dare to call it a different one?<br />--------------------------------------------------------------------------------<br /><br /><br />Unreal Tournament's yearly installments; Metroid Prime is working on its third title; Mario Party's up to 7 or 8; We're all but guaranteed to see another Grand Theft Auto game; Metal Gear Solid has been spewing philosophy and way too many cutscenes down our throats for an upcoming 4th installment; Commander Keen had two damn-near-identical trilogies; Leisure Suit Larry followed the same guy for 7 or 8 games; Tetris has been re-made and re-marketted for years; Street Fighter 2 went through Championship Edition, Turbo, and a few other spin-offs; you already discounted sports games, but I COULD GO ON.<br />[hr][/quote]<br /><br />I don't mind sequels; I hate remakes.  I like playing Rayman.  Each time he is in a new world, new levels, new feels, and new powers.  This makes the games worth playing.  Tell me, what was the last addition to an RPG taht didn't involve killing more blobs to get stronger, only to kill more blobs and get stronger?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br />Quote:<br />--------------------------------------------------------------------------------<br />LordofGlobox:<br />I mean, give me a break. Tales of Symphonia is the only 'original' RPG --and it sucked. There's just nothing to do with RPG that hasn't already been done. Playing one RPG is just like playing the previous one and the next one --only with a modified story and graphics.<br />--------------------------------------------------------------------------------<br /><br /><br />I felt that Tales was horribly derivative and uninspired, personally. But while we're talking about previous ones with new stories and graphics, mind explaining to me the difference between Doom, Quake, and Eradicator? How about Mario, Prehistorik Man, Jelly Boy, Rex Ronin, Awesome Possum, Aero-the-Acrobat, Bubsy the Bobcat, Crash Bandicoot, and Whirlo? How about Castlevania and Metroid? F-Zero and Wipeout? Mario Kart and Crash Team Racing? Sonic Shuffle, Fusion Frenzy, and Mario Party? Smash Bros. and Power Stone? Street Fighter 2 and Mortal Kombat? ... Commander Keen and Cosmo? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]       <br />[hr][/quote]<br /><br />Like you already said, they were the old RPG's.  Nevertheless, I don't mind a few similar games.  Take Commander Keen: Invasion of the Vorticons vs. the Crystal Caves trilogy.  Both were made by the same engine, and yet the games were different.  The terrians were different, the power-ups were different, the stories were different, and the games were both excellent.<br /><br />I'm not getting that from RPG's.  I don't see different games and power-ups.  I see similar power-ups that make for a bore of a play.<br /><br />Now, occasionally I find a good RPG (Like I mentioned before, which you convienently didn't respond to.  --; ) then I'll praise it and call it a good game.<br /><br /><br />Like I said, I love certain RPG's --they just have to be original.  Like, I mentioned Spike McFang.  You don't get swords, arrows, and stupid power ups.  You get the traditional power-ups for killing enemies... But you get cards.  These magical cards did different tricks, and after you used the card, you had to go buy it again.  Your 'sword', was your \"magical hat\".  You could eventually upgrade your hat --but the hat had different gameplay than a damned sword.  It could go flying depending on hwo long you held the button in, etc.  Different hats moved different ways.<br /><br /><br />Do you see what I'm getting at?  A different game requires different weapons, different stories... Well, basically it has to differentiate itself from all the other games.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>XkyRauh</b><br />Quote:<br />--------------------------------------------------------------------------------<br />Still LordofGlobox:<br />And platformers are hardly retarded. Rayman, Megaman, Zelda, Halo, and others atleast were original or added some new form of game play other than \"Press A, press A, press A, press B, press A, press C\" ... Oh I beat the game!<br />--------------------------------------------------------------------------------<br /><br /><br />My mistake, you're absolutely right--I have to HOLD LEFT OR RIGHT while pressing \"A, A, A, B, A, C\" in order to win. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]        Heaven forbid.<br /><br />...<br /><br />I can't believe you're so short-sighted as to pidgeonhole an entire genre because you haven't found a game that suits your tastes. The same oblivious arrogance can be said about anything--and I mean ANYTHING. Clothing, hair, food, music, entertainment, operating systems, cars, people, whatever. <br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]        Don't give up on the poor little RPG just yet. I can agree with you that there is an awful lot of crap out there these days--but there's always been an awful lot of crap in the gaming world. Back in the early 90's it was Platform games and 2d Fighters. In the mid-to-late 90's it was First Person Shooters and Multi-CD RPGs. Now that we're in the early 00's it's mostly about World War II and Cut Scenes that are WAY TOO LONG. Give it another 5 years... we'll move on to something new. <br /><br />This wasn't meant to be a personal attack on you, LordofGlobox, but your arguments completely failed to convince me that you've played enough RPGs to pan the genre as a whole the way you did. <br />[hr][/quote]<br /><br />I agree with everything you've just said in the second part, but I think you completely missed my entire argument.  I said <i>most</i> (And I said MOST on purpose) RPG's are unoriginal and boring.<br /><br />Go back and look at what I said, I phrased it very precisely.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21242,
		"title": "Re: long post...",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-29T01:36:59.000Z",
		"content": "i agree. RPG's suck. I can't stand them."
	},
	{
		"id": 21243,
		"title": "Re: long post...",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-29T02:58:37.000Z",
		"content": "[img]http://dylangallagher.googlepages.com/1130118916720.gif[/img][center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 21244,
		"title": "Re: long post...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T03:38:21.000Z",
		"content": "I love the Happy Mask Man.  That's quality stuff right there.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21245,
		"title": "short post...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-29T04:27:52.000Z",
		"content": "RPG's I dislike:<br /><br />Panty Raider<br />Second Life<br /><br />RPG's I love<br /><br />TEXTure [Not around anymore,text playng game]<br />Guild wars.<br /><br />We need a Keen RPGA proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21246,
		"title": "....",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-06-29T15:32:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>LordofGlobox:</b><br />I don't mind sequels; I hate remakes. I like playing Rayman. Each time he is in a new world, new levels, new feels, and new powers. This makes the games worth playing. Tell me, what was the last addition to an RPG taht didn't involve killing more blobs to get stronger, only to kill more blobs and get stronger?[hr][/quote]<br />Card Games, Crafting Items, and Minigames.  <br />I swear, all three of them detract from the fun I have grinding blobs to get stronger, but I can understand how their diversions are meant to be entertaining.<br /><br />I do not want to have to play the stupid Card Game with its arbitrary difficulty for hours just to get that one ultra-rare card that lets me get the secret sword at the top of the tower.  Forget that.<br /><br />I do not want to get to the store in the next town and see a nifty piece of armor I'd like to get, but can't because I only have 12 of the necessary 15 Blue Jelly Eyeballs.  I've got 6 of the Red Jelly Eyeballs right here--can't you substitute?  <br /><br />I do not want to start to become engaged with a storyline only to do the \"LET'S COOK DINNER!!\" button mashing minigame involving a timer, reflexes, and memorization.  <br /><br />I didn't mean for my bigger post up above to sound like a troll (and I'm specifically sorry to AllStories, who is clearly +3 intarweb kewl above me) ... <br /><br />Anyone else here like Phantom Brave?  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 21247,
		"title": "Re: ....",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-29T16:03:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>LL</b> RPGs I dislike:... Second Life[hr][/quote]<br />I assume that you probably don't like Second Life because it has complete freedom and therefore no gameplay - it might not entirely count as an RPG as a result, since there are no particular roles you are pidgeonholed into. (When I refer to roles I mean \"farm this\", \"sell that\" rather than \"Alien Race A\", \"Alien Race B\", \"Alien Race C\")<br />[quote]<b><i>Quote:</i></b>[hr]We need a Keen RPG[hr][/quote]<br />There are already one or two - I know RoboBlue was working on a Keen/Earthbound crossover, and I'm sure there was another. I'll post links if I find any.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 21248,
		"title": "Re: ....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T16:18:06.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>Xky:</b><br /><br />Card Games, Crafting Items, and Minigames. <br />I swear, all three of them detract from the fun I have grinding blobs to get stronger, but I can understand how their diversions are meant to be entertaining.<br /><br />I do not want to have to play the stupid Card Game with its arbitrary difficulty for hours just to get that one ultra-rare card that lets me get the secret sword at the top of the tower. Forget that.<br /><br />I do not want to get to the store in the next town and see a nifty piece of armor I'd like to get, but can't because I only have 12 of the necessary 15 Blue Jelly Eyeballs. I've got 6 of the Red Jelly Eyeballs right here--can't you substitute? <br /><br />I do not want to start to become engaged with a storyline only to do the \"LET'S COOK DINNER!!\" button mashing minigame involving a timer, reflexes, and memorization. <br />[hr][/quote]<br /><br />....<br /><br /><br /><br />You still don't get what I'm talking about, do you?<br /><br />Or are you just mocking my opinion?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21249,
		"title": "what?",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-06-29T17:25:49.000Z",
		"content": "No, no, I wasn't making fun of you at all--I was expressing my own frustration with those \"developments\" in the RPG arena.  You said <i>\"Tell me, what was the last addition to an RPG taht didn't involve killing more blobs to get stronger, only to kill more blobs and get stronger?\"</i> and I said <i>\"Card Games, Crafting Items, and Minigames.\"</i>  None of those are about killing blobs to get stronger; they're about playing cards, delaying power curves, and distracting players from the tedium OF killing blobs.  Had nothing to do with making fun of you. <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>"
	},
	{
		"id": 21250,
		"title": "Re: what?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-06-30T02:23:52.000Z",
		"content": "Lord of Glo, I have no idea what you are trying to say.<br /><br />At first I got the impression you hated all RPGs. Now you don't. And if you don't hate all RPGs then what the hell is this topic about?<br /><br />Now you support RPGs... when I thought you didn't before...<br />What is a good RPG? What is a Bad RPG?<br /><br />WHAT IS THE POINT OF THIS THREAD?! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stoned.gif[/img] <br /><br />RPGs that are ok:<br />Lunar Legends (Yes I know it's a remake. It's the same exact game though.)<br />Chrono Trigger (Only good one time through though.)<br />Well of Souls<br /><br />RPGs I absolutely LOVE:<br />Solar Winds<br />Morrowind<br />Baldur's Gate II<br />Guild Wars<br /><br />RPGs I Absolutely HATE:<br />Final Fantasy 1<br />Final Fantasy 2<br />Final Fantasy 5<br />Final Fantasy 8<br />Final Fantasy 9<br />Sword of Manna (Also a remake.)<br />Chrono Cross<br />(There are a LOT more, just can't think of em right now.)<br /><br />And that is excluding the games that I consider an RPG, but if I mention them you will get into a hissy fit.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21251,
		"title": "Re: what?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-30T03:46:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />No, no, I wasn't making fun of you at all--I was expressing my own frustration with those \"developments\" in the RPG arena. You said \"Tell me, what was the last addition to an RPG taht didn't involve killing more blobs to get stronger, only to kill more blobs and get stronger?\" and I said \"Card Games, Crafting Items, and Minigames.\" None of those are about killing blobs to get stronger; they're about playing cards, delaying power curves, and distracting players from the tedium OF killing blobs. Had nothing to do with making fun of you. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  <br />[hr][/quote]<br /><br />Right, but those can only be done so many times, no?  I mean, how many times can you collect a sword that makes you stronger, or go on a miniquest to get that sword --until you're bored sick?<br /><br />Gal -- My point never was that ALL RPG's suck.  My point was that there is no real reason to play the same RPG over and over again like most RPG addicts do.  I like diversity in my games... RPG just doesn't provide that for me.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21252,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-06-30T10:33:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Chrono Trigger (Only good one time through though.)[hr][/quote]<br /><br />Only good one time through? There are thirteen different endings to the game!"
	},
	{
		"id": 21253,
		"title": "Hmm.",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-06-30T22:27:38.000Z",
		"content": "I suppose it's a question of who wants what out of the game.  <br /><br />In a racing game, people will run the same oval-shaped track day and night in order to shave those last few hundredths of a second off of their lap time.  <br />In an FPS, people will run the same multiplayer map day and night in order to perfect their headshot talents and sniping skills, so that in their clan matches they can be ranked #1.  <br />In an MMORPG, people will camp the same monster day and night in order to get their ideal gear, which gives them bragging rights and makes their next challenge to the games instances that much easier.<br />In a traditional RPG, people will grind the same monsters day and night in order to hit the fabled \"level 99\" limit, which is a bragging point and makes the rest of the game easier.<br />In a platform game, people will run the same first few levels day and night in order to memorize enemy locations and perfect techniques for speedruns and showing off.<br /><br />*shrugs*  What do you look for, in any game, to satisfy you?  <br /><br />Some RPGs will create random dungeons for you, so that you're not grinding the same LOCATIONS over and over again (particularly those by Nippon Ichi, such as Disgaea, Phantom Brave, Makai Kingdrom)<br />Some RPGs are more action-oriented, and give you more control over your main character during combat, which gives the game a segmented, action-y feel. (Star Ocean, Tales of Symphonia/Legendia/etc.)<br />Some RPGs are extraordinarily tactical, asking the player to consider each individual's actions on a deeper level (Front Mission, Super Robot Wars, Final Fantasy Tactics, La Pucelle Tactics, etc.)<br />Some RPGs are more teamwork-based, and you can play them with friends (Secret of Mana, Final Fantasy Crystal Chronicles, Legend of Zelda: Four Swords Adventure)<br />Some RPGs are focussed hardcore around their plot, so that the gameplay becomes secondary (or tertiary) to viewing the cinematic cutscenes (Xenosaga)...<br />Lastly (in my mind), some RPGs are \"classics,\" demonstrating the pinnacle of gameplay for the era they were released in (Chrono Trigger, Fallout 2, Knights of the Old Republic).<br /><br />\"RPG\" is about as descriptive as \"Rock,\" as far as genres go, these days... <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 21254,
		"title": "Re: Hmm.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-07-01T14:24:56.000Z",
		"content": "Same with 'platform'<br /><br />Keen was the platform pinnacle when it was released.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21255,
		"title": "Re: Hmm.",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2006-07-02T02:59:28.000Z",
		"content": "One man's monotony is another man's quest.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 21256,
		"title": "Re: Hmm.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-02T04:19:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /> suppose it's a question of who wants what out of the game. <br /><br />In a racing game, people will run the same oval-shaped track day and night in order to shave those last few hundredths of a second off of their lap time. <br />In an FPS, people will run the same multiplayer map day and night in order to perfect their headshot talents and sniping skills, so that in their clan matches they can be ranked #1. <br />In an MMORPG, people will camp the same monster day and night in order to get their ideal gear, which gives them bragging rights and makes their next challenge to the games instances that much easier.<br />In a traditional RPG, people will grind the same monsters day and night in order to hit the fabled \"level 99\" limit, which is a bragging point and makes the rest of the game easier.<br />In a platform game, people will run the same first few levels day and night in order to memorize enemy locations and perfect techniques for speedruns and showing off.<br /><br />*shrugs* What do you look for, in any game, to satisfy you? <br /><br />Some RPGs will create random dungeons for you, so that you're not grinding the same LOCATIONS over and over again (particularly those by Nippon Ichi, such as Disgaea, Phantom Brave, Makai Kingdrom)<br />Some RPGs are more action-oriented, and give you more control over your main character during combat, which gives the game a segmented, action-y feel. (Star Ocean, Tales of Symphonia/Legendia/etc.)<br />Some RPGs are extraordinarily tactical, asking the player to consider each individual's actions on a deeper level (Front Mission, Super Robot Wars, Final Fantasy Tactics, La Pucelle Tactics, etc.)<br />Some RPGs are more teamwork-based, and you can play them with friends (Secret of Mana, Final Fantasy Crystal Chronicles, Legend of Zelda: Four Swords Adventure)<br />Some RPGs are focussed hardcore around their plot, so that the gameplay becomes secondary (or tertiary) to viewing the cinematic cutscenes (Xenosaga)...<br />Lastly (in my mind), some RPGs are \"classics,\" demonstrating the pinnacle of gameplay for the era they were released in (Chrono Trigger, Fallout 2, Knights of the Old Republic).<br /><br />\"RPG\" is about as descriptive as \"Rock,\" as far as genres go, these days... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />[hr][/quote]<br /><br />Yeah whatever, but atleast you aren't playing the same game over again.  When I play RPG, all it feels like is that I'm in the same fantascy-land on my magical pony knocking down the Evil King Chingchongweewee and his army of Evil Blobs.<br /><br /><br />Maybe some people can get past all that, but I can't.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21257,
		"title": "Re: Hmm.",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-07-02T17:52:57.000Z",
		"content": "I like RPGs, and I think RPGs do have the best plots in gaming(save adventure games).  If you don't go for the save the princess stuff, at least the plot in that is better then FPSs or even in a sidescroller like king.<br />  RPGs is all about environment and plot and characters.  It can't have as much fighting as FPSs.<br />  RPGs are games you have to play the whole way through.  If its a good RPG it will have a lot more variety ion what you do then in FPSs.  Of course it doesn't give you everything, but there isn't a game yet that does, so i think its ok."
	},
	{
		"id": 21258,
		"title": "Re: Hmm.",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-07-03T21:00:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]like RPGs, and I think RPGs do have the best plots in gaming(save adventure games). If you don't go for the save the princess stuff, at least the plot in that is better then FPSs or even in a sidescroller like king.[hr][/quote]<br />Well, it depends. Some FPSes have good plots (System Shock), and some have great plots (Thief -- Looking Glass Studios seems to have a knack for this). Heck, even Star Trek Voyager: Elite Force had a pretty good plot, although the game wasn't great otherwise. So did Heretic II. You can't really lump them all together any more than you can lump all RPGs together.<br /><br />________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21259,
		"title": "!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-03T23:01:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Lord of Globox:</b><br />Evil King Chingchongweewee and his army of Evil Blobs.[hr][/quote]<br />He happens to be a close friend of mine.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />I think maybe you're not so much annoyed by the genre as much as you're flat-out bothered by the cliches... and I can totally sympathise with that.  No hard feelings?"
	},
	{
		"id": 21260,
		"title": "Re: !",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-04T02:26:07.000Z",
		"content": "Never was.  =)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21261,
		"title": "Re: !",
		"author_id": 1485560,
		"author_name": "Sanitars",
		"timestamp": "2006-07-11T02:33:44.000Z",
		"content": "My blood is about to boil!!<br />When you say \"I hate all RPGs\", you obviously mean \"I hate all jRPGs\". Then I would agree totally with you. I hate every single jRPG ever made, without exceptions. Final Fantasy my ass!<br /><br />But you CAN'T say you hate all RPGs when you OBVIOUSLY haven't played Fallout AND Fallout 2 AND Planescape Torment. How the HELL can you say they all have the same gameplay, same environment, same story. Fallout, for example, can have around 3 different endings to EACH of the towns you visit and there are about 10 of them. You can even finish the game without killing a single monster in the game! Or you can become a grinding machine and slaughter everyone in your way with your good old minigun or, just as effectively, your bare hands. Every person you meet in the game is a personality. When you talk with them, the things you say/ask/answer to them actually has EFFECT on the things that happen in the game world. ALL your actions have effect on how people react on you. Almost every quest in the game can be completed or failed in a handful of different ways or simply skipped and moved on to other ones. And also, the game's combat system is turn based, meaning you can take time and think wether to aim your gun at the mob's left leg or open your backpack and reload your gun, take a stimpack instead. The environment - post-apocalyptic desert, towns built with junk and underground vaults - you can't say it's the same as every other RPG. Show me a similiar game please. Now I suggest you look a moron up in the mirror, point at him and laugh until you choke. Or alternatively, rethink your arguments."
	},
	{
		"id": 21262,
		"title": "Re: !",
		"author_id": 1486058,
		"author_name": "BlueIllusionX",
		"timestamp": "2006-07-11T05:28:24.000Z",
		"content": "please control all PMS"
	}
]
