[
	{
		"id": 954,
		"title": "I've got some new hardware :D",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-11-23T15:53:25.000Z",
		"content": "I've bought a new mouse the old one was driving me crazy [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-halloween.gif[/img]     so I  bought a new one.<br />The mouse I've bought is a Razer copperhead , here is some info<br /><br />2000 DPI laser<br />1000 Hz / 1ms responce<br />32 KB onboard memory (for settings)<br />7 programmble buttons<br />16-bit data channel<br />Teflon feet<br />Always-on<br />On the fly sensitivity<br /><br />[img]http://img.photobucket.com/albums/v177/memsys/razercopperhead.jpg[/img]"
	},
	{
		"id": 22892,
		"title": "Re: I've got some new hardware :D",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-23T17:48:49.000Z",
		"content": "Mmmh, seems to be good! The programmable buttons sounds good. I should get a new mouse too, this one is about seven years old, doesn't work properly all the time and *gasp* doesn't even have the scroll! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 22893,
		"title": "Re: I've got some new hardware :D",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-23T18:10:02.000Z",
		"content": "Laser mice are cool, but tend to be <i>too</i> accurate - sometimes even the slightest bump in the table can cause the mouse to go haywire. However, I find anything less than an optical mouse with a scroll wheel to be infuriating.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 22894,
		"title": "Re: I've got some new hardware :D",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-23T22:44:20.000Z",
		"content": "Well this brings up a point that's been bugging me ever since I upgraded my seven year old mouse a month ago.  I bought a Logitech MX1000 - another laser-based mouse, but the scroll wheel on it is driving me crazy!<br /><br />My old mouse used to do it occasionally (an early Logitech with a wheel) but this one does it about 90% of the time.  When I move the wheel, I expect the screen to scroll one 'unit' for every 'click' the scroll wheel makes.  If I move the wheel two clicks, I expect the screen to scroll two units.<br /><br />Unfortunately the wheel seems misaligned, so that when I start pushing on the wheel it scrolls one unit, then when the wheel clicks it scrolls a second unit, then when I let go of the wheel it scrolls *back* one unit.  This makes it extremely irritating to use, and something that I would've expected they'd fixed by now...<br /><br />Is it just my mouse, or do yours all do this too?"
	},
	{
		"id": 22895,
		"title": "Re: I've got some new hardware :D",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-23T23:06:00.000Z",
		"content": "I imagine it's a dodgy mouse - my Logitech never does this, and neither does my friend's (who also has a Logitech MX1000)."
	},
	{
		"id": 22896,
		"title": "Re: I've got some new hardware :D",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-23T23:45:49.000Z",
		"content": "It must be a dodgy mouse. I've had other mice do that, but never my MX1000. On the other hand, my cursor occasionally leaps upwards if I use my MX1000 without the PS/2 adaptor. Their QC doesn't seem to be the best.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	}
]
