[
	{
		"id": 238,
		"title": "Commander Keen Duel",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2006-06-21T20:00:02.000Z",
		"content": "A couple years ago I started making a Keen fan game in KnP called the Commander Keen Duel.  I've abandoned it now, but if people like it I'll finish it.  Does anybody know where I can post a download for it, as I do not have my own website?"
	},
	{
		"id": 6145,
		"title": "Re: Commander Keen Duel",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-21T20:10:52.000Z",
		"content": "Email xtraverse on \"xtraverse at spatang d0t com\" (as is pointed out at the top of this forum) and I'm sure he'll be happy to upload it. If you want some proper webspace, you can contact me at \"grafix5000 at gmail dot com\"."
	},
	{
		"id": 6146,
		"title": "Re: Commander Keen Duel",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-21T22:02:23.000Z",
		"content": "Post screens if you complete the game. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 6147,
		"title": "Re: Commander Keen Duel",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2006-06-28T19:31:44.000Z",
		"content": "I don't visit the forums very often due to limited internet time, so I didn't see that note at the top of the forums.  I'll send it to him.<br /><br />Oh, and, if you want background on this fangame, here it is: I had always hoped that a Keen fan would make a multiplayer mode for Keens 1-6, cooperative or Keen-vs-Mort deathmatch, but nobody has of yet, so I decided it was up to me.<br />Since I didn't have the Keen source code or anything, my only hope was to make my own EXE that was very, very close to the original Keens.  Having only KnP and not wanting to recreate the levels, I decided to settle for deathmatch.<br />It took a lot of work to get pogoing, shooting-left-or-right-while-jumping, and the rest of Keen's features into the game, and even then it wasn't anything like a replica of real Keen.  Pretty soon, I just got discouraged and quit.  If people like the incompleted game, I'll finish it, but otherwise I won't.  As of yet it's not really playable because the two characters can't interact and Mort can't do what Keen can."
	},
	{
		"id": 6148,
		"title": "Re: Commander Keen Duel",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-29T03:34:28.000Z",
		"content": "Sounds aweseom!<br /><br />You have very much support here giving me to you.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 6149,
		"title": "Re: Commander Keen Duel",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-03T14:29:57.000Z",
		"content": "Well, don't finish it for us, finish it for yourself.<br /><br />Making a game is always fun; however, you should always make it for your own creative purposes.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
