[
	{
		"id": 1011,
		"title": "What are the worst games you've played? (cheesy games)",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-09T17:36:38.000Z",
		"content": "An terrible game I've played is Keen Plus. Horrible, horrible game.<br /><br />The art is awful. The ripped graphics were resized horribly, and the original art looks terrible.<br /><br />Here's the story of the game. *spoiler alert*<br />One day, 8 year old Billy Blaze went out in the Bean-With-Bacon Megarocket just to have fun in space for the first time without running into any trouble. A short time after leaving earth, Something comes flying torwards the Bean-With-Bacon Megarocket.<br /><br />\"Uh oh, is it a metior?\" Billy Blaze asks himself.<br /><br />Soon enough, a news paper hit the windshield of the Bean-With-Bacon Megarocket,\"The Galaxy Update. This news paper was written in Intergalactic Galactic Alphabet, but knowing it, Billy Blaze was able to read it. Eventually, he found an article that caught his interest.<br /><br />\"A big alien Monster named King Kaba was discovered with a big vorticon making machine on a planet called 'Life Plus' located in a far away galaxy. It is known that Kaba recently went to planet Mars in the Milky Way Galaxy and sucked a life-form out of a dead vorticon then he brought it back to 'Life Plus'. He then gathered up a bunch of spare parts that can't be found on any other planet. He put them together and invented the vorticon-making machine He was now seen making vorticons using the DNA from the vorticon body. When he gets enough of them, he is planning to command them to make a big bomb then he will have them drop it on planet Earth located near Mars after what some guy did to Mortimer and some of his vorticons.\"<br /><br />Keen couldn't read any longer, he had to go to \"life plus andand stop Kaba from dropping that bomb so Earth would be saved.<br /><br />(I corrected spelling and quotation use, but I didn't edit the story, add to the story, or make the story up; the person who made this \"fangame\" made the story.)<br /><br />(Questions)<br />1. The vorticons are no longer deadly, so why are the ones from the dead vorticon's DNA deadly?<br /><br />2. Why can't you call \"Billy Blaze\" \"Billy\", \"B. Blaze\", \"Billy B.\", \"B.B.\", \"Commander Keen\", or \"Keen\"?<br /><br />3. How are the vorticons gonna \"drop\" that bomb on earth?<br /><br />4. If the bomb's too big, How will the vorticons get the bomb off the ground?<br /><br />5. How will the vorticons control the bomb?<br /><br />6. Why would the vorticons want to blow up the planet?<br /><br />7. What if Keen ignored the SGA sign in Keen3?<br /><br />8. What if you failed winning Keen 1, 2, or 3?<br /><br />9. Why play this awful fangame in the first place?<br /><br />Unfortunately, these questions might not ever get answered.<br /><br />There is no music in this game, which is terrible because the sounds are the worst I've heard so far. They are childish, so a little child might enjoy them, but I find them extremely annoying.<br /><br />It is similar to Keens 1-3, but horrible. Keen moves like he's on a sugar rush. He also might get stuck in a wall when you try to jump because his jumping sprite is places too far to the right. Also, you can shoot in all directions, but that works badly, because you have to press an arrow key to aim it, and where your shot is aiming sticks to where it's aiming. Your shots are also aimed upwards (or a little crooked, or diagonal) by jumping. The enemys and dangers work awfully, AND YOU ALWAYS GET STUCK IN WALLS!!!!!!!!!!<br /><br />What are the worst games you've played?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 24089,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-10-09T20:05:19.000Z",
		"content": "Is this for only fan games or retail games? <br /><br />The worst game that came to my mind (even though there are worse games out there) is the first Full metal alchemist game for the ps2. I'm a huge fan of the series and a big fan of Square enix games but I truly felt that the developers didnt put much effort into the game. Alot backtracking, repetitive gameplay, no voiceovers (except for the anime cutscenes), and subpar graphics. The only thing I liked about the game were the anime cutscenes and the alchemy system. There are better action rpgs out there like Kingdom hearts or Full metal alchemist 2 (The 2nd one was way better than one) so I would say stay away from this game even if you are a fan of the series.<br /><br />Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 24090,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-10T07:58:45.000Z",
		"content": "What was it called...?<br /><br />Oh yes, Vinyl Goddess from Mars or somesuch.<br /><br />Total skit.<br /><br />Kangaroo was pretty bad too.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 24091,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-10T10:20:48.000Z",
		"content": "Vinyl Goddess From Mars wasn't bad. Sure, it was a \"technologically advanced\" Jill of the Jungle rip-off, but it was still a good game. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 24092,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-10-10T12:59:47.000Z",
		"content": "keen 2000 its [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  I am the bad you are the ugly There is no good"
	},
	{
		"id": 24093,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-10T17:28:39.000Z",
		"content": "Vinyl Goddess... that was put on a diskette that came with some soft-porn magazine I remember vaguely, so I assumed the game was dirty somehow.<br />It wasn't.<br />I have to admit I was somewhat disappointed, not because I wanted dirtiness, but because it was a bit of a let-down, it felt like a mediocre Jill clone... although I barely remember what it was like it all to tell you the truth.<br />Of course Jill's controls weren't very good at the time, and these days for me they're terrible, but I still think Jill was hotter.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24094,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-10T20:19:45.000Z",
		"content": "Memsys- Die.  CK2000 is a classic, and a forerunner to nearly all fangames.<br /><br />The worst game I ever played had to be... Let us see...<br /><br />Final Fantascy Crystal Chronicles<br />Tales of Symponia<br />Custum Robo<br /><br />God, my friend plays them all the time, and I want to kill myself.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 24095,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-10T20:55:35.000Z",
		"content": "CK2000 deserves recognition for being one of the first fangames. It wasn't the worst of the fangames, but it certainly wasn't good."
	},
	{
		"id": 24096,
		"title": "Re: What are the worst games you've played? (cheesy games)",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-10-11T02:00:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Final Fantascy Crystal Chronicles<br />Tales of Symponia<br />Custum Robo[hr][/quote]<br /><br />I liked Custom Robo but I just could not get into Crystal Chronicles (love the final fantasy series though) and tales of symphonia (I like Star ocean: Till the end of time more)Check out my blog at [url=http://spaces.msn.com/members/superadammario/]spaces.msn.com/members/superadammario/[/url]<br />Check out my fanfics at [url=http://www.fanfiction.net/u/680124/]fanfiction.net[/url]"
	},
	{
		"id": 24097,
		"title": "buh!?",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-10-11T03:07:12.000Z",
		"content": "You Crystal Chronicles haters have obviously never had the privelege of playing it with 4 GBAs and 4 players.  :-)  Yes, I'll admit the game is slow-pace and the map system is extremely lame and un-fun... but once you get into an actual level, and everyone's got their little goal to meet, and someone's gotta carry the cup and someone needs to cure, attack, time the -aga spells, etc... it's a lot of fun.  It demands teamwork and trust.  <br /><br />My friends and I used to get together every Tuesday night to play it for about 3-4 hours... We got our 3 drops of Myrrh, completed a year cycle, and saved for that week.  It was pretty slick!  :-D<br /><br />As far as cheesy/lame games go, I'd have to point to Bases Loaded II for the NES.  The music for 1st player is 4 measures of whistle-blowing rhythm loop, and the music for 2nd player is 8 measures.  The pitching system is gimmicky at best, and the whole game just screams \"Play me poorly!\"<br /><br />Heck, come to think of it, a lot of sports games strike me as poorly put together.  I played NFL Blitz 2000 on the N64, and it was hilariously bad.  I could pull of any passing play I wanted by using the Turbo button to run straight back at the hike, and then pass to anyone I wanted with a 99/100 success rate.  The AI couldn't stop me, and my friends weren't much better.  :-)  Abuse abuse abuse.<br /><br />As far as more modern gaming goes, I was severely underwhelmed with the port of Sonic Adventure DX to the Gamecube... poor framerate, lousy character animation, and just a horrid mess of a port.  Phooey.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 24098,
		"title": "Re: buh!?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-11T06:20:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Vinyl Goddess... that was put on a diskette that came with some soft-porn magazine[hr][/quote]<br /><br />Erm, oookay.... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]I assumed the game was dirty somehow.[hr][/quote]<br /><br />I'll bet.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I have to admit I was somewhat disappointed,... because I wanted dirtiness,[hr][/quote] <br /><br />Uh-huh<br /><br />[quote]<b><i>Quote:</i></b>[hr]I still think Jill was hotter.[hr][/quote] <br /><br />Well I think I've heard enough about what kind of games you like. Probbably hosted on nice little sites ending in .cxA proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 24099,
		"title": "Re: buh!?",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-11T09:32:34.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I have to admit I was somewhat disappointed,... because I wanted dirtiness,[hr][/quote]<br /><br />Try playing 'Singles : Flirt Up Your Life', or any 'Leisure Suit Larry' if you want dirtness. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Well, to be honest, I haven't played either, but I know they're dirty games to say the least. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 24100,
		"title": "Re: buh!?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-11T12:39:21.000Z",
		"content": "I've heard of the Singles game, barely know what it's about, but I'm sure that's not my cup of tea.<br />It's similar to The Sims, if I'm not mistaken, and I don't like that game either.<br />(Truthfully I never actually played it, so maybe I love it and just don't know it, but for now I don't.)<br /><br />[quote]<b><i>Quote:</i></b>[hr]Erm, oookay.... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] [hr][/quote]<br /><br />Confused about what exactly?<br />I went to one of those computer bazar thingies with my dad, and there was some new, small publisher there, who gave away free (old magazines).<br />They had a regular or gaming one with diskettes with games like Hexxagon, and one with games like Strip Poker.<br />Really nothing too bad though; an afternoon on the Web and you can find much worse.<br /><br />Back to games, about the LSL games, I did play those around the time they were new, starting with the first one.<br />Despite popular opinion, at least back then, they really aren't that dirty.<br />They do need you to be an adult to understand some of the humour, because back then a lot of jokes flew right past me.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Well I think I've heard enough about what kind of games you like. Probbably hosted on nice little sites ending in .cx[hr][/quote]<br /><br />Actually the only .cx site I know exists is the famous one, the one that's really only an image which makes you look away REALLY quickly, the one where the actual, original site isn't online anymore.<br />Sort of strange actually...<br /><br />So anyway, what you're really trying to say is you want me to tell you where you can download actually dirty games?<br />OK, I just e-mailed you some good URLs.<br /><br />Oh, and you people can expect some slightly altered quotes as well in the future. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24101,
		"title": "Re: buh!?",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-11T14:54:14.000Z",
		"content": "Leisure Suit Larry is not dirty. It just makes fun of sex. Is there a problem with that? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pig.gif[/img]"
	},
	{
		"id": 24102,
		"title": "Re: buh!?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-11T16:52:56.000Z",
		"content": "Well, it's better than promoting it all the time.<br /><br />Edit: Oh, you're right Djaser.. (Reply to post below.) Clearly didn't think it enough. It's another form of promoting! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 24103,
		"title": "Re: buh!?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-11T18:09:05.000Z",
		"content": "It's still a way of promoting. <br /><br />Anyway the worst game I can remember was Pizza Tycoon or something called like hat. It was full of bugs and I never figured how exactly to play it.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 24104,
		"title": "Re: buh!?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-12T06:11:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]So anyway, what you're really trying to say is you want me to tell you where you can download actually dirty games?<br />OK, I just e-mailed you some good URLs.[hr][/quote]<br /><br />DEAR LORD! Some of those are SICK! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <br /><br />Incidentally, just how long have you been a member of the furrycommunity?A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 24105,
		"title": "Re: buh!?",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-12T07:14:03.000Z",
		"content": "SimTown was a really awful title by Maxis. Good thing it was aimed at a young audience. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />I can't really remember any crappy old games now. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 24106,
		"title": "Re: buh!?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-12T11:41:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Incidentally, just how long have you been a member of the furrycommunity?[hr][/quote]<br /><br />I could be mistaken, but weren't you the one that introduced me a few years ago?<br />Or was it the existance of that golden shower thing you told me about?<br /><br />You know, there are things in this world I really wish I'd never heard about.<br /><br />SimTown... I remember reading Maxis's announcement accompanied by some screenshots, but I never actually got to play the game.<br />I was curious... suppose it was no loss now.<br />SimCity was cool though; played the original 2000, skipped 3, and haven't tried 4 yet either, although I'm probably buying the special edition once it gets a little cheaper.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24107,
		"title": "Buh, humgarg.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-12T14:20:22.000Z",
		"content": "Meh. SimCity 4's way overrated, IMKO. Too much Godness and Simsness, not enough Cityness. 3000 has a nice atmosphere, and I found that easy to lose myself in. The landmarks are a pointless gimmick, and some things are dumbed down from SC2k, but on the whole I find it far less mainstreamised than 4.<br /><br />Hmm... cheesy games... I think I'd rather not ponder it. There are plenty of them out there. If anything springs to mind, I'll let y'all know.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 24108,
		"title": "Re: Buh, humgarg.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-12T15:03:22.000Z",
		"content": "So you're saying 3000 (I called it 3, thought they lost the \"thou\" at the end with the third game already) is better than 4?<br /><br />I'll be taking your opinion as \"just an opinion\" of course, but 3000 is cheaper than 4 I'm sure, and would probably run better on my computer anyway.<br />I just sort of ignored it because by now 4 is out already, and newer = better... even if not always. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />A friend of mine played it, and said he didn't like it as much as 2000, but he has a different taste than I do, so I'm adding salt.<br />Maybe I'll just buy 3000 instead then.<br /><br />I loved the original (never was much good at it though), and played 2000 for quite a while too (although I had even more difficulties making a streamlined community with the extra micromanaging), so I'll probably like the newer games too.<br />I was actually afraid even more micro-managing would make the game less fun for me, but because you say some things were actually dumbed down, maybe I shouldn't be afraid of that.<br />I think there is a special edition out as well, including the Europe expansion set with extra buildings and a building designer or something, so I'll keep an eye out for that.<br /><br />I realise I haven't actually answered the question's original question.<br />Let's see, I never was a big fan of Pacman I suppose.<br />When it was new I was young, and really didn't like to lose, which I did a lot in such a fast-pace game... AAARGH!!!<br />Also as much as I love having infinite resources (eventually playing on tiberium-bare maps in Command &amp; Conquer for instance annoyed me quite a bit, I liked to play it slow, build lots of stuff), I hated respawning enemies.<br />Once I finally managed to eat a power pill and actually eat some ghosts, they'd just be reborn again, making it feel useless, although I realise it isn't.<br />I played it again later, and it wasn't as bad as I remember of course.<br />I can't think of any game I really, thoroughly disliked though.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24109,
		"title": "Bite Me, Mainstream",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-13T01:44:09.000Z",
		"content": "[hr]<b>Retodon8</b> So you're saying 3000 (I called it 3, thought they lost the \"thou\" at the end with the third game already) is better than 4?<br />[hr]The things I find most annoying about SC4 are:<br />- that you're given free reign over the formation of the landscape before starting each city<br />- its emphasis on realistic simulation rather than pure fun<br />- there's still no bloody real-time multiplayer capability!!<br />- that stupid 'place a bunch of sims in the city' feature (albeit, it's entirely optional, but the fact they put so much effort into something so trivial irritates me)<br />- more, but pointlessly simplified micromanagement--it's now possible to adjust the funding for individual utilities and such, but it's still the same basic concept as it's always been--adjust a slider and the building's effect is increased or decreased (power/water output, school bus range, etc)<br /><br />I hope another crowd come out with a decent city simulator one of these days, otherwise that's another game of which it's gonna be up to me to create a non-mainstreamised version.<br /><br />If they took SC2k and 3k, took their best features and removed the gimmicks like arcologies and landmarks, and converted them to SC4's engine, keeping the randomly generated landscapes, gave the populace a bit more AI, and expand the scope back into the 19th century and on into the 22nd or 23rd, allowing a Z-dimension to the infrastructure, for starters, we'd have the makings of a brilliant city sim.<br /><br />Alas, EA has had an incredibly detrimental effect on the quality of the SimCity franchise and there will never be truly brilliant SimCity.<br /><br />I do suggest you seek out some other opinions, though. My tastes tend toward colourful games that are fun and slightly surreal, rather than attempts at perfect recreation of a real-life scenario.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	}
]
