[
	{
		"id": 479,
		"title": "Uh...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-22T23:08:41.000Z",
		"content": "Well... I'm not sure if you guys remember me... but I'm the guy that was going to make a commander keen animated online series thing...<br /><br />I really need to set smaller goals for myself. Well, I'm sorry to say that I won't be doing the animation thing. I'm also sorry that I asked one of the forum members to make a 3d model for me.<br /><br />Now, the little I accomplised has gone to waist... I guess I'm apolgizing for doing that.<br /><br />But I have one thing to give you guys. It's not much and it's not complete but here it is. A fanfiction I may or may not continue.<br /><br />-----<br /><br /><b>COMMANDER KEEN: RETURN TO THE STARS</b><br /><br />In the void of space there is no sound, only the black background filled with many white stars and deep blue nebulae. That was one of outer spaces frightening, yet awe-inspiring traits, especially in that raging battle in the heavens.<br /><br />Powerful cannons fired from all directions, almost filling every possible empty space in the battle area. But he could see the many gaps in this shifting web of devastation and dodge the blazing turquoise balls of destruction. Only his and the brilliant minds of the alien pilots around him had the mental capacity for such reflexes.<br /><br />Everything in this vision was so clear, yet somehow vague. He didnt know where he was but felt a strange urgency and subconsciously knew everything he was supposed to do and every event that would follow.<br /><br />It felt alien to him yet gave him a sense of power and will he had never felt before. He piloted the craft he flew straight toward a hulking vessel and fired two shots at a strange device attached to the bottom of its hull.<br /><br />Then something he hadnt predicted happened. The device exploded and sent a powerful, tsunami shockwave toward the surrounding vessels. He felt himself scream something in the comm. channel, but he couldnt understand the words he spoke. Then a red mist formed in front of him and consumed him.<br /><br />He felt a sharp pain course through his fragile body and then he collapsed.<br /><br /><br />A light flashed beyond his closed eyelids wrenching him back into consciousness. The sound of obnoxious laughter and the whine of an ion engine rang in his ear and he immediately sat up, frantically looking around. Disbelief clouded all common sense and reasoning as the sight filled his vision.<br /><br />Before him was a passageway of immeasurable distance, filled with tan, sand-covered rocks and all of this was in the depths of a broad canyon. The blazing, golden sun was high above in the center of the vast blue ocean of the sky.<br /><br />Looking back down upon the ground, he noticed an object, obscured by a large boulder was not to far from him. He stood up and found that his muscles ached with a burning pain. He stumbled around a bit as he walked to the object.<br /><br />It was his older brothers football helmet. Its yellow surface vaguely glinted from the sun on its scratched and cloudy surface. A white line, bordered with smaller green lines, ran to the back of the helmet and over the top from the front of it. There were large Gs on both sides of it showing that it was a Packers helmet. It was marked with black scorch marks on one part. These were scars of past battles the boy, who now stands on the surface of this strange world, had faced.<br /><br />This boy was Billy Blaze to his friends and family back on earth. But in the society of the galaxy he was a legendary warrior, self-dubbed: Commander Keen.<br /><br />He reached down with his muscular arms and strong hands, picking up his trusty helmet. He donned it, changing from the giddy boy he had been on earth into the determined guardian of justice he had been a year ago. There was a gleam in his big blue eyes as the thrill of being back in space again filled his heart.<br /><br />Billy had been absent from space for a whole year, relaxing peacefully as he granted himself relief of his duties for a while. He had gotten tired of saving planets and finally the entire galaxy. He had only been eight-years-old and he really wanted to rest.<br /><br />But the restless galaxy wouldnt settle for anything less than Commander Keen, less being plain old homesick Billy. He scowled as he felt the desire to blast whoever did this into vapor.<br /><br />The last thing he remembered was falling asleep hearing the sound of an engines pulsating hum and the sight of a headlights beams moving past his bedroom window. He had assumed it was the neighbors arriving home from a party or some other event. But now he guessed it had been an alien vessel coming to take him to this strange wilderness.<br /><br />Underneath where the helmet had originally been was a pistol, with the sleek design of a Vorticon Neural Stunner, for that is what it was. He reached down and picked it up, feeling its rough, worn surface, reliving past encounters with brutish alien soldiers. He looked up from the gun he held in his hand and glared into the air as he imagined what he would do to the alien savages that did this to him.<br /><br />He marched forward, glancing behind him briefly to find that he was at the end of the chasm. There was nothing behind him except a solid stone wall. He turned his gaze back to the lengthy path ahead of him, sighed and started to traverse the great distance that was set before him.<br /><br />He would beat this challenge and when he found the criminals that did this, justice would be laid down upon them with all his might.<br /><br />***<br /><br /><br />A slender, well-built alien sat comfortably in the seat of his flashy, dark-red speeder. He was proud of that vehicle for it had saved him from trouble many times in the past. Its color matched t he color of his scale-covered skin.<br /><br /> His eyes stared at the screen between the steering sticks behind green glowing goggles. It displayed the site where they had dropped the infamous Commander Keen off. The boy was on the move now and immediately acquired a vigor that surprised the alien.<br />Almost.<br /><br />However, he was surprised that the great warrior that had defeated the mind-enslaved Vorticons, who had foiled the Shikadi was a young boy. One of the two most intelligent humans in the universe was a young boy. He had never met the other one, but he assumed that he was an adult.<br /><br />The very thought, that such a young human boy had defeated some of the most notorious villains in the galaxy, baffled and appalled him. If the boy was the infamous Commander Keen, he would show great skills of combat, espionage and have the most agile reflexes.<br /><br />He sighed knowing the boy wouldnt reach the ambush point until hours later, so he jumped off his speeder and walked inside mobile hut he had set up. The time would come sooner or later and then he would have his battle.<br /><br />***<br /><br />Keen cursed a substitute word and kept scaling the many rocks that filled the canyon. It was as if the place was a huge quarry where the people who made it just dug straight down.<br /><br />The many large stones he had to climb over or walk around all felt warm and smooth. This was strange, for he had already observed the suns temperature and concluded that the planet was entirely desert. So why were the numerous brown rocks all eroded smooth?<br /><br />This could only mean there was a large ocean or lake somewhere nearby where storm clouds formed from the evaporating water. Either that or the sun got so hot in the summer that rocks melted and solidified again to look smooth and this was just winter. But if that were so the rocks wouldve looked like hair gel that had fallen onto a flat surface and the rocks were not like that.<br /><br />If there was an ocean or lake around there had to be a place where the water drained back into ocean or lake it had come from. He was hoping that the people that had brought him here were hanging out near that drain to have a water source. Although, he was assuming they hadnt left, but he hoped it wasnt likewise.<br /><br />Those idiots didnt even give me my pogo stick. Keen muttered angrily. He had already seen some ledges he couldve jumped up to and he mightve even found a cave to be safe from the heat of the sun for a while.<br /><br />He kept muttering like this to himself for two miles until he reached a stone slab that was propped up against a large round bolder. He cleared away the gravel and laid down under the shady cover of the stone.<br /><br />-----<br /><br />I hope you guys like it.<br /><br />-Dreamer (boy, I picked a perfect name for myself. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]   )<br /><br />EDIT: Dangit. I left the signature in there.<br />-----------------<br />Keenimation, coming soon in 2004."
	},
	{
		"id": 13437,
		"title": "Holy...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T00:00:37.000Z",
		"content": "\"-----------------<br />Keenimation, coming soon in 2004.\"<br /><br />Oh, well; we all make mistakes from time to time.<br /><br />Nice story!!!<br />I'm really liking this increase in fan-fiction.<br />I'm going to release on soon myself.<br />Awsome; can't wait for more.<br /><br />-- NAJAWA --<br /><br />Edit: Wow!!! I re-read it, and I love the detail, and the suspense.<br /><br />Edit2: I shut up with the expectations."
	},
	{
		"id": 13438,
		"title": "Re: Holy...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-23T05:15:52.000Z",
		"content": "At last! Company in Keenfictioning! I like your style, its more paragraphed then mine, but full of the stuff that makes a good work.<br /><br />I look forward to revelation of the general plot. [Until then its not wise to speculate Naj, otherwise he'll change it to escape your expectations.]A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13439,
		"title": "Re: Holy...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-23T12:54:12.000Z",
		"content": "Hehe, I remember you. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Anyways, awesome work there! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  Well written fan fiction is always fun to read. Like your style. Hopefully you'll continue this..[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13440,
		"title": "Re: Holy...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-23T15:37:47.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]its not wise to speculate Naj, otherwise he'll change it to escape your expectations[hr][/quote]<br /><br />Heh, don't worry. She was wrong... *changes plot quickly*<br /><br />jk :P<br /><br />Thanks for the compliments! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Dreamer"
	},
	{
		"id": 13441,
		"title": "Re: Holy...",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-23T15:39:17.000Z",
		"content": "Great use of imagery and description there! Since I'm picky, I'll say that I didn't really like the way you started a new paragraph every two or three sentences - but otherwise this is a great story. The more high-quality fan fictions like this, the better![url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 13442,
		"title": "Uh...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T17:15:33.000Z",
		"content": "Well; they wern't really ideas, just what I thought might happen; Inferences I made after reading the story, you know; <br /><br />\"Commander Keen was knocked unconcious by a green blur, and the last thing he saw, was razor sharp teeth\"<br /><br />If I read the above passage; I could make the following inferences:<br /><br />1) He was attacled by a Garg [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />2) KeenRush wrote it<br /><br />They are not nesscesarally true, but they're geusses based on observations.<br /><br />-- NAJAWA --"
	},
	{
		"id": 13443,
		"title": "Re: Uh...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-23T22:23:36.000Z",
		"content": "When really it was norp catching rabies and attacking his master, a LL plot. A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13444,
		"title": "Eh... yeah?",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-23T22:26:29.000Z",
		"content": "Okay... sure.<br /><br />Now when do we get the next chapter???<br /><br />Please hurry up... we're getting older by the second. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 13445,
		"title": ":p",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-23T22:29:12.000Z",
		"content": "I was just about to work on it.-Dreamer"
	},
	{
		"id": 13446,
		"title": "Okay... okay!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T02:23:55.000Z",
		"content": "I don't mean it to be rude; I'm just your greatest fan!!!<br /><br />-- NAJAWA --"
	},
	{
		"id": 13447,
		"title": "Re: Okay... okay!!!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-24T09:56:07.000Z",
		"content": "Let him rest Naj, not all of us can write a chaoter a day. [And I'm only going that fast because people are force feeding me so many Ideas I feel like I'm gonna burst.]<br /><br />In his own time a new chapter will form, do not rush art, or what emerges will not be worthy of any fandom.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13448,
		"title": "Okay... I'll be quiet:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-24T14:37:07.000Z",
		"content": "Okay... I'll be quiet. Oh, LL, could a comment on something?<br /><br />LL: \"Make it snappy\"<br /><br />Najawa: *Shoves Idea down her throat*<br /><br />LL: *Choaks*<br /><br />Najawa: \"LL, aren't you going to use that Idea?\"<br /><br />LL: *unconciense*<br /><br />Najawa: \"Ah... she must be meditating*<br /><br />Okay... I won't be pushy, but I still can't wait!!!<br /><br />-- NAJAWA --"
	},
	{
		"id": 13449,
		"title": "Huh...",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-24T15:32:34.000Z",
		"content": "Next chapter? I haven't even finished the first one yet... In fact, I think this should be the prologue or something... actually, maybe it could be the first and the next ones can be longer.<br /><br />One of those.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 13450,
		"title": "Re: Huh...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-25T02:35:07.000Z",
		"content": "I think the fact that I post a chapter every post is what is confusing here, Najawa expects that you will too. What he wants is the next <i>post;</i> several posts making a <i>chapter</i> I presume.<br /><br />Naj, your spelling is getting as bad as mine.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13451,
		"title": "Spelling:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-25T04:49:59.000Z",
		"content": "I spell bad because the darn spell check doesn't work (and most of the time; I dunt caer [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] )<br /><br />-- NAJAWA --"
	},
	{
		"id": 13452,
		"title": "Alrighty",
		"author_id": 1485623,
		"author_name": "Dreamer",
		"timestamp": "2005-09-27T02:18:18.000Z",
		"content": "Here is the next part. I think it might be a bit longer than the last. I tried to fit everything I could into it. I also introduced a new character so I could have some conversation before a certain point in the plot.<br /><br />But anyway, without further delay, here it is.<br /><br />----------<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He kept muttering like this to himself for two miles until he reached a stone slab that was propped up against a large round bolder. He cleared away the gravel and laid down under the shady cover of the stone. He rested for a while and contemplated the situation.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He had been captured and marooned on a desert planet and as of yet he hadnt come across any civilization. There was no water source visible yet, but he expected to come across one sooner or later. Also, there was the scorching sun, the blistering surface of the rocks and possibly even a gang of dangerous space criminals roaming around the canyon with more supplies than he had.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp All he had was a simple blaster and his brothers football helmet. There wasnt much he could do except shoot.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He groaned, lolling his head, then scowled and pound his fist against the sturdy boulder next to him. I hope Im not here more than a day without food or water.  He thought to himself. Im not going to last long like this.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He sat there for a several hours and soon dozed off.<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He suddenly woke up with a jolt, his senses alert. He heard a strange noise down the canyon ahead in his destination.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp After crawling out from under the rock he stood up and looked down the canyons length. There was a boulder not to far from him where the sounds emanated. They sounded like low-pitched, reverberating pig squeals and after whatever-it-was was done squealing it let out a huge, powerful snort.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Then there were thudding noises accompanied with the sound of spattering gravel. Then a long shadow moved past the rocks and Keen found that it resembled a huge creature. His expectations were true, for at that moment the creature loomed out from behind the boulders. Keens eyes betrayed some of his surprise through his calm complexion, as he stared at the creature.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp It looked like a wolf, only its dark gray hair stuck up in a line running through his back. It was also larger than a wolf, about the size of a cougar. It caught sight of the boy and it fixed its yellow eyes upon him. It snarled, revealing two rows of menacing teeth. It suddenly bellowed and planted its feet in the ground, preparing to lunge.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen drew his pistol out just in time to blast the creature in mid-air. The creatures eyes rolled around, arms and legs flailing, and it collapsed on the ground. Keen stood there, still staring at the creatures corpse lying on the ground. His gun had been set to lethal instead of stun, because he wasnt taking any chances out here.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Besides, the creature didnt show any signs of sentience so it was okay. If it had been an intelligent, civilized alien then he wouldve been in big trouble.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He glowered, wishing he had his wrist computer with him. He couldve scanned the creatures anatomy and stored for research back on earth. But, unfortunately, the captors only gave him his most notable stuff.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Then a new question popped into mind. Why was I even given the stuff I have? Why didnt they just kill me?<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Both questions could not be answered unless he was able to interrogate the people that had done this.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He put his concentration back on the animal and started to study it closely. In addition to the two yellow eyes that most creatures have, it had two smaller eyes placed near the originals at diagonal angles and they were both further out on their individual sides of the head. Its muscles were also different, for example, it had three triceps and two biceps, not just one of each. Its mouth was open, revealing long sharp, jagged edged teeth.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keens spine tingled at the thought of what the creature couldve done if it had even touched him.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He carefully walked around it and started the long walk again. He walked for another mile, crossing many large boulders and rocks embedded into the ground. Sweat trickled down his forehead, matting his fiery red hair against his head. The heat was rising from the ground and it made his skin sting.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Suddenly, he heard once again the strange roaring noise of the creatures he had encountered. He slowed his pace and peeked around a large boulder to see an entire pack of the creature he had encountered two hours ago!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He swallowed his spit and tried not to make any sound. His heart pounded and his mind raced with terrible thoughts. He hoped the creatures would turn and go ahead of him, but as of yet they made no move.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Fascinating isnt it!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen whirled around and aimed his stunner at a large round, mechanical ball. It was the source of the voice. Ooh! A Vorticon Neural Stunner, version four! How quaint. The pistol you carry, I see, has been modified for-<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen cut him off by slapping his hand over the speaker, but the totally oblivious robot kept talking. Its voice was muffled now that Keens hand was over it, but that didnt stop the robot.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The noise attracted the attention of the wolf-like life forms and they all roared with anxiety of eating flesh and blood. Keen almost jumped, but instead ran up to a large stone and climbed on top of it.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The pack immediately started lunging at him and Keen instinctively started blasting them down. To his dismay, he now had the full view of the pack. There were nearly fifty of them!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Turning a knob on his gun, he switched it into rapid-fire mode and started killing the creatures left and right. This seemed to upset the robot who was now frantically yelling, No! Dont! They are an endangered species!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen scowled and yelled over the noise of snarls and blaster fire, Im more endangered than them right now!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp But there are only twelve packs left! Dont harm the innocent Skernog! Theyre just hungry! Shouted the robot, dismayed at the sight.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen wouldve gaped at the floating ball had he not already been occupied. Are you insane! I dont think eating a sentient being is innocent.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The orb was still protesting but Keen was now too busy to notice. One of the creatures had jumped and slashed his forearm, leaving it bleeding rapidly. He let out a snarl himself and started to fight more ferociously, jumping from boulder to boulder. His arm burned like blister and warm red blood oozed down his arm in small crimson drops. He would have to bandage it later.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The frenzy of Skernog was kicking dust up and made his wound itch. Ignoring it, he fought on and was almost cut across the stomach as one of the creatures jumped all the way over the stone he stood upon.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp He had only killed eighteen so far but the others were now attacking more violently, their energy fueled by the rage of losing some of their kind.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Then suddenly, the Skernog all stopped, howled and whined. Soon they retreated further up the path and disappeared into the horizon. Keen stood upon the boulder, confused at why they withdrew. He was becoming even more vulnerable.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Then the answer came to him as the little orb said, There, you see? All you had to do was make an extremely high-pitched note and they will run away. The Skernog are saved and sp are you!<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen rolled his eyes, bared his teeth and then narrowed them at the strange robot. You idiot! Im the one who needed to be saved. Look what they did! He held out his arm and showed the torn flesh. The robot now seemed more sympathetic to Keen.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp I see! Here, I can help with that. It had three lenses on the ends of three cylinders sticking out of its metal casing. One of them lit up and cast a blue beam upon Keens arm. Keen watched with interest, trying to determine what the thing was doing.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen sat down and the robot, in perfect synchronization with him, floated down with the arm. The thing then started to speak. Well, we must introduce ourselves since we have already gotten this acquainted. My name is Explorer Probe 33 and E.P. 33 for short. My goal is to gather as much information as I can and return to my creator. Keen was about to speak but then the probe spoke up again. You must be the great Commander Keen, judging by your Packers helmet and Vorticon Neural Stunner.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen, disturbed at how much the probe knew, said, Thats close.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The probe did a slight chuckle and Keen suddenly noticed how much of a British accent it had. I was exactly right and you know it. But I am curious to hear your personal account of your adventures. We shall have to discuss the subject sometime.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp  Keen nodded, glad that he would have someone to talk to about his adventures. He couldnt tell his family, because they would never believe him and if they did they would probably ground him and call the authorities to check out his advanced technology. But now he had someone that wanted to hear the stories and believe almost every word he said.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Eepee, I would be glad to tell you about that, Keen began, But what I really need is information on this planet and who brought me here in the first place.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Hmm, Eepee uttered as he thought, Well, Im afraid I dont know who brought you here, but I might when we see him. But I know just about everything on this planet. He seemed to clear his throat and then started on a long description, recited like a memorized speech. The planet is entirely desert, except for a large ocean to the north of our position. Along the edge of that ocean, tropical plants grow and the soil is perfect for agriculture. The borders of the ocean are the most habitable place on this planet. In fact, an entire culture has been built around the northern side of the ocean. But you would never be able to get there on foot.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keens arm started to itch and tingle, but he ignored it and kept listening to Eepees description.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp If you think where we are right now is hot, just go to the equator. That region is so hot the sand melts into glass in some areas.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The canyon stretches across 1/7th of the planets surface and provides the only shelter for much wildlife. It is close to the North Pole, while the ocean is right on top of it. The planets two orbiting moons cause tides every two weeks and floods the massive chasm with saltwater. Lucky for the wildlife, there are several caves high above ground that are accessible. Estimated time to the next tide, 35 hours.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Keen groaned. The planet was almost entirely deadly. He had to find the bounty hunter and fast, if he was going to escape the forces of the tide. Eepee was continuing on less important, smaller details so Keen wasnt listening anymore. The only thought on his mind at the moment was, I have to get out of here!<br /><br />----------<br /><br />So there you go. The next part. Now I have to go recharge my brain. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] -Dreamer"
	},
	{
		"id": 13453,
		"title": "Re: Alrighty",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-27T04:16:47.000Z",
		"content": "Ha, very good.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I can imagine the annoying climate. Sunny, hot.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13454,
		"title": "Re: Alrighty",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-27T10:27:52.000Z",
		"content": "....salty, slight chance of death; the usual weather for family vacations.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13455,
		"title": "*Najawa visiting empire state builing*",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-27T11:30:26.000Z",
		"content": "Najawa: Wow, dad, this is awesome!!!<br /><br />Dad: Yep, son, I'm glad you like it. *mutters something about wasted money*<br /><br />Najawa: Dad, can I borrow your laptop, I want to check the PCKF with your nation wide wireless card.<br /><br />Dad: Sure son.<br /><br />Najawa: Hmm... a new reply to \"Uh...\"<br /><br />*Checks it<br /><br />*Jaw drops over edge of empire state building*<br /><br />-----------------------------------------------------------<br />New Reporter: 3 People were killed today when a totally amazed teenager's jaw dropped off the empire state building!<br /><br /><br />Holy Crap; your good!!!<br /><br />-- NAJAWA --"
	}
]
