[
	{
		"id": 1392,
		"title": "TrackMania Nations",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-02-17T16:46:38.000Z",
		"content": "I seem to recall there were some TrackMania fans here, although I can't seem to find any posts about it anymore.<br />Not sure if it's a classis, but it's more or less Stunts again, and that's a classic alright.<br /><br />Anyway, a bit late to be news, but there's a third game in the series now: TrackMania Nations.<br />[url=http://www.trackmanianations.com/]www.trackmanianations.com/[/url]<br />It was made for the Electronic Sports World Cup, a French gaming tournament.<br />Also, it's free, which is nice, but which means there are a bunch of \"real\" banners and things around the tracks.<br />It uses TrackMania Sunrise's engine, but there is only 1 tileset, one gameplay mode, so there's less diversity.<br />Still, it might be fun if you like this kind of gameplay.<br /><br />One note...<br /><br />It includes StarForce as an anti-cracking mechanism, which has a few issues:<br />It installs without asking, but since it's part of the game, sort of, I can forgive that.<br />It doesn't exactly advertise itself, making it sneaky, but of course not nearly sneaky enough for people smart enough to try and crack it, so I don't agree with this.<br />Then it supposedly slows down some CD burners, to the point where they don't even work anymore, although it seems it's simply a very loud minority making it seem like a much bigger deal than it really is.<br />[url=http://www.glop.org/starforce/]www.glop.org/starforce/[/url]<br />I personally don't experience any problems, so I don't have much problems with it, knowing a bunch of other games install it as well, but please do some research (both for and against) if you're scared of it.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 29460,
		"title": "Re: TrackMania Nations",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-02-17T18:42:45.000Z",
		"content": "I refuse to install anything with StarForce, simply because I don't trust the developers with my hardware and access to software.  A quick look through google will show the emails that these people send to sites evaluating their copy-protection; a 13-year old could write better.  Much like the outcry over Sony's audio rootkits, I think there's too much of a risk.<br /><br />In a recent interview, the people making StarForce said that the EULA you agree to indemnifies them of damage; I'm personally of the opinion that 90% of EULA's out there are illegal as is and any software that damages anything should not be indemnified.<br /><br />Possibly just alcohol talking, but there's a fine line between protecting your assets and causing end-users an issue.  If anyone is having serious issues with the software, it should be fixed - full stop.<br /><br />That being said, 99% of people will have zero problems; just be sure to get the StarForce removal tool when you're done with the game.  Dude, drunk - enjoy the $%^# game.Wombat is my little donation to all the crazy people who do stuff with old games.  [url=http://www.szevvy.com]www.szevvy.com[/url]"
	},
	{
		"id": 29461,
		"title": "Re: TrackMania Nations",
		"author_id": 1486865,
		"author_name": "Newspaz",
		"timestamp": "2006-02-17T23:30:30.000Z",
		"content": "I'm playing the game, and being a racing fan, I'm enjoying it.<br /><br />Thanks for the advice though."
	},
	{
		"id": 29462,
		"title": "Bleh.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-02-18T06:59:42.000Z",
		"content": "I was a fan of TrackMania up until I started playing it. It's far from on par with Stunts--although it's certainly an awesome engine and provides some pointless amusement, there's just something missing from the atmosphere. Collision physics is among the most notable features I miss (though I'm uncertain whether Sunrise included this).<br /><br />Despite its flaws, I would have purchased a copy... except as was mentioned it uses Starforce, which is just a pain in the arse. I've decided to boycott the game, even from my 'pirate' list.<br /><br />Wait a second... TMN is freeware... AND contains Starforce? That's completely screwed in the head.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 29463,
		"title": "Re: Bleh.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-03-02T17:19:10.000Z",
		"content": "I never really played Stunts a whole lot, so I can't compare.<br />Of course if I really started playing Stunts now in 2006 it would never make the same impression either.<br />Oh well!<br />TrackMania at least is fun for me.<br /><br />Sunrise doesn't feature collisions between cars either, and although of course I miss this cool feature, I assume the game would become quite a bit less playable by it.<br />Well, of course it would, considering the strange/different way of racing.<br />You wait for the race to start, and then you can race the track as often as you want, resetting/respawning whenever you want if you feel like it, until the time runs out.<br />It wouldn't be fair to others if you could do that and push them of the road as well.<br />It's simply a completely different gameplay philosophy.<br /><br />I was wondering about the free game featuring StarForce as well, but then discovered StarForce works against hacking as well, making it (supposedly) nearly impossible to create hacks and cheats for those games.<br /><br />Like I already said, until I experience any problems (and even then I'd be just another individual), I'll have to assume the people with problems are just a minority.<br />Nadeo (TM developers) gave some numbers on their forum, and (considering they are accurate), most problems are due to people running software used to create CD images for instance in the background, and obviously that won't work, considering SF's whole idea is to make it impossible to do that kind of thing.<br />Anyway, it just seems like a lot of people overreacting, not too dissimular to some of those spoof virus e-mails I get hammered with every now and again.<br /><br />All software can potentially screw up your computer, lots of software has access to more things people would want it to, but that's the way it works.<br />Besides, I'm planning on playing The Prince of Persia: The Two Thrones sooner or later, and that's one of the many (?) other games featuring SF, so I can't stay away from it anyway.<br />(By the way, it seems the \"The Sands of Time\" movie is actually going to be made now... no mentioning of Uwe Boll either! Yay!)<br /><br />As for 90% of the EULAs... it wouldn't completely surprise me.<br />Some United States stuff is completely illogical, and therefore doesn't apply to Europeans, so I'm more or less protected by law from a lot of that silliness.<br /><br />I felt it important enough to mention though, so I did my job. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	}
]
