[
	{
		"id": 795,
		"title": "DVD/VCD Audio Languages",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-10-02T09:05:32.000Z",
		"content": "Hi, i was just wondering, is there like a site where you can download the audio in your language?<br /><br />Most DVD's are in english and or russion/greek etc. So what about the other languages?"
	},
	{
		"id": 20476,
		"title": "Re: DVD/VCD Audio Languages",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-02T12:50:12.000Z",
		"content": "I really doubt that. Getting the audio tracks into another language would require a lot of voice actors (preferably good ones as well so one can actually listen to them) and most likely the original movie files/tapes without the voice tracks so the new voices could be added properly. I really don't think there are such sites.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20477,
		"title": "Re: DVD/VCD Audio Languages",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-02T13:17:49.000Z",
		"content": "Warning: Not the answer you wanted to hear... not really an answer to the question either, just my opinion following! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />There should be quite a few places (I'm not really deeply into this) where you can download (textual) sub titles though.<br />Personally I tend to prefer that... make that WAAAAY prefer that over Dutch dubbing.<br />We're a small country, so there's only about 10 voice actors (there's more, but it doesn't feel like it) doing all the films, cartoons, video games, &amp;c., so it gets annoying to hear 3 characters in 1 film all have the same voice, and hearing him/her again in a completely unrelated cartoon, really quickly.<br /><br />Also, even if I don't understand a single word of say Japanese, a lot would still be lost in translation when dubbed.<br />I'd rather have the English than the Dutch dub, but I'd still rather have subtitles and the original audio track.<br />Voice actors interprate the original actors, and not always well enough.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 20478,
		"title": "Re: DVD/VCD Audio Languages",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-10-02T22:17:43.000Z",
		"content": "I think I'm with you on that. I'd rather have good subtitles in my language with the speech, whether I can understand it or not. I'd rather get everything I can of the real actor's performance.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20479,
		"title": "Re: DVD/VCD Audio Languages",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-03T06:08:38.000Z",
		"content": "Well, I rather have the audio always in the original language, and not dubbed. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I like to have subtitles, but they're not necessary in case the language is English. Although, often subtitles have small errors and don't always cover everything said.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
