[
	{
		"id": 1228,
		"title": "Favorite Music Scores:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-17T17:14:34.000Z",
		"content": "I was just wondering what everybody's favorite music scores are: In Star Wars, there is a very well done classical music score which brings you into the movie, and makes it feel bigger than life; In most modern movies, there is usually pop or rock music in them; In more extream cases, meavy metal is used; In Braveheart, there is a lot of ethnic traditional, or celtic music; and in Lord of the Rings, Peter Jackson does a good job mixing celtic and classical to make a movie so imense, and real.<br /><br />I prefer the last; but you all may think other wise.<br /><br />The voting opens... NOW!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 27083,
		"title": "Re: Favorite Music Scores:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-09-17T17:55:20.000Z",
		"content": "Well, I guess it depends on movie. But mostly I like to hear something fast and good techno or breakbeat stuff.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 27084,
		"title": "Re: Favorite Music Scores:",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-17T21:49:23.000Z",
		"content": "I never understood the use of the word \"ethnic\" in sentences like: \"I like ethnic food.\".<br />What on earth is \"ethnic\" food?<br />Every food is ethnic, every music is ethnic too.<br />I think it's the fault of Americans not knowing the true meaning of the word, and using it for something else, but I'm not sure.<br /><br />I voted for LotR.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 27085,
		"title": "Ethnic:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-17T22:17:20.000Z",
		"content": "Ethnic means it is culteral; ethnic food is food from a certian culters (e.g. We ate ethnic food, native to mexico, for dinner last night [which I did [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] ]).<br /><br />-- NAJAWA --"
	},
	{
		"id": 27086,
		"title": "Re: Favorite Music Scores:",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-09-18T00:48:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I never understood the use of the word \"ethnic\" in sentences like: \"I like ethnic food.\"[hr][/quote]It's like \"foreigner\", it has a different meaning depending on who's saying it.  And like Najawa says, ethnic food just belongs to a specific culture, and usually a foreign culture at that.<br /><br />Pulling out the trusty Wikipedia again, [url=http://en.wikipedia.org/wiki/Ethnic]this idea seems to be correct[/url]."
	},
	{
		"id": 27087,
		"title": "Re: Favorite Music Scores:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-18T01:20:17.000Z",
		"content": "Me likey Rammstein.<br /><br />Go and buy their newest CD now, I command you!<br /><br />Ethnic and forgeiner are interesting little words. They are used as 'great dividers'; words that seperate 'us' and 'them' In this case ethnic food is food from some distant nonspecific place. [Does it matter, its not americian/english/australian, etc]<br /><br />LL: Hello? Is this the ministry of ethnic affairs?<br /><br />MOEA: Yes, how can I help you?<br /><br />LL: I've never had an affair with an ethnic before, how do I go about it?<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 27088,
		"title": "Yeah, uh-huh;",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-18T03:38:24.000Z",
		"content": "I just chose ethnic because otherwise, if I did foriegn, it'd sound like a music score you never heard, and if I said weird, you'd think of you little brother doing his Bach depiction (la-la, be=bop, twing-twirp, ding, bang, crash, *Nuclear Explosion*).<br /><br />BTW - Who voted heavy metal; I just filled that in just in case. LL, and everybody else who missunderstood - This is music scores; as in the music in movies: Soundtrack steriotype.<br /><br />-- NAJAWA --"
	},
	{
		"id": 27089,
		"title": "Foreign ethnics",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-18T17:27:44.000Z",
		"content": "\"Ethnic\" means something like \"Of or relating to a sizable group of people sharing a common and distinctive racial, national, religious, linguistic, or cultural heritage.\" according to the first definition on Dictionary.com.<br />It's synonymous with cultural.<br />In other words, it adds about as much to the word \"food\" as \"edible\" would, since every food comes from one culture or another.<br />Even if it's from your own country, it's ethnic food.<br /><br />\"Foreign\" or \"alien\" works differently.<br />It doesn't sound strange to say \"foreign culture\"; the former part adds to the latter.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 27090,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-09-18T17:58:33.000Z",
		"content": "I find myself attracted to video game music because it's organized a bit differently than other music.  <br /><br />Classical music has no real time limit on the length of their developmental sections, and the amount of concentration and memory required to hear some of the lengthier stuff all the way through is just too exhausting for casual listening (though I do very much prefer Classical music to most modern music)...<br /><br />The kind of music you hear on the radio is usually put together in verse-chorus form, looping a few melodic lines with differing lyrics.  I personally have a very hard time understanding lyrics spoken/sung in songs, so without a lyrics sheet, often these songs sound like very short, very repetitive pieces of video game music.  O_o;;<br /><br />Video game music, while not the most complex stuff ever created, interested me primarily because it was a game company's attempt to communicate a mood or idea using just 4 channels of noise, one of which was interruptable by the character's jumping/attacking sound effects.  It's since evolved into some rather bizarre places, often incorporating the radio music I'm less fond of, but also tying in some of the Classical stuff as well.  It's an interesting mix.  <br /><br />I think my favorite video game soundtrack albums at this pont in time are Phantom Brave, Breath of Fire: Dragon Quarter, and Katamari Damacy.  A lot of the best (in my opinion) video game soundtracks came out in the early 90's, with the Super Nintendo.  Secret of Mana, Super Mario RPG, Kirby Super Star, and Super Metroid all had pieces of music in them which I still catch myself humming, years later.  :-)[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 27091,
		"title": "Video Game Music:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-19T01:10:17.000Z",
		"content": "Ah... Video game music; I love composing, and Video game music is what I like to compose most.<br /><br />-- NAJAWA --"
	},
	{
		"id": 27092,
		"title": "Re: Video Game Music:",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-09-20T18:58:41.000Z",
		"content": "Favourite scores... well, for movie scores, I'll name some artists:<br /><br />Michael Giacchino (The Incredibles)<br />Thomas Newman (Finding Nemo)<br />Danny Elfman (Beetlejuice, Men in Black, Spiderman)<br />Paul Buckmaster (12 Monkeys)<br />John Williams (Do you have to ask?)<br /><br />I also liked the musical score for the TV show Firefly.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 27093,
		"title": "*A moment of honor*",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-21T01:37:17.000Z",
		"content": "Let us pause to consider the great legacy of John Williams...<br /><br />*Taps*<br /><br />\"Shhh!!! cut the crap, something more lively (he's not dead)\"<br /><br />*Star Wars Main Theme*<br /><br />\"Ah, better\"<br /><br />John Williams made all the Star Wars music, Harry Potter, and many, amany more soundtracks; he is a musical genius.<br /><br />-- NAJAWA --"
	},
	{
		"id": 27094,
		"title": "Re: Favorite Music Scores:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-21T11:20:47.000Z",
		"content": "I guess it all depends on the movie. I wouldn't hear thrash metal in a fantasy movie. Or classic music in a hard action film.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 27095,
		"title": "Hmm... very good.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-21T22:42:40.000Z",
		"content": "Djaser has a very good point. I guess it all depends on the movie; but if you were to buy a soundtrack; what genre would it be?<br /><br />-- NAJAWA --"
	},
	{
		"id": 27096,
		"title": "Soundtracks:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-25T23:27:39.000Z",
		"content": "Spealing of Lord of the Rings music; I just got The Two Towers, and Return of the King soundtracks, and I'll be getting The Fellowship of the Ring's really soon!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Howard Shore (The composer) is one musical genuis!!!<br /><br />I listen to them when I work on my Lord of the Rings mod.<br /><br />-- NAJAWA --"
	}
]
