[
	{
		"id": 491,
		"title": "Did anyone notice this?",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-08-15T13:55:39.000Z",
		"content": "Keen's blast marks move around... I'll show you what I mean...<br /><br />[img]http://dosclassics.com/keen/k4.gif[/img]<br /><br />[img]http://dosclassics.com/keen/k5.gif[/img]<br /><br />[img]http://dosclassics.com/keen/k6.gif[/img]<br /><br />The images don't change, but where the blast marks are placed changes in different title screens. For example, one of the blast marks isn't placed right in Keen 6, but it wasn't even there in Keen 4. Another example is that there is a blast mark in Keen 5 that doesn't appear in Keens 4 and 6.<br /><br /><b>EDIT:</b> I have also noticed that Keen's helmet constantly changes in the title screen. for example, there is a bump on Keen's helmet in Keen 5 that doesn't appear in Keens 4 and 6.<font color=\"BLUE\">A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13608,
		"title": "Re: Did anyone notice this?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-15T15:29:47.000Z",
		"content": "Yeah, never noticed it.<br />Also Keen is wearing a shirt that says goodbye galaxy. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br /><br />Also notice that someone is playing paddle war in keen 6. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 13609,
		"title": "Re: Did anyone notice this?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-15T17:26:20.000Z",
		"content": "Yeah, I've noticed that.. It can be because of two reasons (or perhaps more):<br />1. Keen fixes the helmet for example during the space trips, and the different blast marks and stuff is because of different adventures. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />2. Artistic reasons (in other words; what looks good in the picture).[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13610,
		"title": "Re: Did anyone notice this?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-08-15T17:34:03.000Z",
		"content": "Well, I noticed some inconsistancies, but I didn't spend that much time on thinking about them.<br /><br />There seem to be 2 main blast marks on Keen's (I know it's really his brother's) helmet, at least on the side we can see.<br />There is a bigger one and a smaller one, and both are on every picture.<br />However in Ep 6 he seems to have gained a new one, which makes sense after all his adventuring.<br />There's also a new one relatively close to his face in Ep 5, which is gone again in Ep 6, which is a bit strange.<br />Ep 5 was made after 6, and the chronological order of the stories was originally going to be like that as well.<br />Of course then there's the other mark which isn't explained, so... maybe Billy cleaned up his helmet, and got bored really soon, like any good 8 year old. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />If he got hit on the helmet around the time the Ep 6 picture was taken, the dent configuration seems to be in relative order.<br />If you make a new dent, you can out-dent previous dents with it... if that makes any sense; I'm not a native English speaker.<br />I'm thinking about the big one in front right now.<br />There's 1 big dent on the apogee of the helmet in Ep 5 though, which I don't see in any of the other images.<br /><br />OK, now I can say I spent some time. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 13611,
		"title": "Re: Did anyone notice this?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-15T20:08:18.000Z",
		"content": "It looks as if the two front dents just fused by episode 6.<br /><br />It's also funny how his helmet has not damage to it in the game itself. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 13612,
		"title": "Re: Did anyone notice this?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-08-16T12:37:12.000Z",
		"content": "1.) ....<br /><br />Keens bro: Aww man! Who screwed up my helmet?! It took me hours to polish this!<br />...<br />...<br />...<br />Aww well, where'd I put my plastadent?<br /><br />2.) ....<br /><br />Keen: Wow, thats really dented! I'd better fix it before he notices.<br /><br />*Zaps with stunner to zap dent out*<br /><br />Keen: Hmm, that made it worse.. how about...<br /><br />*Tries to knock dents out by hitting inside of helmet with sledge hammer*<br /><br />Keen: What? I'm only 8 you know? It seemed like a good idea. Ah to hell with it, I'll but a new one on Ebay.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
