[
	{
		"id": 201,
		"title": "Commander Keen in: The Tantalus Wars",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-06T20:23:36.000Z",
		"content": "<b>NOTE (11/12/06): the new engine will be programmed in C++ (Dev C++), and I'm looking into programming graphics in either DirectX or OpenGL, depending on which one is easier for me to learn.  So yes, this won't be coming out anytime soon.</b><br /><br />Well, here's the new thread for my project.  I created a new thread because I have a title, and a story which I want to be viewed *first* and not some programming problems.<br /><br />From the previous thread:<br /><b>MortimerInBlack: Yes, I could use some programming help in GM.  Do you haev a YIM, AIM, or MSN handle?</b><br /><br />Here are two screen shots (These aren't from the game, but concepts for tiles), <b>so if you were wondering what the \"3D graphics\" meant, here it is, but be forewarned that the GIF extension takes away a lot of colours.)</b><br /><br />[img]http://www.geocities.com/globox88/ConceptScreen0.gif[/img]<br />[img]http://www.geocities.com/globox88/ConceptScreen0.gif[/img]<br /><br />[img]http://www.geocities.com/globox88/ConceptScreen1.gif[/img]<br />[img]http://www.geocities.com/globox88/ConceptScreen1.gif[/img]<br /><br />Commander Keen in: The Tantalus Wars<br /><br />The Story:<br /><br />One brown-haired boy lay upon his bed.  He wore pink bunny slippers, sky-blue pajamas, and patches of freckles.  He was nine years old.  He woke from his sleep by the sounds of his mother.<br /><br />\"Billy, get up now.\" yelled a voice from downstairs.<br /><br />Billy grumbled and rolled over.<br /><br />*Knock* *Knock*<br /><br />Billy's mother came into the room and yelled some more.  Billy yawned and assured her that he was up.  He sat in bed for a moment thinking.  He had just come back from the Altair sector last night, after going on a \"week long vacation with Bobby Stone.\" --or so he told his parents.  Ever since the defeat of Mortimer, the galaxy had exploded into war.  The power vacuum left by Mortimer after his demise led every space-traveling race into a conquest for an galactic empire.<br /><br />Billy had joined the Vorticon's attack on the Altair system because it made a plentiful supply route for Vorticon Destroyers and Motherships.  The Vorticons intended to keep peace in the galaxy; however, the Great Races, consisting of the Shikadi, Fleex, and Regelatins, made this a difficult objective.<br /><br />Last night, the Vorticons also said their fleet had finally reached Korath III --the mainbase of the Shakadi.  If the Shikadi could be subjugated, then one third of the Great Races fleet will be decimated.  Unfortunetely, the Vorticons had no use for a single fighter ship, and said that the would need Keen for other missions.<br /><br />Billy stretched, rubbed his eyes, and got dressed.  Billy hopped downstairs, awaiting breakfast.<br /><br />\"Billy, you're going to need to feed that green thing of yours.  It keeps on coming in here and poking me with its eye.\" said Billy's mom.<br /><br />Billy sighed.  He got up from his bowl of Sugar Stoopies; grabbed the dog food and walked out to his club house.  As soon as he was out the door, Spot was smacking him with his eye.<br /><br />\"Son of a... What's gotten into you, Spot? Billy asked.<br /><br />Spot tapped Billy's back pushing him into the Club House.  The Photacyn Transceiver was buzzing like mad.  Billy turned it on.<br /><br />*Click*<br /><br />\"Keen... Attack... *bzz* Vorticon VI... They're here!  *bzz* Captain Keen, we *bzz* your help!  Come to Vorticon VI!  The Fleex have sent a Shakadi cloak-ship over Vorticon VI!\"<br /><br />*Fades out*<br /><br />\"Damn.\"<br /><br />He flew back into the house and up the stairs.  He donned his brother helmet, snagged the Vorticon Hyper Pistol, and become Commander Keen: Defender of the Universe!<br /><br />He ran backstairs, and leaped into the Bean-With-Bacon Megarocket.<br /><br /><br />He headed off to Vorticon VI and his next big adventure.<br /><br />[End]~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4764,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-09-06T20:27:23.000Z",
		"content": "First to post WOW [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] .----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 4765,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-09-06T21:20:05.000Z",
		"content": "It looks really good! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  The story seems interesting as well.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 4766,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-09-07T05:43:16.000Z",
		"content": "I sent u a PM mail, Globbox- .... . &lt;&gt; ..- -. .. ...- . .-. ... . &lt;&gt; .. ... &lt;&gt; - --- .- ... -"
	},
	{
		"id": 4767,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-07T18:51:47.000Z",
		"content": "KeenRush -thanks.<br /><br />Mort --Okay, I'll check it out.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>LL:</b><br /><br />You're a bastard Glo, you really are. <br />[hr][/quote]<br /><br />But atleast I'm not a Kiwi.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4768,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-09-08T23:04:47.000Z",
		"content": "sounds good.<br /><br />so are those tiles the keen3 equivelents to be replaced later, or are they the actual tiles?<br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 4769,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-09T03:29:54.000Z",
		"content": "I didn't know the Shikadai came from Korath, I thought they simply had a base there, after all, the Korathians arrested them when their ship was parked there.<br /><br />Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 4770,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-09-09T03:41:11.000Z",
		"content": "That's true, plus it's Korath III as well [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 4771,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-09T13:34:09.000Z",
		"content": "yorp --all the graphics in there are original.  They may look similar to the ones in K3, but they aren't the same pictures (Which is intentional, because it does take place on Vorticon VI).<br /><br />LL- Actually, there never was a distinction in the plot.  It merely said that Korath III was the building place of their device.  I have always assumed this to mean that it was their home world, and that they co-inhabited Korath III with the Scotties.<br /><br />I do, however, recognise that this could be entirely inaccurate, but I still prefer my interpretation of the Keen plot.<br /><br /><br />Malv --I believe I said \"the Korath system\" and not just \"Korath\", but I'll check that out. EDIT: Nope, you were right.  Thanks, I edited it.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4772,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-09-10T01:06:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] I have always assumed this to mean that it was their home world,[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]with the quantum explosion dynamo in ruins, the shikadi rush to their getaway ship and hightail it back to their own galaxy.[hr][/quote]<br /><br />They weren't even from this galaxy, so how could their home planet be korath3? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 4773,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-10T01:07:08.000Z",
		"content": "I dunno; I always imagined the Shikadai homeworld to be as electric and transparent as they are, perhaps not a world at all but a giant cloud of static charge.Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 4774,
		"title": "Re: Commander Keen in: The Tantalus Wars",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-10T01:29:16.000Z",
		"content": "Ah, so it seems I'm wrong.  Well, we'll edit that part.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4775,
		"title": "nice",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-09-10T01:37:22.000Z",
		"content": "Looks good--the mountains are definitely improved from the first shots you showed me.  At this point, I'd say be careful with your use of the color black, especially since the green grass in the background shares so many colors with the green grass along the platforms Keen can stand on--the visual similarity might cause an unfair death or two, if that illusion holds up under stress.<br /><br />Also, you may need to tweak the way the buildings work, because I can't imagine an entire living space constructed to be as shallow as the platforms you've constructed.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  We'd better see the sides of them extending into the background or something!"
	},
	{
		"id": 4776,
		"title": "Re: nice",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-10T14:22:33.000Z",
		"content": "Actually, that may look very cool.  I'll experiment with it, thanks Xky.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4777,
		"title": "Re: nice",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-09-30T00:18:07.000Z",
		"content": "<b>UPDATE:</b><br /><br />I haven't been working on this project at all the last month, however, I'd like to say that I'm probably not going to be quiting.<br /><br />My main problem is that computer programming is perhaps the stupidest waste of time possible, but unfortunetely a necessity.<br /><br />I'm really dreading going over my codes for the 40,000+ time, so I'm going to probably script myself a second code... That source code is just fucked to high hell.<br /><br /><br />(Meaning I'll release it for someone else's study)<br /><br />EDIT: Although I have done a few new graphics, but nothing like it was during the first few months.  This will be a slow paced project, given that I'm damned horrible with GML.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4778,
		"title": "Re: nice",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-01T10:57:14.000Z",
		"content": "<i>My main problem is that computer programming is perhaps the stupidest waste of time possible</i><br /><br />Only if you don't do it right [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br /><i>I'm really dreading going over my codes for the 40,000+ time</i><br /><br />That's why you plan ahead and do it right the first time [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 4779,
		"title": "Re: nice",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-10-01T16:44:23.000Z",
		"content": "Yeah, Malv, I'm certain you are spot on every time with your codes.<br /><br />*rolls eyes*~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4780,
		"title": "Re: nice",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-01T21:50:01.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]"
	},
	{
		"id": 4781,
		"title": "Re: nice",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-02T19:38:08.000Z",
		"content": "Hey, make a good plan, perhaps a scheme, in which you keep everything in account, and coding something difficult should become a bit easier... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 4782,
		"title": "agreed",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-10-02T19:52:30.000Z",
		"content": "I always thought using the computer systems we got my Senior year of High School in the animation class was tough--but then I tried making a tutorial for future students, detailing how to use it... THAT was hard.  I had to go back and start from scratch because I didn't plan ahead well enough.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  Having a good plan is CRUCIAL."
	},
	{
		"id": 4783,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-12T18:20:13.000Z",
		"content": "Well, I think this project may work.<br /><br />I'm still working on it four months after it started, which is longer than any other rendition, therefore I think after I get over some problems, like programming, this may get off the ground.<br /><br /><br />So, what's happening with this project you ask?<br /><br />Well, I'm teaching myself C++.  GM is just such a horrible program for stuff like this, and I really am just trying for the best on this project.  Plus I'm going to need to learn C++ anyways, because I want to make a few games in my later life.<br /><br /><br />With that said, today I finished teaching myself all of the Newtonian mechanics of the AP physics C test --so for those of you foriegners who don't know much about the AP program, it basically means I have Sophmore college level knowledge of solid mechanical physics (From translational motion, rotational motion, gravitational motion, and SHM motion applied upto single-variable calculus).<br /><br />Also, I'm still slowly plugging away at graphics (though I've only started that up again recently), and from what I'm seeing --well, expect some really sweet graphics from this game.  It's honestly 100 times better than anything I did on the previous graphics release I had.  I'm 2D texture god.  =P<br /><br /><br />Anyways, for anyone who's mildly interested in the project, that's what's up with it.  It's not in the scrap bin yet!~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4784,
		"title": "Re: agreed",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-11-12T22:41:47.000Z",
		"content": "I wish you luck learning either OpenGL or DirectX, Globox - whilst I'm sure you could master either with less than the amount of work and brainpower you've put in (Newtonian physics = eep, from what little I've failed to grasp) the learning processes for both are fairly mind-bending.<br /><br />Since DirectX and OpenGL are both fairly similar in terms of how you code for them, I suggest learning DirectX; it's generally faster and more reliable than OpenGL (although I have no concrete evidence to prove either - any input on this, Malvineous?). You'll probably have better luck finding tutorials, docs and examples for DirectX too.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 4785,
		"title": "Re: agreed",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-12T23:20:41.000Z",
		"content": "I've briefly tried programming for both OpenGL and DirectX (albeit in the days of DirectX 6), and OpenGL is *much* easier to get started with, by a mile (or it was back then, anyway.)<br /><br />DirectX is heavily object oriented, so you'll need to know C++ well enough that you fully understand classes, objects, pointers, instances, multiple inheritance, etc, etc.  OpenGL on the other hand isn't object oriented at all, so you can use it in straight C programs, no knowledge of classes required.<br /><br />Of course I'd also recommend OpenGL because it's cross-platform, but if you're only going to write a Windows version anyway then DirectX does also handle sound (and 3D sound at that), keyboard/mouse/whatever input, network multiplayer, etc. all within the same framework, whereas OpenGL is 3D graphics only.<br /><br />There doesn't seem to be any shortage of tutorials for either option though, so have a look at a few and see what you think is more suitable.  At the time I tried the DirectX stuff I knew C pretty well, but I was new to C++ so I only had a basic knowledge of classes - and I had to give up, because it was way too complicated for me back then [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 4786,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-13T02:21:57.000Z",
		"content": "Some of the later stuff in the C++ tutorial on Cprogramming.com are ridiculously difficult.<br /><br />If anyone woudl be willing to give me some time on how top understand these later (like, linked lists, command line arguments, inline functions, binary trees --these things just make my head spin!), I'd be forever indebted to you.  Well, if I can figure out some more moderately advanced programming, I think it should be enough for me to use Open_GL or DirectX.  But I'll look both over quite a significantly before I make up my mind.<br /><br /><br />And, nah, the physics is the easy part for me.  Implementing it in an effectual manner is the hard part.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4787,
		"title": "Re: agreed",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-11-13T06:39:19.000Z",
		"content": "I'm not an expert, but I can certainly shed some light on the topics you mention if you need it.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 4788,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-16T01:43:59.000Z",
		"content": "That's cool.  Anyone else who'd like to help would be awesome.  I won't get to learning more programming until this weekend.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4789,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-17T02:57:36.000Z",
		"content": "Well, I think it's finally time to give some news on this game.<br /><br /><b>Animation and models:</b> Graphics have come along so far.  I've got a complete backdrop (I think I'll do three more), I've completed all enemy sprites, and other huge amount of sprites, and I've done HUGE amounts of tiles (Last I counted, all told I have around 400 individual images).  Isloap said they all looked awesome, so that's good enough for me.<br /><br />I'd like to say that I'm really proud of the graphics I've done on this game.  The graphics on the front page of this thread are nothing to what I have now.  All are completely isometric; my control over texture is pretty amazing --especially compared to the stuff on LL's Dev art account.<br /><br /><b>Sound/Music:</b> Yeah, still the same as far as this goes.<br /><br /><b>Programming:</b> This is really killing me.  I just started Windows API programming, after learning a whole lotta stuff about matrices and some pre-linear algebra stuff.  I'm in calc II now, so as far as math goes, I can do the math very well.  Making good algorithms, however, is a really difficult thing.  I've gotten a book on programming with PNG's, too, which I hope to read a little more into, as I hope to implement them over bitmaps or gifs.<br /><br />One of the main problems with this game is that I'm starting afresh with programming (And many thanks to Z-1 for his help), and C++ is hard enough to master, let along adding DirectX to the mix (Which I haven't even started yet, but I've decided on using the DirectX 7.0 SDK).<br /><br />Which, btw, does anyone know what \"Developer Studio\" is?  My book talks about it, but has given no indication as to what it is, nor any download for it.  Could someone help me here?<br /><br />My conceptual ideas for the structure of the program are pretty solid, I think.  I've got a good hold over basic C++ things now, like pointers I get a bit, and classes I've completely got conceptually, but I'm look for a good script that does inheritence so I can master the synta of it.<br /><br /><br />So, seven months of hard work, I've jumped around 8 times over which language I'll be writing it in (Started out in GML, then to DevCpp/DX9, then to Visual C++... Yeah, long story short, I'm using DevCpp and DirectX 7), but this is still going strong thus far.  I hope to learn programming better, and given some more help, I may be able to impliment it better.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4790,
		"title": "Re: agreed",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-17T07:33:53.000Z",
		"content": "I think \"Developer Studio\" is Microsoft's generic IDE - IIRC they changed its name to \"Visual Studio\" some years back.<br /><br />As far as PNGs go, you might want to try the ImageMagick library instead - it makes using images *much* simpler than accessing the raw file data directly, and allows you to use a ton of different file formats too."
	},
	{
		"id": 4791,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-17T14:14:41.000Z",
		"content": "Thanks!<br /><br />Well, after further research, my programming tutorial is supposed to be geared towards 3D graphics, but it goes through all 2D graphics first --which has been great so far for me; however, does anyone know a way to manipulate graphics without using that program (It's 3D centered, I believe, so it is superflous for me to learn how to do it)?<br /><br />Does that ImageMagick library allow me to create the resource headers I need?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4792,
		"title": "Re: agreed",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-17T22:43:59.000Z",
		"content": "If you're referring to Developer Studio then maybe it's some other program, DevStudio is just an IDE (basically a glorified text editor that makes it easy to program, compile and debug programs.)  The only image-related functions in an IDE are in some of the fancier ones where they allow you to draw icons for your program in them.<br /><br />I'm not sure what you mean by \"resource headers\" - ImageMagick simply loads images from disk and stores the image data in memory (at runtime.)  It's up to you to do something with that image data.  It can do basic manipulation (resizing, mirroring, etc.) and can of course save the modified image back to disk, but the idea is that it gives you access to the raw pixels in the image and then gets out of the way.<br /><br />I'll be using it in my game editor for importing images (say if you want to import a .png file over the top of the Cosmo title screen, the .png file will be read in using ImageMagick) and likewise when you export an image ImageMagick is used to create the file on disk (eventually in either .png or .tiff format, but to change formats it's only one function call to the ImageMagick library.)"
	},
	{
		"id": 4793,
		"title": "Re: agreed",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-18T21:44:11.000Z",
		"content": "I'm a little confused right now... What program/library allows me to store into direct memory into the RAM and then display graphics on a monitor?  I thought that was DirectDraw/Direct3D.<br /><br />I'm, right now, just looking for something that'll let me display my graphics in a full screen.  I can manipulate everything past that.  And after that, I'd like something that manipulates sound/music.<br /><br /><br />Bleh, I want to can this project so bad... I fucking hate programming.  I need someone to give me major help, or I may just can this whole damn thing --I have no fucking clue what I'm doing, and there's not a fuck load of help out there.  So, I guess, I need someone to spent a lot of fucking hours with me programming; or this project isn't coming out this century.<br /><br />Can anyone open-source some old project that could help me out?  Give me codes that show inheritence?  Explain what the hell programs I *actually* need to display graphics (That's not Allegro)?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4794,
		"title": "Re: agreed",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-18T22:28:22.000Z",
		"content": "If you're finding that you're not enjoying programming then you really should take a break and start off with something much simpler - you have to learn to walk before you can run cross country [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />DirectDraw and Direct3D will display images that you've *already* loaded into memory on-screen, but you still have to get the images into memory first.  ImageMagick or other libraries will load the data from common image formats (like .png), then you pass that data to say Direct3D and tell it to create a texture using that image data, then you tell Direct3D to draw that texture onto the screen.<br /><br />If you're finding this frustrating I really think it would be a bad idea to proceed with DirectX.  Have a search for NeHe's OpenGL tutorials, they're what I used to get started with OpenGL programming and they're a great starting point for your own programs (e.g. the texture mapping tutorial loads an image from a .bmp file by hand, then displays that image on a rotating cube.)  \"Programming\" the cube is really simple, so you can start changing it to other shapes to learn how things work."
	},
	{
		"id": 4795,
		"title": "A song I know all too well.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-03-19T00:15:10.000Z",
		"content": "Programming, like any other artform, takes a lot of practise. Putting all your focus on one major project is a recipe for frustration, in my experience. If you really want to understand something, create an experimental side project that does <i>only</i> that. Then make another one that does something interesting. By then it should be a lot simpler to include it into an existing program with a lot of other stuff happening at the same time.<br /><br />There's a directory on my HDD called Coding Exercises, where I've created programs that helped me understand linked lists, zlib (for importing data from zip files), bitmap fonts, and various other techniques, which did my head in when I tried learning them through larger projects.<br /><br />My preference at the moment leans toward C (with some slight hybridisation of C++) and Allegro, using Dev-C++/MinGW, so I wouldn't be of much help to your situation. But feel free to pester me on MSN and I'll offer you whatever help I can, assuming I'm not too busy at the time.<br /><br />I expect pure C++ would require a lot more practise, and DirectX definitely much more so since, when compiled on Windows, Allegro basically acts as a simplified wrapper for DX.<br /><br />Good luck."
	},
	{
		"id": 4796,
		"title": "Re: A song I know all too well.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-22T19:57:00.000Z",
		"content": "C++ isn't really hard hard hard, but now that I'm starting to get it a lot more, I'm just struggling.<br /><br />I haven't touched my tutorial for like, a week.  I need some time off, but the problem is that this is the libraries book. =P<br /><br />Well, I'll try to glean what I can off of it, then move onto different tutorials.<br /><br />The thing that pisses me off is it just feels like I'm jumping around, but getting absolutely nothing done.  And it was, and still is I suppose, pissing me off.<br /><br /><br />It wouldn't be so bad learning all of this bullshit, but trying to learn all this bullshit without any tutorials worth a shit, using a different compiler than DX book, still having a few problems finding good scripts to glean off of.... Bleh, it's just enough to make me want to kick the shit out of someone.<br /><br /><br /><br />I guess I just want someone to say: \"Okay, dumb fuck, do this, then this, then this.  That does this, this, and this.\"  But no tutorial does that; I'm getting half information here, quarter there, and trying to find where the hell the missing quarter of information is.<br /><br /><br />PS: Could someone tell me how in the fuck you get assembly coding working for DevC++?  it's something like __assembly() with some stuff on the inside, but DevC++'s page on it is down (Yes, my damn luck), and I need it to progress in my book.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4797,
		"title": "Re: A song I know all too well.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-03-22T21:36:43.000Z",
		"content": "Google sez: [url=http://www.bloodshed.net/dev/faq.html#asm]this[/url] for how to include the assembly in Dev-C++ code, and [url=http://web.archive.org/web/20040218143002/http://www.c-for-dummies.com/compilers/djgpp_asm.html]this[/url] for the assembly syntax (which is apparently \"AT&amp;T syntax\", so Google that if you need any more advice)."
	},
	{
		"id": 4798,
		"title": "Re: A song I know all too well.",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-03-23T05:02:02.000Z",
		"content": "Is there any particular reason you're including assembly language? Learning C++ and DirectX and ImageMagick sounds like enough stuff for one person.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 4799,
		"title": "Re: A song I know all too well.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-23T19:03:25.000Z",
		"content": "Well, unfortunately my tutorial says that I need to use some assembly sparingly for certian things so that I can manage program speed and memory.  Nothing huge; just basic registers and stuff.<br /><br /><br /><br />But yes, you'd think that learning a whole bunch of bullshit would be enough; but that's what seperates people who make their games and people who don't.  So, for now I just learn and bitch on.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4800,
		"title": "Re: A song I know all too well.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-23T19:20:17.000Z",
		"content": "And btw, which program works out alpha channels?<br /><br />And am I going to need a program to load my music and sounds into memory?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4801,
		"title": "Re: A song I know all too well.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-24T01:40:33.000Z",
		"content": "I wouldn't bother using assembly at the moment - it's often not worth doing any optimisation until you're sure the code works, so gaining a few FPS here and there during development isn't usually worth the frustration.<br /><br />I'm not sure what you mean by \"programs\" to use alpha channels (Paint Shop Pro and GIMP are two programs that let you work with alpha channels) but if you're talking about your own code then I'm sure ImageMagick can provide you with an image's alphamap in a useful format.<br /><br />You will also probably need code to load sounds and music into memory, and in the case of DirectX that's not enough, because DirectX will only play sounds loaded into DX \"buffers\" (which can then be hardware accelerated in the case of the SBLive range) so you'll need to load sounds into memory, then put the ones you're using at the time into buffers (and unload the ones you're not using as there are limited buffers available) and then tell DirectX when to play which buffer, etc, etc.  Did I mention DirectX was hard??? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />And of course with music, you'll probably need to write a music player as well, because aside from the custom DirectMusic format DirectX only plays sounds, so you'll need to synthesise the music yourself and hand it over to DX as a single continuous sound permanently occupying one of those buffers.<br /><br />I guess now you can see why so many fangames are created in point-and-click game creation programs, and why many game companies buy other companies' game engines to save developing their own [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 4802,
		"title": "Re: A song I know all too well.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-24T04:33:50.000Z",
		"content": "Well, after mulling over my options, I've finally decided to re-start the program in GameMaker.<br /><br />GameMaker7 has fixed a few of the problems I was having (specifically, it now allows for custumozed alpha channels).<br /><br />Now, I'm thinking of a way to fix my collision checking problems; I've got a code:<br /><br />Step function (Each time GM re-draws the screen, it does this[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]<br />Velocity_Y += Grav //Re-adjusts Velocity for gravitational acceleration<br /><br />if place_free(x,y+Velocity_Y) //If no object lies in the distance to be covered<br />{<br />   y = Velocity_Y //Then, go that distance<br />}<br /><br />if !place_free(x,y+Velocity_Y) &amp;&amp; !(Velocity_Y = 0) //If something does lie between<br />{<br />   Y_Buffer = Velocity_Y //Create a buffer to test where it is<br />       do<br />       {<br />       Y_Buffer -= 1 //Take one pixel away from the max distance<br />       }<br />       until (!place_free(x,y+Y_Buffer)) //Until that distance triggers this switch<br />   y += Y_Buffer //Add that distance the displacement<br />   Velocity_Y = 0 //Since it is now on the ground, stop speeding<br />}<br />[hr][/quote]<br /><br />However, it creates an infinite loop, and honestly don't know why.  So, I'll be looking over this problem for the next few days/weeks (lol).  Until next time, kids...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4803,
		"title": "Re: A song I know all too well.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-03-25T01:15:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]if !place_free(x,y+Velocity_Y) &amp;&amp; <b>!(Velocity_Y = 0)</b> //If something does lie between[hr][/quote]It might be because you're setting Velocity_Y to zero every time !place_free(x,y+Velocity_Y) is true. If so, I suggest you get some sleep [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] [url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 4804,
		"title": "Re: A song I know all too well.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-25T13:48:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It might be because you're setting Velocity_Y to zero every time !place_free(x,y+Velocity_Y) is true. If so, I suggest you get some sleep[hr][/quote]<br /><br />Well, that might make sense, but its still doing some odd stuff in my GM compiler.  Still, it should only repeat this text part every screen draw, not jump back to that loop  (And becides, that says \"When Velocity_Y does not equal zero\").~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4805,
		"title": "==",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-03-25T14:20:42.000Z",
		"content": "I believe what he's getting at is you're using the single equals sign, setting the value to zero every time, instead of a double for testing equality.<br /><br />Hmm... but wouldn't that return TRUE, thus resulting in !(TRUE), ie. FALSE, and skip the cycle anyway? Game Maker syntax looks slightly confusing."
	},
	{
		"id": 4806,
		"title": "Re: ==",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-25T15:48:18.000Z",
		"content": "Yeah, I think I have a sign wrong some where, or else this type of script just doesn't work in GML.<br /><br />Well, GML is a bit of an odd language, but I think I did that \"not equal to\" part wrong.<br /><br />EDIT: Nevermind, I got it workin'.  Now, I have no idea if this'll work all the time, but altleast I've got a workable collision system into place, so I can now play around with some physics (Well, I had some physics before, but very limited).  =P~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4807,
		"title": "Re: ==",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-27T20:09:09.000Z",
		"content": "Well, I'd also like to announce that my game is going to have even more neat features than I announced last time.  So, I'm adding some other interesting things to my game other than the Newtonian Physics engine, isometric graphics, and *hopefully* advanced AI.  But, you'll have to wait a while until I get release my demo.  *sigh* But I'm counting my chickens before they hatch, so I digress.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4808,
		"title": "aaa",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2007-03-28T19:08:44.000Z",
		"content": "Very nice to hear that!"
	},
	{
		"id": 4809,
		"title": "grapics library",
		"author_id": 1485674,
		"author_name": "Dimacus",
		"timestamp": "2007-03-29T09:31:21.000Z",
		"content": "If you are haveing a hard time using DirectX you can always try SDL ([url=http://www.libsdl.org).]www.libsdl.org).[/url]<br />It's fairly simple to use, it's portable and quiet powerfull.<br />I have used it myself for a couple of projects, so if you need any help with it, feel free to ask.<br /><br />Anyway, good luck with this project!"
	},
	{
		"id": 4810,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-29T20:23:00.000Z",
		"content": "Well, great news today: I completed my collisions engine with 0 bugs.<br /><br />So, GameMaker is officially the new engine for Commander Keen in: Tantalus Wars.<br /><br /><br />Dimacus --I intend to finish out what I've learned in the past few months for C++/DX/whatever else.  I'd like to go a lot slower than I had intended with this project.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4811,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-04-01T03:00:48.000Z",
		"content": "This was taken off of my engine this evening (So yes, this actually counts as a REAL, lol, in-game screenshot):<br /><br />[img]http://img299.imageshack.us/my.php?image=screenshot1am2.png[/img]~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4812,
		"title": "Re: grapics library",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-04-01T22:21:52.000Z",
		"content": "The text looks too fancy.<br />Everything else is nice, though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 4813,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-04-15T18:41:32.000Z",
		"content": "Actually, I like the text that way.  It fits with the rest of my graphics.<br /><br />You'll see. =P~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4814,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-04-28T17:37:59.000Z",
		"content": "Hmm... Well, I suppose an update wouldn't kill.  One thing I love about this project is that ideas are never short, so I'm always thinking out one new aspect of the over all engine, or a \"wouldn't it be neat if I...\" type of things.  This is a really cool project.<br /><br />As for updates:<br />All right, collision programming has been completed with 100% satisfaction.  Dynamics programming is all most all done, but friction is giving me a little trouble.  I'm sure I just made a dumb error.<br /><br />Anyways, next comes incline planes (Which I think I know how to work very easily, I'm hoping this idea will work) and that finishes the physics needed for a quick demo.  I've been compiling graphics to get uploaded into my GML file...  Then, I do a lot of other engine programming, like AI and the Keen engine (shouldn't be hard to convert current engine).  Then I do level design and uploading all my graphics.... Should be interesting.<br /><br />Also, I have a working Menu level.<br /><br />I dunno when a demo will come out, but my target date is over the summer.  I doubt June, but maybe July (Heh, it'll be a year then since I started this project!).~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4815,
		"title": "Re: grapics library",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-28T21:40:08.000Z",
		"content": "Ah ha, so you are switching back to GM. In that case I am willing to help u. Are u still trying to do a physics engine?<br />BTW I signed up to the Barricades, made a bunch of posts, then realized that no1 had posted since like 4 months [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  lol it's not dead is it?\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\" No one in the room had any immediate comment."
	},
	{
		"id": 4816,
		"title": "Re: grapics library",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-29T02:45:00.000Z",
		"content": "nah, its not dead, its just not very alive... people still post on it (including me), just not very often...<br /><br />btw. the game looks great, cant wait for it... as for mine, i had to stop because school was getting in the way. too many projects at one time. sorry, maybe i'll get back to it later (i hope)inverted"
	},
	{
		"id": 4817,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-04-30T18:51:51.000Z",
		"content": "Did it move or something?  I thought graphix had eliminated its existence months ago.   Link please?<br /><br />Yeah, I'd love to work on The Barricades, so long as I can find a link that'll work, lol.<br /><br />EDIT: Nevermind, I got a link.  Holy hell, I guess Graphics just didn't pay his cable bill or something. =P<br /><br />Either way, the forum is back up, so come back for help and anything else you need. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4818,
		"title": "Re: grapics library",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-04-30T19:54:17.000Z",
		"content": "Firstly, it's been up for ages - it was down a while ago, but it came back up about two months ago. Secondly, why do you spell my name differently (not to mention wrong) each time you mention it? It's confusing :P[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 4819,
		"title": "Re: grapics library",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-04-30T20:14:14.000Z",
		"content": "My bad man, I keep on forgetting to put the x at the end. =P<br /><br /><br />Anyways, great news: just figured out what was wrong with my friction function.  Now, I'm going to pretend like incline planes don't exist.  I think that'll be something for the second demo. =P~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4820,
		"title": "Hm..",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-07-23T18:07:11.000Z",
		"content": "Well, this project has officially been up for a year.<br /><br />One would think that I would need to have something finished, wouldn't they, lol?<br /><br />Well, I do in fact have a tester alpha demo running around;  I gave an early one to Levellass and an earlier one to DaVince.  The physics engine, as far as it's basic components go, are working great.  (As evidenced by the engine itself)  So, programming past here shouldn't be too hard, from a physics angle anyways.<br /><br />The real problem is graphics.  I have about 7 re-done tiles that create my \"purple plat\" (The purple ground found on Vorticon VI), and one Keen image loaded into the game.  Which is about what I have done --I have a finished animations of him running left, but not right.  I have shells (outlined images meant to show movement, but not textured or shaded) for all of Keen's animations, however; also, I have some of the items done.  That's about it.<br /><br />I've tons of work to do, and really, that little demo is about as far as I'm going to get this summer, I think.  I'm sorry to those who want to see what this game can be, but I jsut don't feel like throwing everything I've got at this game.  I've got the ideas, and now the ability, but I need time.  Not just schedule time, but a lot of time (like months) to re-do the basic animations and tiles.  Once that happens, I'll start on level design (Actually, it's pretty fun for the basic play-testing level I designed for de-bugging).<br /><br /><br />So, happy first b-day, CKTA."
	},
	{
		"id": 4821,
		"title": ":)",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-25T06:28:53.000Z",
		"content": "Keep it up!  This looks to me like it has a lot of potential, and we don't like it when fangames with potential go unfinished. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] [img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 4822,
		"title": "Re: :)",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-09-21T00:00:13.000Z",
		"content": "UPDATE:<br /><br /><br />Yeah, not good.  I did a LOT of work prior to leaving off to Florida in early August.  However, I'm still behind, and now:<br /><br />Well, I'm finally in college.  I just simply do not have a lot of time...  However, in my calculus III class we're doing advanced discussion of vectors, and it's giving me a lot of ideas for how I could much more effectively describe my engine.  I have started the basic mathematical premises of the idea, and probably will continue using it (Coolest part is that it can be converted easily to 3-space, but just bi-metric 2-space)<br /><br />Work has not been done on this game in just under 2 months, so while this still is not on ice, it's not exactly the number one thing on my plate.  I did expressly take me 200 MB+ video game project file and put it on my new laptop, but yeah... I'm really, really busy.<br /><br /><br />So, this weekend I hope I'll be able to get my hands on a mouse for my laptop ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4823,
		"title": "Re: :)",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-10-17T00:25:37.000Z",
		"content": "Well, a little less than a month later and the project is back up.  Finally got the hardware (mouse and USB drive) to start working on the animation of this game again.<br /><br />Graphics will, as ever, take forever.  I don't expect it to be too soon before my graphics are completely up and running for a basic demo.<br /><br />The engine I'm leaving alone for the moment, though I know that I'll be developing a fluid mechanics engine soon enough.  (I'm learning the basics of hydrodynamics right now; it's not too bad, but there are still a few things, like matrices, that I am not too familiar with)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 4824,
		"title": "Re: :)",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2007-10-19T23:43:45.000Z",
		"content": "From what I've seen, this is a good effort. So many projects, all in development!Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
