[
	{
		"id": 358,
		"title": "A WOrld of Difference [Fanfic]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-30T09:30:37.000Z",
		"content": "This will be an interesting thing to write, as its not mine, but Sarah's; and quite a break from her usual animie-oid stories [and much shorter!] However, the damn thing  is currently residing on many sheets of notepaper, so while its not actually chapterised, I'm not bloody going to type the whole thing out at once! You're gonna get a few pages whenever I feel like it, okay? Good.<br /><br /><br />A World of Difference.<br /><br /><br />Keen sat back and listened to the humm of his ships engines and pondered his next move. On the small scanner screen in front of him a green dot blipped a slow and solitary path toward the planets moon. Nearby several hundred blue dots circled the red 'X' that marked the planets location. And that was odd; according to the scanner they were satellites, and one manned spacecraft, yet records stated quite clearly that the civilization on the planet was most definitely pre-industrial, certainly not capable of spaceflight for at least 300 years. And his scans of the planet told the same story; there were a few anomalies, but mostly there were no villages bigger than maybe 200 people, and no sign of anything near the industry needed for space exploration.<br /><br />Keen made a decision, took a closer look at the planet and selected a clearing a few miles away from any visible habitation and plotted a landing course. This little conundrum would make an interesting project to study while he was away at 'summer camp' As his ship soared across the alien sky, parting the thin clouds like mist Keen looked at the planet below him, ignoring the readouts on his monitor. It always paid to get a firsthand 'organic' look at a world, just to get the feel of it. He was over the midlattitudes of an earth like planet, and almost endless forest whirled by below him, broken only by the occasional river or lake. Every now and then a small cluster of building was barely visible amidst the trees. The clearing he had chosen was almost the only landing site for well over a thousand miles; around him, just meters away the forest started.<br /><br />Keen popped the canopy and took a breath of the alien air; it was cool and loaded with a hundred scents, of trees, and shade, water and leaf mould. But especially water. Keen noticed a bubbling sound; the feet of his  spaceship were sinking into the ground, small puddles of brackish water forming around them. The ground squelched under his feet as he jumped from his ship. Closer examination revealed that it was covered in moss rather than grass as he'd suspected. The clearing <i>had</i> to be artificial; the line between it and the forest was too sharp, to recent, and there was no sign of any derbis as would be expected if the trees had just died, or even been cut down. Keen squelched slowly toward the forest, his shoes already soaked by the swampy ground. The forest surrounded him on all sides, shady and mysterious. Keen strode purposefully toward it and the forest engulfed him.<br /><br /><br />More will follow when I can be bothered.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10626,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-12-30T11:10:17.000Z",
		"content": "[img]http://img513.imageshack.us/img513/5786/lostgreyscale2es.png[/img]<br /><br />Can't wait until the next chapter. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 10627,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-30T12:57:25.000Z",
		"content": "This's excellent stuff! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Nice drawing too!<b>Eat your veggies!</b>"
	},
	{
		"id": 10628,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-17T07:12:58.000Z",
		"content": "And I finally get around to more typing!<br /><br /><br />'Chapter' 2:<br /><br />Keen squelched through the forest, his sneakers now soaked through. It seemed to him that here the difference between water and land was more a matter of personal choice. Several times he had come across small clearings in the tree cover apparently containing vast expanses of short grass. The reason there were these gaps in the tree cover Keen found, was that those places contained deeper water than most, covered by a surprisingly solid looking layer of algae. He now carried with him a poking stick in addition to his pogo one, useful for testing wether the 'ground' you were about to walk on was really there. Another purpose for it became apparent when the rotted log he was testing for firmness turned a pair of yellow eyes on him, snapped irritably then slunk off under the surface with a wet *schloop* leaving nothing more than a patch of bare black water with the occasional emerging bubble. It seemed to crust over with plant life as he watched. Keen considered the creature he'd just seen from the safety of a small tree. 'Hmm, similar to an aligator, but amphibious, and definitely much larger, but with no visible teeth, how odd.'<br /><br />The creature wasn't the only life Keen encountered, indeed the problem was avoiding the damn stuff. Everywhere insects buzzed incessantly, landing on Keens clothes, sticking in his hair, and making yawning downright dangerous. Multicolored bird twittered among the trees and scrub, flittering to and fro, plucking their meals from the air. Occasionally a small furtive creature would dart around the forest floor, in the panicky flickering way nature reserves for cute fuzzy things whose only job was not to live long. Keen was glad he'd brought a knapsack and some sample jars, there was just so much to see, to study. Even the plant life was exuberant, hardly a flower to be seen anywhere, but the foliage rippled with hues, blue, green, brown, red, even purple. Vines hung everywhere, making progress at anything faster than walking pace impossible. Even if you could cut a path through, the ground was coated in foot thick moss, small shrubs, saplings and rotten logs. The trees were wreathed in beards of moss and lichen, seeming to rot as they grew. Occasionally there was a dull plop as excess vegetation fell to the forest floor.<br /><br />Keen sampled everything he could, it was always amazing to know you were holding a part of an alien world, a new life form, something NASA would pay through the nose for, and there was always later study, time to investigate new biochemical pathways, new drugs and patterns of growth, the endless wonder of nature. Besides, every time Keen had landed on an occupied alien planet he'd had to save either it or the universe and he deserved some time off. The swamp seemed to agree, showing no signs of the alien race that had suddenly become space borne. Sadly Keens hope of a relaxing afternoon studying the local wildlife came to an unexpected end about an hour before sunset.<br /><br />Now totally coated in mud and moss, and trying to avoid collecting more dirt while simultaneously trying ot catch very bright and very  nimble fish from an infrequent hole in the ever present organic skin of the planets thick water Keen quite clearly heard a small voice exclaim \"Ya aint gonna git no pipefish if'n youse's gonna keep usin them teeny preserves jars.\" Keen got up slowly and turned to face the voice that had spoken to him.<br /><br />There was nothing there.<br /><br />Keen frowned, that was almost always a bad sign. \"Hello?\" He asked cautiously \"Is there someone there?\" \"Course there is! Who'd ya think's talkin to ya, ya big twit?\" said the voice again. Keen stepped back and stared; what he had mistaken for a small patch of disturbed moss had suddenly sprouted a face.<br /><br />The creature was about half Keens height and light brown in color, though this was hard to tell under all the mud it was coated with, almost as much as Keen himself. It was catlike, in the same way a decrepit apartment block could be called a house; at least it had two each of eyes ears legs and arms, and stood upright, It was covered with matted wiry fur and wore a lime green tunic, though if the tunic had disappeared the attached mud would still have kept the creature clothed. It was carrying a small oval reed cage, almost as big as it was. Inside were several large bluish fish and some unusual looking weeds. It stared at him in the same way you'd stare at someone who you had caught entering your house in the middle of the night claiming to be checking the gas meter. Finally it shook its head and said 'Wells, ya look awright for a friend of th' quins; and ifs you aint, so much th' better eh? I s'pose ya here to check up on everyone n' stuff am I right?\"<br /><br />Keen paused, he'd been given a perfectly good explanation on a silver plate for dealing with a civilization that certainly didn't look like it had contact with alien races, but then who was the 'quin' and just how much trouble could you get into for impersonating one of her friends? 'Um, kinda, I'm here to look at everything, in a way I guess. I'd appreciate it if you could point me in the direction of the nearest town.\" said Keen always conscious not to reveal anything suspicious or at odds with the creatures beliefs. It smiled, its teeth were small, pointy and sharp. \"Thought as much, one o' th' quins awright. Ne'r mind then, nearest towns about five flicks this way, jus follow me n' watch were you're goin, hear a lot of the quins get stuck or worse in the swamps around here parts.\" And with that it scuttled off at an  aimiable pace, with Keen close behind.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10629,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-17T13:29:45.000Z",
		"content": "Again, really good piece o' fan fiction.. Sarah got talent. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 10630,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-19T12:24:13.000Z",
		"content": "I had some spare time; its not reallly a chapter, but it was all I had time for.<br /><br /><br /><br />Far above Keen, circling the world like a cosmic diamond necklace were the mirrors. Each over twenty feet in diameter, perfectly spherical, perfectly flat; some 140 in total. Each was pure reflectiveness on both sides, so that a distant observer would note that the planet was ringed around its equator and poles by a thing string of stars. They were indeed nothing but mirror, bereft of and propulsion system or satellite, nothing but giant disks of perfectly polished metal, hanging in space, one side turned to the planet, the other to the stars. Anyone who viewed this marvel would be put in the frame of mind that there was something deeply symbolic about this construction, perhaps it represented the new races conquest of the stars? Their hope for the future? Or just art for arts sake? Something like the pyramids or Piza's leaning tower? Certainly it would be hard to see why anyone would spend so much time and effort on something so utterly useless; they couldn't even be moved to focus light, or even be part of some space defense system. Besides, the planet didn't need defense, nobody would attack such an innocent world, and there were no weapons on it, at least of the conventional kind.<br /><br />In fact none of these reasons were actually the case; the mirrors had a much more practical purpose.<br /><br />Lady Alexsis D'Zwitterion looked up from her mirror and smiled. She could see hundreds of reflections; thousands, indeed, as she was standing between two mirrors an infinite number, slowly curving away to infinity. She'd spent hours setting them up right, just a tiny bit antiparalell, so that the reflections didn't block each other, but stood behind each other, multiplying, reinforcing. She adjusted her dress and stepped out.<br /><br />Into a maze of mirrors; the room was lined with them,every surface a reflection. She twirled with delight and watched a million Alesis' dance with her, their long white dresses pinwheeling around them like a blizzard of silk. There were so many mirrors, so many reflections that Lady D'Zwitterion seemed to be a mist, a composite, as she moved it seemed that reflections drifted behind her, like three dimensional shadows. Again she stepped out.<br /><br />This time the room was more barren, grey metal with only token mirrors placed in the occasional corner. Most of <i>this</i> room was taken up by The Machine. Wires and tubes,  screens and displays flickered in the semi darkness. The machine itself almost glowed with a strange dull purple light. It wasn't ordinary light, this light, it was on the other side of purple, so dark it went past black and into a kind of negative purple that seemed to suck at the light entering from the doors and iluminate the room in darkness. Lady D'Zwitterion liked to call it infra black. It was a color she'd seen often enough before, and one anyone could see if they were prepared to run at high speed into a brick wall; the color that flashes before your eyes just before you pass out, well, that was infrablack.<br /><br />D'Zwitterion tapped at a keyboard momentarily, looked at something on the screen, then set off through the castle. And it was a proper castle too, not a <i>real</i> castle, like those found in England and Scotland say, with crumbling battlements, soot coated kitchen and deserted passageways, <i>this</i> this was a <i>proper</i> castle, more castley than the real thing, made of giant blocks of grey granite, with rugs in the hallways and ancient tapestries hung on the walls, towering turrets, dark dungeons and gigantic feasting halls. D'Zwitterion shied away from the throne room, the Queen would not be there, not at this time of day. She followed a winding staircase, up and down and left and right, until she came to an ornate wooden door. It wasn't any specific wood in general, but instinctively you'd <i>know</i> it was a wooden door. Pine perhaps, or oak. Alexsis knocked primly. And a voice sounding like liquid silk answered from inside. \"Lady D'Zwitterion? I take it this is important business?\"<br /><br />Lady D'Zwitterion paused before answering. \"Yes my Queen, I have found something of... interest.\"<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10631,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-04T14:44:06.000Z",
		"content": "Yes, yes, okay, okay, I haven't done anything in months, there was no need to hit* me!<br /><br />Keen had to admit the creature moved at a disarmigly deceptive pace. ALtough probbably only ambling along it ducked and dived with remarkable agility across and over various obstacles, pausing often while he caught up and removed various bits of vegetation from his hair and clothing. It was sunset by the time they reached the town, although something about its construction hinted that 'village' would be a more appropriate word to use. At first Keen didn't even see the constructions, if thats what they could be called, the resembled more like extrusions from the swamp, lumpy warts that had emerged from a bald spot in the trees. The arcitechetural word most often used was 'vernacular' a word that meant swearing in another occupation, and was hence quite appropriate. Indeed, almost nobody would even consider that they could stand upright, let alone be lived in, except for the undoubted air of occupation that emmanated from the settlement.<br /><br />Which was odd, as it was utterly, totally deserted. His companion seemed rather surprised that he was unaware that this should be so. \"Y'mean y'Don't <b>know?</b> This <b>used</b> t'be th' old town till th quin made the new one, just along from ere.\" It paused \"Which of course s'far superior to our previous accomodation n' we're eternally grateful for th' inprovement in our lives caused thereby.\" Keen considered the 'thereby' it was not the kind of word someone like his companion actually <i>knew</i>, but rather was repeating from memory, rather like a class of schoolchildren would speak about how to solve a problem in front of the class. As the sky turned from blue to red, and the light started to drain away, Keen became aware of lights ahead. Obviously the new settlement was just around the corner, something he was glad of, the swamp looked a lot more frightening in the shrinking light, shadows running together ike pitch black mercury. As he truged toward whatever civilisation lay ahead he hearda tinkle, and looked down. At his feet was a mirror in bad shape; it had been shattered, then splattered with mud. He picked up a piece, rubbed it on his shirt sleeve and then absentmindedly tossed it away before rushing off after his companion, it didn't pay to get lost in alien swapms at night.<br /><br />After he had left, and nothing but the sounds of the swamp layover the old town, a figure darted out of the gloom and snatched the fragment of mirror from where it had fallen. It was reflective on both sides and was quickly thrust into the soggy soil. By the dimming light the figure watched Keen stubling toward the town with a glint in its eye.<br /><br />***<br /><br />Keen stumbled into the town, a bright contrast from the almost pitch black swamp. A familiar feeling was stirring within him, the one that motivates small children to come inside after playing for a hot shower and a cup of coca. Now <b>this</b> was a town, everything seemed to scream 'town'; indeed, it was so townish you began to wonder if you hadn't seen it in a fairytale somewhere.<br /><br />All thoe houses gleamed, or at least were clean enought that they could. They were all arranged in neat crisscrossing rows, each simalar to the others, but each individual. They were all large, roomy, bright and neat. The swamp had been cleared away here, a large moat around the town draining the area withing, giving the soil some semblance of solidity. There were neat gardens, rows of letterboxes, and picket fences. You almost kept a lookout for freshly baked apple pie. Everything was neat and tidy to a fault.<br /><br />Keen knew he wasn't welcome as soon as he crossed the bridge into the town. It wasn't an open hostility, more like people simply avoided noticing him ,as if even acknowedgeing his existence would result in a sound whipping-if they were lucky. Behind him he could feel the pressur of their gaze, which seemed to suggest aomething simalar to what Saddam Hussein would recieve if he had just made an appearance on your street looking for a nice hotel. The trip to his companions hose was rather short, the town itself being little more than a mile across. Keen could feel a silent crowd surreptiously building behind him, and hear the whispered conversations going on around him.<br /><br />As he approached the dwelling he had been lead to, a curious figure appeared at the door, gasped in horror, rushed inside and slammed the door. By now Keen had come to notice his companion was about half the height of most of the residents in the town, and unlike them was dirty. This was a classic sign of childrenship. Frantic wispering from inside drew his attention, before the door opened and another figure appeared, stood stiffly to attention and ushered them inside, apologizing profusely for the previous confusion. Keen entered, feeling the crowd outside focus its gaze on the building.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10632,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-04-07T06:38:01.000Z",
		"content": "hmm, good story! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />There are a thousand possibilities from here. It'd be interesting to see how it turns out.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 10633,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-08T14:00:41.000Z",
		"content": "Inside the dwelling was identical, at least in tone, to the outside; neat and ordered, with everything in its place. It was a reasonably comfortable looking domestic scene, there was even a row of plaster ducks stuck to the wall. There was also a family of five, including his companion. They stared at him in abject terror. After a pause that seemed to go on forever the tallest one, presumably the father stepped forward. He spoke to Keen with a curt, clipped tone, staring at the floor as he did so. 'My lord... I assure you that everything is in order here. Whatever my son has done, I swear it was done in youthful exuberance and I take full responsibility for any consequences of his misdeeds.\"<br /><br />Keen stared blankly for several seconds as the statement sank in, things were shaping up he didn't like. He took a deep breath and thought long and hard about his next move. He finnaly decided on a bluff. \"I assure you sir your sons misdemeanours can be overlooked, however my main reason for coming here was to observe progress in the town. I would appreciate it if you had lodgings spare for the nigh so I could continue my observations tomorrow.\" The citizens seemed to have very definite ideas about 'appreciate' when spoken by a certain class of people. He was assured that lodgings for the night were avalible, and the family bustled out of the room, to be as far away from him as possible, all except of course for his now rather confused companion. He was soon left practically alone in the room, feeling worried, suspicious and confused. Aware with every step that he was tresspassing in someone's house, Keen tiptoed into another room.<br /><br />And saw himself.<br /><br />It was a mirror, a very, very large mirror. It reflected the whole room which was the biggest in the house. He stared at it intently, something wasn't quite right... He focused on his reflection, what was it...? He could see...<br /><br />Another face, older than his, a girl, blond hair, smiling at him... and then it was gone, the mirror was totally normal, but the vision had drawn Keen's attention to something near the lower left corner of the mirror, a small label, half peeled off. Keen read the three small words typed on it. He read them again, his frown turning into a clenched grimace. Now he knew who the Quin worked for, now he knew what ahd pressed fear into this town so that any humans were treated with awe and fear.<br /><br />The words were english.<br /><br /><i>Mortimer!</i><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10634,
		"title": "Re: A WOrld of Difference [Fanfic]",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-04-10T01:09:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Mortimer!</i>[hr][/quote]<br /><br />Once again, mort has become 1 step ahead with his 1 step ahead, haha. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />I wonder if they mistook keen for mortimer (his helmet might have been muddy enough to be mistaken for black...)<br /><br />I think I know what the mirrors are for now.<br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 10635,
		"title": "dfjsoj",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-04-10T07:08:40.000Z",
		"content": "eh? so what are the mirrors for?"
	},
	{
		"id": 10636,
		"title": "Re: dfjsoj",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-14T10:02:53.000Z",
		"content": "Looking in to admire your appearance of course!<br /><br />Well, Sarah is back for the weekend, which means, well, more work for me!<br /><br />Keen spent a restless night sleeping in improvised accomodation, lord knew who had sacrificed their bed for his moderate comfort. He could hear his hosts talking in subdued whispers just a few rooms away (you don't get to be a galactic saviour *and* eight years old without some superb hearing)He could almost feel the roumours tricklig through the twon. If this was of Morts doing then there was bound to be some troubble sooner or later. Despite the extremely comfortable bedding Keen tossed and turned trying to plot his next move. Idealy he should try to get as close to Mort as possible, but where would he be? Probbably in the capital city, near this Quin he'd heard about. But how could he do that without causing troubble, either from the natives or Mort? After all, he'd be expected to pretty much know where everyone and everything was, and that was another thing; obviously there were other people here, well of course people, but *human* people. But woh were they, and why would they help Mort? After several hours of using his grand intellect to formulate a reasonably foolproof plan, Keen fell into a deep but fitful sleep.<br /><br />Keen awoke early that morning, had a lite breakfast that he could barely swallow watching the family at the other end of the table, staring at him as if he were likely to explode, which, knowing Mort, he could. After attempting to assure his hosts that they were not about to be taken prisoner Keen made to leave. He was beaten to the door by it being opened from outside by a frantic looking Crois (He'd at least managed to figure out what this species called themsleves earlier that morning.) When it saw him it stopped cold, tried to turn and rum at the same time, tripped over its own tail and tried to back away by moving the fur on its back. Keen sighed and said in a loud stern voice \"Halt! What is the purpose of your visit?\" The Crois managed a three foot leap from a sitting position before hurredly standing to attention and burbling at machine gun speed \"Sosorrysir! Justheretonotifyyouthatyourcolugeishereforthetownhallinspectionsir!\" before dashing away as if its tail was on fire.<br /><br />Without wasting time Keen headed toward the tallest building in the town; if fact, it was the only bulding in the town with more than two stories. There was already a crowd there when he arrived, they stepped quickly out of his way, pretending they hadn't been in it to start with. The town hall was an impressive building, several times the size of the houses, a large complex topped with a tall clock tower. It was an interesting clock; its face was a giant mirror and there were large mirrors on every side of it, overlooking the town. He was correct, there was another human there, dressed in a smart blue uniform, surrounded by about half a dozen well built  Crois in green uniforms. They appeard to be talking to an elderly Crois who looked like they wanted to sink into the dirt. The human turned soundlessly as Keen approached. He could feel their gaze combined with that of the crowd. The human took several steps forward, looked him up and down and... changed.<br /><br />Ot wasn't a drastic change, with sparks and smoke, nor even a gradual change, say if it were growing wings. It wasn't even as big a change as a smile turning into a frown, the figure just... rippled for a second somehow, as if a four dimensional stone had been dropped in reality. And then somehow there was another gaze on him. The figure spoke. \"Ah, Mr Blaze. I take it you have noticed the siuation on this planet? Perhaps that is why you decided to pay us a visit?\" Then he smiled. And *that* was scary, because it wasn't a normal smile, rather it was as if he'd replaced his face with a mask that looked just like it, but smiling. There was no inbetween, it just flicked over. Keen backed away with surprise, but then a sound rang out to break the spell. <br /><br />It was the sound of mirrors breaking. Large lethal fragments of glass fell from the face of the clock tower. All the uniformed figures seemed to shiver simultaneously. There was a whizz and a stone whirrled past Keen's ear, embedding itself into a wall. There was a high pitched yipping sound, and cheers from the back of the crowd, a group of Crois was sprinting toward them holding some kind of simple weapon. The uniformed Crois responded by drawing several small guns and firing apon them. Those that were hit crumpled; Keen knew stun guns when he saw them, but now wasn't time, the attackers had reached him, and it wasn't likely they knew what side he was on. The human guard picked up a dashing Crois and threw him against a mirror... he passed through as if it was a wall of mercury, and dissapeared. Keen swung at the guard unthinkingly. There was a strangled tinking sound, and several fragments of glass fell from the guards face... or at least where it had been, now all that remained was a large piece of wood. The gurd kneeled, then fell over, nothing more than a collection of twigs, leaves, string and dirt. Keen stared at the mess before him, before a stinging pain on his face made him black out.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10637,
		"title": "Re: dfjsoj",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-10T04:18:39.000Z",
		"content": "Sarah prodded me into typing up the rest of her damn story. I'm tired and I want to go to bed, but for her I'm staying up. You better damn well read this and ejoy it, cause I gots me a tazer and I'm itching to use it!<br /><br /><br />Keen groaned and briefly thought about getting up, but years of training had sharpened his common sense to a knifepoint and he stayed still, with his eyes shut, trying to figure out his location. He'd been hit with something, he could feel the bump on his head and the dried blood. From the feel of things he was on a wooden bench, somewhere damp, but that didn't narrow the locale down a lot. He was inside, that was for sure, and someone had taken all his stuff. Several people were talking nearby and the conversation didn't sound good. <br /><br />\"I say we kill it! There's no tellin what it could do!\" <br /><br />\"Look, we don't know anything, <i>he</i>  is bleedin! Non o' th' Quin's creations do that!\"<br /><br />\"Yeah, well you know how good she is wit appearances! Why tak' th' risk?\"<br /><br />Keen decided to end this line of reasoning by sitting up and taking a look around. As he'd suspected he was indoors, in some sort of large caver, slumped on an old table amidst various piees of rusting and abandonded machinery. Standing nearby were a number of people that as yet, hadn't noticed him. He coughed.<br /><br />This had two effects, firstly everybody present whirled around in surprise and faced him. Secondly they pointed sharp objects in his direction. He held up his hands in a suplicatory manner. \"Look, I dunno whats going on, and I mean <i>really</i> so I'd appreciate a bit of explaination here before anyone kills me okay? Especially with this 'Quin' person.'<br /><br />There was a substantial pause as the assorted group thought this over. Finally they seemed to reach some sort of unconsious decision. One of them approached, the leader Keen assumed and stared at him intently.<br /><br />\"Stick your tounge out.\"<br /><br />\"What?\"<br /><br />\"Just do it.\"<br /><br />Keen complied, being stared at all the time as if he had a biohazard label on his forehead. Finally after another long pause during which Keen felt like an utter idiot [A rather strange and alien sensation.] the leader sighed. \"Right, he looks real. We'd better explain stuff. If he moves, beat him to death.\"<br /><br />Keen sighed, another typical day...<br /><br />Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10638,
		"title": "Re: dfjsoj",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-09-18T21:09:16.000Z",
		"content": "Just read the whole thing. Superb story so far, keep on going Sarah!____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10639,
		"title": "Re: dfjsoj",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-19T10:35:55.000Z",
		"content": "Dammit! Stop encourageing/reminding her, she visits here too y'know!<br /><br />[That does it, I'm getting her a seperate account]<br /><br /><br />Keen listened to the story the crature weaved, interrupting now and then to ask the odd question. It was unusual to say the least. As had been reported, the planet had been little more than pre-industrial, with little inclination to improve matters aside from inventing the long necked fishnet a few decades earlier. However the arrival of the 'Quin' had changed everything pretty quickly. Apparently she was a sorceress who built her eintire castle overnight, built an army in a week and declared herself ruler of the planet.<br /><br />She had rapidly introduced new housing, foods, transport and everything else, including blasting satelites into the sky. This rose and intriugeing point; approximately a month after her arrival the entire planet's inhabitants had leanred to speak plain omnispeak, overriding the myriad of dialects that had previously isolated communities. They had also leanred the words and concepts for things like 'satelite' out of thin air, again apparently by the Quin's magic.<br /><br />Despite some initial resistance the Quin had sent parties of soldiers to every town and community on the planet and was even now expanding her empire constructing more barracks and towns. Resistance was apparently almost impossible, the Quin could read minds, anywhere, she employed the glass army, apparently bewitched mounds of rubbish that came alive and did her bidding. Keen had been mistaiken for one as the Quin had human subjects, though not human herself.<br /><br />Mortimer wasn't mentioned, but it was pretty obvious who was behind this, the 'magic' the omnispeak, the technology, all pointed to him like a compass to the north pole. Keen listened to the remainder of the tale in dead silence, clutching his helmet so tightly his knuckles went white and his hands fell asleep. Finally the shocking tale ended.<br /><br />Keen was quiet for some time. \"I'll need to think this over, but I'd like to help you any way I can, I think I know this Quin of yours, or someone close to her.\" There was another long pause as the group considered this. 'Yeah alright. You're collectin y' own rocks though, can't go round runnin' after some lil' dint of a kid.\"<br /><br />***<br /><br />Lady D'Zwitterion stepped back from the mirror and adressed the watching figures. \"So you see it appears our friend has been either captured or killed by one of these horrid terrorist parties. If he is stillliving we have a duty to rescue him before he is mislead, or used against us.\" There was a murmour of assent from the watchers. <br /><br />\"Can you locate him?\" <br /><br />\"Not easily, my Queen, they have destroyed our mirrors, but I believe with a large enough search party we will easily be able to track them down.\"<br /><br />\"Do it then, we await your sucess.\"<br /><br />Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 10640,
		"title": "Re: dfjsoj",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-09-26T20:16:30.000Z",
		"content": "I want more... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  <br /><br /><br /><br />...Please?____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10641,
		"title": "Well then.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-11T13:59:32.000Z",
		"content": "Well, it appears I have been petitioned to write this myself. I can't say the prospect enthuses me, its very hard work writing out page after page of text.<br /><br />In other news, I need to find a way to get Adis back, she's being stubbourn. [And yes, I shall remain if/when she returns.] What I need is a good idea for dragging her back into Keen, does anyone have any suggestions?<br /><br />Anyway, let us continue:<br /><br /><br />Keen tossed and turned in the makeshift bed, trying to sleep, but not wanting to; turning the day's events over in his mind. Why couldn't he do something without it turning into something heroic? He thought back to school, and watching the other kids playing with whatever action figure or game was in vouge that week. *They* didn't have to worry about the Tanzer situation, *they* didn't think the Megazoid looked like a Fadarian Zalk. *They* didn't know themeaning of the words 'in vouge!' People were always so eloquent about excitement, always rushing off for the next thrill, what was wrong with a little routine now and then?<br /><br />Cartoons were worse, those and fanfictions; where the hero was always battling thousand to one odds, always making it through somehow, getting the girl, (Brief thoughts of Lindsey passed before him) saving the city/planet/universe. It was almost sickening, like a vietnam veteran watching Rambo.<br /><br />This was of course, going off subject, but thats what happens when you lie in bed, unable to sleep late at night. And it was just so *unfair*! Now he was stuck in this big mess, fighting someone who could be Mort, or might not be, a mysterious Queen and mirror army, things that didn't make sense! He needed a plan, but his IQ wasn't heping him here. Keen lay still for a long time as his mind slowly cut through the possibilities.<br /><br />* * *<br /><br />Sometime later Keen awoke, there was no real good reason to do so except for the silence. It wasn't the normal silence, the silence you got at night, full of hundreds of small sounds added together, a kind of grey silence you could wrap around you like a blanket, but the dakr, pitch black silence of somebody deliberately not making any noise. Keen followed the small patch of extra quiet as it slowly snuck toward the itchy lump of fabric that passed for a pillow here. There was a brief movement, such as would be expected by someone attempting to gag a person who turned out not to be sleeping in the bed they'd approached, but by that time Keen was out the door and running down the corridor.<br /><br />Only the quietest of rustles behind him indicated someone following, but even with the shock of pursuit he could tell something was wrong; it was far too quiet, people that should've been there were not. He turned a corner, something followed. Open door, shut, run. Something followed, moving so quietly he hardly heard the door open behind him.<br /><br />Or close in front of him.<br /><br />Keen rubbed his bruised noe and tried to focus, a helmet didn't protect your face from running headfirst into a wall unless you weren't wearing it correctly. There was a guard standing in front of him, holding the door shut. Behind him- <br /><br />Behind him was a rather stylish figure in black. Black coat, black pants, black hat, black everything. He seemed to exude style and Keen hated him immediately. He didn't recognize the species at all, the figure was about his height and as red as ketchup, the overall effect making him look like a burning ember, or Darth Maul rip-off. The most worrying thing was the eyes, utterly blank, two pits of inscrutable white. When it spoke it was with the measured tone of someone who had been planning their speech from the start. \"Ah, Commander Keen, no? I *am* a big fan of yours. We shall be spending some time together it seems, how fun!\"<br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10642,
		"title": "Re: Well then.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-12T08:22:52.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Hey \"man\", this is very good. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 10643,
		"title": "Re: Well then.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-12T08:49:35.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10644,
		"title": "Just for you Vinny",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-16T11:49:43.000Z",
		"content": "You don't become a hero and multiple saviour of the galaxy without learning at hing or two, or developing certain instincts. Thus it was of scant comfort to Keen as he was marched down the corridors of the compound that he kenw he was in little danger from his captors. It was however a great shock to him how quickly they had taken over; the unconsious, and sometimes dead, bodies of his former compatirots were being dragged in their dozens to the same destiantion as he was. Here and there lay small piles of discarded garbage, evidence that at least some of the 'mirror soldiers' had been overcome, futile as that had been. While all the others in the compound were silent, the strange red creature who had tracked him down was twittering away like an excited schoolgirl, constsntly enquiring into what aliens Keen had met, had he really snuck aboard the omegamatic and how, and other pointless topics of conversation. Keen noticed however how he moved like a cat, utterly silent and without passing through the interveneing space between two points. The overall effect was that he seemed constantly to sneak up on you, and it was something that worried Keen deeply.<br /><br />He was also immensely curious. \"I'm sure I recognize your species from somewhere, I just can't place it; what are you? A mirror creation of the queens perhaps? A genetic abnormality? What?\" The creature smiled hugely, it looked as if the top of his head were about fall off, but it was a crazed smile, the kind of smile given by a postal employee just before they break out the machine gun and shoot up Stamps and Packaging. \"Oh heck no! I'm half human, the rest is Sintrian Fire lizard, though thats just the SGA word for em, it makes them sound like some sort of dragon, don't you think?\" Keen scowled. \"Right, some sort of bizare hybrid. The Queen,... or Mortimer?\" The creature gave him a look of surprise and amusement. \"Oh no! My mother, she was a smart lass, with odd tastes in men. Did you know she built her very own spaceship out of an easy bake over, weed eater and transistor radio?\"<br /><br />Keen blinked at this. If it were true, then there had been others like himself, which made some sort of sense, you didn't need to be a rocket scientist to build an interstellar spaceship, even Mort had managed it. For a moment Keen paused to wonder how many ships were out there, how many of humanity had reached for the stars and succeeded, but not for long as the soldier behind him gave him an almighty prod in the back.<br /><br />They were bundleded into several large ships; but Keen was given a spacious and comfy seat in a smaller, more brightly colored spaceship, apparently he was to be a spacial guest of the Queen. Sadly the red creature came with him, resulting in an hour and a half's worth of pointless and idle banter. It was worse than babysitting his younger sister, at least she shut up for naps. Keen survived by tuning out and staring out the shuttle's large window at the land below. It was all swamp of course, ranging from lush wet and bug infested at the equator to sparse and frosted near the poles. Keen was whisked across the world and up a rather impressive mountain range before seeing his destination.<br /><br />When it came into view he simply had to gasp.<br /><br />.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10645,
		"title": "Re: Just for you Vinny",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-17T11:23:52.000Z",
		"content": "This is becoming more and more interesting. A human/Sintrian Fire lizard mix that chatters away like a school girl? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10646,
		"title": "Re: cliffhanger",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-10-20T00:52:37.000Z",
		"content": "cliffhanger [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]  <br /><br />can't wait for the next intallment... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 10647,
		"title": "Re: cliffhanger",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-20T02:24:34.000Z",
		"content": "It's hard to make a cliffhanger when you wrote the whole story in one big lump.<br /><br /><br /><br />To call it a palace was an understatement.<br /><br />Even from a distance it gleamed, like a gem locked into the rocks of the mountains, all sparkle and whiteness. As the shuttle got closer the gleam resolved into individual turrets, courtyards and spires. Keen had heard of fairytale castles in books (Usually the 'happily ever after' kind, but it seemed to him that more and more literature tended towards elves dragons and knights these days.) and seen depictions of them on television, but they all paled compared to this. This is what a good castle would become when it died.<br /><br />Everything was neat and trimmed and polished, constructed of some sort of white marble that seemed to glow from inside, liberally dotted with private gardens, hedge mazes, towers two hundred feet high jutting into the sky like the swords of God. It didn't look so much built as grown. The shuttle itself sped over the construction and set down in a courtyard large enough to accommodate double figure's worth of football fields, the other ships went elsewhere; Keen couldn't track them amongst the vast architecture.<br /><br />\"Huh?\" Keen was prodded out of his amazement by the nattering of the creature behind him, he realized that he'd probably missed some important information on the castle's construction or constructor, but the voice was so easy to ignore, he could give Dr Mesmer hypnosis lessons. In short order he was bustled out of the shuttle to be met by a delegation of what were in all likelihood palace officials; they wore rather elaborate white and blue robes and appeared to be some sort of welcoming party. Keen was aware however of several guards placed seemingly randomly and unconcernedly around various gates and portals surrounding the courtyard; it would take a hero's eye to spot that they were positioned so as to be able to see him no matter where he ran, and that it would take mere seconds for their concealed weaponry to be revealed and do something unpleasant to him. <br /><br />Behind him the hybrid was hopping about like a demented balloon, as if he'd float away any moment, all the time keeping up the idle chatter. Something was mentioned to the delegation about an 'esteemed nay, distinguished guest' and they began a procession toward the nearest building. Evidently someone was expecting him and they were in complete control, you had to be to have the galaxies youngest hero prisoner and call him a 'guest'.<br /><br />The interior of the palace was, if anything, more impressive. Outside the sheer scale and complexity overwhelmed the mind, whereas inside things were on a far more human scale, a mountain was easy to describe a living room less so, but the sheer amount of decoration and gilt inside was amazing. Here everything was constructed of the same white material; closer up it had the appearance of almost plastic, but stonelike feel and texture, like solidified and especially dense smoke, the windows were made of the same stuff, blended seamlessly into the main structure, but clear. There wasn't a single crack or fissure to be seen, this place *had* been grown, somehow. Every surface not of the gleaming 'marble' was covered with ornamentation, what looked to be solid oak furniture, gold chandeliers, tapestries, sparkling jewels and statues, dozens of statues.<br /><br />Keen recognized several of them, they were perfect replicas of several of the more obscure martyrs of the 13th century, a subject he had, out of curiosity, researched. The ceiling loomed overhead, with a map, in gold and precious gems, of the night sky as seen from Pictra III And still they moved onward, that had been only one room; there were hallways aplenty, storerooms, treasure rooms, kitchens, bedrooms and more, all glimpsed as he was marched through the winding passageways of the palace. There were streams here too, channeled inside via a giant system of aqueducts and pipes, they formed springs, pools and baths, even drinking fountains, all diverted from natural underground aquifers according to the constant stream of information emanating from the hybrid. Even if he could escape, he'd never be able to find his ship, or the way out this place was *huge*<br /><br />After what seemed to be hours, by which time Keen's senses had simply shut down at the sheer opulence of the place they arrived at what he was informed was 'the great hall' Once again, they had named it aptly, the doors were almost twenty feet high and solid polished brass, they must've weighed several tonnes, but slid open at the lightest touch. (The fact that they did so was no problem, fine balance and primitive hydraulics would do that easily, but something about the lack of piping and smoothness oft he stone told Keen that something else entirely was responsible.) Inside was yet more gilt, this time arranged impressively leading up to a rather large and well padded solid gold throne.<br /><br />Beneath the throne, at the foot of the stairs leading up to it was a small chair and seated upon it...<br /><br />The figure looked up \"Ah, Mr Blaze, I have been waiting to see you for some time.\" Keen didn't gasp, he was feeling rather tired and overcome, but he nonetheless took a step backwards out of sheer surprise, the figure addressing him was a girl, and human.<br /><br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10648,
		"title": "Re: cliffhanger",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-23T09:50:09.000Z",
		"content": "She was about his age, maybe a bit older, blond, blue eyed and clad in a perfectly fitting neat... outfit. It wasn't any specific kind of clothing, just a neat functional set of fabric that gave her an authoriative and knowledgeable air. She stood up, crossed the considerable distance between them. Keen  hadn't expected someone so young, human or cheeful. She adressed the hybrid beside him. \"Very good work Synder; you are not needed at this point in time and can retire to your quarters, you will be called shortly.\" The hybrid was still jumpy 'But...but...\" \"I think I know what I said Mr DuZweit; Please be coperative, thankoyu.\"<br /><br />The hybrid wandered off, muttering and looking back all the time, now the girl was adressing him. \"Where were we Mr Blaze, or can I call you William? Either way, I really must welcome you to the crystal palace, I do wish to apologize for the way you've been treated, especially the hired assasin, but we really had no choice, you were taken prisoner by hostile elements.\" Keen spoke up \"They didn't sound to hostile to me, and it seems that you're the one doing all the hostilities around here.\" The girl laughed \"Oh no, I am only obeying my orders from the Queen, I'm sorry, you must be quite confuesed, allow me to explain things, would you mind taking a brisk walk?\" Without waiting for an answer she started off down a corridor. Keen followed, as far as he knew he didn't have much choice.<br /><br />\"William, as you may or may not have discerned, this world was in a pitiful state just a few years prior. Since my mistress took charge there has been a drastic improvement in living standards and technology here. It may not look like much, but this palace is packed so densely with electronic compnents, that it's practiacally magnetic. While there have been some oppostitions to our activities, by and large the populace has welcomed our efforts.\" She turned to him and gave him a stare that almost made him fall backwards \"So I have asked my mistress to allow you to join us. and she has agreed. We are offering you the chance to improve an entire world William, think of that.\"<br /><br />Keen paused, remembering the looks on the people he'd seen earlier. \"What happened to the others? And what if I refuse?\" The girl smiled. \"They have been taken to a re-education facility, and if you refuse we will be dissapointed, and you will be free to go, so long as you do not interfere further. And now, if you would accomode me, my mistress will see you now.\"<br /><br />Amidst all the talking Keen hadn't realized they'd arrived back in the great hall, and this time the throne was occupied. The Queen stood up and bowed as he enterd. She was roughly the same species as the others he'd met except far whiter, from tip to toe, both in clothing as fur color she was enamel white. Like the girl next to him she had blue eyes, but these shone like two sapphires, they barely looked well 'human' was the closest expression. She wore a silver wrown sparkling with diamonds and one of those long, impractical dresses you saw on princesses imprisioned at the tops of towers. From what Keen had seen of monarchs both at home and abroad, she wasn't a real Queen at all.<br /><br />When the queen spoke it was with a calm reasoned tone. Keen had heard the phrase 'honeyed words'  before, and now he knew what it meant. \"Ah, this must be the renowned interplanetary hero I've heard so much about, I take it you have heard my offer? Feel free to take your time to consider it.\" Keen knew his rsponse and it came out before he could bite his tounge. \"Quite frankly, I'd rather play on a hot waffle iron.\"<br /><br />The Queen didn't so much as flinch. \"I am sure that can be arranged if you desire. Such a pity though, Guards, escort him to his cell please, that will be all.\"<br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10649,
		"title": "Re: cliffhanger",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-10-24T03:26:19.000Z",
		"content": "William? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  <br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 10650,
		"title": "Re: cliffhanger",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-24T07:53:51.000Z",
		"content": "Keen's full name is William B. Blaze.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10651,
		"title": "Re: cliffhanger",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-24T23:18:56.000Z",
		"content": "It's really William Joseph Blazkowicz II, his father, Arthur (Kenneth) changed his last name for showbiz purposes only if I'm correct, so it's not his legal name.<br /><br />I read in the newspaper today about a person that wanted to add her showbiz name to a political party vote thingy.<br />She wasn't allowed to do that, because it wasn't her \"real\" name.<br />Of course nobody knows her by her real name, so I can imagine if she doesn't like having to revert to a name that's meaningless to most.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 10652,
		"title": "Re: cliffhanger",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-24T23:26:19.000Z",
		"content": "Why you  appear to be correct; I had assumed the official last name had been changed thogh, to Blaze, rather than just made an unofficial 'showbiz' name? I must check the quotes; wolfenstein wasn't it?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10653,
		"title": "Re: cliffhanger",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-25T13:16:18.000Z",
		"content": "It's in the [url=http://www.rinkworks.com/apogee/s/2.8.6.2.shtml]Apogee FAQ[/url], and it seems like that's a direct quote from the Wolf 3D manual.<br />Whether or not his name change is of the legal kind or just the show biz kind is still sort of ambiguous.<br />Then again, right after that it's stated that Billy is still called Blazkowicz, indicating the name change wasn't legal.<br /><br />Well, not that it's illegal to use a different name for show biz, lots of actors, singers, etc. do it, nobody goes to jail, but you can't use it in legal documents, just like Billy can't use \"Commander Keen\"... at least not outside of Earth.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 10654,
		"title": "Re: cliffhanger",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-26T07:39:14.000Z",
		"content": "Yes, you are right, and it does suggest that the name change was not a legal one.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10655,
		"title": "fdsoj",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-10-31T14:23:49.000Z",
		"content": "phrowr! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 10656,
		"title": "Great.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-31T17:13:01.000Z",
		"content": "Finally gotten around to reading the last part. Too bad there isn't any more for now, it's so good and I can't wait to see what will happen next.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10657,
		"title": "Re: Great.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-27T21:44:35.000Z",
		"content": "Wah! Sarah? Please write more?____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10658,
		"title": "Re: Great.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-04T03:36:35.000Z",
		"content": "I have been bid to continue, therefore I shall do so. (This is for you, you know who you are!)<br /><br />* * *<br /><br />Keen considered his current position; technically he was incarcerated impending deportation. His cell was very well laid out however; it was spacious and well furnished with a large feather bed, sofa and widescreen TV (Phototachyon enable, 4096 channels.) as well as room service. (After the previous few days it had been a positive pleasure to have some proper junk food again.) However, none of this changed the fact that he was, very much, still a prisoner, was being held by force and that the Queen had upset a great number of people. As well as being impressive and comfy, the room was also impenetrable; the blindingly white walls were solid marble and at least a foot thick, the windows were wide and grandiose, but sheeted with solid crystal three inches thick and almost a meter over Keen's head at the base. The door was locked and wouldn't budge, and any attendants that came by were always flanked with some very impressive looking guards. The sensible thing would have been to give up, enjoy the hospitality and wait for an opportunity to escape. Being a genius, this is exactly what Keen did. He did not have to wait long.<br /><br />It was late afternoon (Though difficult to tell since he couldn't look out of the windows.) when the hybrid came to see him, apparently in an attempt to make him reconsider the Queen's proposal. Apparently the Queen, or indeed anyone else, hadn't been notified of this as Mr DuZweit came unguarded, in his usual giddily cheerful mood. \"Look, Billy, can I call you Billy? I can? Thanks. Anyway, look; I don't think you've really considered what you're passing up here, I mean look at it; you can't argue that the Queen's made some very impressive improvements here in the past few months, we're talking major quality of life issues here. I mean, I know you're not known for your humanitarian- ha! <i>human</i>itarian, geddit? <i>Any</i>way; what I mean is, you're not in to all the 'good of the people' crud, and why should you be? I'm a shoot first, ask questions later kind of guy myself, and I mean heck, some people, it's a mercy to blast the sods, but even you can see the Queen has everyone's wellbeing at heart. So I'm not leaving until you reconsider, okay?\"<br /><br />Keen stood up and stretched, as it is always wise to do before physical exertion. \"Are you finished?\" he said in a bored monotone. \"Okay; first, yes I get it, second, I won't tolerate <i>anyone</i> making others live their way against their will and third, that's quite true you won't be... goodbye!\" The hybrid turned around, confused by Keen's reply, just in time to see the door he had left open slam in his face. The sound of running footsteps faded quickly in the corridor outside. DuZweit stared at the door for a long time. Finally he kicked it in annoyance and swore. Then he turned around and patiently started climbing the wall...<br /><br />Keen dashed down the corridor at high speed; he didn't know where he was headed, or whether he was being followed, but he was bound to be found out eventually and it would help to be far away and possibly even free from this strange place; then he could formulate some sort of plan. Of course, had he waited to be deported he could've located his ship as well, but there wasn't time to think of such things. He was weaponless so far but had one advantage that hadn't been suspected; a small tracker beacon, no larger than a ladybug nestled near the trigger of his neural stunner, and, strapped to his wrist under his wristwatch computer. (Which hadn't been confiscated!) a simple tracking mechanism. Working simply on low level radio pulses, it sent out a very low frequency signal and blinked in the direction of the tracker bug. Thus all one had to do was walk in the right direction long enough. Of course, things could be made complicated by say, a wall right in your way, but the castle was surprisingly open and he made brisk progress toward his goal-wherever that was.<br /><br />\"Halt in the name of the Queen!\" Blast! How <i>had</i> they found him so quickly? Keen dashed down a side passage keeping a close eye on his tracker. Blasts of energy followed him, sparking harmlessly off the walls. Now that was something; evidently the Queen was bulking up weapons-wise. It was only a mild reassurance that the shots weren't deadly, he had nothing to shoot with. There was more shouting; somehow they'd found his hiding place, there had to be some sort of security system in place, not good. And the hallway was a dead end too, Keen could <i>swear</i> that it had been open when he'd dashed down it, but now he was backed against a wall to wall mirror. The mirror felt cold and metallic on his back and Keen backed away from it- straight towards the five waiting guards. For a moment he hesitated, then dashed forward, kicking a guard in the legs. He collapsed, then shattered with a sound like a breaking wineglass. Sticks, stones and most surprisingly, a pumpkin upon which a crude jack-o-lantern face had been carved fell out of the guards now tatty uniform.<br /><br />But behind the guards was another wall! How was that possible? keen didn't have time to consider- and ran right through it. It was an illusion, a hologram, great, just great. The guards were recovering, evidently they knew what was fake and what wasn't. Keeping one hand touching the nearest wall, to feel for now possibly invisible openings, Keen dashed away following his tracker. He outpaced the guards surprisingly quickly; they were evidently not built for high speed chases. However, upon skittering along a mirrored and empty corridor Keen saw something that made his blood run cold. Behind him, from a mirror he had felt as very real and solid, several guards emerged from the glass, making it ripple like liquid mercury. This was very, very serious; flux metal could do that, or piscopetic holograms; either one was complex enough, and that meant that possibly the entire palace was wired and watched. As Keen struggled to pace himself and flee his new pursuers he knew in his bones that if he didn't find a way out <i>soon</i> he would probably never leave.<br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10659,
		"title": "Re: Great.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-22T20:41:37.000Z",
		"content": "Yet some more to waste your time upon.<br /><br /><br /> As luck would have it, Keen was in luck. (What else?) His tracker had led him to an absolutely massive hangar; in it were several ships, most were massive, reaching up to the ceiling, with a carrying capacity of maybe several hundred people, Lord knew how much cargo. But his goal was apparently not one of those, a far smaller and sleeker ship was where the signal was coming from, evidently the symbionts since it was most definitely an Aanvallen scouter ship, built for speed and attack capacity. It wasn't guarded, locked or protected in any way and it was a simple matter to enter and lock his pursuers outside. The ship's hull was in good condition and would be impenetrable, but there was no telling what weaponry would be deployed when the guards reported back about what he'd done- if he wasn't already being watched. Keen quickly found his stuff, the ship was sparsely furnished, though surprisingly messy. His raygun, helmet and sampling equipment had been mounted in an airtight glass case with a small plaque. In the same room Keen found several portraits and a pile of badly written fanfiction. All of them pointed to an obsessed and evidently crazy fan. There was nothing worse in Keen's opinion than fans, he didn't know how celebrities put up with them. (When your fans can be any one of several dozen species that can do anything from electrocute to incinerate you, you quickly learn to dread obsessed fangirls.)<br /><br />Quickly liberating his equipment (And toasting the fanfiction, dear <i>Lord</i> what terrible stuff, how could people write it?) Keen set his neural stunner to 'fry to a golden brown' and leapt into the pilot's seat. (Quickly leaping out, removing the week old pizza and leaping back again.) He could see dozens of guards milling outside the ship, not bothering to attack it, or indeed do anything but stand still and watch. And why should they? Keen could see no way out of the hangar, not a window or door in or out. Evidently more holography Someone wasn't in on the conspiracy though; the hybrid was pushing his way past the massed ranks of guards heading for his ship and yelling something incomprehensible. \"Too late, way too late.\" smirked Keen as he engaged the engines and antigrav pads. Aiming the ship for a section of wall where there had once been a nice big doorway, Keen revved the blasters.<br /><br />The wall was not as holographic as he'd hoped; evidently it was either a very, very advanced piscopetics or someone could afford a few tones of flux metal <i>or</i> someone was way ahead of the game and had developed something entirely new. <i>Everything</i> was pointing to Mort, yet it couldn't be. Either way, Keen had little time to consider this as the ship smashed straight through several feet of wall at high speed, shattering it like opaque glass. Keen himself was flung through the windscreen by the impact, and only the thickness of it (Though weakened of course by the collisions.) coupled with the fact that there was still some wall on it, and Keen's helmet prevented him being ejected entirely. As it was the situation was worse; he was on the nose of an out of control and badly damaged ship. What made it worse was evident just a few seconds later as Keen was tackled trying to renter the ship by an injured and very annoyed DuZweit Keen fled the slash of claws on his back and managed to avoid being bitten, rolling across the nose of the ship as it spiraled lazily into the sky. Grabbing frantically at a piece of protruding scrap Keen kicked at his assailant and eventually managed to dislodge him, sending him plummeting a hundred feet to the ground. Then he slowly fought his way back up toward the cockpit, against the wind, freezing temperatures and decreasing oxygen pressure. As he struggled not to black out only one thought roamed through his mind; 'Why, <i>why</i> does this always happen to me?'<br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10660,
		"title": "dfsojo",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-02-17T06:03:58.000Z",
		"content": "wall?"
	},
	{
		"id": 10661,
		"title": "Say what?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-17T15:10:53.000Z",
		"content": "Eh?<br /><br />Don't tell me people are still looking at this, it's terrible!"
	},
	{
		"id": 10662,
		"title": "Re: Say what?",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-02-17T23:24:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Don't tell me people are still looking at this, it's terrible! [hr][/quote]<br /><br />No its not, its great!<br /><br />---Freeyorp"
	},
	{
		"id": 10663,
		"title": "Re: Say what?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-17T23:38:44.000Z",
		"content": "Well if you want it continued I can, but you're about the only person watching it.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10664,
		"title": "Re: Say what?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-02-20T12:00:26.000Z",
		"content": "I read it for a while, but I got tired of waiting and having to re-read parts to refresh my mind. Sorry. Might give it a shot from the beginning later.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10665,
		"title": "fdso",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-02-24T03:19:35.000Z",
		"content": "arr"
	}
]
