[
	{
		"id": 705,
		"title": "KingsIsle Software",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-08-08T22:10:21.000Z",
		"content": "Has anyone else heard about this new venture of Tom Hall? Or am I behind yet again?-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	},
	{
		"id": 18731,
		"title": "Re: KingsIsle Software",
		"author_id": 1486058,
		"author_name": "BlueIllusionX",
		"timestamp": "2007-08-09T00:28:16.000Z",
		"content": "yea haha we heard about this a while ago. But i haven;t looked into it for a while. I saw a screenshot of what i think is a movie scene of the upcoming game, and it looks so awesome. (could be a movie scene, but with crazy ass game graphics these days, it could be regular game play). <br />Most likely it will be a pay-to-play mmorpg, so im most likely not going to even consider getting it."
	},
	{
		"id": 18732,
		"title": "If: KingsIsle Software could...",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2007-08-09T06:41:08.000Z",
		"content": "Tom Hall could make a new keen game if id Software and KingsIsle Entertainment Inc worked together to make it.<br /><br />Now how to talk id software into doing a new keen game?<br /><br />Just thinking about it like raven software made games with id software.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]"
	},
	{
		"id": 18733,
		"title": "Re: If: KingsIsle Software could...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-09T11:08:45.000Z",
		"content": "Amusing, there's a Josef Hall in KingIsle team too. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Should make a good game with two Halls!<br /><br />Anyways, I haven't heard much about the game they're doing, can someone link those screenshots or something? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
