[
	{
		"id": 1233,
		"title": "Najawa's Avatar:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-17T19:49:45.000Z",
		"content": "Okay; so I was messing around, and came up with a few avatars. I wanted to know which people liked best, and then I could change mine.<br /><br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/Mod.jpg[/img] This is what I have now; \"Tough Guys Wear Pink\"<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/latyvo.jpg[/img] Staring Legolas from Latyvo and my mod we're working on (A big spoiler, but so what?), and those bottles are elvish leap formula<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/KeenFusion.jpg[/img] Kind of random, but cool.<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/KeenX4.jpg[/img] I posted this just in case anybody really liked it.<br /><br />Please do not post frank votes; post what you really like, not what you want me to be stuck with.<br /><br />-- NAJAWA --"
	},
	{
		"id": 27150,
		"title": "Re: Najawa's Avatar:",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-09-18T00:55:56.000Z",
		"content": "Hmm...all the logos look a little like they were done in MS-Paint or something, plus the font looks a bit boring.  Also, you should do the logos at the correct size - you can see that your \"Tough Guys Wear Pink\" logo gets shrunk when it's displayed as an avatar, which makes the writing a bit hard to read.<br /><br />Personally I think the \"Tough Guys Wear Pink\" slogan is amusing, whereas the others are a little bizarre [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   Maybe you could keep the slogan and just pretty up the graphics a bit (maybe have a picture of Keen with a gun, or being attacked, to prove he's tough.)"
	},
	{
		"id": 27151,
		"title": "Re: Najawa's Avatar:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-18T01:33:08.000Z",
		"content": "Use 'Tough guys wear pink' but put a picture of Duke Nukum on it, he wears a pink shirt in his first game too.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 27152,
		"title": "Good Old MS Paint:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-18T03:40:49.000Z",
		"content": "MS Paint; yes!!! What esle do you draw with; MS Paint feels the most comfertable.<br /><br />I guess I never thought of improving what I already have. Maybe I'll change it a bit, and then You can vote again [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] .<br /><br />-- NAJAWA --"
	},
	{
		"id": 27153,
		"title": "Poll; ended!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-18T04:34:12.000Z",
		"content": "This poll is now obsolite: I am now loading a new poll now.<br />(New Avatars)! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 27154,
		"title": "Re: Good Old MS Paint:",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-09-18T06:58:42.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] MS Paint; yes!!! What esle do you draw with; MS Paint feels the most comfertable.[hr][/quote]Wow, I've only ever used MS Paint when I've been forced to use a PC that didn't have anything decent installed on it...<br /><br />For normal painting things Paint Shop Pro used to be good.  The latest versions seem a bit commercial, but if you can find Paint Shop Pro 5 or 7 they're fantastic.  PSP5 is easier to learn if you're used to MSPaint, but it still has advanced features like layers (so you can e.g. have text on the image, but you can move the text around whenever you want without having to redraw the underlying image.)"
	},
	{
		"id": 27155,
		"title": "Re: Good Old MS Paint:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-18T07:20:30.000Z",
		"content": "I use Photoshop, but that's because most of my image-related work involves conversion or scanning in and recolouring drawings. I use a combination of MSPaint and Photoshop for pixel art, because Photoshop's tools make it hard to draw and edit individual pixels by hand.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 27156,
		"title": "Ooo... Recoloring:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-18T13:56:08.000Z",
		"content": "In photoshop; is there a tool to change everything thats one color, into another?<br /><br />I'd also like a program that could have Keen's palate to choose from. So often have I had to open the coustom colors, and get as close as I could before I could draw a certian color (e.g. Bright Red [Lava Red], and Dark Brown [Ash Brown] - They can't be picked off your small normal 16 color palate at the bottom).<br /><br />-- NAJAWA --"
	},
	{
		"id": 27157,
		"title": "Techniques...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-09-18T16:11:53.000Z",
		"content": "[hr]<b>Najawa</b> In photoshop; is there a tool to change everything thats one color, into another?<br />[hr]It's easy enough to do that in Paint:<br /><b>1.</b> Use the eye-dropper to select the colour you want to replace as the background (ie. right mouse button)<br /><b>2.</b> Choose the colour you want to replace it with as the foreground (LMB). <br /><b>3.</b> Select All, Cut<br /><b>4.</b> LMB Fill<br /><b>5.</b> Paste and, if it's not already so, enable transparency<br /><br />[hr]<b>Najawa</b> I'd also like a program that could have Keen's palate to choose from.<br />[hr]This is also easy to emulate in Paint, though it would indeed be nice if 'twere an actual feature.<br /><br /><b>1.</b> Open the tileset belonging to the Keen episode in question (I don't know about Dreams, but Keen:Vorticons and :Galaxy have different shades for most colours.<br /><br /><b>2.</b> Cruise through the bitmap and use the eye dropper to select each 16 colours in turn, drawing a pixel of each in a certain spot. I usually do two rows of eight, surrounded by a white box (as can be seen in the Essence of Mayhem Beta), but it could be more convenient to use a 4x4 box or something.<br /><br /><b>3a.</b> Copy this box into a new bitmap, and save it somewhere convenient. Copy it from here into any bitmaps you're working on in the future, temporarily resizing them if necessary.<br /><br /><b>3b.</b> Once again select each of the colours in turn. For each, select 'Edit Colours...' from the Colours menu. Click 'Define Custom Colours &gt;&gt;' and note the values of Red, Green and Blue. With a few moments' effort, the palette can thus be manually adjusted using the acquired list of RGB values.<br /><br />One of my side projects at the moment is a game art editing utility similar to Paint, but with a more intuitive and streamlined interface. Alas, it remains beyond my coding skill at present, so it'll be a while.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 27158,
		"title": "Re: Good Old MS Paint:",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-18T17:31:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] MS Paint; yes!!! What esle do you draw with; MS Paint feels the most comfertable.[hr][/quote]<br /><br />Pain is about as comfortable as a iron maiden to me.<br />Ouch!<br />I know I got used to it before I had access to something better, but trust me when I say that once you do, you'll realise it's about the worst thing there is. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 27159,
		"title": "Re: Good Old MS Paint:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-18T17:56:05.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]In photoshop; is there a tool to change everything thats one color, into another?[hr][/quote]<br />Photoshop can do anything you could possibly imagine with an image. If you look at [url=http://www.worth1000.com]worth1000.com[/url] (a giant site dedicated to Photshopping competitions), you'll see the sort of things Photoshop is capable of.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 27160,
		"title": "Hehehe",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-18T18:03:58.000Z",
		"content": "Hehehe: Spleen's British!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  \"colour\"<br /><br />*ahem*<br /><br />Yeah, thanks Spleen. That is very helpful.<br /><br />-- NAJAWA --<br /><br />MS-Paint Rocks!!!"
	},
	{
		"id": 27161,
		"title": "Re: Hehehe",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-09-18T19:09:21.000Z",
		"content": "I liked the game face you had earlier.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 27162,
		"title": "Re: Hehehe",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-09-18T20:51:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Hehehe: Spleen's British!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  \"colour\"[hr][/quote]<br />Nope, he's Australian. <i>I'm</i> British, though."
	},
	{
		"id": 27163,
		"title": "Hehe... Oh.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-19T01:11:56.000Z",
		"content": "Well... at least he uses the British spelling. Hehehe!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />Oh, well.<br /><br />Um; the game face is in the new poll; this is the old one!!!<br /><br />-- NAJAWA --"
	},
	{
		"id": 27164,
		"title": "Spellage.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-09-19T01:42:23.000Z",
		"content": "Colour is also the Australian spelling. I do my best to avoid Americanised words.<br /><br />[hr]<b>Retodon</b> I know I got used to it before I had access to something better, but trust me when I say that once you do, you'll realise it's about the worst thing there is. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />[hr]It's the worst thing there is for most endeavours, but when it comes to EGA pixel art, it's the most appropriate interface I've been able to find. For 256-colour stuff, I use The Games Factory's image editing component, and I wish Paint had its right-click colour grabbing and palette display, for starters.<br /><br />I've tried Photoshop and Paint Shop Pro 7-8 (though I'm yet to locate an older version--perhaps one of those will be more comfortable) and I even gave Gimp a shot (then closed and removed it about two minutes later). Nothing I've come across has the right combination of features to fully support oldschool gamedev. If you know of something, lemme know and I'll be all over it.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 27165,
		"title": "Paint:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-19T03:03:30.000Z",
		"content": "MS Paint is very reliable, and easy to use.<br /><br />BTW - Please post any comments in the newer post; I decided to make it into a disscussion, so I could post all the pictures I wanted (within reasonable standards), and have more options.<br /><br />Being American is awesome: We have football - and thus football helmets: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img] . To live in Wisconson is to be a die hard packer fan; Keen wears a packer helmet. Keen is supposed to live in Madison. I live 76 miles from Madison; though, I guess you Europeans don't use miles, so *consults conversion calculator* that'd be 122.310144 kilometers from where we live. Madison is a really cool city; and the only city who's State Capital Building is a replica of the National Capital Building.<br /><br />BTW - If Billy Blaze lives in Madison; doesn't Mort also live there? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] ... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] !!!<br /><br />-- NAJAWA --"
	},
	{
		"id": 27166,
		"title": "Re: Paint:",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-09-19T10:45:46.000Z",
		"content": "Since this thread isn't used for its original purpose anymore anyway...<br /><br />[quote]<b><i>Quote:</i></b>[hr]Nothing I've come across has the right combination of features to fully support oldschool gamedev. If you know of something, lemme know and I'll be all over it.[hr][/quote]<br /><br />Well, what exactly are you looking for? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />I have to admit you need to be careful in selecting the right brush, make it something 1 pixel, fully opaque, but once that's done, you should be all set.<br />I remember fondly the eraser in Pain when wanting to change 1 colour to another all across the image, but Photoshop can do that too, only better (different shaders of the colour(s)).<br />Of course if you don't want better, you need to change the amount of extra shades (there's a nice word for this, but I can't remember) to 0, so you only get that exact colour.<br /><br />Anyway, which features are you looking for?<br />I'd hope that Photoshop is capable of at least everything that Paint is. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 27167,
		"title": "$$$",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-09-19T11:34:53.000Z",
		"content": "I don't have the dough; I have the allowance of an 8th grade boy who's mother gives him $3 an hour to weed, and do other dirty work she wouldn't perfer. I don't mind: I get money; but not enough to get photoshop. I don't really like free programs; and as long as it works. I'll stick with MS Paint.<br /><br />-- NAJAWA --"
	}
]
