[
	{
		"id": 753,
		"title": "Debate on Christianity and w/e else",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-22T22:58:03.000Z",
		"content": "I'm going to take this one step at a time, and edit this post a few times, putting in more points/other stuff or w/e each time. The first part are my points; the second is the evidence that the Bible is a reliable historical record.<br /><br />point #0\" Uh, \"i.e.\" means \"in other words\" and \"e.g.\" means \"for example\". I gotta try to compact my stuff.<br /><br />Point #1: nobody can prove that God does not exist; i.e., the possibility that God exists is always there. This is God we're speculating about--something supernatural--obviously he could hide from us if he wanted to and so we'd have no way of detecting him--we'd have to know everything, which we don't, to prove he doesn't exist.<br /><br />Point #2: if God exists, he could reveal himself to us in someway. How might he reveal himself to us and show he's all powerfer/supernatural/God? The first thing that comes to my mind is...miracles--the supernatural itself. But many scholars and others rule that out from the get go, and thus are flawed. So the point is miracles could happen since God could exist, so don't rule out the supernatural.<br /><br />Point #3: Whichever religion, if any, has the most/greatest evidence for it, (that is, that God did reveal himself there) it is the most reasonable to believe.<br /><br />it gets more technical here, since I define some things. you can skip it if u want; it kinda deals with if what we see is really real or w/e, and also defines facts, since we may not know for sure.<br /><br />Point #4: Some things cannot be proven/known to be absolutely true with no possibility of otherwise, and some things can. E.g., you see your computer screen in front of you, so you know it's there; you've proven it to yourself with certainty. Science is all about what we can measure and see, as far as I know, and so can prove things, but even the laws of science are only good until we find more information that augments them or even does away with them; it has happened before. Why? Because we don't know everything. The thing is, it is still reasonable to act on things we don't know 1000000%. We use technology, so we believe in science/logic right? This is not unreasonable; Though there is always the possibility that something is not what we think, evidence for many things exists.<br />-Yes, this means I can't prove that God exists, as in completely prove/know with no possibility of being wrong. (I corrected myself below on this.) But the argument does not end here because, as point #2 said, if God could exist, he could show us evidence of him/reveal himself. I know of such evidence, which I am going to put in here eventually lol, and so I believe and put my faith in it being true.<br /><br />point #5: When I say \"facts\" i don't necesarily mean what we know absolutely for sure, just what we reasonably know. For example, it is a fact that the Earth is a sphere (or very very close to one if u wanna get that technical), but do we know it certainly? Have you personally proved that and know it's true? Science has proven it; some things we can know for sure, like I was saying in point #4, but if you haven't proven it for yourself, there's still the possibility. My point is it's still reasonable to believe in things you don't know for certain, such as this example. You do it all the time. I trust (most) of what my friends tell me; though I haven't gone out and verified it, it's still reasonable to do under normal circumstances.<br /><br />point #6: Um, some1's proly thinking how they can trust an opinionated source. Well, everyone is opinionated. If you don't believe the Bible, you are opinionated, and likewise if you do. What you can't trust is the prejudiced/biased source (I am still a little unclear on those terms). The source I have is about facts and logic, which is what we have to stick to.<br /><br /><br /><br />Okay, time to get to the evidence. The stuff is so big that I'm just gonna list the sources I have, but I'll make two points since those one's are really brief and easy.<br /><br />[url=http://www.rationalchristianity.net/historical_evid.html]www.rationalchristianity...._evid.html[/url]<br />[url=http://www.carm.org/bible.htm]www.carm.org/bible.htm[/url]<br /><br />-it's a fact that there was a man named Jesus who lived in the first century; there's just too much writing and stuff about him.<br />-the early belivers spread the word even though they faced terrible persecution; i.e. they really had nothing to gain and everything to lose; so they really did believe it at least and weren't trying to deceive.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19661,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-11-22T23:10:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Point # 1: nobody can prove that God does not exist; i.e, the possibility that God exists is always there. This is God we're speculating about--something supernatural--obviously he could hide from us if he wanted to and so we'd have no way of detecting him--we'd have to know everything, whihc we don't, to prove he doesn't exist.[hr][/quote]<br />Excellent example of the [url=http://www.nizkor.org/features/fallacies/burden-of-proof.html]burden of proof[/url] fallacy.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 19662,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-22T23:23:25.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><br />I'm going to take this one step at a time, and edit this post a few times until a bunch of steps are here.<br /><br />Point # 1: nobody can prove that God does not exist; i.e, the possibility that God exists is always there. This is God we're speculating about--something supernatural--obviously he could hide from us if he wanted to and so we'd have no way of detecting him--we'd have to know everything, whihc we don't, to prove he doesn't exist.<br />[hr][/quote]<br /><br />This is true, but you cannot prove that God exists.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Point # 2: if God exists, how might he reveal himself to us and show he's all powerfer/supernatural/God? The first thing that comes to my mind is...miracles--the supernatural itself. But many scholars and others rule that out from the get go, and thus are flawed.<br />[hr][/quote]<br /><br />Okay, point being?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19663,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-11-23T08:06:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Point # 1: nobody can prove that God does not exist; i.e, the possibility that God exists is always there. This is God we're speculating about--something supernatural--obviously he could hide from us if he wanted to and so we'd have no way of detecting him--we'd have to know everything, whihc we don't, to prove he doesn't exist.[hr][/quote]<br />Sure. But unless you initially believe everything you hear this is a lousy position to argue from. Why would a person believe in one god but disbelieve in all the others? It's awfully inconsistent. To paraphrase Dawkins, I could tell you that there's a teapot orbiting the sun, and you couldn't realistically disprove the statement, but you probably wouldn't believe me. Clearly you have some criteria for deciding what to believe, and if \"why not?\" is the best argument you have, then it's pretty clear that your criteria are not at all logical. Going with your gut is a lousy approach to most anything.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19664,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-23T22:26:36.000Z",
		"content": "\"Excellent example of the burden of proof fallacy.\" --Xtra<br />I never claimed that point proved God exists, just that God may exist period.<br /><br />\"This is true, but you cannot prove that God exists.\" --LoG<br />Ugh, gimme some more time to get to that. It might be impossible, but I can show it's very reasonable.<br />\"Okay, point being?\" --LoG<br />point being miracles could happen since God could exist--so evidence that a miracle happened is possible.<br /><br />\"Why would a person believe in one god but disbelieve in all the others?\" --Lemur821<br />because of evidence that this God exists. I'm not there yet lol.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19665,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-11-24T01:06:35.000Z",
		"content": "If you're not \"there\" yet, there was no reason to have posted anything.  You're telling us that there's no way to disprove the existence of God, but the burden of proof rests on you.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 19666,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-24T01:29:02.000Z",
		"content": "What's this miracle you speak of?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19667,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-11-24T04:24:54.000Z",
		"content": "How amazingly perfect women are?------------------<br />[url=http://www.szevvy.net]www.szevvy.net[/url], for all your Wombat needs.  You know you want to.<br />A member of the LevelLord fan club."
	},
	{
		"id": 19668,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-11-24T09:41:26.000Z",
		"content": "These two quotes pretty much sum up every argument from either side of this debate:<br />[quote]<b><i>Quote:</i></b>[hr]Point # 1: nobody can prove that God does not exist;[hr][/quote][quote]<b><i>Quote:</i></b>[hr]This is true, but you cannot prove that God exists.[hr][/quote]<br /><br />Wash, rinse, repeat."
	},
	{
		"id": 19669,
		"title": "Re: re:",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-24T11:31:19.000Z",
		"content": "True. The fact is, he exists for the ones who believe in him, and he doesn't exist for the ones who don't believe in him. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 19670,
		"title": "Re: re:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-24T16:01:05.000Z",
		"content": "DaVince just stated the only truth in this debate.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19671,
		"title": "Re: Yay.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-11-24T20:50:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]point being miracles could happen since God could exist--so evidence that a miracle happened is possible.[hr][/quote]I'm fairly sure that proving that God caused the miracle to happen is impossible. Since there is no way to prove or disprove the existence of God or his influence on anything else, this debate cannot go anywhere at all - except possibly into a downward spiral towards a flamewar. Yay!"
	},
	{
		"id": 19710,
		"title": "fsd",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-11-24T21:42:12.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]DaVince just stated the only truth in this debate.[hr][/quote]<br /><br />Nono.  The fact is, he <i>doesn't</i> exist for the ones who believe in him, and he <i>does</i> exist for the ones who <i>don't</i> believe in him!"
	},
	{
		"id": 19672,
		"title": "Re: Yay.",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-11-24T21:59:10.000Z",
		"content": "Lol!<br />   I could always say, 'You idiots, it's an easy question, of course he exists!' but I would be lying.  If it was an easy question, then there would be a chance that these threads would turn into something other than flame wars.<br />  I personally don't think there is any 'absolute proof' of the existence of God, because, if that were the case, faith would be irrelevant, and that's one of the more important aspects of Christianity."
	},
	{
		"id": 19673,
		"title": "Re: Yay.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-11-24T22:16:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Nono. The fact is, he doesn't exist for the ones who believe in him, and he does exist for the ones who don't believe in him![hr][/quote]<br /><br />Well, KeenEmpire, actually... Nothing would exist if you don't believe it exists. I believe about everything is based on perception, and who knows if this is the same for everyone or differs on what people believe that they see? Believe in God came forth out of things that were not so believable for people, so they had a reason to believe it happened.<br /><br />Yeah, call me weird. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 19675,
		"title": "Meer a cools.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-11-24T22:38:46.000Z",
		"content": "[hr]<b>Grafix</b> I'm fairly sure that proving that God caused the miracle to happen is impossible.<br />[hr]The interesting thing about miracles, is we get so hung up on the \"God did it\" vs \"There's a scientific explanation for everything\". Wouldn't it be more interesting to work out how to repeat the miracle? After all, didn't Jesus promise Greater things than I do shall you also do?"
	},
	{
		"id": 19674,
		"title": "dsflk",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-11-24T22:57:49.000Z",
		"content": "My reasoning is more elegant.  It's a simple application of Murphy's Law."
	},
	{
		"id": 19676,
		"title": "Existance...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-11-24T23:03:29.000Z",
		"content": "Well, how can you prove that God exists if there is always the possibility that we don't even exist. Wasn't that the point of the Matrix (I don't really know, I've never actually bothered to watch it.)<br />I mean, how can I even know that any of you exist? When your dreaming, people seem to think for themselves (usually), but they don't actually exist, do they? (of course, now we might get into a debate on whether or not dreams are real, or whatever.)<br /><br />As for me, I believe in God, but there's still that chance that there is no such thing. We really don't know.<br /><br />Even after we die, and we suddenly know everything or whatever happens, we still can't really be 100% convinced that anything exists. I'm not sure if anything at all can have any proof at all of existance. Its just a matter of faith, really.<br /><br />(And I should probably read over all of this before posting... probably makes no sense at all. Oh well.)-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 19677,
		"title": "ds",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-11-24T23:10:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]After all, didn't Jesus promise Greater things than I do shall you also do? [hr][/quote]<br /><br />I wish, but unfortunately:<br /><br />[quote]<b><i>Quote:</i></b>[hr]John 12 : 14 Most certainly I tell you, he who believes in me, the works that I do, he will do also; and he will do greater works than these, because I am going to my Father.[hr][/quote]<br /><br />And,<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>and greater works than these shall he do;</i><br />meaning, not greater in nature and kind, but more in number; for the apostles, in a long series of time, and course of years, went about preaching the Gospel, not in Judea only, but in all the world; \"God also bearing them witness with signs and wonders, and divers miracles and gifts of the Holy Ghost\", (Hebrews 2:4) , wherever they went: though perhaps by these greater works may be meant the many instances of conversion, which the apostles were instrumental in, and which were more in number than those which were under our Lord's personal ministry: besides, the conversion of a sinner is a greater work than any of the miracles of raising the dead... for this includes in it all miracles: here we may see a sinner, dead in trespasses and sins, quickened; one born blind made to see; one who was deaf to the threatenings of the law, and to the charming voice of the Gospel, made to hear, so as to live; and one that had the spreading leprosy of sin all over him, cleansed from it by the blood of the Lamb yea, though a miracle in nature is an instance and proof of divine power, yet the conversion of a sinner, which is a miracle in grace, is not only an instance of the power of God, and of the greatness of it, but of the exceeding greatness of it: and the rather one may be induced to give in to this sense of the passage, since it is added, as a reason, [hr][/quote]<br /><br />From [url=http://fotfforums.org/fusetalk/forum/messageview.cfm?catid=13&threadid=1244&enterthread=y]fotfforums.org/fusetalk/f...erthread=y[/url]"
	},
	{
		"id": 19678,
		"title": "l",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-11-25T22:54:26.000Z",
		"content": "I know someone who knows someone whose brother knows someone that has an uncle that went to heaven, and he said that God does exist.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 19679,
		"title": "Re: l",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-30T23:50:48.000Z",
		"content": "Just because God doesn't exist doesn't mean He isn't real. Fuck, if He existed, then you wouldn't need \"faith\" to believe in Him, and suddenly a lot of religious people would lose faith BECAUSE THEY DIDN'T NEED IT ANYMORE. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 19680,
		"title": "Re: l",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-12-02T05:02:44.000Z",
		"content": "Okay, I have finally updated the first post. Below I have commented/debated on a lot of, um, comments, since we are debating.<br /><br />\"This is true, but you cannot prove that God exists.\" --LoG<br />true; what i claim is that Christianity is the most reliable religion, since it has the most evidence for it.<br /><br />\"Clearly you have some criteria for deciding what to believe\" --Lemur821<br />Yes, I do have criteria, just like archealogists and histroians and scientists do.<br /><br />\"It might be impossible, but I can show it's very reasonable.\" --MiB (yes, that's me)<br />Correction: it is impossible. I'll leave the mistake there so no1 thinks im hiding my mistake or w/e.<br /><br />\"What's this miracle you speak of?\" --LoG<br />The one's in the Bible, especially Jesus raised from the dead and the fulfilled Old Testament Messianic prophecy, written many years before Jesus' birth, and especially the ones about his time/place/manner of birth, which no one could control (unless he's God).<br /><br />\"These two quotes pretty much sum up every argument from either side of this debate: Quote:Point # 1: nobody can prove that God does not exist; Quote:This is true, but you cannot prove that God exists. Wash, rinse, repeat.\"<br />Good point. Those two quotes are true. However, nothing can be absolutely proven without a doubt, not even science. The laws we have now are only good until we discover something extra that augments them or even does away with them. Why? Because we don't know everything. The point is it is still reasonable to believe and act on things that you don't absolutely know are true. You use technology don't you, so you believe in science/logic right? This is not unreasonable. There is more about this in my fourth point.<br /><br />\"The fact is, he exists for the ones who believe in him, and he doesn't exist for the ones who don't believe in him.\" --Davince<br />That is subjectively true. Objectively, however, that whole statement is impossible to be true, since the two parts are in conflict with one another. The point of a debate is to be objective.<br /><br />\"DaVince just stated the only truth in this debate.\" --LoG<br />Didn't we all admit that my first point was true too?<br /><br />\"I'm fairly sure that proving that God caused the miracle to happen is impossible. Since there is no way to prove or disprove the existence of God or his influence on anything else,\" --Grafix<br />I admit, that one's got me thinking. My reasoning is that if God claimed it was him, and it's a miracle, well it's reasonable to think it's him then.<br /><br />\"I personally don't think there is any 'absolute proof' of the existence of God, because, if that were the case, faith would be irrelevant, and that's one of the more important aspects of Christianity.\" --narnia4<br />right. Again my goal is not to prove, like science proves things, but to show the Bible is the most reliable, since it has the most evidence for it.<br /><br />\"Nothing would exist if you don't believe it exists. I believe about everything is based on perception, and who knows if this is the same for everyone or differs on what people believe that they see?\" --DaVince<br />I'll talk about this kinda thing below. But I'll answer that question here, the one that says, \"who knows...\" Because people are in agreement in what they see and communicate it to other people so they know they're in agreement and see the same thing, or at least is very likely.<br /><br />\"The interesting thing about miracles, is we get so hung up on the \"God did it\" vs \"There's a scientific explanation for everything\" Wouldn't it be more interesting to work out how to repeat the miracle?\" --Commander Spleen<br />I define a miracle as something with no scientific explanation, or at least that's part of the definition. Again, if it's possible that God exists, then this sort of miracle is possible. (if you wanna talk about mircales with another definition that's fine, but i'm just saying what i mean).<br /><br />\"Well, how can you prove that God exists if there is always the possibility that we don't even exist.\" --Genius314<br />Um, it is a fact that we exist. I mean, something must exist right? You eat food and type responses on the Keen community, so u must believe something exists. This is what science is all about, about what we can see exists; it doesn't worry about if everything is an illusion (as far as I know); either way, something must exist if you are experiencing an illusion.<br />Think of it this way: do facts exist? if you say no, well, then it would have to be a fact that facts don't exist, which is self-defeating. Same thing with relativism: \"All truth is relative\" is self defeateing for the same reason.<br /><br />\"I mean, how can I even know that any of you exist?\" ... \"As for me, I believe in God, but there's still that chance that there is no such thing. We really don't know. Even after we die, and we suddenly know everything or whatever happens, we still can't really be 100% convinced that anything exists. I'm not sure if anything at all can have any proof at all of existance. Its just a matter of faith, really.\" --Grafix<br />Okay, I see what you're saying. I can't be sure that you really exist either. I could be in the Truman show! But I can say it's reasonable to belive you exist. Like I said earlier, you gotta believe something. Like you eat food so you believe you gotta nurish your body. There is always a chance it's not what you think, but like it or not, we have to make decisions without knowing absolutely everything.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19681,
		"title": "Re: l",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-12-02T05:16:34.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>Svev</b>[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-annoyed.gif[/img]:\"&gt;  How amazingly perfect women are? <br />[hr][/quote]<br /><br />Women are not perfect by any sense of the imagination.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"This is true, but you cannot prove that God exists.\" --LoG<br />true; what i claim is that Christianity is the most reliable religion, since it has the most evidence for it.<br />[hr][/quote]<br /><br />That's not really true.  Even so, science should not validate religion, and religion should not validate science.  Cluttering up these two concepts is a bad thing.<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"What's this miracle you speak of?\" --LoG<br />The one's in the Bible, especially Jesus raised from the dead and the fulfilled Old Testament Messianic prophecy, written many years before Jesus' birth, and especially the ones about his time/place/manner of birth, which no one could control (unless he's God).<br />[hr][/quote]<br /><br />Well, that's is not historically provable.  The Bible is a secondary source, and anything in the Bible cannot be used as historical fact without corroborating evidence.<br /><br />Secondly, don't you find this to be slightly like shooting an arrow and then painting a target around where it hit?  Isn't it just as plausible that Jesus just took the prophecy in his own hands and stated he was the Messiah?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"DaVince just stated the only truth in this debate.\" --LoG<br />Didn't we all admit that my first point was true too?<br />[hr][/quote]<br /><br />I don't like debating religion.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"I personally don't think there is any 'absolute proof' of the existence of God, because, if that were the case, faith would be irrelevant, and that's one of the more important aspects of Christianity.\" --narnia4<br />right. Again my goal is not to prove, like science proves things, but to show the Bible is the most reliable, since it has the most evidence for it.<br />[hr][/quote]<br /><br />Then do that first, please.  The burden of proof lies on you.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19682,
		"title": "Re: l",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-12-02T10:11:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]My reasoning is that if God claimed it was him, and it's a miracle, well it's reasonable to think it's him then.[hr][/quote]<br />This is, of course, fair enough. However, there is always the possibility that a \"miracle\" could be faked by pranksters with enough spare cash lying around; a scenario I once heard of was a rumoured US military plan to project a giant image of Allah above Baghdad and tell the Iraqis to stop fighting. (Anyone who knows even the slightest thing about Islam could tell you this would have been a stupid idea - the Koran explicity states that Allah never appears in a visible form, apart from through a prophet)[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 19683,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-12-02T14:15:00.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]\"This is true, but you cannot prove that God exists.\" --LoG<br />true; what i claim is that Christianity is the most reliable religion, since it has the most evidence for it.[hr][/quote]<br />Want to back up that claim?"
	},
	{
		"id": 19684,
		"title": "Re: re:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-03T12:51:46.000Z",
		"content": "I second that request but on the other hand:<br /><br />[quote]<b><i>Quote:</i></b>[hr]Well, that's is not historically provable. The Bible is a secondary source, and anything in the Bible cannot be used as historical fact without corroborating evidence.[hr][/quote]<br />This is not true. While always at least a secondary source some books are very reliable as historical sources and are taken to be true without almost any corrobating evidence. Examples are:<br />Samuel, Kings, chronicles, maccabees 1, 2.<br />Let's not forget that all written historical sources are secondary-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19685,
		"title": "Re: re:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-12-03T16:30:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />This is not true. While always at least a secondary source some books are very reliable as historical sources and are taken to be true without almost any corrobating evidence. Examples are:<br />Samuel, Kings, chronicles, maccabees 1, 2.<br />Let's not forget that all written historical sources are secondary<br />[hr][/quote]<br /><br />Not true, either.  In order for them to be considered historical, they need to either have corroborating evidence, or they need to cite primary sources.<br /><br />You cannot simply state that \"Well, Bob the great mass murdered a millions Germans and rose them from the dead 3 days later in 1977, so I have been told.\" and call it history.  There needs to be something supporting it.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19686,
		"title": "Re: re:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-03T16:42:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Not true, either. In order for them to be considered historical, they need to either have corroborating evidence, or they need to cite primary sources.[hr][/quote]<br />Obviously you have no idea what primary sources are. And you also do not seem to know that the mentioned Bible books are for the larger part taken as historical accurate. Whatever you like it or not.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You cannot simply state that \"Well, Bob the great mass murdered a millions Germans and rose them from the dead 3 days later in 1977, so I have been told.\" and call it history. There needs to be something supporting it[hr][/quote]<br />Your example is dumb.<br /><br />When the Bible says that somebody is struck by God you can not say he is, what you can say is that he died. Ever heard of figure of speech? Leave it out and large parts of the bible are historical accurate. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19687,
		"title": "Re: re:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-12-03T23:40:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b></b><br />Obviously you have no idea what primary sources are. And you also do not seem to know that the mentioned Bible books are for the larger part taken as historical accurate. Whatever you like it or not.<br />[hr][/quote]<br /><br />Obviously, you do not know the proper course of argumentation, which is \"claim-&gt;proof-&gt;conclusion\", and not \"claim\".<br /><br />Making a quick jab claim is negligable if you do not cite why I am wrong.  (Which is probably because you <i>can't</i> prove that I do not know what one is, mainly because I do.)<br /><br />Secondly, whether or not the books of the Bible are considered accurate has no bearing on whether or not it is a historical document that is usable for evidence.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Your example is dumb.<br />[hr][/quote]<br /><br />What a wonderful commentary.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />When the Bible says that somebody is struck by God you can not say he is, what you can say is that he died. Ever heard of figure of speech? Leave it out and large parts of the bible are historical accurate. [hr][/quote]<br /><br />You cannot prove that it was a figure of speach or he actually was crazy and thought God struck him down.  Once again, things ambigious like that are not good for historical evidence of things occuring.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19688,
		"title": "Re: re:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-04T11:16:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Obviously, you do not know the proper course of argumentation, which is \"claim-&gt;proof-&gt;conclusion\", and not \"claim\".[hr][/quote]<br />I'm not making any claims myself. The general historical view is that parts of the bible are usufull as historical sources. Your request that I need to prove that claim is insane, it would take months (if not longer) to gather all information and provide it to you. Your lack of knowledge of how history works doesn't make the situation better. I'd rather suggest you read yourself in. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Making a quick jab claim is negligable if you do not cite why I am wrong. (Which is probably because you can't prove that I do not know what one is, mainly because I do.)[hr][/quote]<br />You're argumentation is wrong in origin because you don't know fundemental termd like what a primair and secondair sources are but you still use them. <br />But go ahead make me laugh and explain what they mean.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Secondly, whether or not the books of the Bible are considered accurate has no bearing on whether or not it is a historical document that is usable for evidence.[hr][/quote]<br />It does because collobarting source are so rare.<br /><br />[quote]<b><i>Quote:</i></b>[hr]What a wonderful commentary.[hr][/quote]<br />And so true.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You cannot prove that it was a figure of speach or he actually was crazy and thought God struck him down. Once again, things ambigious like that are not good for historical evidence of things occuring.[hr][/quote]<br />He couldn't think that because he was dead.<br /><br />Aside from this lame joke, no you can't prove that but that doesn't matter. If the source is reliable you can say that the person died. With detailed records like the Bible book kings you can even date certain rulers which otherwise would have been impossible.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19689,
		"title": "Re: re:",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-12-06T00:58:22.000Z",
		"content": "-Wait, wait, guys, nobody seemed to see what I said on my last post, \"Okay, I have finally updated the first post.\" My argument for the reliability of the Bible is there, and *yes I know the burden of proof lies with me*. It is really just 2 websites that have a whole lot of stuff about that. I could have quoted them/copy/paste but there is a whole lot and these topics don't need to be any bigger than they naturally are.<br /><br />\"Even so, science should not validate religion...\" -LoG<br />What science can validate is that a document, such as the Bible, is either reliable or not. And if it does show it is so, then this religion is true or you don't believe in science. You might wonder how science can validate a non-scientific thing (mircales) lol; it can't, at least not like it validates other stuff, but if it's a reliable record that the tomb was empty and that people saw Jesus again (all physical things), then the most likely conclusion is that the Bible is true about that point.<br /><br />\"Secondly, don't you find this to be slightly like shooting an arrow and then painting a target around where it hit? Isn't it just as plausible that Jesus just took the prophecy in his own hands and stated he was the Messiah?\" -LoG<br />I'm not sure what you meant by \"took the prophecy in his own hands\" except that he did things that were prophesied, such as drove out people from the temple or w/e (not sure if that was prophesied), and then claimed he was Messiah since he fulfilled it. Well, this is certainly possible, but there are a lot of prophesies (somewhere around 300 i think); plus, who has control of the time that they're born, or their lineage? Nobody can fake that, and these were prophesied as well.<br /><br />\"However, there is always the possibility that a \"miracle\" could be faked by pranksters with enough spare cash lying around;\" -Grafix<br />Yeah i know, but there were a lot of miracles, such as healings, which must be very hard to fake. Still, I'll give you that there's always the possibility, but in light of all the evidence, it is reasonable to believe what the Bible claims.<br /><br />\"Examples are:<br />Samuel, Kings, chronicles, maccabees 1, 2.\" -Djaser<br />What is maccabees? I've never heard it b4; maybe it goes by another name in the US.<br /><br />\"Secondly, whether or not the books of the Bible are considered accurate has no bearing on whether or not it is a historical document that is usable for evidence.\" -LoG<br />I don't see how that is true at all. What is your reasoning behind this? Did u mean \"accurate\" in some other way?- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19690,
		"title": "re:",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-12-06T02:30:55.000Z",
		"content": "\"What is maccabees? I've never heard it b4; maybe it goes by another name in the US.\"<br /><br />I believe that most protestant bibles are abridged somewhat. Maccabees 1 and 2 fall just before the wisdom books."
	},
	{
		"id": 19691,
		"title": "Re: re:",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-06T08:50:37.000Z",
		"content": "Indeed, not every bible has them, a pity because they are great books. You can find more on info about them on wikipedia under the same name.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19692,
		"title": "Re: re:",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-12-06T19:47:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What science can validate is that a document, such as the Bible, is either reliable or not. And if it does show it is so, then this religion is true or you don't believe in science.[hr][/quote]Slight problem: the Bible was written by lots of different people, some of whom were only scribes for the people who witnessed the events; it was also translated by lots of different people, who had many different political motivations and weren't necessarily accurate even if they didn't have said motivations. The Bible you read is a fair way from the Bible that was written thousands of years ago - not that some people seem to have noticed:<br />[quote]<b><i>Quote:</i></b>[hr]<b>Taken from <i>[url=http://www.eurozine.com/articles/2005-10-07-bloom-en.html]www.eurozine.com/articles...om-en.html[/url]</i>:</b><br />Two days ago in the New York Times, someone wrote about a woman who was the governor of Texas and whom everyone called Ma Ferguson, and she said that nowhere in Texas is there any language other than English to be taught. And she said: \"If English is good enough for Jesus Christ, then it's good enough for us.\"[hr][/quote]This is, of course, an example of a person who does not see the necessity of a debate because they believe they are always right - so it doesn't really apply here. I just included it for the humour value :P<br />[quote]<b><i>Quote:</i></b>[hr]I'm not sure what you meant by \"took the prophecy in his own hands\"[hr][/quote]Basically, it means that he took responsibilty for an event that had already occured through no action of his own.<br />[quote]<b><i>Quote:</i></b>[hr]Yeah i know, but there were a lot of miracles, such as healings, which must be very hard to fake.[hr][/quote]Not if the person was already well and only pretending to be sick.<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 19693,
		"title": "Re: Reason",
		"author_id": 1486882,
		"author_name": "Edh Thorn",
		"timestamp": "2006-12-12T23:08:47.000Z",
		"content": "Ok, let's look at this reasonably. . .<br /><br />Definition of Religion:<br />  \"The outward act or form by which men indicate their <br />recognition of the existence of a god or of gods having power over their destiny, to whom obedience, service, and honor are due;\"<br /><br />The first question we have to answer, then, is this:  <i>Is</i> there a God (or gods)?  If there is no god at all, then there is no need for any religion (because all religions have at least one god).<br /><br />After we answer this question, we can move on to the question of which religion is the most reasonable."
	},
	{
		"id": 19694,
		"title": "Re: Reason",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-12-16T16:08:08.000Z",
		"content": "Wow... Djaser actually made me laugh with that last post of his.<br /><br /><br />Well, if you're view of debating is \"I'm too lazy to prove that I'm wrong, because I have no idea what I'm talking about\" then go ahead and debate that way Djaser.  But, I'm done here.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19695,
		"title": "Re: Reason",
		"author_id": 1486882,
		"author_name": "Edh Thorn",
		"timestamp": "2006-12-17T01:00:00.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Edh Thorn:</i><br />Ok, let's look at this reasonably. . .[hr][/quote]<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img] <br />Actually, I must take that back; that approach is incorrect.  There is no way to use human reasoning to find the truth.  Since every person in the entire world is naturally against God and \"altogether become filthy,\" there is no way to determine if God exists using our own reasoning:  for it will naturally be flawed.  For<br />[quote]<b><i>Quote:</i></b>[hr]<i>Romans 3:10-18</i><br />  10 As it is written, There is none righteous, no, not one: <br />  11 <b>There is none that understandeth, there is none that seeketh after God.</b><br />  12 <b>They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one. </b><br />  13 Their throat is an open sepulchre; with their tongues they have used deceit; the poison of asps is under their lips: <br />  14 Whose mouth is full of cursing and bitterness: <br />  15 Their feet are swift to shed blood: <br />  16 Destruction and misery are in their ways: <br />  17 And the way of peace have they not known: <br />  18 There is no fear of God before their eyes.[hr][/quote]<br />And also,<br />[quote]<b><i>Quote:</i></b>[hr]<i>Psalm 14:1</i><br />The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good. [hr][/quote]<br />Thus, if we begin as a fool by saying there is no God, we will get nowhere because foolishness will naturally follow:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Proverbs 12:23</i><br />A prudent man concealeth knowledge: <b>but the heart of fools proclaimeth foolishness.</b> [hr][/quote]<br />The following also eliminates any possibility of multiple gods:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Isaiah 45:5-6</i><br /><b>I am the LORD, and there is none else, there is no God beside me:</b> I girded thee, though thou hast not known me: <br />  6 That they may know from the rising of the sun, and from the west, that there is none beside me. I am the LORD, and there is none else. [hr][/quote]<br />How do we know that the Bible is true?  Well, it was written by the One that never lies:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Titus 1:2</i><br />. . .In hope of eternal life, which <b>God, that cannot lie,</b> promised before the world began;[hr][/quote]<br />But how do we know that God wrote the Bible?<br />[quote]<b><i>Quote:</i></b>[hr]<i>II Timothy 3:16</i><br /><b>All scripture is given by inspiration of God,</b> and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:[hr][/quote]<br />How do we know that we aren't missing some ancient parts of the Bible?  How de we know that some parts weren't incorrectly added and thus can't really be termed \"scripture\"?  I really do not know; and I'm not sure anyone does.  But what we do know is this:  God will use His Word in the way He chooses, whether as a \"stumblingblock\" to the unbelievers or to teach \"Christ the power of God, and the wisdom of God\" to those whom He has chosen to save:<br />[quote]<b><i>Quote:</i></b>[hr]<i>I Peter 2:7-8</i><br />7  Unto you therefore which believe he is precious: but unto them which be disobedient, the stone which the builders disallowed, the same is made the head of the corner, <br />8  And a stone of stumbling, and a rock of offence, even to them which stumble at the word, being disobedient: <b>whereunto also they were appointed.</b> <br />[hr][/quote]<br />Thus, the debate about how reliable the Bible is will not really get anywhere, IMO, because what some might take as \"historical\" fact, others might say is untrue; and the discussion can go on and on. . .  The fact of the matter is that the Bible is true no matter how many people deny it -- and no-one can prove otherwise!  Yes, I know, just because you cannot prove something false, this does not neccessarily make it true.  <br /><br />However, the truth of the Word of God does not depend on whether or not you believe it or whether or not someone can prove it.  After all, a blind person might argue that the sun does not shine (or exist) because he cannot see any effects from it, but that does not make it true. . .  So with the Bible, we all are spiritually blind and cannot see:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Isaiah 6:9-10</i><br />9  And He said, Go, and tell this people, Hear ye indeed, but understand not; and see ye indeed, but perceive not. <br />10 Make the heart of this people fat, and make their ears heavy, and shut their eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed. <br /><br />[Not surprisingly, then. . .]<br /><i>Isaiah 59:10</i><br />We grope for the wall like the blind, and we grope as if we had no eyes: we stumble at noonday as in the night; we are in desolate places as dead men.<br /><br />[And only God can open the eyes of the blind:]<br /><i>Psalm 146:8</i><br />The LORD openeth the eyes of the blind: the LORD raiseth them that are bowed down: the LORD loveth the righteous:<br /><br />[Only God can save us:]<br /><i>John 14:6</i><br /><b>Jesus saith unto him, \"I am the way, the truth, and the life: no man cometh unto the Father, but by Me.</b>\"[hr][/quote]<br />My point is, the whole argument of whether the Bible is true (or reliable or w/e) cannot be determined by using our own standards or logic.  We can continue coming to it with our own reasoning (i.e. \"I can't see God; how do I know the Bible was really written by Him; maybe the whole book is just a pack of fables. . .\"), but this -- as I have shown the Bible indicates -- will not lead to the truth.  Now all this may sound un-reasonable to us, but that's no surprise:<br />[quote]<b><i>Quote:</i></b>[hr]<i>I Corinthians 2:14</i><br />But the natural man receiveth not the things of the Spirit of God: <b>for they are foolishness unto him: neither can he know them, because they are spiritually discerned.</b>[hr][/quote]<br /><br />Only God can convince someone of the truth:  only God can open our eyes."
	},
	{
		"id": 19696,
		"title": "Re: Reason",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-18T16:53:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Wow... Djaser actually made me laugh with that last post of his.<br /><br /><br />Well, if you're view of debating is \"I'm too lazy to prove that I'm wrong, because I have no idea what I'm talking about\" then go ahead and debate that way Djaser. But, I'm done here. [hr][/quote]<br />edit: nice, but before you run away like a coward (not answering important questions, that precisely what you're doing) I want to know the following: In this topic every post of you is filled with annoying arrogance, Your 'I know what I'm talking about and you don't attitude'. It gives me a certain impression of you and I would like to know if I'm right. I want to know from you what gives you the arrogance to claim that your an authority on this subject, please include in your education + grade in your answer.<br /><br />And afterwards, please choke in it, I mean that.<br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19697,
		"title": "Re: Reason",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-12-25T05:01:17.000Z",
		"content": "\"Slight problem: the Bible was written by lots of different people, some of whom were only scribes for the people who witnessed the events; it was also translated by lots of different people, who had many different political motivations and weren't necessarily accurate even if they didn't have said motivations. The Bible you read is a fair way from the Bible that was written thousands of years ago\" -Grafix<br />-No, this isn't true because of the following facts:<br />-We have over 5,000 Greek (the original language the NT was written in) manuscripts today. This is way more than any other ancient manuscript of any work. The closest thing we have to it is the Iliad wih over 600.<br />-This means we can cross-check them 4 accuracy. The textual accuracy of the NT has been calculated at 99.5%. The whole Bible's accuracy is somewhere around 98.5% if I remember correctly.<br />-there's also over 19,000 copies in Syriac, Latin, Coptic, and Aramic.<br />-So there's no way that the Bible is a fair way from what it originally was.<br /><br />\"Not if the person was already well and only pretending to be sick.\" -Grafix<br />-Yeah, but a good deal of these people could not have been, like those blind/lame from birth or that one guy with the shrivled hand, not to mention those people who were raised from the dead...<br /><br />\"The first question we have to answer, then, is this: Is there a God (or gods)? If there is no god at all, then there is no need for any religion (because all religions have at least one god).<br />After we answer this question, we can move on to the question of which religion is the most reasonable.\" -Edh Thorn<br />-So how do you propose we go about investigating if there is a God? My approach to this is that the Bible proves that God exists (or at least is very reasonable) because it records his revealing of himself and miracles accurately and reliably.<br /><br />\"Actually, I must take that back; that approach is incorrect. There is no way to use human reasoning to find the truth.\" -Edh Thorn<br />-I disagree. You say not to look at it reasonably? Didn't u just try to reason with me throughout your post that I was wrong?<br />-I do agree with you that human kind can't find the true moral way on their own, but people can certainly figure out many other things. God has brought his Word into being in such a way that it's reliability is scientifically ascertainable, as I have been trying to show.<br />-Throughout your post, you are using circular reasoning, which is not really reasoning. E.g., you ask how we know it is written by God, and then u quote the passage saying that scripture is inspired. All you've done there is show that the Bible claims it is written by God. No one should believe something just from a claim. Think about this: if you were born into a a family that believes in another religion, how would u know it was false? by looking at it objectively and seeing what evidence it has, just like I've been. U just have to have reason to figure out what's reasonable and not.<br /><br />\"Thus, the debate about how reliable the Bible is will not really get anywhere, IMO, because what some might take as \"historical\" fact, others might say is untrue; and the discussion can go on and on. . .\" -Edh Thorn<br />-It indeed may not get anywhere. My objective here is not to convince anyone, since that lies within the individual, but to show how and why the Bible is trustworthy. If anyone accepts it or rejects it, I can ultimately do nothing about it since that is their choice, and so like I said I'm not trying to convince anyone in that sense.<br /><br />\"My point is, the whole argument of whether the Bible is true (or reliable or w/e) cannot be determined by using our own standards or logic.\" -Edh Thorn<br />-Well again, I disagree. It has already been done (note, that doesn't mean everyone's accepted/believed it) and I'm just trying to relay it. Hasn't anyone checked out the sites I listed in the OP?<br /><br />\"Only God can convince someone of the truth: only God can open our eyes.\" -Edh Thorn<br />-Okay this i agree with; i hope u dont' see me as trying to take God's place, though I am hoping that He'll use me here. I'm sure u won't disagree that God has used many people b4 and that they weren't wrong for going out and preaching or w/e. I have verses to back up my position as well:<br />2 Corinthians 10:4-5,  2 Timothy 4:2 (these show that we should still preach, since u seemed to indicate that we shouldn't need to do this cuz God can do it or w/e)<br />Hebrews 11:6,  Matthew 7:7-8,  Jeremiah 29:13,  Proverbs 8:1-11 (these is to show that we should still seek him even though we are flawed)<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19698,
		"title": "Re: Reason",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-12-25T09:51:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]-No, this isn't true because of the following facts:<br />-We have over 5,000 Greek (the original language the NT was written in) manuscripts today. This is way more than any other ancient manuscript of any work. The closest thing we have to it is the Iliad wih over 600.<br />-This means we can cross-check them 4 accuracy. The textual accuracy of the NT has been calculated at 99.5%. The whole Bible's accuracy is somewhere around 98.5% if I remember correctly.<br />-there's also over 19,000 copies in Syriac, Latin, Coptic, and Aramic.<br />-So there's no way that the Bible is a fair way from what it originally was.[hr][/quote]<br />Nevertheless the Bible was written by different persons years after the original events happened and used different sources so that end result became a compilation.<br /><br />[quote]<b><i>Quote:</i></b>[hr]-So how do you propose we go about investigating if there is a God? My approach to this is that the Bible proves that God exists (or at least is very reasonable) because it records his revealing of himself and miracles accurately and reliably.[hr][/quote]<br />How are his revealings and miracles accurate and reilable?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19699,
		"title": "Re: Reason",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-12-31T06:07:51.000Z",
		"content": "The part that Mort is ignoring is that many different, and contradicting, writers wrote about the events of the Gospels around 200 years after i happened.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19700,
		"title": "Re: Reason",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-01-02T01:13:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />nice, but before you run away like a coward (not answering important questions, that precisely what you're doing) I want to know the following: In this topic every post of you is filled with annoying arrogance, Your 'I know what I'm talking about and you don't attitude'. It gives me a certain impression of you and I would like to know if I'm right. I want to know from you what gives you the arrogance to claim that your an authority on this subject, please include in your education + grade in your answer.<br /><br />And afterwards, please choke in it, I mean that.<br />[\\quote]<br /><br />Run away like a coward?  Jesus, you goat, you are the one who will not defend their own claims.  If you cannot even support your own argument then it is you, Djas, that are the annoying one.<br /><br />You know what debaters do with unsubstantiated claims?  We piss on them, because that's about all you can do with them.<br /><br /><br />As for stating that I'm an authority on the subject, I think you're suffering from some form of a delusion.<br /><br />Defend of retract you[hr][/quote]~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19701,
		"title": "Re: Reason",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-02T11:18:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Run away like a coward? Jesus, you goat, you are the one who will not defend their own claims. If you cannot even support your own argument then it is you, Djas, that are the annoying one.<br /><br />You know what debaters do with unsubstantiated claims? We piss on them, because that's about all you can do with them.<br /><br /><br />As for stating that I'm an authority on the subject, I think you're suffering from some form of a delusion.<br /><br />Defend of retract your[hr][/quote]<br />You still haven't answered my questions in my last two posts.<br />And you're very short of memory:<br />[quote]<b><i>Quote:</i></b>[hr]Making a quick jab claim is negligable if you do not cite why I am wrong. (Which is probably because you can't prove that I do not know what one is, mainly because I do.)[hr][/quote]<br />Yet even in this post you're arrogant attitude continues:<br />[quote]<b><i>Quote:</i></b>[hr]You know what debaters do with unsubstantiated claims? We piss on them, because that's about all you can do with them.[hr][/quote]How this attitude of 'we the great debater' helps YOUR discussion remains a mysterie to me.<br /><br />Lastly, you have never shown in this topic to even understand what I'm saying. I'll try to explain it again to you with a question. <br />Globox, can you prove to me the history of the united states of amerika, in one post without links but only with quotes?<br />If you can do that to satisfaction, I'll admit that I'm at fault in this topic. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19702,
		"title": "Re: Reason",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-01-03T23:39:20.000Z",
		"content": "Hey, you guys are bringing the rest of us down here.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19703,
		"title": "Re: Reason",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-01-15T01:15:08.000Z",
		"content": "\"Nevertheless the Bible was written by different persons years after the original events happened and used different sources so that end result became a compilation.\" -Djaser<br /><br />\"The part that Mort is ignoring is that many different, and contradicting, writers wrote about the events of the Gospels around 200 years after i happened.\" -LoG<br /><br />-Yes, it was written by different people and \"years after the original events\", but not that many years at all. Almost all, if not all, of the NT books were written before the close of the first century, as my sources indicate and give reasons for, one of which is the romans destroying the Jerusalem temple in AD70. Since Jesus prophesied its destruction (Matthew 24:2 Mark 13:2 Luke 19:44 Luke 21:6) and since the event is nowhere recorded in the NT, it likely wouldn't have been written after AD70, after the event. There is other evidence cited on the websites i listed on the OP.<br />-70 years is simply not enough time for legend and myth to alter the story. There would still be people around who saw for themselves what Jesus did and said, but we have no ancient text dated to this time that claims any NT historical fact is incorrect. If you can find a source that explains why they believe 200+ years is correct, I would be interested to see it and what they say against this.<br />-Does anyone know the timespan between the original and the earliest copy we have of, say, Aristotle's or Plato's works? It is about a millenium, but what's doubted more--the NT or those two?<br />-I don't mind talking about the parts of the Bible that are mostly taken as contradictions. If you have an example, keep in mind that the CARM site listed on the OP has a vast section for this under \"Bible Difficulties\".<br /><br /><br /><br />\"How are his revealings and miracles accurate and reilable?\" -Djaser<br /><br />-Well, because the NT is just that, which is what I've been trying to show.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 19704,
		"title": "Re: Reason",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-01-15T09:11:24.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]-70 years is simply not enough time for legend and myth to alter the story.[hr][/quote]<br /><br />It certainly is. Zero years is plenty of time for a story to get twisted around. Look at how often news is inaccurate these days. We have video cameras and audio recordings and the ability to transmit information all over the globe in milliseconds, and we still get it wrong! Back then it was all word of mouth. The time it takes for a story to grow larger than life is roughly equal to the time it takes to tell the story.<br /><br />That's not to say that your bible is definitely inaccurate, but proving that it is a primary source with the potential to relate things as they went down does not prove that it actually is accurate. Look at \"Godless: The Church of Liberalism\", by Ann Coulter, if you don't believe it. It's certainly contemporary (published last year in fact), but it's also full of it. You've all shot off on a wild tangent about whether it's an accurate source while completely ignoring the fact that a single source is pretty much worthless on its own, for purposes historical, journalistic, academic, or otherwise.<br /><br />Face it, the only way a person is going to find out for sure whether there's a god lurking up there waiting to eat their soul is to become an hero and ask it in person if it really did all that magic.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19705,
		"title": "Re: Reason",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-01-15T10:22:38.000Z",
		"content": "Hasn't anyone considered the possibility that Jesus and his disciples were just incredibly blazed for five or so years?  Just being realistic...[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 19706,
		"title": "Re: Reason",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-15T19:34:30.000Z",
		"content": "C'mon, of course they were, we all know Muhammed was the *real* deal.<br /><br />On a sidenote, what do you think of the witnesses?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19707,
		"title": "Re: Reason",
		"author_id": 1486882,
		"author_name": "Edh Thorn",
		"timestamp": "2007-01-26T03:57:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Me:</i><br />Actually, I must take that back; that approach is incorrect. There is no way to use human reasoning to find the truth.<br /><br /><i>MIB:</i><br />-I disagree. You say not to look at it reasonably? Didn't u just try to reason with me throughout your post that I was wrong?[hr][/quote]<br />I think you misunderstood my post:  I did not say we shouldn't look at it reasonably, and I was not trying to show that you were wrong.  My point was, if we base our beliefs on our own understanding (i.e., our human reasoning), we will never know the truth -- the absolute truth of the Bible which only God can reveal to people.  Yes, many things can be found to be true by just looking around, but the truth of God as spoken of in His Word can only be known if God makes it known to someone. . .<br />[quote]<b><i>Quote:</i></b>[hr]<i>John 14:6</i><br />Jesus saith unto him, \"I am the way, the truth, and the life: no man cometh unto the Father, but by Me.\"<br /><br />and also. . .<br /><br /><i>Matthew 11:27</i><br />All things are delivered unto Me of my Father: and no man knoweth the Son, but the Father; neither knoweth any man the Father, save the Son, and he to whomsoever the Son will reveal Him.[hr][/quote]John 12:37-41 also speaks of this. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />-So how do you propose we go about investigating if there is a God?[hr][/quote]<br />Well, I figured we could use our own observations and reasonings [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  to come to the right conclusion but later decided to correct myself on that approach. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />God has brought his Word into being in such a way that it's reliability is scientifically ascertainable, as I have been trying to show.[hr][/quote]<br />Scientifically ascertainable?  Well, that may be fine as long as you have a standard of why you believe or disbelieve something. . .  For example,<br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />[earlier in same post]<br />No, this isn't true because of the following <b>facts:</b><br />[a list of several interesting statements. . .][hr][/quote]<br />How do you know these are facts?  I have no problem with those statements, but other people with whom you argue might not take them as facts, and since I doubt either side can prove which is true (regarding these statements), the discussion can go on and on. . .  This is basically what I said before, and as I see, you addressed it, as it is not your goal to convince someone the Bible is true; you're just trying to show that from a reasonable standpoint (i.e. all that we can observe around us), it's reasonable to conclude that the Bible is reliable. . .  However, my point is/was that even some of these \"facts\" (which show the Bible is reliable) might be questioned by others (therefore not proof enough of the Bible's reliability); so your argument might not get anywhere in this regard (IMO). . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />-Throughout your post, you are using circular reasoning, which is not really reasoning. E.g., you ask how we know it is written by God, and then u quote the passage saying that scripture is inspired. All you've done there is show that the Bible claims it is written by God. No one should believe something just from a claim. Think about this: if you were born into a a family that believes in another religion, how would u know it was false? by looking at it objectively and seeing what evidence it has, just like I've been. U just have to have reason to figure out what's reasonable and not.[hr][/quote]<br />Well, you see, my goal there is not (at least it should not be) to use these verses to prove that the Bible is true (for, I agree, that is circular reasoning); my point is that the Bible is true regardless of whether or not someone is convinced it has the most evidence for it.  As to using our reasoning to find what religion is best. . .  People won't know God by their own wisdom.<br />[quote]<b><i>Quote:</i></b>[hr]<i>I Corinthians 1:21:</i><br />For after that in the wisdom of God <b>the world by wisdom knew not God</b>, it pleased God by the foolishness of preaching to save them that believe.[hr][/quote]<br />[Note:  I'm not trying to use this to show that preaching is useless.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />-Well again, I disagree. It has already been done. . .[hr][/quote]<br />Well, I agree; and here's what I mean:  yes, that appears to be good evidence to support your argument -- that the Bible is a trustworthy source of information. . .  My point here again is that only God can reveal His truth to people -- they don't come to a knowledge of the truth by their own human reasoning, logic, or wisdom. . .<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br />I'm sure u won't disagree that God has used many people b4 and that they weren't wrong for going out and preaching or w/e. I have verses to back up my position as well:<br /> 2 Corinthians 10:4-5, 2 Timothy 4:2 (these show that we should still preach, since u seemed to indicate that we shouldn't need to do this cuz God can do it or w/e)<br /> Hebrews 11:6, Matthew 7:7-8, Jeremiah 29:13, Proverbs 8:1-11 (these is to show that we should still seek him even though we are flawed)[hr][/quote]<br />Ok, I was absolutely <i>not</i> trying to say that people shouldn't bother preaching the Word of God.  I completely agree that the Bible commands Christians to preach the true Gospel.  The Bible also definitely commands us to seek God:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Matthew 6:33</i><br />But seek ye first the kingdom of God, and His righteousness; and all these things shall be added unto you.[hr][/quote]<br />In the end, I guess my post wasn't exactly relevant because you're dealing with the reliability of the Bible, while I'm saying that using our human reasoning will not lead us to the Truth (only God can); also, other people won't neccessarily agree (about it's reliability) because they might not take your historical facts as facts, etc."
	},
	{
		"id": 19711,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-01-27T02:32:33.000Z",
		"content": "These topics always go on forever (\"Dolphins\", anyone?) and never go anywhere with a lot of flaming in between.  I've got half a mind to close it.  You're all just lucky you caught me on a good day.<br /><br />Anyways, if you rely on the Bible for your belief in God, then you're stupid.  Pure and simple.  A good book, a useful book, a true book (more-or-less), yes.  But in the end just a book.<br /><br />You need something more.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 19708,
		"title": "Re: Reason",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-27T02:49:55.000Z",
		"content": "I don't know, it is not just a book but God's word, and therefore exceedingly useful. (Check out what Timothy has to say on the subject.)<br /><br />Yes the bible alone will not bring you to God, and it freely admits so. But it is a guide, a users manual for a spiritual life and so therefore, the best place to start.<br /><br />If you want to talk to someone, it pays to know their address or phone number. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19712,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-01-29T16:30:00.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />These topics always go on forever (\"Dolphins\", anyone?) and never go anywhere with a lot of flaming in between. I've got half a mind to close it. You're all just lucky you caught me on a good day.<br />[hr][/quote]<br /><br />*stares blankly*<br /><br />You do realize that you gave up admin powers a long ass time ago?<br /><br />edited by Flaose: <i>I gave up my admin powers eh?  Doubt not though you see not.</i><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>Dj:</b><br /><br />Quote:<br />Making a quick jab claim is negligable if you do not cite why I am wrong. (Which is probably because you can't prove that I do not know what one is, mainly because I do.)<br /><br />[hr][/quote]How this attitude of 'we the great debater' helps YOUR discussion remains a m[/quote][/quote][/quote]<br /><br />\"We the great debater\"?  Heh, well, I suppose if you knew a thing about the art of argumentation, you would know.  Thus far, you've done nothing but make nonsensical posts --and this post doesn't break the tradition.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Lastly, you have never shown in this topic to even understand what I'm saying. I'll try to explain it again to you with a question. <br />Globox, can you prove to me the history of the united states of amerika, in one post without links but only with quotes?<br />If you can do that to satisfaction, I'll admit that I'm at fault in this topic.<br />[hr][/quote]<br /><br />Firstly, it is spelled 'America'.  The history of the United States?  What are you, an idiot?<br /><br />Life in America started raughly 10,000 years ago when the first Native Americans came over here; if you mean when America called itself America and became liberated, there are several primary sources we might cite.  From the beginning of independence, we could start looking through primary sources of George Washington's accounts (And many others) of the Revolutionary War (What's left after his wife burned his notes), and then we could go through numerous sources on the Constitution's creation (The Federalist Papers comes to mind).  Unlike the Bible, historical fact is determined by primary sources and coberated by other witnesses.<br /><br />If you want me to prove everything that happened in America, I do not have time to educate me; nor do I have time to further entertain your shifting the burden of proof fallacy.<br /><br />I'm done here, Djaser, you have proved yourself to be a dunce.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 19709,
		"title": "Re: Reason",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-29T17:00:39.000Z",
		"content": "Wow Flaose, just like the old days again?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-love.gif[/img]  <br /><br />[quote]<b><i>Quote:</i></b>[hr]Firstly, it is spelled 'America'. The history of the United States? What are you, an idiot?[hr][/quote]<br />Who knows but I don't think you're capable of judging that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]If you want me to prove everything that happened in America, I do not have time to educate me; [hr][/quote]<br />Neither have I the time to educate myself 500 years history of Israel just to explain it to you. Point taken? For the last time I suggest you that you go and read some stuff and not demand from me that I have to explain it all to you.<br /><br />[quote]<b><i>Quote:</i></b>[hr]nor do I have time to further entertain your shifting the burden of proof fallacy.[hr][/quote]<br />Your wrong, burden of proof lies with you.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I'm done here, Djaser, you have proved yourself to be a dunce. [hr][/quote]<br />If that's what you believe, that's fine with me. Will you now go back to your busy own forum and please stay there.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 19713,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-29T19:29:09.000Z",
		"content": "So, what exactly is being debated? I can't quite pick it up amongst the arguments and countering. If someone is willing to give me a starting question I'm all too happy to debate.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19725,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-01-29T19:49:51.000Z",
		"content": "\"Intellectual\" flamewars are the worst kind. This thread was headed nowhere good from the beginning.------------------<br />Nothing in particular"
	},
	{
		"id": 19714,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-02-11T18:11:00.000Z",
		"content": "-\"It certainly is. Zero years is plenty of time for a story to get twisted around.\" -lemur821<br />\"You've all shot off on a wild tangent about whether it's an accurate source while completely ignoring the fact that a single source is pretty much worthless on its own, for purposes historical, journalistic, academic, or otherwise.\" -lemur821<br />-That is not the consensus of historians. It takes at least enough time for the original witnesses to not be alive anymore or there would be people contradicting it back then, which we have no record of. The NT isn't exactly a single source--it was composed over a few decades by different witnessess, some of whom died for their beliefs with nothing to gain if it wasn't true.<br /><br />-\"Hasn't anyone considered the possibility that Jesus and his disciples were just incredibly blazed for five or so years?\" -Xtraverse<br />-Sure, but the record of miracles is stil there. Unless you want to believe that all of Jerusalem was mass delusional at the same point in time, it's not too likely.<br /><br />-\"On a sidenote, what do you think of the witnesses?\" -Levelass<br />-One good piece of evidence is that the believers suffered terribly for their faith, with nothing to gain if they were wrong. I hope no one contends with the accuracy of that historical record. The point is a lot of them really believed, not because they were stupid, but because something must have really convinced them. People don't willing endure persecution without knowing they're right.<br /><br />-@Edh Thorn: your post is very clear, and it clears a lot up; i did misunderstand then. Let me be clear about it here. I'm not trying to philosiphize or argue for what's moral or God's Truth or w/e, just that the Bible is right. So yes I can't figure out what is righteous on my own, but if I know the Bible is true, it reveals what I need to know. I'm just arguing here why I believe the Bible as opposed to the next religion. You bring up a good point in<br />-\"How do you know these are facts? I have no problem with those statements, but other people with whom you argue might not take them as facts, and since I doubt either side can prove which is true (regarding these statements), the discussion can go on and on. . .\" -Edh Thorn<br />-Well, here's that thing with facts again ^^;. Some things are facts whether or not people don't believe them. I'm sure everyone here agrees, since we all think there are some people doing the wrong thing in spite of common sense/logic. You in fact (no pun intended) agree with me here:<br />\"my point is that the Bible is true regardless of whether or not someone is convinced it has the most evidence for it.\" -Edh Thorn<br />-I know I need to prove it, and I've listed sources on the very first post. I know that it won't convince anyone if they don't believe in the facts I believe in, but I still have to say what I think are facts and try to prove why they're true. That is really what everyone else is doing too.<br />-So in the end, what I wanna say is that you're right that people can't get to God's Wisdom/Truth on their own; I think there was no distinction between that and the reliability/evidence. History and archeology and all that are perfectly valid as tools to verify things--all I'm saying is that if we investigate the Bible just like any other document of antiquity, we see that it's reliable.<br />-Perhaps the better question for you is why do you believe the Bible instead of another religion?<br /><br />\"You need something more.\" -Flaose<br />-No argument there, but if you believe it and it's true, which is what I've been working at here, then you have something more, namely God, salvation, etc.<br /><br />\"So, what exactly is being debated? I can't quite pick it up amongst the arguments and countering. If someone is willing to give me a starting question I'm all too happy to debate.\" -Levelass<br />-I am debating the reliability of the Bible and thus its reasonableness to believe in it. Starting question? Um, idk^^;. I guess why do you believe or not believe in the Bible, as in what evidence do u have to support your claim? Doesn't necessarily have to be physical evidence--could be experience or something like that.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 19726,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-11T19:48:11.000Z",
		"content": "Ah, right. So we're discussing the veracity of the bible. It's actually quite a remarkable book and it's sheer content convinces me. There is no other book out there that shows what pitiful, ungrateful vermin the 'chosen people' were; they don't seem to be able to go five miniutes without jumping into paganism. All their kings eventually turned rotten, they committed murders, genocide and child sacrifice, got conquered, cheated, lied... the list goes on. The OT reads very well as a detailed and factual history, far more realistic than what I've seen in most myths. It also contains a legal system that can govern a whole society and bans almost every deviation possible. (As well as a few other things like pork which was done, it seems, just to make them different.) The NT by contrast seems to be devoted to spreading the 'good news' and outlining some very nice morality.<br /><br />My personal belief is as follows, God made the world, it got screwed up. Afterwards, there were still people coming to God, but not nearly as many as he wanted (viz Noah.) so he decided if he wanted everyone to take notice of Him, he'd need to pick a favourate. So he did, got some religious people, let them breed a bit, made them a nation and blessed them silly. (According to the bible, other nations took notice of this and Jehovah was respected, if not worshipped abroad.) After people had their way, and judaism was totally ruined and off-track; he sent his kid down to sort things out and tell everyone they didn't have to listen to a bunch of stupid laws anymore.<br /><br />The problem with most people is that they're rather attached to outdated and/or pointless commandments. Look at the catholic church, they had to invent most of their dogma.<br /><br /><br />Some other random points:<br /><br />The NT is a select set of 'gospels' just a few out of the origional 50 or so believed to have been written. The early church eventually had to appoint someone to figure 'fact from fiction' and decide what was to be orthodoxy and what not. That said, it can be argued that everything in the NT came from a single source, but that can be argued about any things. (And of course if we consider God as the single source it could be said to be true.)<br /><br />The possibility that Jesus was 1.), High 2.)Delusional, 3.)A conman, 4.)Just a nice guy has been considered, many times and what you believe again depends on your existing beliefs. Can you prove your identity? I bet that birth cerfificate is faked. Your family supports you? Well how unbiased are they? In the end all we know is that some guy called Jesus (Or actually Yeshua) lived around AD 0, that he was cruicified for going around rousing people up. If you're atheist there is simply no way you're going to believe in him, if you're theist then there's no way you can dismiss him.<br /><br />It is also debateable whether people suffered with nothing to gain; there wer many strong believers, that doesn't mean what they believed was true. (Osama for example.) and even in the early church, people would have sought power.<br /><br />Everyone needs 'something else' but that doesn't have to be God; people will fill the void with anything they can, from pointless frivolities to deep and meaningful beliefs. People tend toward the spiritual, even athiests.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19715,
		"title": "sfljfio",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-02-25T17:28:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]if you're theist then there's no way you can dismiss him.[hr][/quote]<br /><br />wat?"
	},
	{
		"id": 19727,
		"title": "Theo?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2007-02-26T02:03:46.000Z",
		"content": "What is it with this community and its need to create all these long theology threads so often?<br />I'd call myself an existentialist, so this subject is an interesting one, but these kinds of threads always follow a similar pattern, end up being looong threads of posts trying to (dis)proof stuff.<br />Basically they're useless, unless you're new to the whole theology discussion thing and can still be convinced to change your opinion because of some good points you haven't heard before.<br /><br />I know, I can just stay out of this thread if I don't want to read it, but right now I am still interested in knowing why this subject keeps popping up.<br />This is a Commander Keen community, or it started out as such.<br />It was \"supposed to be\" about some old computer game, so why is theology such a popular topic here?Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 19716,
		"title": "Whether tis nobler to suffer the slings 'n arrows of fortune",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-26T12:03:13.000Z",
		"content": "Actually, from what I've seen, limited though my experience is, nearly every message board with a 'general' like forum does this, I've just come from a pokemon board (Don't laugh, they're nice people.) where 'Suzy-Q' has declarted her total belief that the elders shall arrive on Earth in 2012 to set up a world government, she of course was flamed into oblivion.<br /><br />Thse things just seem to happen. (Either that or someone up there is messing you about.)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19728,
		"title": "Re: Theo?",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-02-26T16:54:23.000Z",
		"content": "It's because it's a good excuse for a flame war.<br /><br />I thought this topic was dead...------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 19717,
		"title": "Re: Whether tis nobler to suffer the slings 'n arrows of for",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-27T07:51:13.000Z",
		"content": "They never really die; this is a broad topic remember.<br /><br />New sub-subject; what do you think of islam and science? They're facing tough issues as modernity graduly enters the middle east.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19718,
		"title": "Re: Hmmm",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-28T12:36:31.000Z",
		"content": "Yeah, Retodon8, that is quite interesting. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I've wondered it too.<br /><br />One could guess there are many young members who aren't completely happy with their belief system (or more like lack thereof) and are trying to find reasons to believe in what they used to. They feel guilt. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] <br /><br />Or then not. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  I don't know.<br /><br />Why do I feel like I have said that before? I think I haven't. Anyways, it's an interesting subject, but on the other hand I'm kinda tired of it as I'm of most kind of talking -- there's no point. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  <br /><br /><br />\"New sub-subject; what do you think of islam and science? They're facing tough issues as modernity graduly enters the middle east.\"<br />Yeah, it's interesting too! Although probably modernity only brings more problems than it solves. I don't know much about Islam, and of course there are many different views and such within it, just as in Christianity -- what is science to them? Is science that helps humanity for longer and healthier life wrong? I should perhaps read something. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 19722,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1486882,
		"author_name": "Edh Thorn",
		"timestamp": "2007-03-21T01:34:05.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>MIB:</i><br /> -Perhaps the better question for you is why do you believe the Bible instead of another religion?[hr][/quote]<br />Well now here it gets a little interesting. . .  First of all, to just say that the Bible is true does not make one a true believer.  As James 1:22 says,<br />[quote]<b><i>Quote:</i></b>[hr]<i>James 1:22</i><br />But be ye doers of the word, and not hearers only, deceiving your own selves.[hr][/quote]<br />Just because I say I know the Bible is true does not mean I <i>really</i>, truly, believe it -- I may be just deceived into thinking that I believe it (that's how it seems to me - I could be wrong); for as we know,<br />[quote]<b><i>Quote:</i></b>[hr]<i>Jeremiah 17:9</i><br />The heart is deceitful above all things, and desperately wicked: who can know it?[hr][/quote]<br />Only God can make someone believe in Him:<br />[quote]<b><i>Quote:</i></b>[hr]<i>Matthew 16:16-17:</i><br />And Simon Peter answered and said, Thou art the Christ, the Son of the living God.  And Jesus answered and said unto him, Blessed art thou, Simon Bar-jona: <b>for flesh and blood hath not revealed it unto thee, but My Father which is in heaven.</b>[hr][/quote]<br />As far as I can tell, therefore, if I in any way believe the truth of the Bible, it is only because God has caused me to believe.<br /><br /><br /><br />[url=http://worldwide.familyradio.org/zusa/graphical/literature/tracts/frames/]Does God Love You?[/url]"
	},
	{
		"id": 19719,
		"title": "Re: Hmmm",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-03-21T01:54:15.000Z",
		"content": "Isn't that a bit circular reasoning?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 19723,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-21T06:52:23.000Z",
		"content": "I don't quite see how; I've always said that you can only get true understanding through knowing God; the bible will take you halfway of course.<br /><br />The issue of why x instead of another religion comes down to two factors I think, firstly because they found you first, the belief you were raised in sticks, and secondly, maybe that religion has a little extra 'something' that attracts you to it; like why muslim extremeists will spit on the writings of the Koran because they like to spend their time killing people.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19720,
		"title": "Re: Hmmm",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-03-21T18:03:34.000Z",
		"content": "WOULD PEOPLE PLEASE STOP REVIVING THIS TOPIC? IT WAS NICELY DEAD. NOBODY HAD POSTED IN IT FOR A MONTH AT LEAST.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />&lt;/capslock&gt;------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 19724,
		"title": "Re: Debate on Christianity and w/e else",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-22T10:05:38.000Z",
		"content": "That's a bit of n overreaction isn't it? There's no need to shout.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19721,
		"title": "Re: Hmmm",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-03-22T10:15:11.000Z",
		"content": "At this point I think it's an underreaction. But opinion is divided on the subject.------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	}
]
