[
	{
		"id": 676,
		"title": "FACEBOOK",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2007-10-07T07:09:13.000Z",
		"content": "As many of our old members grow up... forums seem to fade behind us, as going to different sites to discuss different topics is a chore us musically brainwashed adolecants are loath to undertake...<br /><br />Thus sites like myspace (which is currently infested with sexual preditors - you've seen the \"I *heart* Nerds\" T-shirts... they're out there) and facebook (which is known for a cleaner, and much less cluttered layout) arose to fill the need to be connected with <i>everyone</i>.<br /><br />Now after setting up my facebook, I noticed something called groups. It allows you to post bulletons and shit without muddling it into your own private life (like the fact that I'm part of the national rapists of new zealand, which really isn't a fact bacause the only thing I know about new zealand is levellord and Sarah come from there... and that it's off the coast of Australia, and...)<br /><br />My point, a.k.a. my conclusion: set up a PCKF facebook group. Make Keen real...<br /><br />Now as I was typing this, I realized how compromising this may be: facebook requires u use ur real name, and a real picture usually follow suit. Many of us prefer hiding our pathetic existance behind a 16 color 64 x 64 avatar with tough guy lingo like \"tough guys wear pink,\" and \"proud member of the spleen extiction society\"... but on facebook, we would actually BE members of the spleen extinction society.<br /><br />What say you?<br />Search \"PCKF\" or \"Commander Keen\" under Group Search in facebook. It's the group led by the emo looking kid (me) taking a picture of his hair before my back to school haircut.<br /><br />(P.S. I am not emo - Emo is supressed gayness)Tough Guys Wear Pink!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 18218,
		"title": "Re: FACEBOOK",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-10-07T08:13:09.000Z",
		"content": "Well speak for yourself, I certainly don't consider my existence pathetic...but then again I'm no longer a teenager, that's probably got something to do with it.<br /><br />And maybe you might like to post a URL?  I'm curious, and I tried to do a search, but didn't come up with anything (and I couldn't see where to do a group search either.)<br /><font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18219,
		"title": "Re: FACEBOOK",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2007-10-07T09:18:29.000Z",
		"content": "When I said \"pathetic\", I was refering to us brainwashed teenagers who have our iPods blaring and stuff...<br /><br />When you log in, there are icons under the search bar. Groups is one of them. Search for PCKF there.<br /><br />-- Naj<br /><br />Any more questions?<br /><br />btw - the url is www.facebook.com<br />u need a facebook to join the group... just because it's <i>facebook</i>.com...Tough Guys Wear Pink!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 18220,
		"title": "Re: FACEBOOK",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-10-07T13:28:47.000Z",
		"content": "1. I have a Facebook, but I'm not interested in joining the PCKF group right now. I do like to keep my personality private at all times, but I am definitely not pathetic... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />2. The only thing I can see that group being used for is to let people know who on Facebook is a Keen fan. It seems more like a label than a group. So even if people join, it's not going to do much.<br /><br />3. However, I think that people on the PCKF having Facebooks would be interesting. It would emphasize the community feel of the PCKF. Of course, that'd make me a hypocrite, since I don't want other members to have my Facebook.<br /><br />4. Emo's aren't gay. It's just a style of clothes and music, branced off from punk. I'm sick of people saying things like that. I'm not emo, either, but it gets really old...-Genius314"
	},
	{
		"id": 18221,
		"title": "Re: FACEBOOK",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-10-07T14:05:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]4. Emo's aren't gay. It's just a style of clothes and music, branced off from punk. I'm sick of people saying things like that. I'm not emo, either, but it gets really old... [hr][/quote]<br />Your entitled to your opinion but personally I get more sick of emo's than of people calling them gay. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 18222,
		"title": "Re: FACEBOOK",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-07T15:53:46.000Z",
		"content": "I don't have any need for Facebook, and I certainly don't need to be connected with everyone, hardly with anyone. I won't join, but I guess it's good thing for those who use it.<br /><br />Emos... Tend to agree with Djaser. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  And I hope najawa isn't thinking all the people with long hair are emo or gay, because that's certainly not true. For example, I know that much about myself. My only regret is I didn't start growing my hair earlier...<br /><br />And last, all those sites are infested with those 'sexual predators' (and t-shirts can be jokes too)... And often it works, I guess, I don't know or care, because people are so damn stupid and are on animal level with their lust.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18223,
		"title": "Re: FACEBOOK",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-10-07T18:48:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>KR:</b> And often it works, I guess, I don't know or care, because people are so damn stupid and are on animal level with their lust.[hr][/quote] <br />That's funny because it's true. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />*Ahem*<br /><br />I don't want facebook. I already am a part of an online community (Actually more than one.) and that's all I'm interested in OR ELSE I would be on myspace type sites already. Do I REALLY want to know about someone else's life? Reading blogs is fun. Reading myspace type \"Blogs\" is like listening to someone bitching about their personal problems. I find \"personal\" sites to be quite lame.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Naj:</b> As many of our old members grow up... forums seem to fade behind us, as going to different sites to discuss different topics is a chore us musically brainwashed adolecants are loath to undertake...[hr][/quote]<br />So you admit you are so lazy you don't want to type in \"www.PCKF.com\" and look at topics. That's a chore for you. Forums aren't a chore... no one expects you to post or anything. It's a discussion place where people who share a common interest come together and type things in. If it's that much of a bother to you then why do it? I personally think forums (Intelligent forums with 100 active members or less.) are very fun, not work at all. Building a fence is a chore... I never heard anyone refer to relaxing internet surfing as a chore...<br /><br />And um... brainwashed musically? That's a new one. What kind of garbage do YOU listen to then?<br />[quote]<b><i>Quote:</i></b>[hr]When I said \"pathetic\", I was refering to us brainwashed teenagers who have our iPods blaring and stuff...[hr][/quote]<br />Woah... \"US\"? I don't think I was ever brainwashed. (As a teenager.) What's so bad about having an iPod? And if you meant it or not, it does sound like you called yourself pathetic. The word \"us\" also includes you...<br /><br />You just called yourself a pathetic brainwashed teenager... who has an iPod. Congratulations.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 18224,
		"title": "Yeah...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2007-10-07T19:13:03.000Z",
		"content": "Ur points are all valid (including the emo one)<br /><br />I also don't want to break privacy... but as I already have a facebook, it'd be cool to have some label identifying me as a keen fan, and allowing me to see other keen fans. There are other groups, but it'd be cool if a more exclusive group was made, just PCKF people. I don't know... it'd be cool if you could set it up so the only contact they had with you would be through the groups main page, and/or if u accepted...<br /><br />i don't know, it was one of those late night strokes of self induced and approved brilliance. It was like 4am after homecoming when I wrote that, and I danced all three hours... so forgive me if I sounded really stupid or something...<br /><br />and about emo's: I have nothing against them... and all the gay people I know have short hair...<br /><br />Emo's are like normal people who like someone, but keep it inside them, and wont admit it until they just can't take it anymore... the difference between striaghts and gays is that no one frowns on straight relations, while gay people are still made fun of. So emo people keep that in, and get all depressed and stuff... Edit: and the emo's keep it inside long after the breaking point... thus emo: emotional... emotional wreck...<br /><br />idk...<br /><br />and I refering to the class of '10, the Juice Box Generation... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  <br /><br />And I am pathetically lazy... I'm fucking 7 lessons behind in Algebra. If I fail, I'll be taking Algebra for my fourth year.... I'd die first... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  <br /><br />-- Naj"
	},
	{
		"id": 18225,
		"title": "Re: Yeah...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-07T20:52:47.000Z",
		"content": "Even if you're straight, and not accepted by society, like for example by being fat or having a glass eye or some deformation, people will frown on your relationships and feelings and make fun of you, and likely of that other person too. They're either afraid of you, jealous to you, or just plain idiots, mostly the last one.<br /><br />And yeah, as said, I like forums a lot more than other kind of sites. Forums I like to use, unlike other kind of stuff.<br /><br />And, I'm not musically brainwashed, far from it.<br /><br />And very last, I'm not a teenager either. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18226,
		"title": "Re: Yeah...",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-10-08T06:48:32.000Z",
		"content": "I see people do seem to have a problem with this [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] [quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 18227,
		"title": "Re: Yeah...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-10-08T07:39:13.000Z",
		"content": "Isn't facebook that website where you have to enter some school details or you won't be able to register? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 18228,
		"title": "Re: Yeah...",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2007-10-08T09:45:57.000Z",
		"content": "I are in the group.------------------<br />[url=http://www.szevvy.net]www.szevvy.net[/url], for all your Wombat needs.  You know you want to.<br />A member of the LevelLord fan club."
	},
	{
		"id": 18229,
		"title": "Re: Yeah...",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-10-08T20:19:50.000Z",
		"content": "I'm actually already in a group called 'Commander Keen is Awesome' and have been for some time so I'm taken care of in that department, but thanks anyway.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 18230,
		"title": "Re: Yeah...",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-10-09T02:33:32.000Z",
		"content": "yeah i think i'm in that same group<br /><br />but i don't visit facebook very often neway[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 18231,
		"title": "Re: Yeah...",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-10-09T17:45:43.000Z",
		"content": "I've already got too many damn useless accounts on all these Myspace-alikes. No thanks. I'd rather have a PCKF Kingdom of Loathing clan, or something.------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 18232,
		"title": "Re: Yeah...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-10-10T00:20:52.000Z",
		"content": "If you're in college in the USA, facebook is really the only social network worth joining...but if you aren't, I don't see a point.  So that excludes what, 80% of our members?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	}
]
