[
	{
		"id": 780,
		"title": "Haha, oh O.J.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-16T00:03:09.000Z",
		"content": "[url=http://today.reuters.com/news/articlenews.aspx?type=entertainmentNews&storyid=2006-11-15T040626Z_01_N14435424_RTRUKOC_0_US-SIMPSON.xml&src=rss&rpc=22]today.reuters.com/news/ar...rss&amp;rpc=22[/url]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Fox said Tuesday it will air a two-part interview with O.J. Simpson at month's end in which he describes the 1994 murders of his ex-wife and her friend that he says he didn't commit.<br /><br />The interview will be conducted by editor and book publisher Judith Regan. On November 30, her Regan Books is publishing a book Simpson wrote with the working title \"If I Did It, Here's How It Happened.\"<br /><br />Fox said Simpson's book \"hypothetically describes\" how he would have committed the murders. The special will air at 9 p.m. November 27 and 29 on Fox.<br /><br />THE 21st CENTURY IN PICTURES<br /><br />War and Conflict<br />View Slideshow<br /><br />Fox executives declined comment about the show Tuesday. In a statement released Tuesday, executive vice-president/alternative programming Mike Darnell said: \"This is an interview that no one thought would ever happen. It's the definitive last chapter in the trial of the century.\"<br /><br />Fox is a subsidiary of News Corp., which also owns Regan Books.<br /><br />A spokeswoman for Regan Books didn't return a phone call or an e-mail seeking comment Tuesday.<br /><br />Simpson was acquitted in 1995 of the murders of Nicole Brown Simpson and Ron Goldman; he can't be tried again for those crimes. In 1997, a civil court found him responsible for the slayings and ordered him to pay $33.5 million to the victims' families.[hr][/quote][center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 20232,
		"title": "Re: Haha, oh O.J.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-16T03:02:32.000Z",
		"content": "\"If I Did It, Here's How It Happened.\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />I'm not familiar with the case, but it might be interesting to see this interview.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20233,
		"title": "Re: Haha, oh O.J.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-11-17T12:43:26.000Z",
		"content": "Maybe he's writing it from the same angle as that \"If Santa was real..... he would break the sound barrier several times over and vapourise with air resistance\" essay...----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20234,
		"title": "Re: Haha, oh O.J.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-20T10:51:49.000Z",
		"content": "But wouldn't you be just a little bit suspicious if a guy in a big red suit and a beard was telling you that story?  \"See, I *can't* be Santa, now help me up this chimney\""
	}
]
