[
	{
		"id": 1141,
		"title": "Stupidity",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-08T10:50:53.000Z",
		"content": "Do you think stupidity is positive? (That is; it is not merely an absence of intelligence, but rather the presence of idiocy.) Or is it merely the lack of knowledge (Or common  sense, experience or what have you.) That is, is it positive (Like light) or negative (Like darkness, the absence of light.)<br /><br />While traditionally viewed as an absence of intelligence, we often act like stupidity is something someone possesses, 'they deserved that for being so dumb' and othersuch.<br /><br />I consider this an interesting question, and as Rorie is not as active, it falls to me to poll pointlessly."
	},
	{
		"id": 25697,
		"title": "Ugh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-02-08T18:07:02.000Z",
		"content": "What a silly topic.  To me, Stupidity would be an absence of knowledge about a particular topic.  A student who enrolled in a class but did not invest enough time to understand the material would not do well on the test--their lack of knowledge could be viewed as \"stupid.\"  An individual who did not invest enough time into researching the chain-letter email from the widowed billionaire in a foreign country might find their bank account depleted and their live savings gone--their lack of foresight and wisdom could be viewed as \"stupid.\"  <br /><br />There are individuals who learn in different ways, and there are individuals who take longer to digest information... these people could be considered \"stupid\" by others who learn more rapidly or in a method that benefits from a particular teacher's style... This doesn't make those individuals smarter or less smart--it just makes them different.  *shrug*<br /><br />It's an absense of knowledge, be it common sense, wisdom, information, or esoteric scraps of trivia.  :P"
	},
	{
		"id": 25698,
		"title": "Re: Ugh",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-08T19:35:43.000Z",
		"content": "I tend to think of the absence of knowledge as ignorance. When you call someone ignorant, you highlight a deficiency of theirs and insinuate they don't know enough.<br /><br />Wheras when you call someone stupid, it has connotations of 'they should've known better' or 'I can't believe they did that'; stupidity I think seems to persist despite knowledge. 'Sure I know it's dangerous, but...'<br /><br /><br />We're all born ignorant, but most stupidity is willful.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25699,
		"title": "Topic is its self",
		"author_id": 1485592,
		"author_name": "Slugfest",
		"timestamp": "2007-02-08T22:52:24.000Z",
		"content": "I think stupidity is this thread.<br /><br />Like... why even ask such a question?"
	},
	{
		"id": 25700,
		"title": "I pity the fool.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-09T00:23:52.000Z",
		"content": "Actually, I think this is a perfectly valid question.<br /><br />A lot of people are smarter than they appear. They simply believe they're too stupid to learn new things. That doesn't make them stupid. I daresay ignorance would best summise them, though it usually takes place subconsciously.<br /><br />I consider wisdom and intelligence separate elements. While you can quote facts that you know intellectually, wisdom is more to do with discernment, finding the truth of a matter based on life experience, a more emotional endeavour than intellectual.<br /><br />There's more I could say on the matter, but right now my thoughts are too tangled. (Or am I just too stupid to word them?)"
	},
	{
		"id": 25701,
		"title": "Re: I pity the fool.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-09T09:55:31.000Z",
		"content": "*That* is a very interesting argument, and one I would have to agree with. Especially when you see so many so-called 'experts' go off and join government, or make stupid laws, or start pointless threads...<br /><br />I don't think there's enough discussion on wisdom and intelligence, especially IQ tests; they're very misleading.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25702,
		"title": "Re: I pity the fool.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2007-02-10T00:09:26.000Z",
		"content": "Stupidity is the lack of something, although acting stupid can be something positive.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 25703,
		"title": "Garg!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-02-10T01:33:45.000Z",
		"content": "Ret8, you always come up with the best answers.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 25704,
		"title": "Re: Garg!",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-11T00:37:31.000Z",
		"content": "He's one smart cookie, may he never crumble!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25705,
		"title": "Re: Garg!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-11T13:00:03.000Z",
		"content": "IQ tests are stoopid. But as said before, intelligence and wisdom are separate, and I mostly care about the latter. And (I guess) there are different kind of intelligences.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 25706,
		"title": "Re: Garg!",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-11T19:27:13.000Z",
		"content": "Well, it would depend on what you consider 'intelligence'; there is a new term going around now; EQ or emotional intelligence, but I consider it to be part of KR's aforementioned 'wisdom'.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25707,
		"title": "Re: Nrop!!2",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-02-11T19:28:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>LL:</b><br /><br />Do you think stupidity is positive? (That is; it is not merely an absence of intelligence, but rather the presence of idiocy.) Or is it merely the lack of knowledge (Or common sense, experience or what have you.) That is, is it positive (Like light) or negative (Like darkness, the absence of light.)<br />[hr][/quote]<br /><br />That depends solely on where you look at it from; relativity is crucial to philosophy.<br /><br />From the view of intelligence, ignorance is the negative form of intelligence.  From the view of ignorance, intelligence is the lack of ignorance.  They are inversely related proportions.<br /><br />Neither intelligence nor ignorance are physical entities like cold vs. hot.  Heat exists, cold is the absence of heat.  Heat is nothing more than energy, which exists.  Same with light and darkness; light exists in the form of photons, darkness is the absence of light.  Intelligence exists, but not in a physical sense like the afore mentioned.<br /><br />Therefore, I do not believe you can say that one \"exists\" and therefore one is anymore \"absent.\"~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 25708,
		"title": "Re: Nrop!!2",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-12T06:01:54.000Z",
		"content": "Well, scientists seem to consider information a fundamental component of the universe, there is even a debate on where the 'lost' information that falls into black holes goes. (And that debate confuses even me.)<br /><br />So if we define smarts and stupidity in terms of information, what can we say?<br /><br />I'd say smarts is a presence of positive (True) information, such as, studying for a test will let you pass. Ignorance is an absence of information (I don't know what to do to pass this test!) and stupidity is the presence of negative (False) information (My horoscope says I'll pass, I'm going to party.) In which case, my viewpoint is that stupidity is positive; it's anti-intelligence.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25709,
		"title": "Re: Nrop!!2",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-02-14T16:54:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>LL:</b><br /><br />Well, scientists seem to consider information a fundamental component of the universe, there is even a debate on where the 'lost' information that falls into black holes goes. (And that debate confuses even me.)<br />[hr][/quote]<br /><br />That's not information in its strictest sense, I do not believe.  Though I know very little about quantum mechanics, myself.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />So if we define smarts and stupidity in terms of information, what can we say?<br />[hr][/quote]<br /><br />Intelligence is the (positive) collection of information, and ignorance is the lack of information (negative).~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 25710,
		"title": "Re: Nrop!!2",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-14T19:32:23.000Z",
		"content": "Then what is the presence of incorrect information?<br /><br />If I think seven nines are 84, am I intelligent? (Heck does this make creationism intelligent design?)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25711,
		"title": "Re: Nrop!!2",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-02-16T01:29:15.000Z",
		"content": "That depends; do you believe you are correct?  There is no way for me to prove to you that you are incorrect without your mind submitting that my axioms (Rather, the generally excepted ones) are correct to come to that conclusion.<br /><br />Newton was completely wrong in many of his conclusions:  He did not factor in velocity's affect on time, he didn't speculate about gravity's true nature, he did not realise that matter was made out of energy, he did not know about energy, and many other things that made his equations and concepts incorrect.  Do you surmise Newton to be ignorant?<br /><br />Surely he was, but only when compared to a absolute standard.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 25712,
		"title": "Re: Nrop!!2",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-16T03:49:54.000Z",
		"content": "In that light, everyone is ignorant. There are countless topics and skills I'll never know sufficiently.<br /><br />I've always considered ignorance in its direct 'ignore-ance' context. If you have information, but choose not to use it, or do your best to forget it, then you are ignorant. Ignorance is not always a bad thing, and in many cases can be very helpful.<br /><br />Newton wasn't ignorant because there were gaps in his knowledge--he had no way of knowing those things at the time."
	},
	{
		"id": 25713,
		"title": "Re: Nrop!!2",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-16T08:40:33.000Z",
		"content": "I say Newton was ignorant yes, *compared* to our modern standard, this is different from stupidity, such as creationists telling us that light moved faster in the past (Thus the universe is 6000 years old.)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25714,
		"title": "Re: Nrop!!2",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-02-18T22:36:33.000Z",
		"content": "There is no denotative difference between \"ignorance\" and \"stupidity.\"  It is defined as a general lack of knowledge.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 25715,
		"title": "Re: Nrop!!2",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-19T00:46:26.000Z",
		"content": "Answers.com: 'ignorance n. The condition of being uneducated, unaware, or uninformed.' \"Stupidity is the quality or condition of being stupid, or lacking intelligence, as opposed to being merely ignorant or uneducated.\"<br /><br />wordnet.princeton.edu/perl/webwn: 'Ignorance: the lack of knowledge or education' 'Stupidity: a poor ability to understand or to profit from experience.'<br /><br /><br />So, the common definitions *do* put a difference between the two, on is inherent lack of knowledge, while the other relates to performance. (A young child walking blindly across the street is ignorant, a Russian psychic jumping out in front of cars to 'stop them with her mind' is stupid.)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 25716,
		"title": "Re: Nrop!!2",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-04T21:28:52.000Z",
		"content": "Decently stated; therefore stupidity is a negative.<br /><br />It is the loss of the ability to comprehend.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
