[
	{
		"id": 1274,
		"title": "System of a Down.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-07-07T04:19:46.000Z",
		"content": "OMG! Gal made a topic! OH NOSE!<br /><br />I know there are a few music buffs on the PCKF. While I don't consider myself a music guru by ANY means I still like to listen to it every once in a while. (No really Gal? Are you SERIOUS?![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] )<br /><br />Now there is this one band in particular that has me perplexed. As from the title, you probably guessed that I am talking about System of a Down.<br /><br />... Uh... which I am... by the way.<br /><br />*Ahem*<br /><br />ANYWAY, I was wondering what your opinion of this band is, if any. I heard all kinds of things about them. From \"OMG AWESOMESAUCE1\" to \"EMO!\" to \"LOL Faggot baNd. #1Nerd.\"<br /><br />I have heard quite a few of their CDs... and quite frankly... I don't know WHAT to make of this band. The singer is...<br />Um, he has a \"distinctive\" voice and can be rather annoying. (Anyone who heard one of their songs is like \"UH HUH!\")<br />Now the music its self is rather catchy, but that does not mean it is good. I like the band but at the same time I can't stand it sometimes. It's weird.<br /><br />Well enough of my wishie-washieness. Waffling-waffleironing. Tell me what YOU think of System of a Down. And don't just be like \"ROXORS ONE\", or \"Suzors1.\" (I'm looking at YOU Metallica thread.) Tell my WHY you think they are good or WHY you think they are bad.<br />I like intelligent threads to be attributed to my name THANK YOU!-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 27707,
		"title": "Re: System of a Down.",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-07-07T06:30:58.000Z",
		"content": "More of the awesome sauce and less of the sucking in my opinion.<br /><br />They rock hard, but they're a little silly too. I like that they're expressing their social justice stuff without getting bogged down in how serious it is. Love the vocals too; they're not quite like everything else. I tend to like bands with interesting vocals (Coheed and Cambria, Rush, Horrorpops, to name a few). Nice harmony.<br /><br />I especially like Lonely Day, from Hypnotize. Good song. Plus they get cool points for using the phrase \"the most loneliest day of my life\" over and over again.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 27708,
		"title": "Re: System of a Down.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-07-07T19:50:04.000Z",
		"content": "System of a down is a typical band that went downhill fast after it's debut. I bet that on their next release is not a single song that I can stand.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 27709,
		"title": "Re: System of a Down.",
		"author_id": 1486169,
		"author_name": "Vrevolving",
		"timestamp": "2006-07-11T07:18:42.000Z",
		"content": "Bad band...<br />IMO Toxicity was there best album, all downhill from there, plus whats up with Malakians singing on the new records?"
	},
	{
		"id": 27710,
		"title": "Re: System of a Down.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-07-11T17:51:03.000Z",
		"content": "Well he can't sing, that's what's up with it.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 27711,
		"title": "Re: System of a Down.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-07-11T21:33:12.000Z",
		"content": "This is the best thread ever.<br /><br />I like all the information. I learned a lot.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] -----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	}
]
