[
	{
		"id": 1076,
		"title": "rpg maker",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-07-10T14:04:16.000Z",
		"content": "does some one know a rpg maker ???[img]http://img.photobucket.com/albums/v177/memsys/goodorevilp.png[/img]"
	},
	{
		"id": 24840,
		"title": "hmm...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-10T14:09:15.000Z",
		"content": "I had one a few years back, which I believe was simply titled \"RPG Maker 2000,\" and it was a pretty script-heavy SNES-style RPG editor.  Very in-depth, but a lot of time required.  Lots of programmable triggers and stuff.  <br /><br />A quick Google search [url=http://members.chello.at/theodor.lauppert/games/rm2k.htm]gave me this[/url], though I didn't check to see if the links worked.  Hope that can help you out some.  :-)"
	},
	{
		"id": 24841,
		"title": "Re: hmm...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-10T14:28:26.000Z",
		"content": "I've always wanted an RPG maker. I even started designing a Keen RPG. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <br />Too bad i have too much to work on. I wish my name was Too Much Spare Time! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 24842,
		"title": "Around here somewhere...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-07-10T14:38:56.000Z",
		"content": "I was searching this up recently for a ten year-old friend-of-a-friend I'm introducing to gamedev. Didn't end up getting a copy (referred him to some Visual Basic stuff) but I believe there was a torrent somewhere, probably at TorrentBox.com.Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 24843,
		"title": "Re:",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-10T16:05:30.000Z",
		"content": "I have RPG Maker 2000, 2003, and XP on my computer. Out of them I think RPG Maker 2000 is the best. RPG Maker 2003 has slightly updated graphics and features, but it's has an active battle system. RPG Maker XP looks visually a lot better than the other RPG Makers and runs at a much greater resolution. It has a slightly altered interface and the English Translation uses an ugly font. Though, I haven't tinkered with it a whole lot.<br /><br />Keep in mind that downloading these programs are illegal, as they were made in Japan and illegally translated to English. So most sites with RPGMaker resources won't have a download for the actual program. <br /><br />I managed to find RPG2003 and RPGXP with relative ease using Google. RPG2000 is also pretty easy to find if you look hard enough, but the Run-Time Package (RTP) required to run the program is slightly less common to find. If you don't want to bother, it probably wouldn't hurt to just start with RPGXP.<br /><br />There are tons of sites with resources and games for RPGMaker. My favorite is gamingw.net . It also features resources for game creator programs like RPG2000, RPG2003, (but surprisingly not RPGXP), the Clickteam games, Sphere, Game Maker, and others. Another site I've gone to in the past is [url=http://www.stgames.net/]www.stgames.net/[/url]<br /><br />Probably the only other alternative to RPG Maker that I know of is RPG Toolkit. I've never really used it before, but it's legal, and it's free (I believe). Try googling it or something.<br /><br />I've attempted to make Keen-based RPGMaker games before, but haven't had much luck, since I try to make my games more exploration based, which takes planning, and setting up a battle system isn't a whole lot of fun. (nor is playing it, IMHO)<br /><br />Also, I don't know who made it, but the Sky Tower Games website has a Commander Keen character set for RPG Maker. I don't know who made it, but it's kinda cool. Though, it makes him look like an adult.<br /><br />[img]http://www.stgames.net/resources/charsets/keen.png[/img]"
	},
	{
		"id": 24844,
		"title": "Re: Re:",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-07-12T09:16:56.000Z",
		"content": "yeay I found a site that has RPG Maker 2000[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br />but i can't use it i need some files but i don't know where to get them [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  [img]http://img.photobucket.com/albums/v177/memsys/goodorevilp.png[/img]"
	},
	{
		"id": 24845,
		"title": "Details?",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-07-12T11:34:03.000Z",
		"content": "It might be possible to help if you tell us which files...Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 24846,
		"title": "Re: Details?",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-07-12T15:53:56.000Z",
		"content": "got them already[img]http://img.photobucket.com/albums/v177/memsys/goodorevilp.png[/img]"
	}
]
