[
	{
		"id": 360,
		"title": "Keen 1 Level Competition WINNERS!!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-03T17:31:18.000Z",
		"content": "It was an awesome level pack, big thanks to everyone who made a level! And here are the winners! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br /><b>The Most Keenish</b><br />[img]http://keengrid.net/keenrush/keenish.png[/img]<br /><b>ceilick</b>, <b>Zorath</b>, and <b>Grandy</b> (each of them with 2 points)<br /><br /><b>The Most Garging</b><br />[img]http://keengrid.net/keenrush/garging.png[/img]<br /><b>Djaser</b> (with 4 points, followed by freeyorp101, z-one, and ceilick, each with 2 points)<br /><br /><b>The Most Yorping</b><br />[img]http://keengrid.net/keenrush/yorping.png[/img]<br /><b>Shadow Master</b> (with 5 points)<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]  <b>Congratulations to all winners!!</b><br /><br />Here you can see who made which level:<br />01 freeyorp101<br />02 z-one<br />03 ceilick<br />04 Zorath<br />05 Commander Spleen<br />06 Genius314<br />07 ElecDude33<br />08 KeenRush<br />09 battleguy01<br />10 xtraverse<br />11 Matze<br />12 Xky<br />13 Levelass<br />14 Grandy<br />15 Djaser<br />16 Shadow Master3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 10958,
		"title": "Winners!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-02-03T18:21:43.000Z",
		"content": "*Thunderous Applause*  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif?ttinline=true\"/><br /><br />Very well organized, presented, and managed contest, KR.  Kudos to you for putting something like this together--I'd be interested in future contests along these lines.<br /><br />Congrats to Ceilick--Your style as a Keener has really come along as time has gone by, and I think you're one of the most productive modders we have.  I should have recognized your ability to construct believable structures out of simple square blocks!<br /><br />Congrats to Zorath--Similarly, you pieced together a set of architecture that really reminded me of Keen1, even if the difficulty was a little higher than the original.  Your level was clearly divided into sections, which really helped the flow, in a player's mind.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/> <br /><br />Congrats to Grandy--Your level was epic-sized, but it was stitched together from recognizable patterns and pieces of Keen levels that were familiar enough to lead us in the right direction, in most cases.  I personally didn't make it too far in your level, but the spirit remains true.<br /><br />Congrats to Djaser--Most Garging, indeed.  Your level was difficult to complete, even with God Mode!  Is it even possible to make the jump for the Blue Keycard?  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif?ttinline=true\"/>  You're cruel.  Very cruel.<br /><br />Congrats to Shadow Master--Welcome to the club!  Your level had consistent design, start to finish, and had a few splashes of color in the architecture.  Pillars of stand-on-able blocks that didn't serve a functional purpose, yet helped the level not feel barren.  I like your style.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />Congrats to everyone who enetered--This was a fantastic community demonstration, and I am thrilled to be a part of it.  You guys are truly Keen.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif?ttinline=true\"/><br /><br />Edit: The only comments MY level received were \"Cute old-school Ice Level\" and \"Not much of a challenge.\"  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>"
	},
	{
		"id": 10959,
		"title": "Re: Keen 1 Level Competition WINNERS!!",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-02-03T19:54:30.000Z",
		"content": "Oh yeah, I finally wan an award in the Keen community and complete in style it's dubious if this one is something to be proud of. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Is it even possible to make the jump for the Blue Keycard?[hr][/quote]<br />Yes, it is but a more important question is if the blue keycard is of any use at all? <br /><br />[quote]<b><i>Quote:</i></b>[hr]You're cruel. Very cruel.[hr][/quote]<br />Hey were did you think the 'c' stands for in Holy C. Djaser?<br /><br />This was my first level, my level design was partly inspired by the Smile mod, so thank you Keenrush. I did the level in maybe two hours or so just to put a few ideas together, some of them worked out great and some of them made the level very difficult/annoying/garging to play. One thing is certain: IF I ever make a mod again it will be easier to play.<br /><br />Congrats to everyone who contributed to the contest no matter if it was with votes or levels. Especially a big thumbs up to the other winners. (Although it's weird that the Keen award winners got my garg nominations)<br /><br />last not least: a big booh and much rotten tomatoes to everyone who didn`t vote but could have. You know who you are!-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 10960,
		"title": "Re: Keen 1 Level Competition WINNERS!!",
		"author_id": 1486722,
		"author_name": "Battleguy01",
		"timestamp": "2007-02-03T22:16:37.000Z",
		"content": "Wow great! That was a really awesome mod, we'll have to do it again, maybe with an added twist."
	},
	{
		"id": 10961,
		"title": "Re: Keen 1 Level Competition WINNERS!!",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2007-02-04T02:21:47.000Z",
		"content": "Great job everyone! It was a lot of fun playing everyone's level(well most everyones, some were really hard! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]  ). Can't wait for a Keen 2 level contest [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 10962,
		"title": "Re: Keen 1 Level Competition WINNERS!!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-02-04T13:31:26.000Z",
		"content": "Rotten tomatoes? Aww, man.------------------<br />www.ericmushroomwilson.co.uk My website is going to go offline <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10963,
		"title": "Re: Keen 1 Level Competition WINNERS!!",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-02-06T15:06:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The Most Yorping: Shadow Master (with 5 points)[hr][/quote]<br />Aha! I would have made it more difficult. For example, in the part of the floor made of green algae, originally the roof was also made of it, and there were 2 additional yorps, making it difficult, plus fire at the entrance, for the player to make it alive with the green key without time and patience.<br /><br />Anyway, talking of level design, my mods, overall, will be composed by really difficult levels... er. Well, not so difficult, just a combination of peaceful levels and dangerous levels with shooting rooms and obstacle-dodging rooms.<br /><br />Huh, I could beat Djaser's level after dying 3 times anyway. Strange, I'm not so nimble.<br /><br />Well, congratulations to you all, and I hope we'll have a Keen 2 level competition too some day. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] ------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	}
]
