[
	{
		"id": 899,
		"title": "Lyrics and tablature sites = Illegal",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-01-19T03:58:06.000Z",
		"content": "Oh, c'mon, music industry, this is just getting silly.<br /><br />[url=http://news.bbc.co.uk/2/hi/entertainment/4508158.stm]news.bbc.co.uk/2/hi/enter...508158.stm[/url][center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 22135,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-01-19T06:51:03.000Z",
		"content": "I typed an essay long response, stating my beliefs and defending my viewpoint... but I decided that everything can be summed up in one statement:<br /><br /><br /><br /><br /><center>People are greedy.</center>"
	},
	{
		"id": 22136,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-19T07:37:37.000Z",
		"content": "I also compiled a long and comprehensive reply, borrowing heavily from Gals main points, but then I realized nobody would read it, and it can also that it too can be summed up:<br /><br />People are stpid and greedy.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22137,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-19T10:16:20.000Z",
		"content": "I read that more than a month ago and I was not impressed. Most tablature sites are still online, I don't know about lyrics sites.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22138,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-01-19T13:50:18.000Z",
		"content": "insane... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />they simply don't respect the art that is music as being a relatively  free artform. i guess this is the price we have to pay when we let money hungering <i>non-musicians</i> to rule the industry.<br /><br />i'm not suprised at all.<br />this is just another step for world domination i'll tell you."
	},
	{
		"id": 22139,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2006-01-19T14:49:47.000Z",
		"content": "This is nice. Everybody is a criminal and should rot in hell! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pig.gif[/img] [hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22140,
		"title": "Re: Lyrics and tablature sites = Illegal",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-19T16:09:27.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  This is nuts.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Come on! This is so lame!<b>Eat your veggies!</b>"
	},
	{
		"id": 22141,
		"title": "Oh Em Gee",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-01-19T21:34:37.000Z",
		"content": "All thats left are midis, and then music will die completely. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br />Rest in peace music...-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 22142,
		"title": "Re: Oh Em Gee",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-19T21:51:19.000Z",
		"content": "Hmmm, I better copyright the silence before someone else does. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 22143,
		"title": "Re: Oh Em Gee",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-01-20T00:23:57.000Z",
		"content": "uhhh..... Jingle Bells?<br />  I'll tell you how much i got sued for including the title of a song in my post. <br />You know who I think works for the music industry?  MORTIMER!<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]"
	},
	{
		"id": 22144,
		"title": "Re: Oh Em Gee",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2006-01-20T02:17:06.000Z",
		"content": "What the music industry assumes is that the people who download something for free would pay for it if they didn't have the free option.<br /><br />If I want to find out the lyrics to a song by Billy Joel or something, I'll look for them if I can find them for free. If I have to pay to find them, my curiosity will not drive me to pay five bucks to find them. The music industry gets no more money out of me than they would if the free stuff wasn't available, and the songs would have less publicity.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 22145,
		"title": "Re: Oh Em Gee",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-01-20T03:12:55.000Z",
		"content": "Keenrush:  [url=http://archives.cnn.com/2002/SHOWBIZ/Music/09/23/uk.silence/]too late.[/url]<br /><br />The onslaught has already begun.  mxtabs.net has turned into a music reviewing site.  taborama.com has their disabled at the moment while they figure out a way to pay royalties.  It's sickening to me, but luckily sites based outside of the US are a little safer.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22146,
		"title": "Re: Oh Em Gee",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-20T10:13:13.000Z",
		"content": "Oh my garg! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  I am sure going to break that kind of copyright.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  How about \"Silence 1:01\"? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  Hahahaha!<b>Eat your veggies!</b>"
	},
	{
		"id": 22147,
		"title": "Re: Oh Em Gee",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-01-20T22:02:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />they simply don't respect the art that is music as being a relatively free artform. i guess this is the price we have to pay when we let money hungering non-musicians to rule the industry.<br />[hr][/quote]<br /><br />It is because things do not come for free.<br /><br />Honestly, if everyone had this mentality of \"Oh, I don't have to buy or pay for music so long as it is online, because these musicians make millions\"<br /><br />Exactly, and they deserve any money they request (At a price that their consumers wish to pay for), and any other demand that they make --<i>they own what they make</i>.<br /><br /><br />Honestly, how would you like it if you wrote a computer program that was state of the art, and then someone copied it online and you no money on your program?<br /><br />I would sure be pissed.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22148,
		"title": "Re: Oh Em Gee",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-01-20T23:52:11.000Z",
		"content": "lol dude i wasn't saying noone should pay for the music.<br />but basicly it's a modern thing to make money out of the music (as a product) so what i meant was it should not be taking so seriously in every aspect, like with these lyrics and tablatures.<br /><br />in fact i do make my own music and i have made several real releases (more to come) but i don't see my music as strictly \"my own\" in every aspect.<br /><br />music should bring people happyness and joy. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-goth.gif[/img] <br />and when the music does, the listeners (consumers) <br />are willing to pay for the art.<br />but i feel that most of the music of today is just <b>too much</b>.<br />we have huge music industry monsters who womits out new artists (products) every day. people are getting stressed up to the point wich is now were they don't think the music is worth paying or even listening to anymore because everything sounds the same and without a soul. people are searching for alternatives now, something with a little more substance.<br /><br />if you read your psychology you will know that there is a breaking point of how much information a human can take.<br />too much information (new music) will stress you until you build up a \"protection\" against it and you ignore it. (<i>over-stimulation</i>) i think it's defineately the case here.<br /><br />a simpler way to put it, people are damn bored without admiting it. the magic of music is lots and people searches for better alternatives to mainstream music."
	},
	{
		"id": 22149,
		"title": "Re: Oh Em Gee",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-01-21T01:52:05.000Z",
		"content": "<i>Honestly, how would you like it if you wrote a computer program that was state of the art, and then someone copied it online and you no money on your program?</i><br /><br />What, you mean like Linux?  Or the thousands of other GPL/free software programs out there you legally don't have to pay for??? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]   I think that if people don't want their stuff illegally copied, they shouldn't publicly release it.  Once you release something to the public you shouldn't complain if it gets copied.<br /><br />If these artists are so intent on making money, they should release a single album of their music and sell it for say, $10 million.  Then, providing they're good enough artists, their fans will get together to raise the money to pay them, and in one sale you've made all the money you want from that album and you shouldn't care if it's subsequently pirated.<br /><br />The problem is that most musicians are only in it for the money, there are very few who do it for the music, and only want enough money to live as comfortably as the rest of us."
	},
	{
		"id": 22150,
		"title": "Re: Oh Em Gee",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-21T02:20:52.000Z",
		"content": "What is needed is a website that people who are willing to make and distribute free uncopyrighted music then nobody could stop it.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22151,
		"title": "Re: Oh Em Gee",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-01-21T02:33:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What, you mean like Linux? Or the thousands of other GPL/free software programs out there you legally don't have to pay for???  I think that if people don't want their stuff illegally copied, they shouldn't publicly release it.<br />[hr][/quote]<br /><br />Are you some spoiled little brat or something?  \"If they release it into public, people should be allowed to copy it\".  That is your logic?  Do you have a functioning brain?  Would you walk into shop and steal their merchandise, just because it is 'released to the public'?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Once you release something to the public you shouldn't complain if it gets copied.<br />[hr][/quote]<br /><br />That's like stealing from a blind person then telling them it's their fault.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />If these artists are so intent on making money, they should release a single album of their music and sell it for say, $10 million. Then, providing they're good enough artists, their fans will get together to raise the money to pay them, and in one sale you've made all the money you want from that album and you shouldn't care if it's subsequently pirated.<br />[hr][/quote]<br /><br />That is assinine.<br />[quote]<b><i>Quote:</i></b>[hr]<br />The problem is that most musicians are only in it for the money, there are very few who do it for the music, and only want enough money to live as comfortably as the rest of us.<br />[hr][/quote]<br /><br />Who gives a shit how much they want?  They make the merchandise, they set the price.  Get over it.<br /><br /><br />God, socialists piss me off...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22152,
		"title": "Doo dee doo.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-01-21T04:35:03.000Z",
		"content": "Glo, dude, settle down.<br /><br />[hr]<b>Malvineous</b> What, you mean like Linux? Or the thousands of other GPL/free software programs out there you legally don't have to pay for???<br />[hr]Or Keen mods, fangames, utilties?<br /><br />[hr]<b>Globox</b> Would you walk into shop and steal their merchandise, just because it is 'released to the public'?<br />[hr]I can't stand hearing this argument. I pay for music, movies and software because I want a hard copy of the product. I pirate people's works like mad, and I will eventually buy the ones that I enjoyed.<br /><br />Duplicating a work isn't stealing. Copying it and claiming it as either your own work or the genuine article is.<br /><br />Oh, well. This kind of argument never leads anywhere, so I'll tell you this much. When I complete a game, or in fact any virtual work, that is worth selling, it'll be freely available to download from the Web, as well as in the form of a retail box that can be ordered online which can be freely copied and passed on to others.<br /><br />It won't just be some empty shell of a box enclosing a CD, either. I'll put as much stuff in there as the scale of the game warrants (manuals, posters, etc), just like in the good old days when you could take pride in an off-the-shelf game you'd just purchased. The little extras are what make it all worthwhile, and the stupid thing about the industry's tendency to cut back on them is that they cost practically nothing.<br /><br />In the meantime I'm going to behave as if that's how the industry works, regardless of how many bullshit measures they introduce to the contrary.<br /><br />[hr]<b>Globox</b> Who gives a shit how much they want? They make the merchandise, they set the price. Get over it.<br />[hr]I'd be all for that, except that the musicians rarely set the price. It's the corporate money-grabbers that dictate how much we're meant to shell out, as well as how much of that goes to the artist. In my mind the real pirates are the publishers.<br /><br />Woo, I could cook a barbecue with all the flaming I'm in for.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22153,
		"title": "Re: Doo dee doo.",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2006-01-21T06:04:17.000Z",
		"content": "Yes, damn those fansites for giving their favourite artists all that free publicity. Damn them all to hell. <br /><br />That'll teach all those people who hear songs on the radio, then Google the lyrics, find out what the song's called then go and buy it a lesson.<br />(disclaimer: I know very well that it <i>is</i> against the law, but in my own personal opinion I think the free publicity would be more beneficial than whatever money was lost -and how much is that, exactly?- on tabs sites for artists who don't actually sell tab books)<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Globox: </b>Honestly, how would you like it if you wrote a computer program that was state of the art, and then someone copied it online and you no money on your program?[hr][/quote]<br />I could understand the point behind this analogy if the issue was copying and freely distributing songs. But it's lyrics and tabs, not actual songs. <br /><br />People are not going to find the lyrics to the songs and say \"well, now that I've got the lyrics, I don't need to go and buy the song\".<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Globox: </b>Are you some spoiled little brat or something? \"If they release it into public, people should be allowed to copy it\". That is your logic? Do you have a functioning brain? Would you walk into shop and steal their merchandise, just because it is 'released to the public'?[hr][/quote]<br />You'll note that Mal said actually said, \"I think that if people don't want their stuff illegally copied, they shouldn't publicly release it.\" <br /><br />I've really got no idea how you managed to extract \"If they release it into public, people should be allowed to copy it\" from that.<br /><br />And I agree with what Mal <i>actually</i> said. Although it's sad and unfortunate, it's foolish for an artist to release something these days and really expect it not to be copied and illegally thrown around online. And the best way to prevent that would be not to release it at all.<br /><br />I also agree that just because it's released in public is absolutely no reason or justification to <i>allow</i> it to be copied.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>Spleen: </b>Woo, I could cook a barbecue with all the flaming I'm in for.[hr][/quote]<br />Pass a sausage - I'll probably be joining you."
	},
	{
		"id": 22154,
		"title": "Re: Doo dee doo.",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-01-21T13:26:00.000Z",
		"content": "This is either going to turn into a flamewar or, um... something else. But yeah, tabs and lyrics aren't the same as putting the actual song on there. And all that. But honestly, I'm not going to say much because I don't want to get involved. It always turns into some moronic argument with people getting called communists and so on.------------------<br />Nothing in particular"
	},
	{
		"id": 22155,
		"title": "Re: Doo dee doo.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-01-21T13:56:12.000Z",
		"content": "[hr]<b>Spike</b> People are not going to find the lyrics to the songs and say \"well, now that I've got the lyrics, I don't need to go and buy the song\".<br />[hr]Yeah, and that's like robbing a blind man and then deciding \"Now that I've robbed this blind man's money, I don't need to go out and spend it!\"<br /><br />Now that I think about it... what was the deal with that analogy?<br /><br />*shrugs*<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22156,
		"title": "Re: Doo dee doo.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-01-21T15:32:10.000Z",
		"content": "As I would have said earlier had I not decided to sit back and enjoy the argument/flamewar (and there's a very fine but very noticable line between those two) I have only ever used lyrics sites to find music I couldn't remember the name of and then subsequently bought. Whilst content providers have every right to take these sites off the 'net, it's their customer's money they're losing.<br /><br /><b>EDIT:</b> If you're interested, I've highlighted in bold what differentiates a flamewar from an argument:<br />[quote]<b><i>Quote:</i></b>[hr]<b>Are you some spoiled little brat or something?</b> \"If they release it into public, people should be allowed to copy it\". That is your logic? <b>Do you have a functioning brain?</b> Would you walk into shop and steal their merchandise, just because it is 'released to the public'?[hr][/quote]<br />The point where people start throwing personal insults is the point where you can't have a proper debate anymore.[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 22157,
		"title": "Re: Doo dee doo.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-21T17:22:24.000Z",
		"content": "I agree with Globox that people should pay for music and movies they want. However there is never a black and white area, there is always a grey part. Like Spleen pointed out, nobody can expect people to buy stuff when they don't know if it's good. I'm a fan of more alternative music, music from bands that sometimes don't have a site, and nowhere samples of their songs uploaded. So I download their stuff first to know if it's worth purchchasing. While maybe illegal, it would not consider this as immoral. What is immoral in my eyes is to never go to a concert, never buy a cd, never buy a dvd, never go the cinema but to download everything. People who behave like that usually like to make fun of people who do want to pay of art. This kind of people should be shot because they are the ones that make cd, dvds, concerts, and movie tickets so expensive and cause those annoying copy protection. It wouldn't be a problem if there where just a few of them but they are the majority. <br /><br />Oh and Grafix please don't be such a crybaby, ok?-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22158,
		"title": "Re: Doo dee doo.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-01-21T18:25:31.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Malvineous What, you mean like Linux? Or the thousands of other GPL/free software programs out there you legally don't have to pay for??? Or Keen mods, fangames, utilties?<br />[hr][/quote]<br /><br />Mods and fangames == real product. That, and the publishers have not <br /><br />I'm not talkign about just 'free programs', I'm talking about pirating.  The people who make music work hard at what they make.  Respect them and do what they request, or don't bitch when they sue you.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />can't stand hearing this argument. I pay for music, movies and software because I want a hard copy of the product. I pirate people's works like mad, and I will eventually buy the ones that I enjoyed.Duplicating a work isn't stealing. Copying it and claiming it as either your own work or the genuine article is.<br />[hr][/quote]<br /><br />Pirating, whether with intent to buy or not, is stealing.  I'm sorry that you can wave your conscience around it by labelling it something else, but that's what I think Demo's are for. --;<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />When I complete a game, or in fact any virtual work, that is worth selling, it'll be freely available to download from the Web, as well as in the form of a retail box that can be ordered online which can be freely copied and passed on to others.It won't just be some empty shell of a box enclosing a CD, either. I'll put as much stuff in there as the scale of the game warrants (manuals, posters, etc), just like in the good old days when you could take pride in an off-the-shelf game you'd just purchased. The little extras are what make it all worthwhile, and the stupid thing about the industry's tendency to cut back on them is that they cost practically nothing.In the meantime I'm going to behave as if that's how the industry works, regardless of how many bullshit measures they introduce to the contrary.<br />[hr][/quote]<br /><br />I am glad that you are goign to make your software free.  In the mean time, their software is not yours, and you msut respect their rights or risk getting sued. End of story.<br /><br />So becaue you do not like what they are doing, you're going to steal their products?  That's a great arguement.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I'd be all for that, except that the musicians rarely set the price. It's the corporate money-grabbers that dictate how much we're meant to shell out, as well as how much of that goes to the artist. In my mind the real pirates are the publishers.<br />[hr][/quote]<br /><br />So since the evil, money-grabbing corporations set the price, they are damaging the artist?  Oh that's rich.<br /><br />I think 50 cent got about 2 million for his first record deal.  Yes, it is <i>horrible</i> what those money-grabbing bastards pay those poor, moneyless artists!<br /><br />Grow up.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22159,
		"title": "Re: Doo dee doo.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-21T18:36:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Pirating, whether with intent to buy or not, is stealing. I'm sorry that you can wave your conscience around it by labelling it something else, but that's what I think Demo's are for. --;[hr][/quote]<br /><br />That's nice but it's hard to find demo's, trailers, samples of. let's say, about 80% of all games, movies, cds, etc.  As I pointed out in my previous post. <br /><br />Music/game/movie companys should also look at themself and not only at the public. What if you're favourite artists releases a cd and you can't play it because it has the newest and advanced copyright protection? Happened to me various times.<br />You're point that it's their right to do so and you just have to accept it might hold up in court but it is as insane as Malvenious idea that fans could raise 10 $ to make an artist release it's cd.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22160,
		"title": "Re: Doo dee doo.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-01-22T05:42:29.000Z",
		"content": "What the hell has happened to music?<br /><br />If (actually when) I become an artist, I'm going to be much happier with more publicity than more record sales.  More publicity means more people knowing about my music (which is the goal of making music, creating an art form that people can enjoy), and more people coming to my concerts, which ends up meaning more money for me.  Let's be serious here, most artists don't make shit off record sales.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22161,
		"title": "Re: Doo dee doo.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-22T08:44:05.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]tists don't make shit off record sales.[hr][/quote]<br />And there is a reason for that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]people coming to my concerts[hr][/quote]<br />The people who intend there concerts are not the people who downloaded all their cds.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22162,
		"title": "Re: Doo dee doo.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-01-22T09:21:34.000Z",
		"content": "Really?  I've gone to shows of plenty of artists that I haven't actually bought cds of, as have many of my friends.  Granted, I have bought cds at some of the shows I've been to, but you're still way off on that comment.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22163,
		"title": "Re: Doo dee doo.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-22T11:05:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Really? I've gone to shows of plenty of artists that I haven't actually bought cds of, as have many of my friends. <b>Granted, I have bought cds at some of the shows I've been to,</b> but you're still way off on that comment. [hr][/quote]<br />Exactly, now tell me how many of your friends go to concerts and never buy a cd? <br />They exist but that are people who do not really attend concerts for the music<br /><br />I yet have to find the first artist who is glad with downloading.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22164,
		"title": "Re: Doo dee doo.",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-01-22T13:19:47.000Z",
		"content": "if noone has mentioned it before, downloading can help people get to know new music too! more listeners = more attention and possibly more cash if the listeners feels like suporting the artist they like.<br /><br />i still believe that the downfall of buying music is because of the music itself is pure crap. not that people don't want to buy the stuff. why should they buy something they don't like?"
	},
	{
		"id": 22165,
		"title": "Re: Doo dee doo.",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-01-22T22:02:08.000Z",
		"content": "Do you guys serously think enough people are going to take this seriously to enforce stuff like this?  If absolutely noone is going to follow the rule, what are they going to do, throw everyone in jail?  i'm talking about the tabs and lyrics thing, but for the downloading music debate, i think that's a little deeper.  I don't think they can enforce no lyrics or tabs, but they might be able to do something about downloading the actual songs.  <br />I know people who download thousands upon thousands of songs and don't buy any cds, and i know people who dont download anything and buy all their music, but anyway, having music available for download definitely does not help the music industry. Why buy it if you can just download it?<br /> Oh, and i agree with those who say the music industry is complete crap now. Don't you wish the sixties would just come back?"
	},
	{
		"id": 22166,
		"title": "Re: Doo dee doo.",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-01-23T00:09:57.000Z",
		"content": "i buy the stuff i find worth spending my precious little heap of money on and i'm doing so even if i have the possibility to download it for free with same quality. (i'm not just talking here)<br /><br />do you think i am the only one thinking like that?<br />the ability to download have helped me discover many new artists i'm willing to support with my own money because they bring something new and something special into my life.<br />i can't say britney or any of those damn american productions bring me anything of substance, but maybe i'm just a stupid person who demands too much??<br /><br /><br />okay what's the point of speaking your heart out here anyway [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br />i guess i'll have to ride out this storm like everybody else..."
	},
	{
		"id": 22167,
		"title": "Re: Doo dee doo.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-01-23T10:36:54.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]if noone has mentioned it before, downloading can help people get to know new music too! more listeners = more attention and possibly more cash if the listeners feels like suporting the artist they like.[hr][/quote]<br />Several times yes, and I don't see a problem in that if that would be the only reason.<br /><br />[quote]<b><i>Quote:</i></b>[hr]i still believe that the downfall of buying music is because of the music itself is pure crap. not that people don't want to buy the stuff. why should they buy something they don't like? [hr][/quote]<br />I don't. There is more music around then in the hitlists.-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22168,
		"title": "Re: Doo dee doo.",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-01-23T12:23:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't. There is more music around then in the hitlists.[hr][/quote]<br /><br />ofcourse, but when the big recordcompanies whine it's often because their own music don't sell good enough. they don't find it a good thing that people have turned to alternative stuff since they can't make any money out of it even if the alternative stuff is 100% legaly bought by the listeneres. i have seen bosses for minor labels talking about how great filesharing is for them since it could help them get free promotion (instead of making expensive music videos and campaigns for promoting artists)<br /><br />the big labels don't act upon principles, it's just a big money deal for them because that's all that counts, so they see a chance to make the rules even more strict to gain more money. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img]"
	},
	{
		"id": 22169,
		"title": "Re: Doo dee doo.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-23T13:29:42.000Z",
		"content": "\"I don't. There is more music around then in the hitlists.\"<br />Definitely agree. The \"hitlists\" suck! There's a lot excellent music around, elsewhere.<b>Eat your veggies!</b>"
	},
	{
		"id": 22170,
		"title": "sfdlkje",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-02-04T04:22:14.000Z",
		"content": "Greed and stupidity.  What do they expect, for us to spend money to look at lyrics or something?<br /><br />Even acting against song downloads has for more theoretical viability than this.  Lyrics <b>are</b> free ads.  Now the music companies are just turning paranoid, and looking to make a buck on settlements."
	},
	{
		"id": 22171,
		"title": "Hmm",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-02-04T15:02:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I yet have to find the first artist who is glad with downloading.[hr][/quote]<br />They may be Giants.<br /><br />Rhythmicru...<br /><br />Probably a lot more too.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22172,
		"title": "Re: Hmm",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-02-10T22:09:26.000Z",
		"content": "I don't mind if you download my music.<br /><br />...<br /><br />Please download my music! ...oh wait, it's not really um... there to download yet. At leat not much of it. Never mind then.------------------<br />Nothing in particular"
	}
]
