[
	{
		"id": 556,
		"title": "Oooh Glo artwork!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-29T02:53:46.000Z",
		"content": "Yes; after several years of lying on this I've decided to release my- OW!<br /><br />Anyway, as I was saying my ar-OW!<br /><br />Alright! Alright! Its LordofGlobox's art! Yeesh!<br /><br />Anyway, it appears he did a lot of art for fangames that didn't ever see the light of betatesting. So, since he's entrusted it to me, I'm splashing it al over the net for everyone to see.<br /><br />Even if he is jabbing me with a pencil<br /><br />Art:<br />[url=http://www.deviantart.com/deviation/35506206/]www.deviantart.com/deviation/35506206/[/url]<br />[url=http://www.deviantart.com/deviation/35506526/]www.deviantart.com/deviation/35506526/[/url]<br />[url=http://www.deviantart.com/deviation/35507001/]www.deviantart.com/deviation/35507001/[/url]<br />[url=http://www.deviantart.com/deviation/35507385/]www.deviantart.com/deviation/35507385/[/url]<br />[url=http://www.deviantart.com/deviation/35507565/]www.deviantart.com/deviation/35507565/[/url]<br /><br />Screenshots:<br />[url=http://www.deviantart.com/deviation/35507209/]www.deviantart.com/deviation/35507209/[/url]<br /><br />Go look at it now! I comand you!<br /><br />OUCH! Okay, and credit to Glo!<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 15042,
		"title": "Re: Oooh artwork!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T03:18:00.000Z",
		"content": "<i><b>EDIT: To get my pics, you need to hit \"Full size Image\"</b></i><br /><br />So, I meant to post these months ago... I just never got around to it.  Prior to this, only Floase had these graphics. (Unless he handed them to other people.)<br /><br />NOTE: I SPENT LITERALLY THOUSANDS OF HOURS MAKING THESE.  DO NOT F**K WITH AN ARTIST AND HIS WORK.  PLEASE CONTACT ME IF YOU INTEND ON USING THESE, OR I WILL MAKE YOUR LIFE A LIVING HELL!<br /><br /><br />Those are all my major renditions of Keen and Norp, plus the ideas I've had before that.<br /><br /><br />ARTIST's COMMENTARY:<br />First of all, you all should know that each time I re-made, and re-announced my Keen &amp; Norp game series --I made new graphics.  I've announced it many times, but lately, I've been getting to good at it, that I can complete nearly the entire series of tiles/sprites in 1.5-2 months.<br /><br /><br />The first series I did last March --only XkyRauh and Flaose knew about that rendition 7.  Rendition 7 is special to me because it was the first time I had completed almost 50% of my sprites and made a stable Engine for Commander Keen (With a lot of help from AdamMarrero) in less than 5 weeks.  *the engine is not released yet, nor do I think I'll ever release it.  But I did have a basic demo, also not released*<br /><br /><br />Now, Rendition 6 (Picture#2) is special to me because it's the first time I have ever sat down and done the entire tile and enemy set for Keen 2 &amp; Keen 3 in two months.  Yes, I did them all.  I did it last summer (Of '05).  I barely got to any programming... ALthough I do have atleast two demo levels *Also not being released*<br /><br />The next one is aptly called \"GameHelpv1.0\" --I file I literally worked on for 3 years.  It compiled and assembled every known graphic of Commander Keen 1-6.  I also have one for Enemies, but that's not being released right now.  This was made from mid-2000 to late 2002.<br /><br /><br />Rendition 5 is the next TWO files.  It was not worked on for very long, but I did have some nice work.  It was worked on around Christmas of 2004.<br /><br /><br /><br />There was a few more pics, I think, but those are just other stuff.<br /><br />The rest of the Renditions are either not being released or are destroyed in the depths of time.  (Rendition 4 I have in the Screen shot, but I have about 30-40 individual sprites [Not released] and tiles of that Rendition, but no Station.  A Station is the name I use for my main Picture file that I do my graphics on.)<br /><br />Rendition 1 was the shortest, I only had one sprite for it -- a Vorticon-- which is now lost forever.  (Unless I saved it to a disk, but that disk is now lost in the depths of time.<br /><br /><br />Comments?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 15043,
		"title": "Re: Oooh artwork!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T16:10:23.000Z",
		"content": ".... No comments?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 15044,
		"title": "Re: Oooh artwork!",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-29T16:52:06.000Z",
		"content": "Pretty damn cool - it'll definitely be interesting to see the end result. You don't happen to have any animations of those sprites, do you?"
	},
	{
		"id": 15045,
		"title": "Re: Oooh artwork!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-30T03:48:11.000Z",
		"content": "Hundreds of them.  I'll make a ZIP for all my work at a later date, but right now I'm not too concerned with doing this.<br /><br /><br />(I'm not working on this project right now, just so everyone knows.  I just felt I should release them for community to use, look at, get inspiration from, etc.)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 15046,
		"title": "Re: Oooh artwork!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-30T22:09:42.000Z",
		"content": "Ah, yeah, it looks very nice. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Especially the high-res sprites! The vorticon elder looks pretty cool.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 15047,
		"title": "Woog.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-07-02T00:52:50.000Z",
		"content": "Wow. There's some incredible stuff in there. I've been looking for a top-down BWB image... I'll put that to good use sometime. This stuff needs to be placed in a more accessible location--it'll be a valuable resource for all Keen developers. And just looking at it is giving me all sorts of ideas for all my projects, not just Keen-related ones.<br /><br />This is neat."
	},
	{
		"id": 15048,
		"title": "Re: Woog.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-02T04:10:51.000Z",
		"content": "Thanks....<br /><br />Could a Mod move this?<br /><br /><br />*laughs at himself* \"Could a Mod move this..\"? that's priceless...<br /><br /><br /><br />Anyways... If you want another one (The one with about a billion commander keen enemies + a BETA Shakadi sprite for the World Map...) gimme a holla on MSN.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 15049,
		"title": "Okay... People....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-03T02:36:43.000Z",
		"content": "People, post one way or another.<br /><br />I didn't shred hours of my life to have people download my work and not say a damn thing.  Either say it sucks, it's okay, you've seen better.... Or don't d/l it, please.<br /><br />I like comments."
	},
	{
		"id": 15050,
		"title": "Re: Okay... People....",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-07-03T20:53:34.000Z",
		"content": "There's not a whole lot to comment on, really. The artwork is better in some places than others, but what I like best is the ideas. Keen in the BwBM, the BwBM flying and shooting, wetsuit-Keen with a gun, Keen wearing robes, and so on. All things that make me think, \"I'd like to play a game like that.\" So it's fun to look at from that angle.<br /><br />I also like the Keen sprites where his white gun is replaced by the Keen 1 raygun. It always bothered me that his gun was green before he picked it up, but was a little white thing when he fired it. I've got a partially complete set of Keen sprites that I made to cheer myself up about it in which he's holding the green gun (and has it strapped to his hip at other times).________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 15051,
		"title": "Re: Okay... People....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-04T02:11:32.000Z",
		"content": "Eh, I suppose.<br /><br /><br />I tried out a whole bunch of ideas back in the day...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 15052,
		"title": "Re: Okay... People....",
		"author_id": 1486597,
		"author_name": "kittyyorp",
		"timestamp": "2007-05-23T03:20:05.000Z",
		"content": "Glo = King of MS Paint in case you guys didn't know. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 15053,
		"title": "Re: Okay... People....",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-05-23T21:24:19.000Z",
		"content": "You're posting in some pretty old threads, you know.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 15054,
		"title": "Re: Okay... People....",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-05-24T03:05:35.000Z",
		"content": "Yeah, she's an old timer; we both made the mistake before.  Nevertheless, she knew it and didn't care.  And it's not like PCKF is active enough that it really matters.<br /><br />Hell, I think the bottom of this page is what, like 7 month old posts?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
