[
	{
		"id": 976,
		"title": "Sexuality",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-19T01:58:40.000Z",
		"content": "What do you think is a morally (Obviously not adhering only to a Christian perspective) correct sexuality?  Do you beleive that any form of sexual intercourse outside of vaginal man with a woman sex is immoral?<br /><br />What's your opinion on pedophilia, homosexuality, masacism, or any such fettist/sexual abnormalities?<br />(Although, Froyd, I beleive, argued that the only abnormal sexual preference is to have none).<br /><br />Basically, thoughts?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23258,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-19T09:13:01.000Z",
		"content": "Mmmh, is that the smell of smoke? There's the finest hint of flame war in the air.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  Hope not..<br /><br />Anyways; about the first question, really not sure. Personally I don't find the idea of oral sex or such very tempting, but it being immoral, don't know about that.<br /><br />The different paraphilias are quite interesting in my opinion, although with that I don't mean I personally have them. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  Some of them are entirely wrong on my list, but generally I don't consider all of them or different fetishes bad. For example, if someone would prefer doing it only underwater, what's the big deal?<br />See: [url=http://en.wikipedia.org/wiki/Paraphilia]en.wikipedia.org/wiki/Paraphilia[/url]<br /><br />Of the ones you listed, I think pedophilia is entirely wrong. Generally I consider wrong all the acts that are towards people that aren't of your age, or are a lot older than you, if the other is physically abnormal, unconscious, dead, forced to something, rape etc.. Generally wouldn't consider anything physically dangerous to oneself or either to someone else being very good. Oh, and forgot animals. Humanoids are fine. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23259,
		"title": "Re: Sexuality",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-19T11:35:56.000Z",
		"content": "1.) Concerning natural sex:<br /><br />Vaginal mf is the only natural, but that doesn't mean it is the only moral. However, a lot of what is today acceptable I find disgusting. [Not say, homosexual, but the more interesting multiple penetrative positions that fill my inbox inviting me to view them.]<br /><br />2.) Concerning immoral sex:<br /><br />Anything done without a participants consent [rape in all its forms, drugging, cocerion, etc.] or anything done purely for commercial gain. I also dislike sex for sex's sake, it feels too much to me like turning a pleasurable and personal act into something like taking drugs, you do it because its something mildly pleasant to pass the time.<br /><br />3.) On Pedophillia and homosexuality<br /><br />Just because its this, doesn't mean its all bad, but doesn't mean its all good either. Everything has grey areas. Otherwise, I'm broadly supportive.<br /><br />4.) On sexual fetishes and abnormalities<br /><br />Abnormalities by their definition are abnormal and I hate them. Fetishes I'm so-so on. If a fetish involves harm to another being [viewing child porn, zoophilia, crush flicks.] unreasonable personal harm or emotinal harm to oneself or others, or undue stress in life [where a fetish begins to control a persons life like an addiction to smoking] then they should get help.<br /><br />5.) On having no sexual preference.<br /><br />Freud sucks! He was a fraud, paranoid, faked his data and an overall a$$hole!<br /><br />Aside from that, those with no sexual preference [Asexuals] are heavily discriminated against in society today. So you can like on sex, the other, or both, but not neither? Even religions imply that no sex has to be worked at, is an unatural state reached through an effort of will. These people are called frigid, geeks, not gtting any, and worse. It seems inconcievable to people today that yes, there are people who aren't nterested in sex, who can have a relationship outside the bedroom. Societies attitude to these people makes me sick!<br /><br />:/rant<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23260,
		"title": "Asexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-19T12:41:34.000Z",
		"content": "Asexuality is definitely a very good thing in my opinion. Those who are asexual can be proud of it. The common attitude towards them is rather negative, too bad. But that's probably because today sex sells. Media is targeted and brands/crap are sold for sexuals mostly, thus making the public opinion like that. Today it's told everywhere that sex is something special and important, although it's neither. These days it's \"love = sex\".<br />If there is no sex, or not once a day, the relationship isn't good or the other is gay and not interested. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]    This picture one can easily get from the surrounding 'culture'.<br />The reason I always blame media, advertising, and brands is that I really think they have a huge impact on people. They really define opinions.<br />The whole thing is overrated, if I'd ever find a female friend it'd be more than nice if she were completely asexual. Most asexuals don't just want the sex part, but still want a relationship. For them the relationship is based on love rather than to sex as opposed in many sexual ones. Sex is too important for many sexuals; I wouldn't call it much of love if one is ready leave the other if for some reason they don't have sex anymore, the love is just sex's side product for them.<br />Anyways, I hope nobody keeps asexuals as a threat for some reason. I can understand perfectly how someone can thing sex is disgusting (although many asexuals don't find it exactly disgusting, just not something they'd like to do), it's rather grotesque when you think about it; having your own body parts pushed inside some other person (or some other thing in worst case), sweat, fluids.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  <b>Eat your veggies!</b>"
	},
	{
		"id": 23261,
		"title": "Re: Asexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-19T16:01:49.000Z",
		"content": "Right, you would like to marry someone who doesn't want sex with you.<br /><br />Yeah right.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23262,
		"title": "Re: Asexuality",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-19T18:41:28.000Z",
		"content": "So not having sex is a goal to reach?  I would beg to differ.  Sexuality is a part of human nature.  Maybe we would be better off without it, but I still think having none at all is some how... Incorrect.<br /><br />At any rate... Abnormalities... I meant fettishes (However, I would define sexuality as a group of fettishes).  So exactly what did you mean by abnormalities LL?  And why are they so atrocious?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23263,
		"title": "Re: Asexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-19T21:19:20.000Z",
		"content": "\"Right, you would like to marry someone who doesn't want sex with you.<br /><br />Yeah right.\"<br /><br />Yes, to answer your question. Personally I'm not that interested in it anymore (not long ago I would've been rather interested). People change. I don't find the idea very pleasing, I don't think I'd really want it.<br /><br />LoG, but why should people that simply don't feel anything force theirselves do it? Why do you see that incorrect? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23264,
		"title": "Re: Asexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-20T04:19:54.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Yes, to answer your question. Personally I'm not that interested in it anymore (not long ago I would've been rather interested). People change. I don't find the idea very pleasing, I don't think I'd really want it.[hr][/quote]<br /><br />I think that's just an idea in your head. Last time I read about someone married who wasn't asexual and didn't have sex was a year ago. I almost never happens and you won't be an exception when the time is there. <br />It's like sleeping and eating, I don't like these things either but it's part of life. -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23265,
		"title": "la.",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2005-10-20T06:42:50.000Z",
		"content": "I like eating, sleeping, and sex too.  My opinion is simple - whatever floats your boat is fine, as long as you harm anyone.  I'm also of the opinion that you should have sex with however you plan to marry before you do."
	},
	{
		"id": 23266,
		"title": "Re: la.",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-20T07:56:10.000Z",
		"content": "As a believer in 'no sex before marriage', I guess I have a long wait ahead. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  Although I find the idea of sexual intercourse (similarly to KeenRush) undesirable, let's face it, it's a part of life. And i'd probably enjoy it immensely whenever I try it.<br /><br />I don't think there's anything wrong with exploring new ways of \"expressing love\", however there are quite a few \"techniques\" that I find awfully disgusting. I think genitalia should only come in contact with genitalia of a member of the opposite sex. 'Nuff said.-- Censorship is F**ked! --"
	},
	{
		"id": 23267,
		"title": "Re: la.",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-20T07:58:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]you should have sex with however you plan to marry before you do.[hr][/quote]<br />I agree with that. You don't want to be honeymooning and have the whole trip ruined when you find out your new wife suffers from extreme vaginismus or something. Not that that should stop you from marrying someone you love, but some sort of sexual problem would be a rude shock to a couple of newlyweds. Better to do your research beforehand.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23268,
		"title": "Re: la.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-20T11:02:59.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Right, you would like to marry someone who doesn't want sex with you.<br /><br />Yeah right.[hr][/quote]<br /><br />Its actually not that hard. Once again more prejudice. My Aunt 'Joe' [Don't ask me her real name, I have forgotten] hasn't had sex... well, pretty much ever. And she's been married quite some time.<br /><br />[quote]<b><i>Quote:</i></b>[hr]So not having sex is a goal to reach?[hr][/quote]<br /><br />So being gay or hetero is a goal to reach?<br /><br />You misunderstand, Asexuality is a condition, just like bisexuality, it is not a goal, it is the way some people <i>are.</i><br /><br />[quote]<b><i>Quote:</i></b>[hr]I still think having none at all is some how... Incorrect.[hr][/quote]<br /><br />And its people like you that contribute to such prejudice.<br /><br />[quote]<b><i>Quote:</i></b>[hr]It's like sleeping and eating, I don't like these things either but it's part of life.[hr][/quote] <br /><br />Perhaps, but again, there have been arguments that gays are just going through a phase, and all they need is a good woman to set them straight. Just put the two together, and the natural thing will happen.<br /><br />What you people seem to fail to understand [like society at large] is that there are people out there whose desire not to have sex is as strongly expressed as the desire to have sex in 'normal' people. You seem to think that just because it is a lack of desire, that it is not really a condition at all. This is like saying to a gay 'Yes, but maybe you'd enjoy hetero sex immensly if you tried it, maybe your lack of desire to engage in it is all in your mind?'<br /><br />There are asexuals who are disgusted by sex with anyone as much as gays are disgusted by hetero sex [when attempting it] or 'normal' people by gay sex. Asexuality is a spectrum, ranging from those with 'unusually' low sex drive, through those with no sex drive to those who are repelled by the thought of sex.<br /><br />Peoples denial off this condition really pisses me off, my brother is asexual, and it has caused him no end of troubble, especially since the local gay group tried to 'convert' him, believing he was really gay.<br /><br />Here, read these nice little pages, maybe your ignorant attitudes will change.: <br /><br />[url=http://www.asexuality.org/Theory/ranges.htm]www.asexuality.org/Theory/ranges.htm[/url]<br /><br />[url=http://www.asexuality.org/Theory/asexuality.htm]www.asexuality.org/Theory/asexuality.htm[/url]<br /><br />[url=http://www.asexuality.org/info.htm]www.asexuality.org/info.htm[/url]<br /><br /><br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23269,
		"title": "Re: Sexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-20T12:58:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Its actually not that hard. Once again more prejudice. My Aunt 'Joe' [Don't ask me her real name, I have forgotten] hasn't had sex... well, pretty much ever. And she's been married quite some time.[hr][/quote]<br />And is she married? And if so how does her husband think about it?<br />[quote]<b><i>Quote:</i></b>[hr]Perhaps, but again, there have been arguments that gays are just going through a phase, and all they need is a good woman to set them straight. Just put the two together, and the natural thing will happen.[hr][/quote]<br />So what? I've never been part of that kind of arguments.<br /><br />[quote]<b><i>Quote:</i></b>[hr]What you people seem to fail to understand [like society at large] is that there are people out there whose desire not to have sex is as strongly expressed as the desire to have sex in 'normal' people. You seem to think that just because it is a lack of desire, that it is not really a condition at all. This is like saying to a gay 'Yes, but maybe you'd enjoy hetero sex immensly if you tried it, maybe your lack of desire to engage in it is all in your mind?'[hr][/quote]<br />I'm aware that the desire of seks between people differs. I have no problems with gay or asexual people whatsoever. You should know that. My point is that someone who is not asexual can't deceide in one night that he doesn't want seks anymore. It's the same for a gay person to say; hey I don't like men anymore I'll stick to women from now on. Wouldn't that be ignorant and naive?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23270,
		"title": "Re: Sexuality",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-20T13:59:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And is she married? And if so how does her husband think about it?[hr][/quote]<br /><br />Yes, oh yes. For years now. I don't know what my uncle thinks about it though. They had some marrige problems when she started drinking, but thats over now.<br /><br />[quote]<b><i>Quote:</i></b>[hr]So what? I've never been part of that kind of arguments.[hr][/quote]<br /><br />No, but you are applying an identical argument to other people. Its like justifying hating muslims by saying you've never hated blacks.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You should know that. My point is that someone who is not asexual can't deceide in one night that he doesn't want seks anymore.[hr][/quote] <br /><br />Of course. Simalarly, no gay person has ever sat down one day and said 'You know, I'm gay.' They've had to find out as they realize what their attractions are. This point is null and void.<br /><br />[quote]<b><i>Quote:</i></b>[hr]It's the same for a gay person to say; hey I don't like men anymore I'll stick to women from now on. Wouldn't that be ignorant and naive?[hr][/quote] <br /><br />This is a misomer. For a gay person to do that their desire would have to change first. [usually anyway.] I don't see how this is anything like someone who's never felt sexual attraction suddenly hearing about asexuality and going 'Wow, other people are like that? Its kinda normal? Am I asexual? I think I am.' Imagine if homosexuality was hidden away, would you not expect a gay person on hearing about it to say something like 'Wow, now I know what I am.'?<br /><br />I just wish people would stop sweeping this under the carpet like 'Oh thats nice. Of course its not real, just a bunch of crap invented by people who aren't getting any.' It really, really pisses me off.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23271,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-20T14:00:28.000Z",
		"content": "\"My point is that someone who is not asexual can't deceide in one night that he doesn't want seks anymore.\"<br />Well, that can be partly true. Although, I can see no reason why one should accept his/her sexuality. If one would like to be something other, why that can't be a goal? Because it wouldn't work? I'm sure it could work.<br /><br />Personally I think there's problem with the terms. Since there are many asexuals that have or want to have girl/boyfriend, but just not want any sex with them. Many have the preference to specific gender, just like for example heterosexuals do. Should they be called heteroasexual, homoasexual, and biasexual?<br /><br />Edit: \"I just wish people would stop sweeping this under the carpet like 'Oh thats nice. Of course its not real, just a bunch of crap invented by people who aren't getting any.' It really, really pisses me off.\"<br />Yes, you're right. But just wait some years or a decade. Not long a go same was said about homosexuality, today it's part of mainstream.<b>Eat your veggies!</b>"
	},
	{
		"id": 23272,
		"title": "Re: Sexuality",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-20T15:37:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Not long a go same was said about homosexuality, today it's part of mainstream.[hr][/quote]I like to think of myself as an ignorant a$sh0le. This whole politically correctness feels stupid and even more ignorant than me. For example, I hate the smell of fish and I love cocolate with menthol, and there are people who don't. I just can't understand them and I won't be able to do that any hard I try. It's the same with homo-bi-a-whatever-sexuality. The fact is that every people is different and we have to live with it, but please, don't anyone try to convince me that their way is better than mine. Politically correctness is just in vogue right now, but it'll hopefully pass. What I say is not that we should hate people who are different, not at all, and don't ever hurt anyone just because he/she is different. We all are 'strange' in a way for others. It's just people are getting so nervous and sensitive when someone says he doesn't like heterosexuality or asexuality. So what? <br /><br />[quote]<b><i>Quote:</i></b>[hr]...there are many asexuals that have or want to have girl/boyfriend...[hr][/quote]What if someone loves an asexual person. Does he(she) have to keep away from sex, or can he have a purely sexual relationship too? He just can't help it, and it's a bit like torture when the other person won't let him do it... And don't say that he just shouldn't love an asexual person, because some can't help who one loves, you know."
	},
	{
		"id": 23273,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-20T16:34:38.000Z",
		"content": "\"So what?\"<br />Nothing! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br />To note, with that mainstream thing I didn't mean anything that I'd care about something political correctness, I just mean that not long ago homosexuality was something like mental disorder but now it's everywhere, especially in tv. As well, there's plenty of stuff that before was 'females only' and these days targeted to males as well.<br /><br />\"What if someone loves an asexual person. Does he(she) have to keep away from sex, or can he have a purely sexual relationship too? He just can't help it, and it's a bit like torture when the other person won't let him do it... And don't say that he just shouldn't love an asexual person, because some can't help who one loves, you know.\"<br />In my opinion he/she should keep away from sex, then. Too bad in many cases asexuals do it just because their partner is sexual, and don't feel good at all doing it. Imagine yourself being asexual female, not enjoying at all, sex disgusting you, and then imagine some male just doing stuff and you don't want it at all. I'd say that is almost like a rape or something. If they can't love without sex, they shouldn't try to be with asexual.<b>Eat your veggies!</b>"
	},
	{
		"id": 23274,
		"title": "Re: Sexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-20T16:40:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]No, but you are applying an identical argument to other people. Its like justifying hating muslims by saying you've never hated blacks.[hr][/quote]<br /><br />Oh yea<br />h am I? Tell me in what way am I doing so? Do you think that when one has sexual feelings that he can deceide to hide them for the rest of his live, no matter if he has a woman/girlfriend?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Of course. Simalarly, no gay person has ever sat down one day and said 'You know, I'm gay.' They've had to find out as they realize what their attractions are. This point is null and void.[hr][/quote]<br /><br />Oh so we agree? Or did you read my post without really reading it? Let's see....<br /><br />[quote]<b><i>Quote:</i></b>[hr]This is a misomer. For a gay person to do that their desire would have to change first. [usually anyway.] I don't see how this is anything like someone who's never felt sexual attraction suddenly hearing about asexuality and going 'Wow, other people are like that? Its kinda normal? Am I asexual? I think I am.' Imagine if homosexuality was hidden away, would you not expect a gay person on hearing about it to say something like 'Wow, now I know what I am.'?[hr][/quote]<br /><br />What are you talking about LL? I never doubted the lack asexuals sexual desire while you keep telling that I do. Now who is judging who and who has the right to be pissed of?<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"My point is that someone who is not asexual can't deceide in one night that he doesn't want seks anymore.\"<br />Well, that can be partly true. Although, I can see no reason why one should accept his/her sexuality. If one would like to be something other, why that can't be a goal? Because it wouldn't work? I'm sure it could work.[hr][/quote]<br />You lost me there. Are you saying that if one wants to become homesexual it is possible if he works hard enough on it, or that if you don't want sex you can't deceide this for the rest of your live?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23275,
		"title": "Re: Sexuality",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-20T16:53:06.000Z",
		"content": "KeenRush: I meant to say that the person who loves an asexual girl(or guy), should or shouldn't have sexual relationship with someone ELSE, because he needs it (while his girlfriend/wife does not)?"
	},
	{
		"id": 23276,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-20T17:43:47.000Z",
		"content": "\"You lost me there. Are you saying that if one wants to become homesexual it is possible if he works hard enough on it, or that if you don't want sex you can't deceide this for the rest of your live?\"<br />Yes. I'm pretty sure I could become homosexual if I wanted. To note, I really don't want that nor will become one. You probably should have \"can't\" replaced with \"can\" there; but anyways, yes I guess that's possible, just requires some effort and will.<br /><br />\"KeenRush: I meant to say that the person who loves an asexual girl(or guy), should or shouldn't have sexual relationship with someone ELSE, because he needs it (while his girlfriend/wife does not)?\"<br />Ah, ok. Well, I'd say he/she should not. At least I'd feel rather bad about it if I were the asexual person, although understanding what it would mean for the other. I guess the same answer would apply to this as well (the one I answered because of misunderstanding the question); perhaps a sexual person who can't be in celibacy shouldn't be with asexual. (Or then he/she should just masturbate, although that's not sex.)<b>Eat your veggies!</b>"
	},
	{
		"id": 23277,
		"title": "Re: Sexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-20T18:09:53.000Z",
		"content": "You know that people are homosexual because of their gens, KR? -----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23278,
		"title": "Re: Sexuality",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-20T18:26:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You know that people are homosexual because of their gens, KR?[hr][/quote]I've read this a lot at this forum lately, unfortunately it's not true, at least not exactly. There can be other reasons, for example some disorder during pregnancy, but there can be psychological reasons to. And even these are not fully proven."
	},
	{
		"id": 23279,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-20T18:47:40.000Z",
		"content": "\"You know that people are homosexual because of their gens, KR?\"<br />I've heard of that, but I don't believe in most sciences or the 'genes'..<b>Eat your veggies!</b>"
	},
	{
		"id": 23280,
		"title": "Re: Sexuality",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-20T19:24:08.000Z",
		"content": "I think we all can agree however, that homosexuality is generally not media-influenced and not chosen, which is what's important in this discussion.<br /><br />KeenRush, what exactly disagreeable about the science of genetics that you don't believe in it?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23290,
		"title": "Re: Sexuality",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-20T21:50:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] LoG, but why should people that simply don't feel anything force theirselves do it? Why do you see that incorrect?   -Keen Rush [hr][/quote]<br />I never said they should.  I find it highly amusing that I quoted a physcologist, and it escalates into a \"asexuals exist\" vs. \"no they don't!\" debate.<br /><br />I have never seen an asexual, but I do not doubt their existence.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />As a believer in 'no sex before marriage', I guess I have a long wait ahead.  Although I find the idea of sexual intercourse (similarly to KeenRush) undesirable, let's face it, it's a part of life. And i'd probably enjoy it immensely whenever I try it. 0 Unfeexable 0<br />[hr][/quote]<br /><br />Ironically, I'm in the middle of chosing whether or not to remain Christian, however, I still prefer having sex after marriage.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I agree with that. You don't want to be honeymooning and have the whole trip ruined when you find out your new wife suffers from extreme vaginismus or something. Not that that should stop you from marrying someone you love, but some sort of sexual problem would be a rude shock to a couple of newlyweds. Better to do your research beforehand. Lemur<br />[hr][/quote]<br /><br />Crude comments about sexual inadiquency are not nessecary.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />You misunderstand, Asexuality is a condition, just like bisexuality, it is not a goal, it is the way some people are. LL<br />[hr][/quote]<br />Ironically, you still are against homosexuals.  Nice to see you're not blinding your conscience with religion.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />And its people like you that contribute to such prejudice. LL<br />[hr][/quote]<br />Revert back to my last comment.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Perhaps, but again, there have been arguments that gays are just going through a phase, and all they need is a good woman to set them straight. Just put the two together, and the natural thing will happen. LL<br />[hr][/quote]<br />Then I suppose asexuals are just going out of a bad relationship to have their sexual problems.  --;<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />This is a misomer. For a gay person to do that their desire would have to change first. LL<br />[hr][/quote]<br />I think you're saying that gays are not normal but asexuals are?  I could be wrong, please correct.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Edit: \"I just wish people would stop sweeping this under the carpet like 'Oh thats nice. Of course its not real, just a bunch of crap invented by people who aren't getting any.' It really, really pisses me off.\"<br />Yes, you're right. But just wait some years or a decade. Not long a go same was said about homosexuality, today it's part of mainstream. Keen Rush<br />[hr][/quote]<br />Nonetheless, you are still against homosexuality, no?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />You know that people are homosexual because of their gens, KR? -DJaser<br />[hr][/quote]<br /><br />A. It's called \"genes\"<br />B. That's not scientifically exact.  If it can't even hold up in court, I really don't care about it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I think we all can agree however, that homosexuality is generally not media-influenced and not chosen, which is what's important in this discussion.<br /><br />KeenRush, what exactly disagreeable about the science of genetics that you don't believe in it? Xtra<br />[hr][/quote]<br />Again, it's not proven beyond a reasonable doubt that homosexuality is created by genes.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23281,
		"title": "Re: Sexuality",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-20T22:06:41.000Z",
		"content": "\"I think we all can agree however, that homosexuality is generally not media-influenced and not chosen, which is what's important in this discussion.\"<br />But well, asexuality isn't chosen either.<br /><br />\"KeenRush, what exactly disagreeable about the science of genetics that you don't believe in it?\"<br />Well, it's more than just science of genetics. I just don't believe it, my mind can't keep it true or agree with it. Sorry, I think we can't know almost anything. And how do I know that? I don't..<br />I assume the roots of this science disbelief is in the 'modern' idea of science replacing God. I don't want to support that kind of stuff.<br />I've been told for example that \"there are nuclear plants and stuff, the nuclear physics are at least partly on right tracks\". I have no idea, probably it's just some very good coincidence or act of God.<b>Eat your veggies!</b>"
	},
	{
		"id": 23282,
		"title": "Re: Sexuality",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-20T23:04:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]But well, asexuality isn't chosen either.[hr][/quote]<br />I don't know much about asexuality, but that may true as well, I'd have to do some research.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I assume the roots of this science disbelief is in the 'modern' idea of science replacing God. I don't want to support that kind of stuff.[hr][/quote]<br />Uhh...what?<br /><br />I can see that theories such as the big bang (which is now considered unlikely) and maybe evolution would conflict religious beliefs, but genetics?<br /><br />The goal of science is nothing to do with replacing God.  Humans have a natural tendency to want to learn more about themselves and the world around them and science is simply trying to discover how the world works.  I remember a couple of years ago you mentioned your doubt of physics, but I really can't see the connection between God and physics or genetics.<br /><br />Anyways, the evidence for genes is pretty incontrovertible, whether or not it has anything to do with God.  Read up on Mendel and his pea plants.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I've been told for example that \"there are nuclear plants and stuff, the nuclear physics are at least partly on right tracks\". I have no idea, probably it's just some very good coincidence or act of God.[hr][/quote]<br />You could consider everything in the world happening through acts of God, but that doesn't necessarily mean it can't be explained without God.  Certainly it is possible that a god created the universe and guided it along a certain path so that functions and processes such as the passing on of genes in life would emerge, but there are still physical explanations on how these processes work, whether or not God had a hand in it.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23283,
		"title": "Sexuallity",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-21T00:02:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]As a believer in 'no sex before marriage[hr][/quote]<br /><br />I totally agree; if you look at the numbers; a couple who is wed, and are  not virgin, have a much greater chance of divorce than singles who enter as virgins.<br /><br />Homosexuality: To me; this is wrong - This is not hard coded in someones DNA; we never had a problem with this during the Stone Age and Middle Ages!!!<br /><br />Pedo: Never tolloratable in any situation; unless under wedlock. It would be sick for a 60 year older to marry a 6 year older, but if lawfully wedded, then relations between them are okay.<br /><br />(I don't really perfer yound marraiges, but I can stand them...)<br /><br />Any relations outside of marraige are compleatly wrong!!! No questions!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23284,
		"title": "Re: Sexuallity",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-10-21T07:10:17.000Z",
		"content": "I don't think there's anything wrong with a young guy to get married to an older woman and vice versa as long as they're happy together and love each other.<br /><br />I read this cute story about a 99 year old woman married to a 50 year oldm man. They've been married for around 12 years as of now. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] -- Censorship is F**ked! --"
	},
	{
		"id": 23285,
		"title": "Re: Sexuallity",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-21T07:31:05.000Z",
		"content": "Me:[quote]<b><i>Quote:</i></b>[hr]I agree with that. You don't want to be honeymooning and have the whole trip ruined when you find out your new wife suffers from extreme vaginismus or something. Not that that should stop you from marrying someone you love, but some sort of sexual problem would be a rude shock to a couple of newlyweds. Better to do your research beforehand.[hr][/quote]<br /><br />LordOfGlobox: [quote]<b><i>Quote:</i></b>[hr]Crude comments about sexual inadiquency are not nessecary.[hr][/quote]<br /><br />Sorry, that wasn't meant as a crude comment. Sometimes I forget that some people aren't as frank as my crowd is. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]  I truly believe that a couple should already be sexually familiar with each other before marrying, and know what they're getting into. I guess my example wan't appreciated.<br /><br />Najawa:<br />[quote]<b><i>Quote:</i></b>[hr]I totally agree; if you look at the numbers; a couple who is wed, and are not virgin, have a much greater chance of divorce than singles who enter as virgins.<br />[hr][/quote]<br />Perhaps that has something to do with why they waited until after marriage, and not so much to do with the actual waiting.<br />[quote]<b><i>Quote:</i></b>[hr]<br />Homosexuality: To me; this is wrong - This is not hard coded in someones DNA; we never had a problem with this during the Stone Age and Middle Ages!!![hr][/quote]<br />I'm going to go out on a limb here and say that there have been gays as long as there have been people. Animals also engage in homosexual behavior, you know.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23286,
		"title": "Re: Sexuallity",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-21T07:44:10.000Z",
		"content": "<i>Najawa: \"Pedo: Never tolloratable in any situation; unless under wedlock. It would be sick for a 60 year older to marry a 6 year older, but if lawfully wedded, then relations between them are okay.\"</i><br /><br />Wow, so the idea of forcing a child to have sex with someone is bad, but if you force them to get married first then it's okay?  Sorry, but I don't think getting married makes it any better.  How would you like it if your parents told you that tomorrow a 60 year old grandmother was going to become your wife?  Would you go along with it, simply because you'd both be married and that makes it all okay?  I'm sure you'd find the prospect revolting, married or not.<br /><br /><i>\"Homosexuality: To me; this is wrong - This is not hard coded in someones DNA; we never had a problem with this during the Stone Age and Middle Ages!!!\"</i><br /><br />Nobody said it was hard coded in DNA - it's a birth defect, one way or another.  And contrary to popular belief there was a huge gay subculture in the middle ages (you should watch more documentaries.)  Just because it's been left out of the history books it doesn't mean it never happened."
	},
	{
		"id": 23287,
		"title": "Re: Sexuallity",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-21T08:07:46.000Z",
		"content": "Ugh, I wouldn't agree that kind of marriage. That's just disgusting. If someone wants to marry a child before having sex with her he isn't any better than some pervert raping one. I hope that kind of marriages aren't legal in USA, although I wouldn't consider it impossible..<br /><br />\"The goal of science is nothing to do with replacing God. Humans have a natural tendency to want to learn more about themselves and the world around them and science is simply trying to discover how the world works. I remember a couple of years ago you mentioned your doubt of physics, but I really can't see the connection between God and physics or genetics.\"<br />Well, I'm sorry, maybe it's just an attitude around here. Don't even ask how many times I've heard students making jokes of God and saying He has no part in anything. When a foreign Creationist was going to have a lecture at the local university, the students got mad and had a demonstration against it; it was cancelled.<br />This may seems childish to you, but for those who believe it's rather annoying to hear about people claiming there is no God or telling science is the answer etc.. It seems to be either religion or science that one needs to choose..<br /><br />\"Anyways, the evidence for genes is pretty incontrovertible, whether or not it has anything to do with God. Read up on Mendel and his pea plants.\"<br />I know that stuff, I just don't believe it.<br /><br />Anyways, enough of this now, probably. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23288,
		"title": "Re: Sexuallity",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-21T08:58:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Personally I think there's problem with the terms. Since there are many asexuals that have or want to have girl/boyfriend, but just not want any sex with them. Many have the preference to specific gender, just like for example heterosexuals do. Should they be called heteroasexual, homoasexual, and biasexual?[hr][/quote]<br /><br />Well, that depends, since what these terms reflect is<i> sexual</i> attraction rather than personal attraction. As such I think the term is quite appropriate.<br /><br />[quote]<b><i>Quote:</i></b>[hr]What if someone loves an asexual person. Does he(she) have to keep away from sex, or can he have a purely sexual relationship too? He just can't help it, and it's a bit like torture when the other person won't let him do it... And don't say that he just shouldn't love an asexual person, because some can't help who one loves, you know.[hr][/quote] <br /><br />That is a simalar situation say, to a girl loving a gay guy. The two people will have to work out their problems themselves.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Do you think that when one has sexual feelings that he can deceide to hide them for the rest of his live, no matter if he has a woman/girlfriend?[hr][/quote]<br /><br />No, but do you expect someone without sexual feelings to invent them and live a lie all their life?<br /><br />[quote]<b><i>Quote:</i></b>[hr]You lost me there. Are you saying that if one wants to become homesexual it is possible if he works hard enough on it, or that if you don't want sex you can't deceide this for the rest of your live?[hr][/quote] <br /><br />No, but what if someone is not sure if they are gay? What if someone has never liked sex but kept at it because that is what society demands? These people will need time to find and settle into their sexuality.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I've heard of that, but I don't believe in most sciences or the 'genes'..[hr][/quote] <br /><br />[quote]<b><i>Quote:</i></b>[hr]KeenRush, what exactly disagreeable about the science of genetics that you don't believe in it?[hr][/quote] <br /><br />The new 'my genes made me do it' defence is becoming increasingly common. Its not your fault, its your biology. The cause of gayness may never be fully understood. Some peole are romantic, is it their genes? Do Djaser and I have incompatible opinion genes?<br /><br />KeenRush has good reason to doubt a lot of science, thats scientific method for you. Plus, a lot of science is either new age crap, paid for by corporations, or politically motivated.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Ironically, you still are against homosexuals. Nice to see you're not blinding your conscience with religion.[hr][/quote]<br /><br />I am? How? And I always think of my religion as paralell to my consience, I'll only believe that which I know to be moral, which is why I don't call for heathens to be burned at the steak.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I think you're saying that gays are not normal but asexuals are? I could be wrong, please correct.[hr][/quote]<br /><br />I'm not sure how you infferred that, the point I was making is that both asexuals and homosexuals are different types of normal.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Nonetheless, you are still against homosexuality, no?[hr][/quote]<br /><br />No, I'm fine, as I said, I've had some personal experience with sexual diversity. [Man that sounds weird.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"Anyways, the evidence for genes is pretty incontrovertible, whether or not it has anything to do with God. Read up on Mendel and his pea plants.\"[hr][/quote]<br /><br />Mendel completely faked his results, and he was still ignored! A lot of what is touted as fact is just well accepted dogma. Thats why I like creationist science books, they point out the holes in theories scientists are afraid to examine. [Even though they may be ignorant bastards.] [The creationists, though I know a lot of ignorant scientists.]<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23289,
		"title": "Re: Sexuallity",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-10-21T11:54:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Thats why I like creationist science books, they point out the holes in theories scientists are afraid to examine.[hr][/quote]After they have studied for years and years what they are against, in university, or after reading other ignorant folks books with faked facts? Anyway, there are holes in theories, that's why we call them theories and not truth. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  But most are much better than nothing at all.<br /><br />The debate between believers and non-believers goes on and on, now over a century. No matter if it's about god or science or both. You won't ever make others agree with what you say if they have a different belief-system, but don't give up! I'd like to see what this all leads to! (maybe to closing the topic?) Anyhow you can't win! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] <br /><br />It seems that every one of us are ignorant in a way. What I believe in is that one sensible and skeptic enough just can't believe in god, as one will always see that god is just a cheap way of not asking questions. One will question science forever too before actually studying it for all one's lifetime, and even than knowing everything would be impossible. There clearly cannot be such person, so we will always believe at least partly in something or other, and we need our beliefs to survive. There is no way out.<br /><br />I know this will be ignored before you think this over, so I stop now. <br /><br />Now fight! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-celtic.gif[/img]  (I know you'll say that you haven't)<br /><br />(My genes made me say these, sorry [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-disguised.gif[/img] ) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]"
	},
	{
		"id": 23291,
		"title": "Re: Sexuality",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-21T14:46:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well, it's more than just science of genetics. I just don't believe it, my mind can't keep it true or agree with it. Sorry, I think we can't know almost anything. And how do I know that? I don't..[hr][/quote]<br />Than use your mind a little bit better. Most gay people had problems with their sexuality when they were teenagers and tried very hard to find girls attractive, even had girl friends before they find out that they really couldn't help their feelings. Are you saying they didn't try hard enough, they might be thankfull and try again to become heterosexual.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Homosexuality: To me; this is wrong - This is not hard coded in someones DNA; we never had a problem with this during the Stone Age and Middle Ages!!![hr][/quote]<br />Wrong, they have always been there. I could give a lot examples if you want me to.<br /><br />[quote]<b><i>Quote:</i></b>[hr]making jokes of God and saying He has no part in anything. When a foreign Creationist was going to have a lecture at the local university, the students got mad and had a demonstration against it; it was cancelled.<br />This may seems childish to you, but for those who believe it's rather annoying to hear about people claiming there is no God or telling science is the answer etc.. It seems to be either religion or science that one needs to choose..[hr][/quote]<br />Students don't make more jokes about God then normal people. But if you choose not to believe scientist even the christian scientists like Mendel, well than you're not far away from believing that the earth is flat. I don't see what you're problem with science has to do with God at all. That some things goes against your feeling doesn't make them less true or against God.<br /><br />[quote]<b><i>Quote:</i></b>[hr]No, but what if someone is not sure if they are gay? What if someone has never liked sex but kept at it because that is what society demands? These people will need time to find and settle into their sexuality.[hr][/quote]Possible but not relevant to discussion. We're talking about people who are really heterosexual.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The new 'my genes made me do it' defence is becoming increasingly common. Its not your fault, its your biology. The cause of gayness may never be fully understood. Some peole are romantic, is it their genes? Do Djaser and I have incompatible opinion genes?[hr][/quote]<br />And what if it is proven? Do you think you can discuss evil genes?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Thats why I like creationist science books, they point out the holes in theories scientists are afraid to examine. [Even though they may be ignorant bastards.] [The creationists, though I know a lot of ignorant scientists.][hr][/quote]<br />Those books are art. I read a lot of creationists books with historical subject. Usually just a few crazy theories based on a few little holes history that have nothing to do with each other.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23292,
		"title": "Re: Sexuality",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-21T15:17:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The new 'my genes made me do it' defence is becoming increasingly common. Its not your fault, its your biology.[hr][/quote]<br />People have twisted the nature/nurture thing all of history.  Saying that one is completely responsible for all of your actions is silly, and just because people are misusing the principles of genetics, it doesn't mean that there is a problem with the science.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Those books are art. I read a lot of creationists books with historical subject. Usually just a few crazy theories based on a few little holes history that have nothing to do with each other.[hr][/quote]<br />My favorite theory is the one that says ingesting cyanide is the cure for cancer, but the government has been supressing this for the past century or so.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23293,
		"title": "Re: Sexuality",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-21T19:52:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] Homosexuality: To me; this is wrong - This is not hard coded in someones DNA; we never had a problem with this during the Stone Age and Middle Ages!!!\"<br />[hr][/quote]<br /><br />Excellent!  Another ignorant comment!<br /><br />Homosexuality has been around long before the Bible was  written, you would even know this if you had opened it up or thought about that comment before you posted that.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23294,
		"title": "Grr...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T18:03:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't think there's anything wrong with a young guy to get married to an older woman and vice versa as long as they're happy together and love each other.[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Wow, so the idea of forcing a child to have sex with someone is bad, but if you force them to get married first then it's okay? Sorry, but I don't think getting married makes it any better. How would you like it if your parents told you that tomorrow a 60 year old grandmother was going to become your wife? Would you go along with it, simply because you'd both be married and that makes it all okay? I'm sure you'd find the prospect revolting, married or not.[hr][/quote]<br /><br />Grr... I not saying that I encourage it...<br /><br />If the child does not enter the marragie willfully, then it is not a valid maraige. I do not support, but as long as someone os married, they can have relations; that is why people get married!!! To have children!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Ugh, I wouldn't agree that kind of marriage. That's just disgusting. If someone wants to marry a child before having sex with her he isn't any better than some pervert raping one. I hope that kind of marriages aren't legal in USA, although I wouldn't consider it impossible..[hr][/quote]<br /><br />No, they are not legal (TY God!!!); I do not support them, but if the child wants to get married (and in some culter they do [gypsys and the like]), and both sides consent, relations are not morrally wrong, though their marraige may be.<br /><br />[quote]<b><i>Quote:</i></b>[hr]After they have studied for years and years what they are against, in university, or after reading other ignorant folks books with faked facts? Anyway, there are holes in theories, that's why we call them theories and not truth.  But most are much better than nothing at all.[hr][/quote]<br /><br />Ah... but creationism has the least holes, and BTW - print out that lvl 11 picture from Keen 2 (Filthy word in Keen 1-3 topic). Cut it into 3 parts. Drop them.<br /><br />What are the chances of them coming togather seamlessly to form the picture again? That has a greater chance of coming togather, than doesthis earth, and human sexuallity for that matter!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]No, but what if someone is not sure if they are gay? What if someone has never liked sex but kept at it because that is what society demands? These people will need time to find and settle into their sexuality.[hr][/quote]<br /><br />Stay single!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Excellent! Another ignorant comment![hr][/quote]<br /><br />Thank you<br /><br />-- NAJAWA --"
	},
	{
		"id": 23295,
		"title": "Re: Grr...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-10-22T18:14:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Ah... but creationism has the least holes, and BTW - print out that lvl 11 picture from Keen 2 (Filthy word in Keen 1-3 topic). Cut it into 3 parts. Drop them.<br /><br />What are the chances of them coming togather seamlessly to form the picture again? That has a greater chance of coming togather, than doesthis earth, and human sexuallity for that matter!!![hr][/quote]<br />However if you try it million years long the chances that it will come together one time are big.<br /><br />Do you have another hole?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23296,
		"title": "Exactly:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T18:39:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]However if you try it million years long the chances that it will come together one time are big.[hr][/quote]<br /><br />Yes... but the chances of that are much, much greater than that of the creation of a 1 celled organizm, which can reproduce itself!!!<br /><br />1 cell!!!<br /><br />I am now going to insert a term paper I did:<br /><br />\"Darwinism: <br />The un-proven proof<br /><br /><br />In this day and age, many people believe in evolution. There are actually many different theories that people have grouped together under the title of Evolution. Most evolutionists believe in Darwinism, but their beliefs do not contain any scientific proof. If there is no proof for Darwinism, then why do scientists believe in it? This paper will point out the some of the biggest scientific errors in the theories of atheistic evolution and Darwinism. It will also explain why you cannot trust this evolving belief. <br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp First, there are many versions of evolution. Most Christian evolutionists believe that God created everything and then set everything in motion. They believe that God steps in throughout history to keep things going. However, Darwinism rejects the role that God plays in creation. Darwinists are atheists who believe that everything came from nothing.<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The atheistic theory that everything came from nothing has already been disproved. If a natural environment wanted to create life, first it would have to create protein; these are the building blocks of life. To do so, it must make amino acids. If it did, it would need to sort the left-handed amino acids from the right-handed. Then the environment would have to string around 100 amino acids together in the right shape, and Walla! One protein! But then the environment would need to protect them from UV rays, oxygen, calcium, and other chemicals otherwise the protein will spoil. In fact, 2,000 different proteins are needed to have enough protein for a one-celled organism!<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp If the earth wanted to make DNA, it first would need a special protein in order for the DNA to survive. This protein is created by the DNA, but DNA needs the protein before it will reproduce. No human scientist has ever created DNA, much less studied its every detail. In addition, the DNA of one species is completely different from DNA in another species (for example, a human baby has different DNA than a puppy). This is just the tip of the iceberg; the earth would also have to make brains for most of its creatures, and the chance of that is very impossible. The brain can think creatively; it was not made by accident. Therefore, the theory of atheistic evolution fails.<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Likewise, Darwinisms theology does not contain any scientific proof. Darwinism states that there is an in-between stage, a stage in which one animal is halfway evolved into another species. However, this is not scientifically true. No one has ever discovered even one true fossil that contains evidence of this stage. Another element of Darwinism states that because almost all creatures have five fingers, toes, and bones in flippers and wings, that they must be all related. Wrong! In different species the bones branch off in different parts of the hand. This could not have happened simply due to adaptation.<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Darwinism also states that matter and energy came from nothing. But something cannot come from nothing. Matter and energy could not have been created naturally, so it must have been made supernaturally. For example, a beach will never turn its sand into glasses, and fill the glasses with water from the sea. Someone needs to do that, it cannot happen by itself. The glasses are so much less complex than DNA or the brain. This could not have happened Darwins way. So in that case, who did make the earth? God did. There is so much order, that one small different variable could set this universe into chaos. <br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp In conclusion, this paper has proved that Darwinism is neither scientifically nor philosophically correct. It has also demonstrated that there is a God. Because of this, we know that we all have a purpose in life, no matter how small.<br /><br /><br /><br />Works Cited<br /><br />Bernhoft, Robin. Confronting Creations Complexities  Darwinism Isnt Fit to Survive, This Rock. San Diego, CA: Catholic Answers, Sept. 2003.<br /><br />Catechism of the Catholic Church, Liberia Editrice Vaticana. Liguori, MO: Liguori Publications, 1994.\"<br /><br />I hope I have proven a point!!!<br /><br />BTW - This paper was written be me (Nathan Waddell), and to copy anything from it, without proper citing, would be plagarism!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23297,
		"title": "Re: Exactly:",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-22T19:54:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Ah... but creationism has the least holes, [hr][/quote]<br />Yeah, except for god.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The atheistic theory that everything came from nothing has already been disproved.[hr][/quote]<br />Are you sure you know what \"disproved\" means? It doesn't mean it's unlikely, it means that someone has actually got proof to the contrary.<br /><br />[quote]<b><i>Quote:</i></b>[hr]If the earth wanted to make DNA, it first would need a special protein in order for the DNA to survive. This protein is created by the DNA, but DNA needs the protein before it will reproduce. No human scientist has ever created DNA, much less studied its every detail. In addition, the DNA of one species is completely different from DNA in another species (for example, a human baby has different DNA than a puppy). This is just the tip of the iceberg; the earth would also have to make brains for most of its creatures, and the chance of that is very impossible. The brain can think creatively; it was not made by accident. Therefore, the theory of atheistic evolution fails.[hr][/quote]<br />You've got nothin'. Scientists haven't created organisms from scratch, but they have modified DNA. They've even managed to reconstruct a flu virus that caused a big epidemic at one tume, as I recall.<br /><br />You make DNA between species sound like it's much more different than it is. And wouldn't you expect <i>some</i> differences? Seeing as how humans and puppies are different animals?<br /><br />You say that it's impossible for the brain to evolve, but you're not backing it up. And no one here is suggesting that brains came about \"by accident\". Evolution is not accident.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Darwinism states that there is an in-between stage, a stage in which one animal is halfway evolved into another species. However, this is not scientifically true. No one has ever discovered even one true fossil that contains evidence of this stage.[hr][/quote]<br />This isn't quite the hurdle you seem to think. There's no sharp division between dog and not dog, with a half dog phase in between. Some forms are closer to dog, some are closer to not dog, and if dog and not dog are far enough apart then we might make up a name for half dog. Names are just labels for points in an animal's evolution.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Darwinism also states that matter and energy came from nothing.[hr][/quote]<br />No, I don't think you're right about this.<br /><br />[quote]<b><i>Quote:</i></b>[hr]In conclusion, this paper has proved that Darwinism is neither scientifically nor philosophically correct. It has also demonstrated that there is a God. Because of this, we know that we all have a purpose in life, no matter how small.[hr][/quote]<br />Actually, you forgot to prove either of those things. Maybe they're provable and maybe they aren't, but you didn't do it. All you did was make assertions and fail to back them up. And what's with the purpose stuff? You didn't even mention it until your conclusion.<br /><br />[quote]<b><i>Quote:</i></b>[hr]BTW - This paper was written be me (Nathan Waddell), and to copy anything from it, without proper citing, would be plagarism!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  [hr][/quote]<br />I don't think there's much danger of that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  <br /><br />You kept talking about lack of scientific proof for evolution. What about creationism? Got a bible handy? Look at Matthew 7:5.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23298,
		"title": "BIG BANG",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-22T22:14:44.000Z",
		"content": "This is a paper I wrote against Darwinism; the Big Bang Theory:<br /><br />[quote]<b><i>Quote:</i></b>[hr]You've got nothin'. Scientists haven't created organisms from scratch, but they have modified DNA. They've even managed to reconstruct a flu virus that caused a big epidemic at one tume, as I recall.[hr][/quote]<br /><br />No; no one but God could do that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You say that it's impossible for the brain to evolve, but you're not backing it up. And no one here is suggesting that brains came about \"by accident\". Evolution is not accident.[hr][/quote]<br /><br />Quote Me, then... I never said that...<br />If you are refering to this<br />[quote]<b><i>Quote:</i></b>[hr]The brain can think creatively; it was not made by accident. Therefore, the theory of atheistic evolution fails.[hr][/quote]<br /><br />All I said was that is was not made hap-hazardly; there was intelligent design<br /><br />[quote]<b><i>Quote:</i></b>[hr]This isn't quite the hurdle you seem to think. There's no sharp division between dog and not dog, with a half dog phase in between. Some forms are closer to dog, some are closer to not dog, and if dog and not dog are far enough apart then we might make up a name for half dog. Names are just labels for points in an animal's evolution.[hr][/quote]<br /><br />And nevertheless: [quote]<b><i>Quote:</i></b>[hr]No one has ever discovered even one true fossil that contains evidence of this stage.[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]You hypocrite, first take the plank out of your own eye, and then you will see clearly to remove the speck from your brother's eye.[hr][/quote]<br /><br />Um... what about it?<br /><br />-- NAJAWA --"
	},
	{
		"id": 23299,
		"title": "Re: BIG BANG",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-22T22:56:14.000Z",
		"content": "Naj, you're missing the point of evolution.  Evolution does not explain how life came to be.  It offers no explanation for how one-celled organisms originally were created, because that is not its purpose.  Evolution expains how life continued from a point at which there already were simple organisms.<br /><br />Before you make arguments against evolution, make sure you understand what it is.  And that would involve a scientific textbook, not Christian literature arguing against evolution.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23300,
		"title": "Re: BIG BANG",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-23T02:29:10.000Z",
		"content": "Also, the big bang and evolution are two entirely unrelated things.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23301,
		"title": "Re: BIG BANG",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T13:07:21.000Z",
		"content": "Woo, big post ahead!<br /><br />[quote]<b><i>Quote:</i></b>[hr]And what if it is proven? Do you think you can discuss evil genes?[hr][/quote]<br /><br />Then I don't want to live. Not if I can get my morals out of a test tube. Besides, if its proven we can have gene therapy for gays! Finally a 100% effective cure! And niggers too! Cripples! Depressed people! People with brown eyes and hair! Jews! Heil!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Those books are art. I read a lot of creationists books with historical subject. Usually just a few crazy theories based on a few little holes history that have nothing to do with each other.[hr][/quote] <br /><br />Bah! <i>History</i> books! I'm talking about those that discuss science and God, like In the <i>Begginning There Was Information</i> which tries to define information and wanders through computer science, information theory, biology and evolution, finding holes in all areas and arguing for God. It doesn't force belief on the reader, rather it tries to persuede. I like the juxtaposition of subjects and discussion of hidden flaws. [I got my Mendel factoid from that, it wasn't slandering Mendel, merely mentioning he was christian, and oh yeah, he faked stuff.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]My favorite theory is the one that says ingesting cyanide is the cure for cancer, but the government has been supressing this for the past century or so.[hr][/quote] <br /><br />Worryingly, cyanide is anticarcinogenic, but the dose has to be very small. NO is better. <br /><br />[quote]<b><i>Quote:</i></b>[hr]Homosexuality has been around long before the Bible was written, you would even know this if you had opened it up or thought about that comment before you posted that.[hr][/quote] <br /><br />Why would the bible ban something that didn't exist? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]What are the chances of them coming togather seamlessly to form the picture again? That has a greater chance of coming togather, than doesthis earth, and human sexuallity for that matter!!![hr][/quote]<br /><br />Bullskit. But I see your point, the 'ol chance argument. I do believe science's only answer so far is 'if it weren't all balanced out this way, then we wouldn't be hare to see it'<br /><br />[quote]<b><i>Quote:</i></b>[hr]However if you try it million years long the chances that it will come together one time are big.[hr][/quote]<br /><br />A pitiful billion years? You really really <i>really</i> <b><i>really</i></b> underestimate the magnitudes we're dealing with here. I will make a topic about it. We're talking larger than the number of atoms in the universe times the seconds they've existed squared.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Yeah, except for god.[hr][/quote]<br /><br />God is not a hole, nor a proof, he is beyond scientific proof, which pisses scientists off.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You've got nothin'. Scientists haven't created organisms from scratch, but they have modified DNA. They've even managed to reconstruct a flu virus that caused a big epidemic at one tume, as I recall.[hr][/quote]<br /><br />Noo, not an epidemic at all. Also, we mod Keen, but few of us have created a new game. We fiddle with what has already been worked out for us, we have never built a new form of life [No DNA, ise something else, use different chemicals and processes, all worked from scratch.] or even successfully made a new particle [using of course, our invented grand unified theory to dictate its formation.]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Evolution is not accident[hr][/quote]<br /><br />Yes it is pretty much. Natural selection fails 9 times out of ten, evolution is naturally resisted [mutations should be minimized] and has no goal, species wander, they do not progress. If we evolved from apes, why are there still apes? Cockroaches? Bacteria? Evolution is a lottery, you live, you die, its all chance.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You hypocrite, first take the plank out of your own eye, and then you will see clearly to remove the speck from your brother's eye.[hr][/quote]<br /><br />Ah, I love that verse. Pity we all have so many planks we're whacking each other in the face then eh?<br /><br /><br /><br />Now then; I do believe we were dicussing sexualtiy? Put down your bibles and lets engage in some oral sex! [Talking about it]<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23302,
		"title": "Re: BIG BANG",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T13:45:19.000Z",
		"content": "Why has this turned into a an Evolution vs. Creation?<br /><br />Start a new thread if you like, but quit spamming on this one.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23303,
		"title": "Re: BIG BANG",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-23T19:48:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Why has this turned into a an Evolution vs. Creation?[hr][/quote]<br />The inevitable inclusion of genetic's involvement in sexuality into the discussion led to the question of how that could allow any non-heterosexual to survive if natural selection would prevent those people from reproducing and thus spreading their genes, which lead to the \"does natural selection even exist?\" question."
	},
	{
		"id": 23304,
		"title": "Gaa!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-23T21:52:34.000Z",
		"content": "Woa; I know; the Catholic Church is not against evolution, as long as God is involved.<br /><br />That was a paper about Darwinism!!!<br /><br />[quote]<b><i>Quote:</i></b>[hr]Naj, you're missing the point of evolution. Evolution does not explain how life came to be. It offers no explanation for how one-celled organisms originally were created, because that is not its purpose. Evolution expains how life continued from a point at which there already were simple organisms.[hr][/quote]<br /><br />Yes, I know!!!<br /><br />-- NAJAWA --"
	},
	{
		"id": 23305,
		"title": "Re: Gaa!!!",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-23T23:45:44.000Z",
		"content": "Well it appears you have misconceptions about what [url=http://en.wikipedia.org/wiki/Darwinism]Darwinism[/url] is too.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]If we evolved from apes, why are there still apes?[hr][/quote]<br />*sigh*<br /><br />If anyone wants to continue this evolution discussion, open up a new topic.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23306,
		"title": "Re: Gaa!!!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-24T02:51:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]If we evolved from apes, why are there still apes?[hr][/quote]<br />If you're descended from your parents, how can your brother have the same parents?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23307,
		"title": "Re: Gaa!!!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-24T09:39:26.000Z",
		"content": "Yes I know that was incorrect Mr. Specific Sir. However, I was trying to make a point. Also, you're objection makes absolutely no sense. I think you were trying to make the point that we wvolved from a common ancestor, not apes <i>per se</i> But the point remains, many ancestors remain alive and kicking, crawling, oozing and flapping.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23308,
		"title": "Re: Gaa!!!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-24T22:46:18.000Z",
		"content": "My point was that your point was silly. I didn't mean the answer was the same.<br /><br />Maybe I still don't understand what you're getting at.<br /><br />It's entirely possible that one group of apes (or whatever animal) could evolve one way, and another group could go another, or stay the same, because the best solution to surviving in one environment isn't necessarily the best for another.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23309,
		"title": "Re: Gaa!!!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-25T13:20:03.000Z",
		"content": "A rewording then;<br /><br />It is a common misconception that evolution always leads to better; that rather than being a lazy 'whatever fits, patch it together' process, it follows some sort of divine perogative, as if a 'God of evolution' were pulling the strings.<br /><br />How often have you seen that famous tree of life? Sludge =&gt; fish =&gt; reptiles =&gt; mammals =&gt; us or even 'the march of progress' starting with apes and ending with <i>Homo Sapiens Sapiens?</i> <br /><br />We are not the pinacle of evolution, it did not work to make us come about. Nor do more 'advanced' species replace, or even compete successfully with 'primitive' ones. Finally, left to its own devices a species will not evolve, its fine the way it is. Evolution is something that has to be done, species don't like it, but, like you when you wake up on a cold, rainy school day, they groggily force themselves through it with the minimum amount of effort.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23310,
		"title": "Re: Gaa!!!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-25T22:17:49.000Z",
		"content": "Start a new thread for christ's sake...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23311,
		"title": "Re: Gaa!!!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-10-25T23:18:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr] Start a new thread for christ's sake...[hr][/quote]<br />I can't even remenber what it was meant to be. It evolved into a thread better suited to its environment (a forum full of arguementative keeners). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] ________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 23312,
		"title": "Re: Gaa!!!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-26T00:48:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Start a new thread for christ's sake...[hr][/quote]<br /><br />Oh no! Don't bring him into it as well...<br /><br />[We need a holy Keen emoticon.]A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23313,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T03:40:01.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-christmas.gif[/img]  (St. Nick [St. and thus Holy])<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23314,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-27T19:31:40.000Z",
		"content": "WE officially have too many Christians on this thread when a simple sexuality thread turns into a ID vs. Evo debate...<br /><br />*sigh*~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23315,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-27T23:06:03.000Z",
		"content": "Muahahaha!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  (I put Keen, cause Keen is good)<br /><br />Christianity is the worlds largest religion.<br /><br />-- NAJAWA --"
	},
	{
		"id": 23316,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-28T01:39:44.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Christianity is the worlds largest religion.<br />[hr][/quote]<br /><br />I remember when I was you.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23317,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-28T05:41:24.000Z",
		"content": "LoG is right, this thread was about sexuality.. (It was? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] ) So, try to keep in topic people.<br /><br />(And besides, what is the largest religion then? I thought Christianity was it, too..)<b>Eat your veggies!</b>"
	},
	{
		"id": 23318,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-28T07:32:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]WE officially have too many Christians on this thread when a simple sexuality thread turns into a ID vs. Evo debate...[hr][/quote]<br /><br />1.) Sex aint simple [olly Parton.]<br /><br />2.)I think this would have wandered this way anyway, it was more the content of other threads spilling over into this one.<br /><br />3.) Christianity is the largest, but it is fragmented into about 10 times as many pieces as Islam. By contrast, there are only three types of athesim.<br /><br />4.) We've all talked out. This thread is over. Goodnite.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23319,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-28T20:07:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />(And besides, what is the largest religion then? I thought Christianity was it, too..) <br />[hr][/quote]<br /><br />It is.  That's the sad part...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23320,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-29T04:22:37.000Z",
		"content": "Haer haer! If the world had more atheists everything would be magically better. After all, atheists never fight, are greedy, start wars or ignore poverty or do anything bad at all.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23321,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-29T12:40:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Haer haer! If the world had more atheists everything would be magically better. After all, atheists never fight, are greedy, start wars or ignore poverty or do anything bad at all. <br />[hr][/quote]<br /><br />I would truly adore it if you did not put words in my mouth, or if you could stop acting like you understand my thought patterns.<br /><br />A. I did not say that more athiests would make the world \"magically\" better.<br />B. I never, nor would ever, say that athiests are not greedy, violent, start wars, or ignore poverty.<br /><br />Although Christians (On the main) are doing all four at once. --;~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23322,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-29T13:13:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I would truly adore it if you did not put words in my mouth[hr][/quote]<br /><br />A.) I wasn't.<br />B.) No, you'd just hate me less.<br /><br />Quite frankly, I think religion is just another excuse for people to do all the killing they secretly want to do. Its depressing, but what the hell.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23323,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-30T00:29:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />A.) I wasn't.<br />B.) No, you'd just hate me less.<br /><br />Quite frankly, I think religion is just another excuse for people to do all the killing they secretly want to do. Its depressing, but what the hell. <br />[hr][/quote]<br /><br />First of all, I never said I loathed you.  I disagree with your faith, you seem to take this as a personal effrontery.  I really do respect you, and I do not like being told who I hate and who I don't.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23324,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-30T00:42:55.000Z",
		"content": "Ha! Hatred!<br /><br />[Just kiddin, geeze, don't take stuff I say so seriously, I always try to jest.]<br /><br />Now I tell you you wouldn't convert even if God himself came down and hit you on the head. And if you reply I will tell you what pop groups you like.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23325,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-10-30T01:03:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I think religion is just another excuse for people to do all the killing they secretly want to do.[hr][/quote]<br />Yes, but if it wasn't there people would (and do) come up with another reason to do it. What a resourceful species we are.[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 23326,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-30T03:01:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Now I tell you you wouldn't convert even if God himself came down and hit you on the head. And if you reply I will tell you what pop groups you like.<br />[hr][/quote]<br /><br />I felt that God was not acting morally, I would not obey him even if he tapped me on the head.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23327,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-30T06:26:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It is. That's the sad part... [hr][/quote]<br /><br />*Reconsiders the morality of Killing LoGo*Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 23328,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-30T09:45:48.000Z",
		"content": "\"Although Christians (On the main) are doing all four at once. --;\"<br />They are no exception, so do your atheists. And besides, most of the politics that tell they're Christians just say so to get more votes, in case the majority of people is Christian on their area.<br /><br />PS. I wait eagerly the time you crawl to church, crying, telling that you're so sorry.. That has happened before too..<b>Eat your veggies!</b>"
	},
	{
		"id": 23329,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-30T09:54:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I felt that God was not acting morally, I would not obey him even if he tapped me on the head.[hr][/quote] <br /><br />Well that goes without saying doesn't it. Of course, knowing you your first words would be something like \"Oh my God, wait, wait, no, not my God, not yet. First I want to know a few things. #1 Genesis 1.1, <b>you</b> said-\"<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23330,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-31T01:49:13.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Well that goes without saying doesn't it. Of course, knowing you your first words would be something like \"Oh my God, wait, wait, no, not my God, not yet. First I want to know a few things. #1 Genesis 1.1, you said-\"<br />[hr][/quote]<br /><br />Indeed.  I would rather procure an answer than strut about like an ass.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23331,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-31T03:54:00.000Z",
		"content": "Too late for that then.<br /><br />[jks; Sorry, couldn't resist.]<br /><br /><br />Well whatever. I think this thread has run its course.<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23332,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-03T23:12:40.000Z",
		"content": "Unfortunetly, this conversation never run its course in the first place.<br /><br />Sexual fettish is actually defined as an acquired sexual arousal from a tangable object (leather outfit) or from an idea (masocism).<br /><br />Others you are born with, such as homosexuality.<br /><br />Thoughts?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23333,
		"title": "Re: Holy Keen Emote:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-04T01:36:33.000Z",
		"content": "Mehs.<br /><br />On Homosexuality, we've discussed this pretty much.<br /><br />On Fettishes, these I think, sice they are aquired and can be 'cured' with much more success than homosexuality <i>et al</i>, could be defined as abnormalities or just variation depending on your labelling. If a fetish harms the quality of life of the practicer or others, then it is unacceptable. For example, most of the 'kiddie porn' traded on the net is done so by and to those who do not engage in this activity, but are interested in such pictures as a means of arousal or due to warped curiousity. Many when convicted maintain that this was a fetish and they didn't mean to harm anyone.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23334,
		"title": "..",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-04T07:28:51.000Z",
		"content": "But what about fetishes that don't harm anyone physically? Like this one for example [url=http://en.wikipedia.org/wiki/Glove_fetishism]en.wikipedia.org/wiki/Glove_fetishism[/url] ? I don't think it does much mental damage, either..<br />And besides, if the particians completely free-willingly do something that might hurt them, but not any other, what's the big deal? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23335,
		"title": "Re: ..",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-04T11:55:53.000Z",
		"content": "Like I said; you can view it as sexual variarion, or an abnormality [albeit a harmless one] that could [but not necessarily must] be corrected.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23336,
		"title": "Re: ..",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-04T17:02:14.000Z",
		"content": "Oh, ok. I just didn't understand, it seems. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23337,
		"title": "Re: ..",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-04T20:57:31.000Z",
		"content": "Indeed.  But I think any consensual sexual act is okay.  For instance, masocists and sadists can have a fine relationship.<br /><br />I also think no sexual laws should be put into place (Becides forced sodomy/sexual act or rape, obviosuly).  IE: Homosexual sex shouldn't be illegal in any state, neither should prostitution.<br /><br /><br />Let's bring this into a better realm, considering 90% of everyone here is Christian: What do you think about marriage?<br /><br />I mean on any level, political, sexual, social, religious...?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23338,
		"title": "Re: ..",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-05T13:57:58.000Z",
		"content": "I'm going to argue with you. [Big surprise!]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Indeed. But I think any consensual sexual act is okay. For instance, masocists and sadists can have a fine relationship.[hr][/quote]<br /><br />A very good point, I should have allowed for this. Allowance would need to be made for varying levels of 'consensual'<br /><br />[quote]<b><i>Quote:</i></b>[hr]I also think no sexual laws should be put into place (Becides forced sodomy/sexual act or rape, obviosuly). IE: Homosexual sex shouldn't be illegal in any state, neither should prostitution.[hr][/quote]<br /><br />You always need laws, people are too smart and too stupid otherwise. Recently NZ's prostitution laws busted several 14 year olds working in a brothel; undercover police found over half of all bothel visitors would gladly have sex with a 12 year old. While not advocating a total ban, there should always be clear boundries and definitions.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Let's bring this into a better realm, considering 90% of everyone here is Christian: What do you think about marriage?[hr][/quote]<br /><br />Well... that depends.<br /><br />On one hand, marrigie is nothing anymore, they can be broken, over a third fail in the first year, they can be bought, arranged, convenient, on a drunken whim and over 25% of children are the result of adultery. [Even possibly you!] Civil unions and alternate relationship bloom. You can marry rocks, trees and pets. In short, marrige is no longer relevant, just a stupid piece of paper.<br /><br />And yet gays continue to strive for it, why?<br /><br />Becuase marrige is more than that to some peole; it is a vow, a binding commitment, tendon ans sinew and bone, that hurts when severed. It is a foundation to build a life apon, a center of two worlds. The gay community wants to one day be able to say, these two people love each other and this piece of paper symbolises that love, that commitment.<br /><br />Marrige resulted in us losing Ilsoap.<br /><br />Despite this I think marrige is a good idea and a nice institution, if only it were treated with more respect and consideration to keep out the riff raff. However, a marrige that isn't working, isn't working. It should be counseled or dissolved.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23339,
		"title": "Re: ..",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-05T16:29:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />You always need laws, people are too smart and too stupid otherwise. <br />[hr][/quote]<br />This idea is the result of arrogance that is dispicable in every form.  People MUST have a right to make choices for themselves:<br /><br />\"If you cannot write very well, then you cannot think very well, and if you cannot think very well, then someone is doing your thinking for you\" -George Orwell<br /><br />The law does not protect idealism, it bastardizes it in order to make it a rallying point.  It neglects any wieght the original idea had in order to make it political fuel.<br /><br />The EPA really does nothing for the enviorment (I would know, I worked for a lab).  In an episode of Law &amp; Order, I saw an enviormental activist protesting against a company's neglect for the enviorment.  I was impressed.  For once someone understood (Whether in reality or not) that the goverment does not care about our enviorment nor will it ever.  People not allowing a thought to be put on the back burner by the government and doing it themselves shows that we as a people are capable of not needing government intereference with out enviorment.<br /><br />The same goes for any governmental agency that ecceeds constitutional mandate:<br /><br />\"I HEARTILY ACCEPT the motto,\"That government is best which governs least\"\" -Henry David Thoreau<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Recently NZ's prostitution laws busted several 14 year olds working in a brothel; undercover police found over half of all bothel visitors would gladly have sex with a 12 year old. While not advocating a total ban, there should always be clear boundries and definitions.<br />[hr][/quote]<br /><br />Perhaps you have forgotten that having sex with a minor (16 and below) is very much illegal (In the USA)?<br /><br />There is already a law against that act.<br /><br />So please, how does prostitution come into play?  It is atrocious to have sexual intercourse with a minor, but a grown woman giving herself for money is her choice.  I disgree with it on an ethical level 100%, but it is not my right to interfere with her life and her choices.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23340,
		"title": "Re: ..",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-06T06:40:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]This idea is the result of arrogance that is dispicable in every form. People MUST have a right to make choices for themselves:[hr][/quote]<br /><br />Thats the problem; by themselves they tend to choose things that harm others.<br /><br />[quote]<b><i>Quote:</i></b>[hr]People not allowing a thought to be put on the back burner by the government and doing it themselves shows that we as a people are capable of not needing government intereference with out enviorment.[hr][/quote]<br /><br />Indeed, sadly government is not always the best place to get the right laws passed.<br /><br />A law is merely a written version of a common [or not so common] convention that outlines it and its consequences specifically.<br /><br />[quote]<b><i>Quote:</i></b>[hr]So please, how does prostitution come into play? It is atrocious to have sexual intercourse with a minor, but a grown woman giving herself for money is her choice. I disgree with it on an ethical level 100%, but it is not my right to interfere with her life and her choices.[hr][/quote] <br /><br />I likewise disagree ethically, and I hope that the vast majority of prostitutes are in thier profession for their own ends rather than due to monentary of relationship problems.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23341,
		"title": "Re: ..",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-06T15:41:12.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Thats the problem; by themselves they tend to choose things that harm others.<br />[hr][/quote]<br /><br />Then they're interfering with anothers rights; something that Christians are doing with moral laws (Ten Commandments in court houses; anti-Gay Marriage; banning of sodomy/prostitution)<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Indeed, sadly government is not always the best place to get the right laws passed.<br /><br />A law is merely a written version of a common [or not so common] convention that outlines it and its consequences specifically.<br />[hr][/quote]<br /><br />\"right laws\" is not what I meant... I meant that no laws should be passed about envoirment, gun regulation, sex regulation, religious regulation, public schools, welfare...<br /><br />I disagree with laws that force us to not care about other humans beings, mainly, but I also detest laws that force people to be philanthopists.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I likewise disagree ethically, and I hope that the vast majority of prostitutes are in thier profession for their own ends rather than due to monentary of relationship problems. <br />[hr][/quote]<br /><br />Eh, I know of very few women who got dumped and then become hookers...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23342,
		"title": "Re: ..",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-07T04:38:45.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Then they're interfering with anothers rights; something that Christians are doing with moral laws (Ten Commandments in court houses; anti-Gay Marriage; banning of sodomy/prostitution)[hr][/quote]<br /><br />Yes; and that is why the law exists, to prevent this. It is also why there is a push to legalize prostitution, ban the 10 commandments from law and wait a sec, sodomy is ilegal?<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"right laws\" is not what I meant... I meant that no laws should be passed about envoirment, gun regulation, sex regulation, religious regulation, public schools, welfare...[hr][/quote]<br /><br />A NRA are you? There is no way you'd persuede me that no laws there would be better, especially the environment, we had no laws there and look what that did. And isn't welfare itself a law? Taking from others legally to support a group? Schools I'm more ambivalent about, but here in NZ there are some shady 'schools' operating at the edge of the law, I'd hate to see them become mainstream.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I disagree with laws that force us to not care about other humans beings, mainly, but I also detest laws that force people to be philanthopists.[hr][/quote]<br /><br />I half agree with that, what do you define as a philanthropist?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Eh, I know of very few women who got dumped and then become hookers...[hr][/quote] <br /><br />Yeah, but sex abuse tends to tally with prostitution.<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23343,
		"title": "...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-08T20:16:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Yes; and that is why the law exists, to prevent this. It is also why there is a push to legalize prostitution, ban the 10 commandments from law and wait a sec, sodomy is ilegal?<br />[hr][/quote]<br /><br />In some states, if I do remember correctly.  Adultery is illegal in NY also, if you did not know.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />A NRA are you? There is no way you'd persuede me that no laws there would be better, especially the environment, we had no laws there and look what that did. And isn't welfare itself a law? Taking from others legally to support a group? Schools I'm more ambivalent about, but here in NZ there are some shady 'schools' operating at the edge of the law, I'd hate to see them become mainstream.<br />[hr][/quote]<br /><br />NRA = National Rifle Association?<br /><br />I did not say \"no laws\", I implied \"less law\".<br /><br />And Welfare is, obviously, a law.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I half agree with that, what do you define as a philanthropist?<br />[hr][/quote]<br /><br />Anyone who:<br /><br />A. Does not care about the people they give their money to.<br />B. Gives up money because they are forced to.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Yeah, but sex abuse tends to tally with prostitution.<br />[hr][/quote]<br /><br />And it does not tally with drinking, smoking, or any coping mechanisms?  You cannot single out one as a crime, unless it interferes with anothers rights."
	},
	{
		"id": 23344,
		"title": "Phonilanthropy",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-09T02:59:23.000Z",
		"content": "[hr]<b>Lord of Globox</b> Anyone who:<br /><br />A. Does not care about the people they give their money to.<br />B. Gives up money because they are forced to.<br />[hr]That's not philanthropy, it's a try-hard impersonation.<br /><br />This is true philanthropy:<br />[hr]   1.  The effort or inclination to increase the well-being of humankind, as by charitable aid or donations.<br />   2. Love of humankind in general.<br />   3. Something, such as an activity or institution, intended to promote human welfare.<br />[hr]<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23345,
		"title": "Re: Phonilanthropy",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-09T11:04:10.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And it does not tally with drinking, smoking, or any coping mechanisms?[hr][/quote]<br /><br />No it doesn't; prostitutes, while at greater risk of drug abuse and sexually transmitted diseases do not tend to smoke or drink more.<br /><br />They do tend to come from families that have alcoholics, childhood sexual abuse, povery, single parents and drug abuse.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23346,
		"title": "Re: Phonilanthropy",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-10T04:10:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />A. Does not care about the people they give their money to.<br />B. Gives up money because they are forced to.<br /><br />--------------------------------------------------------------------------------<br />That's not philanthropy, it's a try-hard impersonation.<br /><br />This is true philanthropy:<br /><br />--------------------------------------------------------------------------------<br />1. The effort or inclination to increase the well-being of humankind, as by charitable aid or donations.<br />2. Love of humankind in general.<br />3. Something, such as an activity or institution, intended to promote human welfare.<br />[hr][/quote]<br /><br />Indeed.  I thank you for attempting to make a fool of me.  I will now note that I said my usage of philanthopy (in this case), not the denotated version.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />LevelLord00:<br />--------------------------------------------------------------------------------<br />And it does not tally with drinking, smoking, or any coping mechanisms?<br />--------------------------------------------------------------------------------<br /><br />No it doesn't; prostitutes, while at greater risk of drug abuse and sexually transmitted diseases do not tend to smoke or drink more.<br /><br />They do tend to come from families that have alcoholics, childhood sexual abuse, povery, single parents and drug abuse.  <br />[hr][/quote]<br /><br />Well, prostitutes have many a drinking and drug problem in the USA.<br /><br />There is not just one reason why women becomes prostitutes, there are many.  So I do not see how ascribing one situation as a offense against my view is hardly that credible.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23347,
		"title": "Re: Phonilanthropy",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-11-10T08:47:45.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>LoG</b> I will now note that I said my usage of philanthropy (in this case), not the denotated version.[hr][/quote]<br />He's right, you know - this was the question he was answering:<br />[quote]<b><i>Quote:</i></b>[hr]<b>LL</b> what do <b>you</b> define as a philanthropist?[hr][/quote][url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[url=http://www.last.fm/user/grafix5000/][img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img][/url]"
	},
	{
		"id": 23348,
		"title": "Uhuh...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-10T14:40:29.000Z",
		"content": "*shrugs* In that case, allow me to rephrase:<br /><br />I don't see how that can be considered philanthropy. It's based upon selfish motivations. Granted, many who call themselves philanthropists may fall into this category, but this doesn't necessarily mean that philanthropy is thus not what it claims to be, just that those who claim to practice it are not what they claim to be.<br /><br />Or something. I've grown bored of these discussions, but decided to drop in a random comment (and wasn't attempting to make anybody look foolish).<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23349,
		"title": "Re: Uhuh...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-11T04:22:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />*shrugs* In that case, allow me to rephrase:<br /><br />I don't see how that can be considered philanthropy. It's based upon selfish motivations. Granted, many who call themselves philanthropists may fall into this category, but this doesn't necessarily mean that philanthropy is thus not what it claims to be, just that those who claim to practice it are not what they claim to be.<br /><br />Or something. I've grown bored of these discussions, but decided to drop in a random comment (and wasn't attempting to make anybody look foolish). <br />[hr][/quote]<br /><br />Then allow me to rephrase a say \"forced philanthropy\".  Better?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23350,
		"title": "Re: Uhuh...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-11T05:01:42.000Z",
		"content": "Perhaps then we need to rearrange the wording here; philanthropy isn't working, lets try Coactuanthropy or Creptioanthropy both mean literally 'be forced to care for your fellow man'A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23351,
		"title": "Re: Uhuh...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-11T21:53:47.000Z",
		"content": "Either works.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
