[
	{
		"id": 103,
		"title": "Help about Commander Keen",
		"author_id": 1486011,
		"author_name": "Stipe",
		"timestamp": "2006-05-05T15:39:33.000Z",
		"content": "Hi! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br />I need help about playing Some versions of Commander Keen.<br />(Commander Keen: CK) <br />My play at some really hard levels looks like this: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] <br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br />CK 2: It's too hard when I get to that switch to destroy the Earth. I don't know how to easily jum those electricity things. And: I've noticed switch to turn light off. Does it have some sence or it is made just for fun?  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wormouth.gif[/img] <br />CK 4: about story; since english is not my mother language, can someone explain what happened to that wizard who just ran away?  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img] <br />CK 5: How to get that level on bottom of the map? I found that blue point, but I don't get it how to use it.  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img] <br />I'm sure I'll have more questions since I haven't passed all 7 versions, so be able to answer me. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] <br />Thanks! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 3113,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-05-05T16:53:37.000Z",
		"content": "CK2: Don't jump over the electric things. Just shoot past them. The light switch makes Vorticons unable to jump.<br /><br />CK5: That's a secret level. The blue circle thing that you are talking about is how you get back from the level. To get to the level, go into the second-to-last level (the green one), and get to the arch by the exit. Inside the arch, press down and jump. You'll fall down. Now walk to the left and you'll fall down some more. Just keep going up until you find the teleporter.<br /><br />I hope this helps. What language did you learn first? Maybe someone else who speaks that language can help you.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 3114,
		"title": "Re: Help about Commander Keen",
		"author_id": 1486011,
		"author_name": "Stipe",
		"timestamp": "2006-05-05T17:10:39.000Z",
		"content": "Thanks! I forgot to ask:<br /><br />CK5: How to kill all that machines but last one? That's the only one I got.<br /><br />My mother language is not english. I used cheats to \"fly\" trough levels. So I came to that secret level in CK4 and seen one red wizard (I forgot their name). So, I've touched him and he said something. Keen had confused face. I understood just \"Sorry\" and \"You aren't angry, are you?\" from wizard. After that there were doors. I went in and got that flying foot. I hope you know what am I taking about.<br /><br />P. S. I don't need translate. I need someone to explain me talk with another english words. Got it? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]"
	},
	{
		"id": 3115,
		"title": "Re: Help about Commander Keen",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2006-05-05T23:16:15.000Z",
		"content": "The Oracle Council member (the 'red wizard') in that CK4 level is only the janitor, or something similar. <br /><br />I can't remember exactly what is said between him and Keen, but I think Keen was angry that he wasted all his time getting through the level only to discover that the Oracle member he was trying to rescue was just the janitor, and not someone in his mission objective."
	},
	{
		"id": 3116,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-05-06T03:07:34.000Z",
		"content": "Keen 1: What levels in particular? There are only a few you *need* to do.<br /><br />Keen 2: Shoot the purple spark, do so by standing *next* to the destroy earth switch [but not touching it!] and pgogoing, when you are at the top of your jump, shoot, it will destroy the spark, and the machine will die and you can get past.<br /><br />The light switch stops those shooty blue guys jumping, so you can make them fall into pits and stuff, and get out of your way.<br /><br />CK4: That wizzard was a janitor, not very important, Keen had to do that big level thinking he'd save a wizzard, but really he was just saving the guy who mops the floors and makes coffee, so Keen got all mad [did you see his red eyes?]<br /><br />Also, in that pyramid with the moon on it, at the bottom, if you go there and make *all* the worms move into one spot, they will make a big foot that will take you to the secret pyramid.<br /><br />CK5: There is a teleporter that will take you there; but its in one of the other levels; if english is not your first language, it may be hard to explain; basically, near the end of one of the levels, you are in a doorway and can jump up and find a secret area that will take you there [Like the foot in Keen 4] I might need to post a picture.<br /><br />The machinea at the end; you see the big black cubes that follow you and blow up? You amke one follow you to the machine, then when it is close, make it blow up; it will blow up the machine too, you win!<br /><br /><br />Can someone make him a dosbox movie of it? And the secret level?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3117,
		"title": "Re: Help about Commander Keen",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-05-06T04:00:05.000Z",
		"content": "[hr]<b>Stipe</b> CK5: How to kill all that machines but last one? That's the only one I got.<br />[hr]Try jumping on them with the pogo stick."
	},
	{
		"id": 3118,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485560,
		"author_name": "Sanitars",
		"timestamp": "2006-05-06T11:18:48.000Z",
		"content": "Cheating is for lazy losers [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]"
	},
	{
		"id": 3119,
		"title": "Re: Help about Commander Keen",
		"author_id": 1486011,
		"author_name": "Stipe",
		"timestamp": "2006-05-06T13:01:19.000Z",
		"content": "Thanks for help!<br />Now I need to tell you two things you haven't understand:<br />1. I know english well, but I haven't understood that talk. Maybe I haven't read it too well.<br />2. I cheated just to see whole story about Keen AKA Billy Blaze. Now I'm playing game without cheat and I've passed whole 1st Keen and almost whole 2nd Keen.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 3120,
		"title": "Re: Help about Commander Keen",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-05-06T15:09:34.000Z",
		"content": "Tell us what you don't understand, and we'll try to find different words to explain them.<br /><br />[hr]<b>Stipe</b> P. S. I don't need translate. I need someone to explain me talk with another english words. Got it? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img] <br />[hr]Why wouldn't you prefer a translation? It makes a lot more sense to do it that way. You could then use the translation to learn what the original English words mean."
	},
	{
		"id": 3121,
		"title": "Re: Help about Commander Keen",
		"author_id": 1486011,
		"author_name": "Stipe",
		"timestamp": "2006-05-06T19:53:27.000Z",
		"content": "It was just that talk with unreal wizard. Thanks, Commander Spleen!  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />I got something on idea. How did Commander Keen got his name? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]"
	},
	{
		"id": 3122,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-05-07T02:54:56.000Z",
		"content": "Simple; Billy wanted a title that assonated, like his name <b>B</b>illy <b>B</b>laze. <br /><br />He was also quite eager, and determined, but neither of those worked, Keen would work, giving him two options, Captain Keen, or Commander Keen. Commander sounded better [He gets mad if anyone calls him captain]<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3123,
		"title": "Re: Help about Commander Keen",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-05-08T11:51:23.000Z",
		"content": "Isn't the \"wizard\" referring to the council page from the intro?<br />He's the guy in a yellow robe, I think red circle on it as well, grey skin.<br />(Can't be bothered to check right now.)<br />He just ran off again to the Oracle site I guess, and is back there for the ending sequence.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 3124,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-05-09T11:44:20.000Z",
		"content": "Either that or the Janitor for the high council in the pyramid of the forbiddenA proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3125,
		"title": "Re: Help about Commander Keen",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-05-13T05:52:04.000Z",
		"content": "Yeah, the Council Page (the gray dude) went back to the Oracle, I think (coward!). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
