[
	{
		"id": 748,
		"title": "Freeware DOS C or Pascal compilers? (16-bit real mode)",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-03-28T17:51:09.000Z",
		"content": "I'm looking for free C (not necessarily C++) or Pascal compilers for real mode DOS. DJGPP, unfortunately, only produces protected mode DOS applications.<br /><br />What's all this for? For experimenting with CKPatch's source code, and also to write an utility called \"modstub\" that could be used for Keen2/3/5/6 mods (not written yet, although I have the general idea written down somehwere).------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 19577,
		"title": "Re: Freeware DOS C or Pascal compilers? (16-bit real mode)",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-03-28T21:02:46.000Z",
		"content": "That's a difficult one. I think there's a Borland C compiler that worked in 16-bit mode, and was released freely to the public at some point. Good luck searching the Borland site though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 19578,
		"title": "Re: Freeware DOS C or Pascal compilers? (16-bit real mode)",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-28T22:33:04.000Z",
		"content": "Yeah Borland released their compiler a while back, but I can't remember whether it did real mode or not.  I think it was actually pretty easy to find though.<br /><br />Back in the days of DOS there weren't many free compilers, so I think you'll have a tricky time finding a free one from that era."
	},
	{
		"id": 19579,
		"title": "Re: Freeware DOS C or Pascal compilers? (16-bit real mode)",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2007-03-30T21:27:52.000Z",
		"content": "[url=http://dn.codegear.com/article/20803]dn.codegear.com/article/20803[/url]<br /><br />Try using Wiki links, they really do kick so much ass. =P~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
