[
	{
		"id": 971,
		"title": "Growing Legs",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-12T01:07:41.000Z",
		"content": "I've been involved with a lot of Internet forum conversations. Conversations that turn into debates, debates that turn into arguments, and arguments that turn into sludge.<br /><br />I'd like to try something new. There is a scenario below. I would like you to read it fully and then answer the questions given. That's all:<br /><br />[hr]<br /><br />At our church recently, an interesting thing has been happening. There have been many people (some in our congregation, some not) who have had back problems. Not just any back problems though, they have one specific thing in common: the back problems are caused by the fact that one of their legs is shorter than the other.<br /><br />Well, over the last two months, people are being healed of this. In some cases, they come up to the front of our church with a back problem and ask to be prayed for to be healed. They're sat down on two chairs, with legs parallel and feet up on one of the chairs, and prayed for. During the prayer, the short leg comes forward through whatever means, and the legs are the same length. Any back pain is gone.<br /><br />The most extreme case of this that I know of is a guy in his mid-twenties named C.J., who had to some sort of brace as a kid, and as a result, his leg lengths were a full 1 1/2 inches different. The leg difference was enough to be noticeable in his walking (he favored one leg), but after being prayed for, his legs aligned and he walks perfectly straight.<br /><br />Here are my questions to you:<br /><br />1. Do you believe that these people were healed supernaturally? If not, what happened?<br />2. Do you believe what I'm saying at all? If I scanned in the medical records of this (or other healings) and posted them here, would you believe then?<br />3. If this does not convince you anything supernatural is involved... what would?[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23107,
		"title": "Re: Growing Legs",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-12T01:59:58.000Z",
		"content": "This will just turn out the same way...<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />1. Do you believe that these people were healed supernaturally?<br />2. Do you believe what I'm saying at all? If I scanned in the medical records of this (or other healings) and posted them here, would you believe then?<br />3. If this does not convince you anything supernatural is involved... what would?<br />[hr][/quote]<br /><br />1. No.<br />2. If you gave me a definative record, doctors opinions, and if I met the doctor myself.<br />3. I do not beleive God manifests himself as a healer even if he is real.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23108,
		"title": "Re: Growing Legs",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-12T02:53:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]This will just turn out the same way...[hr][/quote]<br /><br />Whether or not this turns into sludge... I'd still like to know what answers people give. (Oh, and I edited question #1, since I forgot an important part of it when I made the original post.)[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23109,
		"title": "Re: Growing Legs",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-12T03:30:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]1. Do you believe that these people were healed supernaturally? If not, what happened?<br />2. Do you believe what I'm saying at all? If I scanned in the medical records of this (or other healings) and posted them here, would you believe then?[hr][/quote]<br />I do not believe in what you say but I don't know wether you believe in it yourself or not. Scans wouldn't prove anything. I could do it with photoshop too, and there are believer doctors out there too who see what they want to see.<br /><br />[quote]<b><i>Quote:</i></b>[hr]3. If this does not convince you anything supernatural is involved... what would?[hr][/quote] What does supernatural mean? Is it something that cannot be explained by today's science or something else? I wouldn't call the former supernatural.<br /><br />What I don't understand is why do you care what we believed? If we didn't believe in something that does happen than it's our problem. Why do believers of all kind always try to convert non-believers? I'd never start a topic saying that I don't believe in god or anything supernatural, but I tell it if you ask so.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 23110,
		"title": "Re: Growing Legs",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-12T05:13:45.000Z",
		"content": "1. I don't believe it, since all I have is your story to go on. If anything of the sort happened, then my first thought is that there were some serious measurement errors. I'd be more inclined to take the incident seriously if I had seen it myself, or if someone I trust very much vouched for it.<br />2. I would believe the story more than I do now.<br />3. Well, I'll know it when I see it. I don't think about whether something is supernatural or not. There are just two kinds of events: those I understand and those I don't. If I don't understand it at all then I think about it until I do understand it, or until I give up. I'm not one to decide there's a magical answer to something because it's confusing. There are lots of things I don't understand, but a lot of those things are understood by others. My knowledge doesn't even come close to everything that is known and can be known, so I don't get upset when I reach the edge of the things I know.<br /><br />The real issue here is that you've presented us with a story we can't verify. God isn't even an issue until that is resolved.<br /><br />Like Z says, what does it matter whether we believe it happened? Did you see it, and are you satisfied that you saw what you did? We we weren't there, so your opinion carries a lot more weight than ours (to all who consider you credible).________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23111,
		"title": "Re: Growing Legs",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-12T06:22:26.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]1. Do you believe that these people were healed supernaturally? If not, what happened?[hr][/quote]<br /><br /><i>Such healings are well documented across a variety of faiths and also some atheist 'faith healers'; this phenomenom is thus obviouls real.</i><br /><br />Maybe; a church doesn't necessarily mean God, or any God. I try to keep an open mind.<br /><br />[quote]<b><i>Quote:</i></b>[hr]2. Do you believe what I'm saying at all? If I scanned in the medical records of this (or other healings) and posted them here, would you believe then?[hr][/quote]<br /><br />I'll take you at your word as you have so far not given me any evidence that you would lie about something like this. If however you were to push for donation to your church I'd want some kind of testimony and medical records.<br /><br />[quote]<b><i>Quote:</i></b>[hr]3. If this does not convince you anything supernatural is involved... what would?[hr][/quote] <br /><br />Null and void.<br /><br /><i>For the more polarized atheists on our forum, it'd need to be something pretty drastic, more drastic I'd say then what would convince them of a scientific theory. Remember, they believe in mo God as firmly as you believe in one.</i><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23112,
		"title": "answers",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-12T07:33:29.000Z",
		"content": "<i>1. Do you believe that these people were healed supernaturally? If not, what happened?</i><br /><br />I do not think any physical change took place in these peoples' bodies--but I would agree that a \"placebo effect\" or \"faith healing\" took place, easing the minds of those in pain.<br /><br /><i>2. Do you believe what I'm saying at all? If I scanned in the medical records of this (or other healings) and posted them here, would you believe then?</i><br /><br />I would not be likely to believe them, because there are countless tutorials for Photoshop, and I've been fooled in the past.  Call it cynicism, if you will.<br /><br /><i>3. If this does not convince you anything supernatural is involved... what would?</i> <br /><br />Depends... if it's halloween time or I've just finished reading a bunch of ghost stories, I may be more likely to believe... but from a purely scientific standpoint, the only way I'd consider the notion is if I were to actually witness it with my own eyes, on multiple, seperate occasions.<br /><br />:-)"
	},
	{
		"id": 23113,
		"title": "Re: answers",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-12T07:53:10.000Z",
		"content": "I don't get this praying business.  There are plenty of people who have cancer, and plenty of them pray for healing.  Some of them do recover, some of them don't.  Why does God heal some and not others.<br /><br />From my standpoint, praying is simply something to ease the mind of the person that does it, which is a pretty good thing.  From a Christian standpoint, it's getting in touch directly with God.  But why would God heal some people and not others?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23114,
		"title": "Re: answers",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-12T11:59:49.000Z",
		"content": "Why should he heal anyone? People nag me all the time and they don't get squat.<br /><br />*Sigh* <i>Dear Lord, a smoke grenade, gas mask and helicopter, thats all I ask of Thee.</i>A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23115,
		"title": "Re: answers",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-12T16:16:14.000Z",
		"content": "1. Hmmm, I'd guess so.<br />2. Yes.<br />3. It's convincing enough.<b>Eat your veggies!</b>"
	},
	{
		"id": 23116,
		"title": "Re: answers",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-12T17:30:28.000Z",
		"content": "1. no<br />2. no<br />3. It's probably in their head or everything is faked. What ever is the case I don't believe anything supernatural can be involved. And even so, why would God or whoever do something like this? edit - not an answer to the question.<br />If God of one of his messagers revealed himself then I would be convinced.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 23117,
		"title": "Re: answers",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-12T20:05:00.000Z",
		"content": "1. Yes; supernatural thing do happen, and this is minor compared to most.<br />2. Yes<br />3. I'm a Christian, and God is not dead!<br /><br />[quote]<b><i>Quote:</i></b>[hr]1. no<br />2. no<br />3. It's probably in their head or everything is faked. What ever is the case I don't believe anything supernatural can be involved. And even so, why would God or whoever do something like this? edit - not an answer to the question.<br />If God of one of his messagers revealed himself then I would be convinced. [hr][/quote]<br /><br />So you're basically saying, you don't trust Ilsoap?<br /><br />Name one time Ilsoap has lied to us? Just one!!!Proud Leader of the \"Tough Guys Wear Pink\" Society<br />--------------------------------------------------<br />Tough Guys Don't Follow Fads; the set them!!!<br />Kudus to Trensetters!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23118,
		"title": "Questions.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-11-13T02:00:05.000Z",
		"content": "I'm inclined to believe it if you claim this is a true story. I don't see any reason you'd lie just for the sake of some controversy.<br /><br />One question I have, though, is why is this happening so frequently? Is it a theme the church has going, or did these people 'randomly' turn up in a short period of time?<br /><br />As far as 'supernatural' healing goes, I say yes and no. If we're talking supernatural as in beyond our current ability to understand scientifically what's going on, then yes. However, ultimately nothing is supernatural, it's just that there's more to nature than we allow ourselves to believe.<br /><br />To completely convince me, you would need to present me with before and after photos, or footage of the entire session, from several different angles and varying zoom levels (filmed by a neutral party with no affiliation with you or the church and no vested interest in either a positive or negative outcome). Medical records would be handy, but I don't really give the medical profession much credit these days.<br /><br />In fact, the next time I'm in the middle of a scenario like this, I must find some video cameras and actually try to document it for once.<br /><br />Ultimately, I don't care what source this healing comes from. Rather I want to know how to harness it in everyday life, without the need for prayer or affirmation, just raw psionics and visualisation.<br /><br />The problem with prayer sessions and hypnosis and such, which seem to manifest such results, involve an individual giving the power over themselves away to other people.<br /><br />For phenomenon like this to be truly useful, it must be used by someone willing to take responsibility for their own self. If they don't, someone else will, and no level of physical healing will make up for that.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23119,
		"title": "Re: Questions.",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-13T09:48:33.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Name one time Ilsoap has lied to us? Just one!!![hr][/quote]<br />No one necessarily thinks he's lying. His story might be accurate to the best of his knowledge, but still not be true. Anyone can be wrong.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23120,
		"title": "Re: Questions.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-13T11:17:49.000Z",
		"content": "Today I met someone while looking through thier trash [technically its an inorganic waste collection, happens about once every two years] he pointed out several items I had overlooked and got me a bag to carry them home [10km!] He also gave me the cutest little stuffed toy 'for another set of eyes to look out for you.' It's been a long time since I've met someone so nice [makes you all look like right bastards. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  ] and its times like that which convince me that God exists.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]However, ultimately nothing is supernatural, it's just that there's more to nature than we allow ourselves to believe.[hr][/quote]<br /><br />Or perhaps there are things we may never understand; Godels incompleteness theorem proves that in any finite language there are statements that cannot be proven true or false. This applies to mathematics, and possibly the universe too.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23121,
		"title": "Re: Questions.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-13T16:18:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Today I met someone while looking through thier trash [technically its an inorganic waste collection, happens about once every two years] he pointed out several items I had overlooked and got me a bag to carry them home [10km!] He also gave me the cutest little stuffed toy 'for another set of eyes to look out for you.' It's been a long time since I've met someone so nice [makes you all look like right bastards.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ] and its times like that which convince me that God exists.<br />[hr][/quote]<br /><br />Eh, some people are really nice like that.  Where did you meet him?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23122,
		"title": "Re: Questions.",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-13T20:07:39.000Z",
		"content": "Well... as christians, we are supposed to preach by example rather than with words.<br /><br />Someone is more likely to accept Christ if Christians live normal happy lives, and are kind, rather than if Christianity is shoved down there throat.Proud Leader of the \"Tough Guys Wear Pink\" Society<br />--------------------------------------------------<br />Tough Guys Don't Follow Fads; the set them!!!<br />Kudus to Trensetters!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23123,
		"title": "Re: Questions.",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-13T20:57:24.000Z",
		"content": "As I see this, there's basically two types of answer. Ilsoap, now I'd like to know why have you asked those questions? Just curious. [hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 23124,
		"title": "Re: Questions.",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-14T00:10:06.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]As I see this, there's basically two types of answer. Ilsoap, now I'd like to know why have you asked those questions? Just curious.[hr][/quote] <br /><br />I was waiting on purpose, seeing how many people would give answers to my questions before discussion started again, and that looks like right about now.<br /><br />My point to all of this is that there are many who say God doesn't exist because he doesn't show himself. That is flawed, because there isn't a single miraculous thing that God could do that would definitively prove to everyone that he exists. Anything miraculous can be explained away.<br /><br />Of all of the responses of how to make the miracle more convincing to you, CommanderSpleen's seemed most practical:<br /><br />[quote]<b><i>Quote:</i></b>[hr]To completely convince me, you would need to present me with before and after photos, or footage of the entire session, from several different angles and varying zoom levels (filmed by a neutral party with no affiliation with you or the church and no vested interest in either a positive or negative outcome).[hr][/quote] <br /><br />The problem is that, honestly, who goes to a church with no vested interest in a positive or negative outcome? Even a news crew would have some bias. There's also a common denominator about miracles, in that they aren't a miracle until they happen, and they aren't expected. You have a lot of footage of the second plane flying into the twin towers, but precious little of the first plane. (I'm giving that example only to prove a point about video, not to make any other message about religion, just in case there's a misunderstanding about that.)<br /><br />Moreover, Biblical healing is always unpredictable. Jesus healed several people of blindness, but every time he did it a different way. Of course, if healing always happened the same way, it's no certainty that it would prove God's existence.<br /><br />Getting back to this incident of the legs growing... all I can say is what I know. I didn't personally witness any of the leg growths. I wasn't at the youth group meeting when C.J.'s leg grew 1 1/2 inches. What I can do is direct you to about 30 people who DID see this happen, including one guy who was an atheist that night and isn't now.<br /><br />There isn't a single thing that I or anyone else can do or say to prove that God exists, because so many miraculous things are on a personal level. Yes, my relationship with God was finally able to break me of my addiction to porn, but how can I prove that? I have a friend who broke his arm and had it healed before his eyes... how can I prove that?<br /><br />[quote]<b><i>Quote:</i></b>[hr]What I don't understand is why do you care what we believed? If we didn't believe in something that does happen than it's our problem. Why do believers of all kind always try to convert non-believers? I'd never start a topic saying that I don't believe in god or anything supernatural, but I tell it if you ask so.[hr][/quote]<br /><br />Because it's not just about opinions. The message that you can be saved of sins and set free and know God... a Christian looks at this as though it were a life preserver to someone who's drowning. Sure, you can tread water without it, but there's a better way.<br /><br />However, I feel as though I've been ultimately unsuccessful portraying that on this, or any, Internet forum. My real point in all of this was curiosity, to see if there was anything that would convince some of the people here to look outside their beliefs, and what it would take to do that. I wasn't particularly surprised.<br /><br />I'm done discussing Christianity on Internet forums. I'll do it one-on-one over e-mails (chris-at-screenhog-dot-com, if you so desire), but on a mass scale like this... it's an uphill battle, to say the least.<br /><br />All I can say is that it's real. I don't know it all, but I know that much. [url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23125,
		"title": "Re: Questions.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-14T00:57:18.000Z",
		"content": "You know Soap, you should get into preaching. You'd really clean up.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Eh, some people are really nice like that. Where did you meet him?[hr][/quote] <br /><br />Biking past his house heading home from work. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23126,
		"title": "Re: Questions.",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-14T01:48:39.000Z",
		"content": "There are many people who will believe just about anything just because someone else says it, but it's not me...<br /><br />[quote]<b><i>Quote:</i></b>[hr]Yes, my relationship with God was finally able to break me of my addiction to porn, but how can I prove that?[hr][/quote]I believe that, it's psychology.<br />[quote]<b><i>Quote:</i></b>[hr] I have a friend who broke his arm and had it healed before his eyes... how can I prove that?[hr][/quote]You wouldn't have to prove that but I'd have to see it myself otherwise I don't believe it. I think I could tell fake from real, maybe not.<br /><br />Even if \"supernatural\" things have happened, how could anyone prove it was made by a god?<br /><br />This is why it's called belief, it's not belief if you have to prove it.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 23127,
		"title": "Re: Questions.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-14T09:32:48.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]This is why it's called belief, it's not belief if you have to prove it.[hr][/quote] <br /><br />He's got a point you know.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23128,
		"title": "Re: Questions.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-15T01:41:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />The problem is that, honestly, who goes to a church with no vested interest in a positive or negative outcome? Even a news crew would have some bias.[hr][/quote]<br /><br />I actually went to church to see what they had to offer (After I became agnostic).  They were lacking on nearly every level.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Getting back to this incident of the legs growing... all I can say is what I know. I didn't personally witness any of the leg growths. I wasn't at the youth group meeting when C.J.'s leg grew 1 1/2 inches. What I can do is direct you to about 30 people who DID see this happen, including one guy who was an atheist that night and isn't now.<br />[hr][/quote]<br /><br />I being raised Christian have heard a million of these stories.  I do not think that they are all that credible.  If you could some how create a website with medical proof and such, I may reconsider.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />There isn't a single thing that I or anyone else can do or say to prove that God exists, because so many miraculous things are on a personal level. Yes, my relationship with God was finally able to break me of my addiction to porn, but how can I prove that? I have a friend who broke his arm and had it healed before his eyes... how can I prove that?<br />[hr][/quote]<br /><br />Having his arm broke is again something I am doubtful of.  It may have never broke in the first place, if I am understanding this story correctly.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />What I don't understand is why do you care what we believed? If we didn't believe in something that does happen than it's our problem. Why do believers of all kind always try to convert non-believers? I'd never start a topic saying that I don't believe in god or anything supernatural, but I tell it if you ask so.<br />--------------------------------------------------------------------------------<br /><br />Because it's not just about opinions. The message that you can be saved of sins and set free and know God... a Christian looks at this as though it were a life preserver to someone who's drowning. Sure, you can tread water without it, but there's a better way.<br />[hr][/quote]<br /><br />I once heard a quote that I think is rather sufficient here:<br /><br />\"To be moral is to do what it is right and not what you are told.<br />To be religious is to do what you are told, and not what is right.\"<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />However, I feel as though I've been ultimately unsuccessful portraying that on this, or any, Internet forum. My real point in all of this was curiosity, to see if there was anything that would convince some of the people here to look outside their beliefs, and what it would take to do that. I wasn't particularly surprised.<br />[hr][/quote]<br /><br />The internet is a difficult medium for Christians, because you have almost no factual evidence.  Christian (Albeit whether it is right or wrong) is conveyed on a personal level.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I'm done discussing Christianity on Internet forums. I'll do it one-on-one over e-mails, but on a mass scale like this... it's an uphill battle, to say the least.<br />[hr][/quote]<br /><br />And one on my side would say the same.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />All I can say is that it's real. I don't know it all, but I know that much.<br />[hr][/quote]<br /><br />One should always entertain the thought that they could be wrong, for no one is perfect and therefore they have to be wrong on one level or another.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23129,
		"title": "Re: Questions.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-15T02:38:32.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And one on my side would say the same.[hr][/quote]<br /><br />The problem we all have is that none of us are going to be convinced by words alone, which in the end is all we have. Not even Ilsoap is gifted enough to shift the long held and dearly beloved beliefs that we ourselves have cultivated in our own personal lives.<br /><br />Ultimately, apart form informing others of our views and giving them something to think about, these debates do little.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23130,
		"title": "Re: Questions.",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-15T07:03:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]One should always entertain the thought that they could be wrong, for no one is perfect and therefore they have to be wrong on one level or another. [hr][/quote]<br /><br />I go into every one of these debates doing so. I can only hope that everyone else does the same, because without it, they never work.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The internet is a difficult medium for Christians, because you have almost no factual evidence. [hr][/quote]<br /><br />We have almost no factual proof. Evidence is merely facts that have increased the likelihood of a thesis. We've got lots of that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]You know Soap, you should get into preaching. You'd really clean up.[hr][/quote]<br /><br />As much as I appreciate the vote of confidence, I'd be very surprised if that's the direction God takes me. I've only ever preached as a sort of \"guest preacher\" to my youth group, and coincidentally, it actually is very applicable here. I'm not going to go through the whole thing right now, but I'd like to give the example I started with.<br /><br />About 7 years ago, there were some hydroplane races happening on the lake I live near (do a Google search of \"hydroplane\" if you don't know what they are... they're really cool). They hydroplanes skimmed along a \"track\" on the lake, boarded off by large logs. <br /><br />Dad and I decided the best place to watch the races would be from the lake, so we took our boat into the water and motored over to where the races were held. However, many other residents here had the same idea, so the viewing area on the lake was very, very crowded.<br /><br />Now, to stay in one place, every boating party threw out an anchor, but there was one question... how much rope do you put on the anchor? Not enough rope, and the anchor won't reach the bottom, and you'll drift. Too much rope, and you will be drifting all over the place.<br /><br />Well, we had something that none of the boats around us had... a depth finder. It's a little electronic device that feeds to a display in the boat to say exactly how deep the lake was at that point. Dad and I both thought that it would be around 100 feet deep, but in fact, it was only 40 feet. We were surprised, but we got 45 feet of rope (had to give it a little extra in case the bottom was muddy) and threw out the anchor.<br /><br />This worked just fine until it got a bit windy. Suddenly, we had boats around us crashing into us. It seems that everyone else around us assumed that it was 100 feet deep instead of 40, and threw out that much rope. We were staying still, and all of the boats around us were drifting and crashing into us.<br /><br />Here's the interesting thing: everyone around us thought that WE were the ones who were wrong. They figured that we had thrown out way too much rope, and that's why WE were drifting into the other boats. We explained that we had a depth finder, and that it's only 40 feet deep. From that, we got one of two responses. Most people asked us to just put out more line so that we would conform to those around us, and a few people even said that our depth finder must be wrong and that THEY were right, even when they had no depth finder of their own.<br /><br />Thus, that day, we proved something that you already know... people don't like to be wrong. Myself included, I don't like to be wrong, but I definitely can be. I got into a discussion about evolution a year ago that opened my eyes to the fact that, hey, evolution poses no threat to Intelligent Design whatsoever. That was interesting, and I was better for it.<br /><br />Am I wrong now? I highly doubt I'm completely right about everything I've said here, and I'll be the first to admit that. Not a person in the world knows all the answers, and if Christianity was judged only by the Christians, it would always come up short. So be it... but I still stand by my statement that God is real. <br /><br />To all who have spent time in Christianity and found it lacking, I am sorry. I ask that you still keep it in the back of your mind as being not as crazy as you might think.<br /><br />(And yes, I said that I was done with the Internet forum debate stuff... I figured that it would be unfair to not allow some kind of rebuttal here, so I'll probably post here a few more times.)[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 23131,
		"title": "Honesty!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-15T08:46:07.000Z",
		"content": "I...I think I'm going to cry...A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23132,
		"title": "Re: Honesty!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-16T00:34:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />I go into every one of these debates doing so. I can only hope that everyone else does the same, because without it, they never work.<br />[hr][/quote]<br /><br />I do.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Ultimately, apart form informing others of our views and giving them something to think about, these debates do little.<br />[hr][/quote]<br /><br />They are, despite public opinion, not geared towards making the other side see your way.  They sometimes help the outsiders with makign descisions, but again, they are not really geared towards them either.<br /><br />They are for the debater himself\\herself.  When you debate, you are actaully testing your beleifs.  You are seeing where they fail, what other people have to say on your beleifs, you see baised critisism, and you see what needs to be pruned and what needs to be bettered.<br /><br />I do not enter debates just to show people what I think, but to see what they think.  The harder you argue them, the stronger you understand why you think as you do.  Which is true debating.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23133,
		"title": "Re: Honesty!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-16T01:28:50.000Z",
		"content": "Hmmm, good point. That too.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23134,
		"title": "Re: Honesty!",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-11-16T05:06:01.000Z",
		"content": "Very well put.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	}
]
