[
	{
		"id": 1273,
		"title": "Pink Floyd- Shine on, Syd Barrett...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-07-17T19:29:40.000Z",
		"content": "Nobody bothered to post this so I had to do it.<br />[img]http://www.sydbarrett.net/images/74-Now/roger2005.jpg[/img]<br />[quote]<b><i>Quote:</i></b>[hr]<b>Pink Floyd's Barrett dies aged 60 </b><br />Syd Barrett released two solo albums after leaving Pink Floyd <br />Syd Barrett, one of the original members of legendary rock group Pink Floyd, has died at the age of 60 from complications arising from diabetes. <br />The guitarist was the band's first creative force and an influential songwriter, penning their early hits. <br /><br />He joined Pink Floyd in 1965 but left three years later after one album. He went on to live as a recluse, with his mental deterioration blamed on drugs. <br /><br />\"He died very peacefully a couple of days ago,\" the band's spokeswoman said. <br /><br />\"There will be a private family funeral.\" <br /><br />  He was the first guy I'd heard to sing pop or rock with a British accent - his impact on my thinking was enormous <br /><br />David Bowie <br />A statement from Pink Floyd said: \"The band are naturally very upset and sad to learn of Syd Barrett's death. <br /><br />\"Syd was the guiding light of the early band line-up and leaves a legacy which continues to inspire.\" <br /><br />David Bowie described Barrett as a \"major inspiration\", saying: \"I can't tell you how sad I feel. <br /><br />\"The few times I saw him perform in London at UFO and the Marquee clubs during the '60s will forever be etched in my mind. <br /><br />\"He was so charismatic and such a startlingly original songwriter. Also, along with Anthony Newley, he was the first guy I'd heard to sing pop or rock with a British accent. <br /><br /> <br />Barrett (third from left) struggled with drugs and fame in the 1960s <br />\"His impact on my thinking was enormous. A major regret is that I never got to know him. A diamond indeed.\" <br /><br />Born Roger Barrett in Cambridge, he composed songs including See Emily Play and Arnold Layne, both from 1967. <br /><br />He also wrote most of their album The Piper at the Gates of Dawn. But he struggled to cope with fame and drugs. <br /><br />Dave Gilmour was brought in to the band in February 1968 and Barrett left that April, releasing two solo albums soon after. <br /><br />The band's biggest-selling releases, Dark Side of the Moon and The Wall, emerged in the post-Barrett era, with the band selling an estimated 200 million albums worldwide. <br /><br />Just as Pink Floyd were about to achieve global success, Barrett retreated from public life and returned to Cambridge. <br /><br />Little was known about his whereabouts for 20 years until he was tracked down living with his mother. <br /><br /> <br />Barrett became one of rock's most reclusive characters <br />But his influence remained, with younger fans and artists discovering his music. <br /><br />Former Blur guitarist Graham Coxon released a statement saying: \"Lost him again... for bang on 20 years Syd led me to better places.\" <br /><br />\"From my agape 17-year-old first listen to Bike to, just the other day, Jugband Blues. <br /><br />\"Languished in his noise... dreamt in his night... stared at his eyes for answers...\" <br /><br />Barrett's biographer Tim Willis said the guitarist's music left a lasting legacy. <br /><br />\"I don't think we would have the David Bowie we have today if it wasn't for Syd,\" he told BBC Radio Five Live. <br /><br />\"Bowie was very much a kind of clone of Syd in the early years. His influence is still going. <br /><br />\"New bands discover him all the time. There's always a Syd revival going on - if it wasn't the punks, it was REM, and I'm sure that Arnold Layne and Emily Play as pop songs will live forever.\" <br />http://news.bbc.co.uk/2/hi/entertainment/5169344.stm<br />[hr][/quote]<br /><br />Although I'm not familiar with 'The Piper at the gates of dawn' I'm a bit sad about this news. The homage album to this man 'Wish you where here' was a beautiful album and having seen Roger Waters dedicating the song 'Shine on you crazy diamond' to Syd only a few weeks ago makes it even stronger.<br /><br />Anyway there is a lot to say about Pink Floyd, do you consider the last two albums as Pink Floyd etc. but there are also a lot recent things to talk about like the new solo works of Roger Waters and David Gilmour, their solo tours, the Pulse dvd, and a possible reunion.<br /><br />So I take this opportunity to turn this topic in a central one for Pink Floyd.<br /><br />[img]http://www.pink-floyd.org/images/front.jpg[/img]<br /><b>Discography</b><br />1967: The Piper at the Gates of Dawn <br />1968: A Saucerful of Secrets <br />1969: Music From the Film More <br />1969: Ummagumma <br />1970: Atom Heart Mother <br />1971: Meddle <br />1972: Obscured by Clouds <br />1973: Dark Side of the Moon <br />1975: Wish You Were Here <br />1977: Animals <br />1979: The Wall <br />1983: The Final Cut <br /><i>1987: A Momentary Lapse of Reason </i><br /><i>1994: The Division Bell</i><br /><br /><b>Pink Floyd is</b><br />Roger Waters - base guitar and vocals<br />David Gilmour - guitars, base guitar, and vocals<br />Syd Barrett - guitars and vocals<br />Nick Mason - drums<br />Richard Wright  - keyboards<br /><br /><b>Official websites</b><br />[url=http://www.pinkfloyd.com/home/24.html]Pink Floyd[/url]<br />[url=http://www.roger-waters.com/]Roger Waters[/url]<br />[url=http://www.davidgilmour.com/]David Gilmour[/url]<br />-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	}
]
