[
	{
		"id": 417,
		"title": "Aint it funny?",
		"author_id": 1180427,
		"author_name": "The Dixie Dazzler",
		"timestamp": "2006-03-15T00:58:15.000Z",
		"content": "on this keen day. I think back to my humble beginnings of playing keen, at the age of ... well I'll say 8 we went to visit our grandmother out in Tennessee, while we where there me and my brother where introdused to many games... but the three that stick out the most in my mind where Commander Keen 1, Digger, and wheel of fortune. we... (me and my brother) stayed up all night almost every night playing these game's. when it came time to go back home to Colorado, we toled our Dad, and bugger him, and Wanted one of these games so bad. so... he made a copy of it, and we went home... as if you dont already know what game that was [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   <br /><br /><br />anyway... what are your storys of your beginnings with Keen? that is, if your lucky enough to remember that great event! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  ____________________________<br /><br />[img]http://i32.photobucket.com/albums/d24/TheFarleyBoy/CoolBackGround.jpg[/img]<br />____________________________<br /><br />\"Gue!! I Love It! I Love It!\" - Rosco P. Coltrane"
	},
	{
		"id": 12286,
		"title": "Re: Aint it funny?",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-03-15T04:17:19.000Z",
		"content": "That wouldn't happen to be the DOS Wheel of Fortune, would it? Just played that earlier today... sadly on my old computer, since I upgraded to Win2K recently.<br /><br />I remember playing Commander Keen IV on Kid's Fun House (a shareware collection which also included episode I, but that didn't always work) when I was about two or three. Ever since then, that early exposure to a command line has led me to grow a hatred towards GUIs. Not really a hatred actually, but just a slight dislike. Somewhat. There's actually a much longer and slightly interesting story here, but we'll save that for another day."
	},
	{
		"id": 12287,
		"title": "Re: Aint it funny?",
		"author_id": 1180427,
		"author_name": "The Dixie Dazzler",
		"timestamp": "2006-03-15T04:26:56.000Z",
		"content": "how did you know... I loved that game... anyway yes it was the DOS one... thats what my grandma had... the funy thing is that it was brand new. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] . wow I Am geting old... lol! ____________________________<br /><br />[img]http://i32.photobucket.com/albums/d24/TheFarleyBoy/CoolBackGround.jpg[/img]<br />____________________________<br /><br />\"Gue!! I Love It! I Love It!\" - Rosco P. Coltrane"
	},
	{
		"id": 12288,
		"title": "Re: Aint it funny?",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-03-15T04:37:31.000Z",
		"content": "Vanna White sure looked unfed in that game."
	},
	{
		"id": 12289,
		"title": "Re: Aint it funny?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-15T11:35:43.000Z",
		"content": "Yeah, it's kinda amusing that we still play the same game we've enjoyed over a decade. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  I think I was four or possibly three years old when my dad introduced me to Keen 1. It was probably the very first time I used computer. This computer (good ol' 286) was brand new in our house. We had had a computer before this new 286, but I had never touched it as far as I can remember. Dad asked me if I would like to play something on computer, and started this game Keen 1. I didn't even know what computer game playing was! I had never heard of it before. I got hooked. Since then I played Keen all my childhood. The game was just stunning!3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 12290,
		"title": "Thinking back",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-03-15T17:33:15.000Z",
		"content": "I discovered Keen back in the youth club that run after school. There were always big queues to play it on the old 386 with the broken mobo clock and Menu Commander (or something) with Keen 4 listed as \"Keen 2\" on it. We all stared and watched as the \"pro\" kid found the giant foot and flew to the hidden level. Good times.<br /><br />Then I stumbled across this forum in early 2003 whilst searching for Keen cheats, and found a community where I could read and take part in interesting discussions. There was also plenty of original content and entertaining people talking. I also discovered TmsT's work through here, which led onto a great journey of discovery. I fell in love with the great atmosphere of the community, and have been here ever since.<br /><br />Ah, there's nothing like nostalgia to cheer me up. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 12291,
		"title": "Re: Thinking back",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-03-16T02:50:22.000Z",
		"content": "PCKF is indeed a great place...<br /><br />And grafix, are you grafix5000?"
	},
	{
		"id": 12292,
		"title": "Re: Thinking back",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-16T03:31:59.000Z",
		"content": "No. But he did kill grafix5000.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 12293,
		"title": "Re: Thinking back",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-03-16T04:10:25.000Z",
		"content": "We had Keen 4 at my preschool/afterschool care place.  Everyone one waited in line to play it.  I never got alot of time to play it so I pleaded with my mom to get it for me for my birthday!  This is before the internet really took off, so she ended up calling around to tons of places and had Good Bye, Galaxy shipped me for my Birthday!  I can't tell you how happy I was.  I had to have been about 5.  Then after years, I forgot all about Keen.  I then saw the  GBC game in a CVS and the memories came back.  It came up in some random Google search I did later and further interigued I refound the games and the PCKF, and here I am a little over a year later.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 12294,
		"title": "Re: Thinking back",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-17T05:00:40.000Z",
		"content": "My memories of Keen fade into obscurity; I believe I was hitting 5 or six when I first played Keen 4, 4 color version. A few years later I met David, who had the 16 color version on his computer I stayed over and played it a lot, and discovred the inchworm secret.<br /><br />No, no wait, I remember Keen 3, after church, I was a lot, lot younger, I remember being introduced to it on a hyper friends computer [we were both ADD] and I remember her playing it and using the cheats, and never clicking later that it was Keen, all I remember was a kid in a buble soaring over some tiny houses shooting little blue cats, and funnily enough, I remember two lines from the ending sequence *perfectly* [The ones starting with I and the other Vorticons...']<br /><br />Anyways, later on after years of wondering deep within my soul what a Shikadai looked liek, and pushing the high score counter past all 9's I was introduced to Keen 6 by my friend Daniel [Nice guy gave me a lot of games] I remember that night that even though it was school prizegiving, I wasn't getting anything and so I stayed home and played half of it until it was time to go to bed [We live opposite the school]<br /><br />And then one day it happened; on my new school computer, Keen 5, I barely recognized it as Keen I was so buried in playing it. I only had 10 miniutes after class and before mom came looking for me to play it. I never did finnish it. By then of course I knew how to pirate stuff by copying to floppy disk, I remember trying to pirate it, and begging the teachers to plaeas *plllz* let me copy it, all through middle school, and then I was gone and didn't see it again. I had played almost two levels.<br /><br />Then I met Daniel again and he gave me Keen 5 [After weeks of telling me about it] And I had finally finnished Keen! [Or so I thought} And lo I began to search for TUIT.<br /><br />And then, the internet appeared, and I searched, and Lo I found Keen 1  and I didn't recognize it,  all I knew was that it was Keen, and a whole new gaming experience. I was enthralled, played it over and over; it was the first, the *only* game I could see *all* the graphics and enemies in my head, understand all it could do. And more browsing led me to Keen 2, and Keen 3, my long lost joy. And I leanrt of Vorticons, Yorps and Gargs, Mars and spaceships and Keens origions, and Molly And then I found these forums.<br /><br />And my life was complete.<br /><br />[Oh, some other stuff happened between then and now, but, meh.]<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12295,
		"title": "Re: Thinking back",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-03-17T19:09:40.000Z",
		"content": "I started out by getting Keen 1 and 5 from my grandparents.<br />Then, a kid who i was friends with for about a week gave me keen 4 and 6 demo.<br /><br />Then, a few years ago, i got the CD with 1-5 on it.<br /><br />I still search for Keen 6... garg [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 12296,
		"title": "Re: Thinking back",
		"author_id": 1485787,
		"author_name": "Keeniver",
		"timestamp": "2006-03-17T20:51:23.000Z",
		"content": "I think I was about two years old, so I don't remember my first few times playing Keen too clearly. I started by playing Keen 1, I believe; and then we just slowly got all the others. I'm pretty sure I'd played them all before I was six, though I'm not quite sure of the exact timeline. [center][img]http://www.familylees.net/~morgan/keensiggo.gif[/img]<br /><br />---|[url=http://www.familylees.net/~morgan/]Palace of Lem'ka[/url]|[url=http://www.familylees.net/~morgan/mstar.html]Metallic Star[/url]|---<br /><br />-- Keeniver --<br />[/center]"
	},
	{
		"id": 12297,
		"title": "Re: Thinking back",
		"author_id": 1388047,
		"author_name": "Afgncaap5",
		"timestamp": "2006-03-19T01:16:04.000Z",
		"content": "We had just purchased a \"new\" computer from a friend of the family when I was...lets say 8.  One day I wandered into the room, and my dad was playing this fun looking game that he called \"Commander Keen.\"<br /><br />He wanted to limit my computer time without actually limiting it, so he didn't tell me where on the computer it was.<br /><br />I learned how to search DOS and navigate command prompt file systems looking for this game, and gosh darn it I've kept playing since then."
	},
	{
		"id": 12298,
		"title": "Re: Thinking back",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-19T06:44:51.000Z",
		"content": "Anyone else notice how many new members we have? Especially the ones that sit there quietly, ignoring our insanity.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12299,
		"title": "Re: Thinking back",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-03-19T10:25:21.000Z",
		"content": "Memories...<br /><br />Christmas/summer holidays (same thing here in the southern hemisphere) 1993-4... rising at 7am to watch Fraggle Rock and then play Keen 4... I'd just turned 14... Some things never get old (and my mind is one of 'em!)...<br /><br />Autumn/Winter 1994... Got Keen 1 off a friend and had fun exploring \"Mars\" and getting stuck on the final level until it suddenly occurred to me that maybe the \"Vorticons\" were not the robots but the big jumping bears... And then I finished off the Vorticon boss with a splat and beat the game...<br /><br />Winter/Spring 1994... Playing Keens 2 and 3 on an old 386 or 286 with an old friend of mine, and making copies of the game before leaving that city behind when my family moved... I didn't use any cheats, yet I managed to find the hidden level in Keen 3 after seeing the sea-monster (\"Messie\"!), which nobody else in their house had managed to figure out (They used cheats, hehe)...<br /><br />Summer 1994... In a new city, playing Keens 5 and 6 that my brother pirated from one of his friends... Actually guessing all the cheat codes to Keen 6 after seeing that it was a Softdisk game (whose games all seem to have the same cheat codes)... Rescuing Molly and translating Mort's note, only to have written down some of the SGA incorrectly and translating it into something with a bit that I couldn't understand...<br />Staying up all night bouncing around in the Omegamatic, frazzing robots and finding bonuses...<br /><br />...A big break where I got sick of shareware games and started making my own...<br /><br />2000-2 ... With my rediscovery of Keen on the internet, along with finding that he had a huge fanbase, I started making Commander Keen comics, including \"Commander Keen: Ten Years On\", which caught the attention of Keen's creators. Imagine how awestruck I was to be getting appreciative emails from the very people who had given so much to my upbringing (as a teenager)... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]    [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img]    [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]    [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]   <br /><br />2003... Got a 286 for five bucks in a garage sale and shoved a sound card into it, then filled its HD up with Apogee classics, including Keen 5, which I had to play since learning (thanks to the internet!) about a hidden level, and how to find it... Seeing alien Scotsmen (for Scotskorathians) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-korath.gif[/img]     and coming to the conclusion that it was a reference to Monty Python's \"aliens are turning people into Scotsmen\" sketch, which partly inspired the animutation that made me famous, \"French Erotic Film\".<br /><br />Cheers, Keen. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img]     I owe ya one!----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 12300,
		"title": "oh?",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-03-19T10:31:46.000Z",
		"content": "Any chance you could elaborate more on that Python sketch?  That sounds too esoteric to be true.  :-)"
	},
	{
		"id": 12301,
		"title": "Re: oh?",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-03-19T10:36:52.000Z",
		"content": "Sure. It was nearly a whole episode of Monty Python, called \"Science Fiction Sketch\". It tells the semi-narrated and wholly ridiculous story of a Scottish couple who uncover a hideous alien plot wherein Blancmanges from outer space are eating people and turning the survivors into Scotsmen, using a scotsmanification beam from their flying saucers... for a reason that I won't spoil for you.<br />It also includes the obligatory pipe-munching, labcoated scientist and his bimbo assistant, and a bunch of other crazy crap from 60's sci-fi's.<br /><br />Oh, and although that particular sketch was named \"Science Fiction Sketch\", the episode itself was called \"You're No Fun Anymore\".----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 12302,
		"title": "Re: oh?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-19T11:30:36.000Z",
		"content": "\"Anyone else notice how many new members we have? Especially the ones that sit there quietly, ignoring our insanity.\"<br />Yeah, and we just got the 800th member! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 12303,
		"title": "Re: oh?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-20T06:49:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Oh, and although that particular sketch was named \"Science Fiction Sketch\", the episode itself was called \"You're No Fun Anymore\".[hr][/quote]<br /><br />I think I liked the black scotsman, and the graph of england emptying and scotland filling up. Also, the bagpipe music and high speed walking. I always wondered if FeF referenced that, either that or Zippy's porn habits.<br /><br />Huzzah Monty, you made as laugh!<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12304,
		"title": "Re: oh?",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-03-20T07:52:06.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  [img]http://tmst.twu.net/rnd/pckf-lol.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	}
]
