[
	{
		"id": 763,
		"title": "Music Tools?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-15T22:55:53.000Z",
		"content": "What kind of tools do you guys use to make music? Be it MIDI or MP3. Because I would like to get into making music for my keen and non-keen related projects.<br /><br />Many thanks"
	},
	{
		"id": 19831,
		"title": "Re: Music Tools?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-02-15T23:13:54.000Z",
		"content": "I've tested out some programs, and found a few nice ones. Although, they aren't free.<br /><br />[url=http://www.midimaestro.com/]MIDI Maestro[/url] - Probably the nicest MIDI editing program I've ever seen. You can edit more than one track at once, as well as view the MIDI in a staff mode. $100<br /><br />[url=http://www.fruityloops.com/]FL Studio[/url] - This one is good for making MP3's, and can also make MIDI's, but not as well as other programs. I should probably buy it one day... I haven't been able to save anything that I've worked on. But, if you work fast, you can export to an MP3, and won't ever have to save. $50-$200.<br /><br />But, if you're looking for free software, I can't help you. I've been looking for a freeware music editing program for far too long...-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 19832,
		"title": "Re: Music Tools?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-16T03:08:14.000Z",
		"content": "I highly recommend MilkyTracker if you want to try the MOD path (and of course that can lead to MP3 if necessary).<br /><br />I've not much experience with other stuff. It'd be interesting to hear what others use for MIDI though."
	},
	{
		"id": 19833,
		"title": "Re: Music Tools?",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-02-16T05:09:35.000Z",
		"content": "Thanks so much for links and suggestions, guys. I was going to try out FL studio but while I was downloading the demo I found a FREE program called \"Anvil Studio\" so I downloaded it and so far it will do what I need and it's really easy to use.<br /><br />Here's a link to it from tucows:<br />[url=http://www.tucows.com/preview/193454]www.tucows.com/preview/193454[/url]"
	},
	{
		"id": 19834,
		"title": "Re: Music Tools?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-02-20T18:22:42.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Thanks so much for links and suggestions, guys. I was going to try out FL studio but while I was downloading the demo I found a FREE program called \"Anvil Studio\" so I downloaded it and so far it will do what I need and it's really easy to use.[hr][/quote]<br /><br />It's the same Bobby Prince has a link to in his webpage. When I asked here for a free MIDI editor, I ended up downloading that free editor, and it seems to be better than other shareware MIDI editors. And best of all, it's freeware. I like it, and I'm gonna use it for composing music for my mods.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	}
]
