[
	{
		"id": 543,
		"title": "Keen 4 mod: The Keys of Krodacia",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-06-27T10:43:20.000Z",
		"content": "Here it is, the first full length keen 4 mod entitled: \"'The Universe is Toast' Episode 7: The Keys of Krodacia\". <br /><br />[url=http://www.keengrid.net/ckfiles/modifications/Keen7.zip]www.keengrid.net/ckfiles/.../Keen7.zip[/url] <br /><br />Ive been working on this mod since the release of Modkeen 2, and a lot of people have helped out with ideas, patches, and other things. Thanks everybody! Im interested in everyones comments about it, especialy on how I can improve since I'll be working on a keen 6 mod next(not for at least a few months though). Tell me what you like, what you hate, and let me know about any bugs you find. Have fun playing! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14689,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-27T11:37:07.000Z",
		"content": "I made this topic sticky, the world's first complete Keen 4 mod deserves attention! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />And.. WOAH!!!!! This mod is so creative and good looking that I'll go insane!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  I've played now about 1/4 of it.. I love it!<br /><br />Gonna play some more now.. I'll update TGMM with pictures later tonight.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14690,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-27T19:11:44.000Z",
		"content": "Congratulations on having the first second generation Keen engine mod (I wish K6 simply remained part of a second trilogy; much easier to talk about that way).<br />Also congratulations on having accomplished what you did! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Truthfully I only played a couple of levels, but with the core Keen 4 gameplay and the added changes, it was quite fun so far.<br />It looks pretty different from the other games, and the changed enemies also add to it, though I have to admit the bouncing guy was annoying.<br /><br />His pattern is even easier than what I'm used to, but I kept waiting too long, then wanting to go at the wrong time, waiting again, but having lost track of my count, almost going at the wrong time again, needing to pause and stop thinking about what I'm used to for a second, and pass him. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />So, he was annoying in a good way, don't worry!<br /><br />Like I said, only a few levels, so no more comments from me for now.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 14691,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-27T20:14:02.000Z",
		"content": "I've finished this mod already (as I said hours ago at K:M). Here's a few pictures for everyone to see:<br />[url=http://keengrid.net/tgmm/garg.php?id=64]keengrid.net/tgmm/garg.php?id=64[/url]<br /><br />Try it out, everyone! My pictures don't give much justice to what you can see and experience in the game. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Hmmm, should try to find the secret level..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14692,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-06-27T21:41:07.000Z",
		"content": "If the Keen Awards 2006 actually existed, I believe we've got a winner."
	},
	{
		"id": 14693,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-06-28T02:51:35.000Z",
		"content": "Just finished this one. Cool game. It seemed a bit tricky, but difficulty with Keen 4 games are tough to gague, as you're often compelled to save every two seconds. That aside, this is quite an accomplishment.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 14694,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-28T05:37:14.000Z",
		"content": "The first of many, we can hope.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 14695,
		"title": "keen 7 mod!",
		"author_id": 1485848,
		"author_name": "kudos",
		"timestamp": "2006-06-28T06:15:07.000Z",
		"content": "noob question here,<br />How can I get this to run under dosbox? If I click the keen7 batch file normally, the mod loads up and everything, but of course there's no sound or music (looks great so far, by the way). If I try running the same batch file in dosbox, I just get the message 'ck4patch KEEN4.PAT,' and I really don't know how to do any of the patching with the ck4patch exe or anything. If I try running the keen4e that came in the zip file with dosbox, I get stuck on the 'Loading... Please Wait,' and it just stays like that.<br />I'd really appreciate some assistance!"
	},
	{
		"id": 14696,
		"title": "Re: keen 7 mod!",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-06-28T06:50:47.000Z",
		"content": "Thanks everyone for the comments.<br /><br />Kudos: The mod should run in dosbox, im useing version .61 so it might not work in other versions. The game doesnt have any new music except those three midis you see in the file, so you'll have to play them externally if you want to listen while you play."
	},
	{
		"id": 14697,
		"title": "Re: keen 7 mod!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-28T08:33:45.000Z",
		"content": "Works perfectly in DosBox 0.65 -- seems 0.65 has support again for all the patching stuff and so on.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14698,
		"title": "Re: keen 7 mod!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-28T08:55:47.000Z",
		"content": "Music was off, and sound was played through the internal speaker by default.<br />Basically you're using the settings as they were when the ZIP was made, not the settings like how you set them from your own/original/clean Keen 4 copy.<br />Don't forget to change that... although you'll get K4 audio, since that isn't moddable (yet).Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 14699,
		"title": "-",
		"author_id": 1486966,
		"author_name": "MRC Marky",
		"timestamp": "2006-06-28T16:45:11.000Z",
		"content": "Just played through 7-8 of your levels.. I have to say, this is really impressive. Comprehensive artwork, keenish level structures. Great use of tiles. Colours blend in perfectly. You cast a huge challenge for others who end up modding keens 4-6. Ten points to your team [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14700,
		"title": "-",
		"author_id": 1485848,
		"author_name": "kudos",
		"timestamp": "2006-06-28T21:29:58.000Z",
		"content": "Thanks for the help guys, I was using Dosbox 6.3, so I downloaded 6.5 and it works perfectly. Awesome work so far! I'm especially looking forward to your next releases with music and all that!"
	},
	{
		"id": 14701,
		"title": "Re: -",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-06-29T09:09:08.000Z",
		"content": "*orgasm*Wombat is my little donation to all the crazy people who do stuff with old games.  [url=http://www.szevvy.com]www.szevvy.com[/url]"
	},
	{
		"id": 14702,
		"title": "Music",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-29T09:44:02.000Z",
		"content": "\"Music was off, and sound was played through the internal speaker by default.<br />Basically you're using the settings as they were when the ZIP was made, not the settings like how you set them from your own/original/clean Keen 4 copy.<br />Don't forget to change that... although you'll get K4 audio, since that isn't moddable (yet).\"<br /><br />You're wrong Ret8. He surely has tried with music on and such, and just turned the music off to allow more memory usage for the levels and such. Not sure if any memory limit was encountered to the point the music wouldn't play, though..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14703,
		"title": "Re: Music",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2006-07-02T03:22:28.000Z",
		"content": "Excellent work on this mod - it looks and feels very Keenish."
	},
	{
		"id": 14704,
		"title": "Re: Music",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-07-02T17:40:20.000Z",
		"content": "Yes!  I finally check back here and find the first keen4 mod! (which is great since 4 is by far my favorite)<br />  I'm definitely getting this one.  It also helps that Ceilick probably makes most of my favorite mods.  (along with all the other modders ofcourse.)<br />  Downloading now..."
	},
	{
		"id": 14705,
		"title": "nice job",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2006-07-03T04:07:08.000Z",
		"content": "Nice! I really enjoyed it but what does this mean for the future of modding Keens 1-3. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]"
	},
	{
		"id": 14706,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-07-03T06:49:01.000Z",
		"content": "Modding Keen1-3 is similar to preparing a box of Macaroni and Cheese.  It's a daunting task at first, if you've never cooked anything before, period--but the instructions are simple, the tools are ample, and there's not too much that can go horribly wrong.  This is something that can theoretically be done in a week or two (*cough LevelLord cough*) or take several years (*cough Spleen and KeenRush cough*)... It's something that goes down easy every time, and isn't tough to prepare... I suspect it'll stick around for a long time.<br /><br />Modding Keen4-6 is more akin to setting down a seven course meal with dessert.  The amount of graphics work alone is roughly 8 times the size of the first trilogy, and then the addition of music, 3 layers of level design, 3 difficulties, new story screens, more complex enemy behaviors and characteristics... and the whole thing is played more by ear at this point.  With the box of macaroni and cheese, you can add spices here and there, or mix in a few additional ingredients, but you're still following a basic recipe.  This seven course meal doesn't have nearly as much documentation (yet).  <br /><br />I'm still incredibly impressed with Ceilick's first showing, here.  There's a balance and flow to the level design, and each of the changed enemies matches their environment nicely.  The mod truly feels like a complete package, rather than a level pack with an altered tileset.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  He's laid the groundwork for future releases, as well as set the bar of expectation rather high.<br /><br />Congrats on a successful release, Ceilick!  This is neat!<br /><br />Edit: Mis-spelled 'dessert' as 'desert.'[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 14707,
		"title": "Re: hehe",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-07-03T14:16:53.000Z",
		"content": "Yeah, I don't see that this would harm Keen 1-3 modding or such. Naturally it can (hopefully) make more people realize that Keen 4-6 mods actually can be done, and start working on them, but it can also make them think that \"gaaarg, it'd take a mortzillion years for me to make one!!\" and turn them into Keen 1-3 modding instead.. Both are fine for me. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]  (And it's highly unlikely anyone'll see a Keen 4 mod by me for a long time..)3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14708,
		"title": "Re: hehe",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-07-04T16:57:56.000Z",
		"content": "I doubt anyone else will make a keen4 mod too soon.<br />  Great mod Ceilick!  My favorite mod was always Lego Keen, seconded by xky1  (storyland and shadowkeen 3 are up there 2, but who knows?  Maybe after I finish this game I'll have to change it."
	},
	{
		"id": 14709,
		"title": "Re: hehe",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-07-06T14:36:32.000Z",
		"content": "just have to say:<br />this is a sweet mod!"
	},
	{
		"id": 14710,
		"title": "Re: hehe",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-07-10T16:54:48.000Z",
		"content": "You know I have the habit to skip stickies so that I didn't notice this topic. <br /><br />Good mod anyway,but I'll get to play it better on a later date.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 14711,
		"title": "Keen 4 Mod",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-09-06T18:27:55.000Z",
		"content": "From an old timer - Thank you for producing this. I'd offer you money except for two reasons - First, I know you did this because you LOVE THE GAME... Second.. I'm a POOR old timer without any money! ;*)<br /><br /> (salute)"
	},
	{
		"id": 14712,
		"title": "Re: Keen 4 Mod",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-07T08:03:55.000Z",
		"content": "Been later enough yet Djas?<br /><br />Haha, nice to see an oldie comin back for more! Visit again sometime!Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 14713,
		"title": "Re: Keen 4 Mod",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-09-08T02:40:06.000Z",
		"content": "I already said I like this, didn't I?<br />I played it before going to bed, since my retrocomputer is in my bed room, but I haven't finished it yet, stopped after a few nights, because I went to bed late enough as it was.<br />I made a list of things I think could be improved (personal opinion stuff too), but it's also upstairs on the other computer.<br />I'll finish the game and write down the list in here later.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 14714,
		"title": "Re: Keen 4 Mod",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-09-17T10:02:00.000Z",
		"content": "Woah! I was blasted away by this excelent mod! Just want to thank you! You're a great modder!<br /><br />update: Now I've just found an interesting bug. It's located at the Underground level. When the level appears on the map, go through it, but don't enter. Just move up and right constantly. When the level dissapear, you've should be able to walk outside the normal walkable area [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] . If you want to return back, go to the Gem Temple. Note that you should be finished the blocking level to the mushroom first, if you don't want to stuck.<br /><br />Notice that there are a few more texts that needed to be replaced. For example when Keen dies and it tells you to return to the shadowlands (?!?). Or the text when exiting the game in DOS. And maybe somewhere in the help menu I've noticed Keen 4 related texts.----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14715,
		"title": "Re: Keen 4 Mod",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-09-18T23:45:27.000Z",
		"content": "Has any1 played this through on hard yet?  Hard is definitely the best for this game, much better than easy and normal.  Plus, it is actually...uhhh..... hard I think is the word.   Actually I havent bothered to play through the whole thing on easy and normal, just because hard is so much fun."
	},
	{
		"id": 14716,
		"title": "hmm",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-09-19T00:54:21.000Z",
		"content": "That raises an interesting question, since Keen4-6 have the difficulty settings.  Ceilick, how did you design all these levels?  My first instinct would be to do the whole thing with a \"Normal\" mindset, and then add or subtract stuff after the fact to make \"Easy\" and \"Hard.\"  ....But the more I think about it, the more I'd want to just start the whole thing with \"Hard\" in mind, and then subtract some/more to make the \"Normal\" and \"Easy\" settings. <br /><br />How did you do it?  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 14717,
		"title": "Re: hmm",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-09-19T04:35:57.000Z",
		"content": "Glad that you guys like it, and I'd love to hear feedback along the lines of what I can improve for my next keen mod (keen6).<br /><br />A lot of stuff is still difficult to edit as far as the opening screen and certain texts in the game. Keen 4-6 doesnt have all the usefull patches and tools like keen 1-3. Interesting bug with the underground though! I found one similar to the right of the Gem temple.<br /><br />With the levels, I designed them to be played on Hard mode. Experienced keen players should be playing on this skill. Easy and normal mode should only be played by inexperienced players. Even on easy though, I've watched people play that cant beat the first level [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14718,
		"title": "congrats",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-09-24T11:47:06.000Z",
		"content": "Well I've finally finished the game on medium with total score of 763 000 and 30 lives.<br /><br />I want to share some more thoughts about the game.<br />Maybe it's something you were looking for, but I've never managed to collect more than 50 ammo through the game. The guns are always rare and this is something not really typical for the Keen universe. I mean I've always managed to finished Keen 4, 5 and 6 with much more than 99 ammos. If you don't want the player to get full of ammo maybe you should put some guns in the secret areas. There are many secrets in your game but none of them contains ammo. Btw placing most of the time 100 points candys in the secret areas isn't really a big deal. Most of the secrets in original keens contains bigger score candys which motivates the player to search more for secrets. Otherwise finding those secrests or not won't affect much your overall final score.<br />Finding the secret level was really difficult, although I've read the sign. That was the only one time I've used cheats though.<br />The design of the enemyes is awesome. My favorites are magifly (that with the flying carpet - insane idea!), rotten raddish, patsy (pretty neat replacement of the slug), nosdril and, of course, ogobogo. This turtle is a wothy heir. Well now we have a second-dumbest turtle in the universe [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] .<br />The overall difficulty of the game, by playing on medium, was ok. The first few levels were easy, the most were medium and a few were hard.<br />It's quite clear that all the levels were tested, so I don't found any major bugs. There were some glitches with the pole climbing  of some of them though. While player jumps up and move through a foreground tile, he stops. But that doesn't really affect the game because you can just climb up without jumping.<br />I enjoyed the story, which imo is quite keenish. And especially the end. I was like \"eeh what?\".<br />So thanx again for this game. I didn't enjoyed a game like this for a long time. Yeah, Keen is Keen (whatever they said).<br />Looking forward for any news on the next episode. GL.----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14719,
		"title": "Re: Keen 4 mod: The Keys of Krodacia",
		"author_id": 1485683,
		"author_name": "alkal",
		"timestamp": "2006-10-07T02:33:24.000Z",
		"content": "Whoa, this game is really awesome. Seriously. There aren't a lot of ways I could think to improve it, except to correct a couple of spelling errors. For example, in the Standard Galactic Alphabet in the manor washroom, you've misspelled \"please\" as \"plase.\"<br /><br />Great gameplay, though. Can't wait for the next installment."
	},
	{
		"id": 14720,
		"title": "mod4",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-10-08T01:29:29.000Z",
		"content": "OK.. I'm stuck in the funhouse... can someone help me?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] <br /><br />keeners!"
	},
	{
		"id": 14721,
		"title": "Re: mod4",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-08T18:12:40.000Z",
		"content": "Sure, just tell me where you're stuck."
	},
	{
		"id": 14722,
		"title": "Re: mod4",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-08T23:38:07.000Z",
		"content": "This. Is a good mod. Well-constructed, and I haven't found any glitches so far.<br /><br />How the enemies are modded is fantastic, I don't even recognize what some of the enemies were BEFORE transformation (like the squid)!<br /><br />Good job!____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14723,
		"title": "stuck",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-10-09T14:19:27.000Z",
		"content": "Just how to get out of it? I can't seem to find the exit. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img] <br /><br />keeners!"
	},
	{
		"id": 14724,
		"title": "Re: stuck",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-09T20:24:26.000Z",
		"content": "DaVince21: Thanks! If you or anyone else for that matter have any cool ideas or improvements I'd like to hear what i can do better (theres a topic for it in the modding forum).<br /><br />Johnkbutler: There are two exits to the fun house: the normal exit and the secret exit.  <br /><br />To get to the normal exit, you'll have to go to the bottom left corner, ride the elevator to the right where you will flip a switch. Then return to the left on the elevator. Go up and you will see a bridge of above the picture of the red blob (blorb). Cross the bridge and go through the red door which should lead to the exit.<br /><br />To get to the secret exit, follow the same path to the bottom right corner. You'll have to look around a bit to find it though.<br /><br />Good Luck! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 14725,
		"title": "Re: stuck",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-10T22:07:54.000Z",
		"content": "I particularly like the way you've used the schoolfish (I assume) as birds that follow Keen in the normal levels.  I like it when things like that are used in quite different ways to the original game."
	},
	{
		"id": 14726,
		"title": "Re: stuck",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-11T20:55:49.000Z",
		"content": "Heh, I cant really take credit for the birds; I stole the idea from the Bird Man mod [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />But it was a real challenge to make the enemies look entirely differant, especialy since their behaviours are so specific. I think managed it farely well except for maybe the inchworm."
	},
	{
		"id": 14727,
		"title": "Re: stuck",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-10-14T17:17:23.000Z",
		"content": "So you've moved to Keen 6 now. I've remebered that the only one released level pack for Keen 6 wasn't able to run to anyone. I mean for some reason there may some problems with runing a mod onto Keen 6. I wonder if you manage to make some progress on the next mod and test it if really works?----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14728,
		"title": "Critique",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-15T22:27:11.000Z",
		"content": "I just played some more (after more or less forgetting I still needed to finish this), and figured I'd better read the notes I wrote and write some comments about the mod.<br />It's a critical post, but those are usually the most helpful, as long as it's clear what the solutions to the \"problems\" are.<br /><br />Firstly, I'm playing at the Normal difficulty level, and I'm currently at the Forest Skies level, but finished everything else up until there, minus whatever is in the water where Keen says he needs a coin for some reason.<br />(On an unrelated note, I discovered I really aren't fluid in SGA anymore.)<br /><br />I have to say I think this mod is a bit too hard, for my tastes anyway.<br />I try to get all the points, and some of those really are pretty hard, making it neccessary to Save, Load, fail, Load, fail, Load, fail, Load, succeed, Save, go on on some occassions.<br /><br />That also made me realise Keen's interface basically sucks now that I got used to better.<br />I use my original Gravis PC GamePad to play, and for some reason scrolling through the menus with the D-pad doesn't work, it usually skips a bunch of options after only a split second press, the buttons don't always do what you expect, nor do Enter and Escape, not to mention the fact that you don't return to the game after saving, and so on, making this way too much of a hassle.<br />I didn't really have this problem with the original games, since they weren't as hard, and didn't need the menu as much.<br />I actually got annoyed by this this evening. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />There were some levels with those bouncing things (not in levels I played recently, don't remember, but mushroom replacements) right in front of sliding poles.<br />Getting all the items, also on top of these poles, also requires perfect timing and usually some saving and loading.<br /><br />There are some typos and textual mistakes I noticed.<br />For instance Keen says: \"I wonder where the rest of the keys are?\"<br />I'm not sure why, but I see lots of people write question marks after sentences including verbs like \"to wonder\" and \"to guess\", even though they aren't really questions.<br />Anyway, just nitpicking here.<br /><br />The secrets are a bit obvious.<br />Due to the way the \"camera\" looks at the levels, secrets are usually in the ceiling or in the right wall.<br />Everytime I suspected a secret, there was in fact a secret.<br />Well, not everytime, but a lot of times, so maybe it's just that there are a lot of secrets compared to the original?<br />Less secrets would mean I wouldn't look for them as much, making them more special... I think.<br /><br />The switches aren't marked with signs with letters (or anything), making it impossible to see which devices they correspond with.<br />This is a design choice of course, but all Keen games had signs, and I like them.<br /><br />Already mentioned, but the music doesn't work in some levels due to memory problems.<br />Since the music is Keen 4 music, and this isn't Keen 4, that's OK.<br />However I also found a level (maybe more) where I actually had to turn of the sound to be able to load it.<br />That's a bit of a shame, I'd personally try to remove some enemies or something to make the engine support all levels properly.<br /><br />I shot one of those drill worm thingies (Wormouth replacement) and it's stunned head fell down a platform. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />I actually paid attention to this in Keen 4 because I wanted to do this in the past, but all platforms with Wormouths have ridges to make this impossible to happen.<br />It looks weird, since it's just a head.<br />Anyway, hardly a bug, but I felt like mentioning it anyway. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />In the level Mansion, I think near the yellow keyhole (a while since I wrote my notes), there is a secret which is right next to some of your pipes (not sure what they are exactly), which are walk-through.<br />I exited the secret room and ended up behind those pipes... pretty sure that wasn't your intention.<br /><br />Finally I also noticed something that's been mentioned by somebody else by now, the sliding poles.<br />I usually don't climb the entire way, but jump up, grab the pole again, jump up some more, and repeat.<br />Once you get the timing right, this makes ascending a lot faster.<br />On your poles I sometimes hit my head on... nothing... or something...<br />It made me have to just do the slow climbing thing.<br /><br />OK, that concludes my post.<br />Again, I do like the mod, really I do, even if I'm being critical. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 14729,
		"title": "GEM TEMPLE",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-10-16T18:49:38.000Z",
		"content": "hello gang... it's me again, the OLD timer trying to work his way through this terrific mod!<br /><br />OK, Gem Temple, I just got the red gem... how in the WORLD do I make that jump back? I've tried... everything I can think to try.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img] <br /><br />keeners!"
	},
	{
		"id": 14730,
		"title": "Re: Critique",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-10-17T17:28:22.000Z",
		"content": "Some of the problems you've mentioned were just \"in your TV\".<br /><br />If you find it too dificult and don't want to save/load all the times, there's always the easy mode.<br /><br />The interface may sucks for you, but that's not a moders problem. Blame id instead [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] <br /><br />The music works in all levels without problems for me. So most probably you're doing something wrong.----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14731,
		"title": "Re: Critique",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-17T22:18:07.000Z",
		"content": "Yes, I never noticed an issue with the music.  If you don't have enough conventional memory under DOS you'll probably encounter this problem.  Time to use DOSBox or start fiddling with config.sys [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />My one criticism with the music is that it wasn't modded!  I found it difficult to get into the game when the music kept telling me this was supposed to be Keen4, but it wasn't.  It would've been nice to have some new songs to listen to while playing!"
	},
	{
		"id": 14732,
		"title": "Re: Critique",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-18T04:14:38.000Z",
		"content": "I am sure it was stated somewhere that for an unknown reason the music couldn't be imported and thus the origional music had to be used.<br /><br />The game comes with several new 'MIDI' tracks to listen to.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 14733,
		"title": "Re: Critique",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-18T07:10:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Already mentioned, but the music doesn't work in some levels due to memory problems.[hr][/quote]<br /><br />Actually, I had that same problem, but I could load the level (it was the underground one, the Miragia mod). I just got the \"not enough conventional memory to load music\" error in native DOS...____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14734,
		"title": "the reply",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-18T17:09:28.000Z",
		"content": "Iv4n: I've already made some progress with keen 6, I havent tried editing levels yet, only importing graphics, but it seems to work fine.<br /><br />Retodon8: I was actualy told by my testers that the mod was too easy, but maybe you had a harder time because of the gamepad? I'll defintaly work on spacing out the secrets more and having less. I cant believe I forgot to make signs for the switches!! I really should have remebered these, although if you notice I think the types of switch correspond with the type of platform they activate (the up-down lever activates elevators, the twist lever activates bridges). Im really not sure what the sliding pole issue is, but I'll try to work it out in my next mod. Thanks for the info, glad you liked it. And no, your not being too critical at all [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Johnkbutler: If you read in the help manual (the txt file found with the other game folders, its titled \"Commander Keen Episode 7 Hints Sheet\") it gives a hint on how to pass that point. <br /><br />Everyone: Im pretty sure I said it before, and Levelass is right, I tried to import new songs but it didnt work. Rather than limit the amount and variety of enemies I could put in a level I just decided to turn the in-game music off. Keenrush made some great midi's that you can play externaly though."
	},
	{
		"id": 14735,
		"title": "Re: the reply",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-18T20:22:25.000Z",
		"content": "I wouldn't call them that great, they were pretty annoying actually. But that's just my opinion...____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14736,
		"title": "pogo",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-10-18T21:16:16.000Z",
		"content": "Been trying that as well [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img] <br /><br />I will redouble my efforts. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] <br /><br />keeners!"
	},
	{
		"id": 14739,
		"title": "Re: music",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-18T22:10:30.000Z",
		"content": "<i>I tried to import new songs but it didnt work. Rather than limit the amount and variety of enemies I could put in a level I just decided to turn the in-game music off</i><br /><br />What was the problem when you tried to import the music?  Were the files too big?  How did you create them?  If they were too large, you could try running them through the IMF optimiser I wrote a few years back, it removes any unnecessary codes from the IMFs and ends up making most IMF files less than half their original size, without changing the way they sound."
	},
	{
		"id": 14737,
		"title": "Re: pogo",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-18T22:10:35.000Z",
		"content": "when you pogo, run right, activate pogo at the edge but dont hit jump, then hit pogo again as you're flying through the air and you should be able to grab the ledge."
	},
	{
		"id": 14738,
		"title": "Re: pogo",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-10-19T15:30:24.000Z",
		"content": "Made me want to start [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]  again...lol <br /><br />Was hardest part yet. Made it 3 times over and DIED before I got over the excitment of making it across! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />Thx for the help! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img] <br /><br />keeners!"
	},
	{
		"id": 14740,
		"title": "Re: Critique",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-19T16:33:36.000Z",
		"content": "I have to admit I didn't really play around with my memory settings, but the regular Keen episodes just work without the need for any tweaking, so this mod does take a bit more memory.<br />I didn't do anything \"wrong\".<br />I also had a level where the music turned itself of with that message, but there's at least one level that exited rightaway with a memory message.<br /><br />Anyway, apparently tweaking by either turning off stuff of scraping together some more memory works, so it's not a big deal.<br />Also like Malv said, not having music wasn't bad, since I have those songs \"connected\" to Keen 4, and it's sort of akward to hear them in similar-but-other environments.<br />(I played on my old computer, I only tried one level or so earlier on my more modern computer, with DOSBox, and I think (don't know) I had memory issues there, but again, did no tweaking.)<br /><br />Yep, there's always Easy.<br />I'm just saying this mod seems to be overall more difficult than Keen 4, since I have less problems playing that on Normal.<br />I played it on Hard a while ago, also tried to get all the items, and remember there being less hazards in places making harder to do that.<br />I'm better with gamepad than with keyboard.<br />Maybe it's just me, I never really play Keen anymore these days.<br />Also maybe I was just more in the mood for some mindless fun, not so much in the mood for doing my best... it happens.<br /><br />The interface doesn't suck for me, it just sucks, period. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br />(It didn't back then, but us gamers got spoiled over time, not just with graphics.)<br />Luckily these days in modern games things are a lot easier to work with.<br /><br />I noticed the different switches, didn't realise I could tell what they did just by looking, which tells us I wasn't very perceptive apparently. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 14741,
		"title": "Re: Critique",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-20T10:13:27.000Z",
		"content": "\"If they were too large, you could try running them through the IMF optimiser I wrote a few years back, it removes any unnecessary codes from the IMFs and ends up making most IMF files less than half their original size, without changing the way they sound.\"<br />Hmmm, that sounds interesting. I might be worth a try, don't you think ceilick? In case the problem was the midi size. Anyways, too bad they couldn't be imported. Otherwise there'd be more of them and they'd hopefully be a lot better. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14742,
		"title": "Re: Critique",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2006-10-20T16:51:41.000Z",
		"content": "Actually, if his next mod is going to use Keen 6 original music, this will be quite cool because Keen 6 music is great and I enjoy it alot.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img] ----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 14743,
		"title": "Re: Critique",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-22T00:29:29.000Z",
		"content": "If you enjoy the Keen 6 music, play Keen 6 [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   IMHO creating a full mod but leaving the original music is like creating a full mod but not changing any of the graphics.  It makes it seem too similar to the original."
	},
	{
		"id": 14744,
		"title": "Re: Critique",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-10-22T16:55:20.000Z",
		"content": "It appears to me that this mod is the only mod in the history of this community, with the possible exception of Yorphius, to actually have a  full and proper critique.<br /><br />Also, I can't get past level 3.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 14745,
		"title": "Re: Critique",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-10-24T18:36:35.000Z",
		"content": "Hey Levelass, I finally played this mod and almost finished.<br /><br />My major problem with this mod is that it feels more than the early Keen 1-3 mods like a levelpack than a real new game. It's a good mod certainly, but the new graphics are to much simalair to the older ones.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 14746,
		"title": "Re:",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-10-27T15:12:08.000Z",
		"content": "For some reason I couldn't get the Keen4/5/6 feel with this mod. It has some interesting sprite graphics, but many tiles look like they're just recolored Keen4 graphics. And the water levels... well, they aren't as amazing as the Well of Wishes. Those little red guys are really annoying, but I think that's because I hate the Pyramid of the Gnosticene Ancients. Other graphics are very similar to Keen 3 (for example, the Manor level backgrounds).<br /><br /><b>EDIT:</b> I almost forgot to mention, the Krodacian sprite graphics are awesome![hr]<br />\"<i>Eat your veggies!</i>\""
	},
	{
		"id": 14747,
		"title": "im curious",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-10-27T20:12:35.000Z",
		"content": "im wondering what specific graphics look like they're just recolored.<br /><br />One of my goals with this mod was to take some of the atmosphere of keen 3 (the houses and such) and put it in the keen 4-6 game style.<br /><br />What about the well of wishes makes it better than the water levels here?"
	},
	{
		"id": 14748,
		"title": "Re: im curious",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-30T15:05:12.000Z",
		"content": "\"im wondering what specific graphics look like they're just recolored.\"<br />None in my opinion..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14749,
		"title": "Re: im curious",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2006-11-05T23:15:06.000Z",
		"content": "Well, I haven't played this yet. I just downloaded it at the library and will put it on my computer when I get back to my room.<br /><br /><br />How did you make this mod, though? I apologize if you've already explained it elsewhere. <br /><br />It sounds like you really made a quality piece of work--I'd be interested to know the techniques you used.<center><b>crymorenub</b></center><br />"
	},
	{
		"id": 14750,
		"title": "Re: im curious",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-06T12:45:42.000Z",
		"content": "If I'm not mistaken he used ModKeen2 for exporting and importing the files, Windows Paint for creating the graphics, and z-1's level editor for building the levels.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 14783,
		"title": "FINISHED !",
		"author_id": 1486820,
		"author_name": "johnkbutler",
		"timestamp": "2006-11-08T02:30:29.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />I have finished this terrific mod. <br />Thank you for putting this together. Loads of fun.<br /><br />My score was only 419,300. But I was playing for making it through this time ;*) <br /><br />Is there another in the making? The ending said something about downloading the next eposide?<br /><br />Well, Thank you again!<br /><br />keeners! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ogo[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]"
	},
	{
		"id": 14784,
		"title": "Re: FINISHED !",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2006-11-08T21:58:34.000Z",
		"content": "Feldegryph: yeah, everything keenrush said was what I used. You can find those utilities at the keen modding forum: <br /><br />[url=http://andy.durdin.net/keen/modding/]andy.durdin.net/keen/modding/[/url]<br /><br />If your interested in making a mod yourself you'll find plenty of help their plus I'd be glad to answer any questions.<br /><br />jonhkbutler: Glad you enjoyed it! I am planning on making 2 more episodes, though they probably wont be done for a long while. My current situation with school is killing me [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-bloody.gif[/img] <br />Im currently interested in what people want to see in the next episode, if you have any ideas please share: <br /><br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=6.topic]p072.ezboard.com/fpublicc...ID=6.topic[/url]"
	},
	{
		"id": 14751,
		"title": "Re: im curious",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-11-10T14:39:22.000Z",
		"content": "Wow, they weren't recolored graphics. I realized that after taking a closer look to a screenshot. One modded tile looks like 4x4 original tiles.<br /><br />About the water levels, I think they're... different. Perhaps it's me, or Keen4/5/6 are too perfect to be MODded, while the original I. of the Vorticons series obviously didn't take advantage of the game engine, making it possible to create incredibly excellent mods (i.e. KeenX and KeenNull). K. of Krodacia is an excellent mod anyway. It has some funny bugs, though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />In Slime Lake, in the pole under the last switch underground, there's a bug. If I climb the pole jumping all the time, I get stuck in the roof. It doesn't happen if I climb the pole without jumping. Why is that?[hr]<br />\"<i>Eat your veggies!</i>\""
	},
	{
		"id": 14752,
		"title": "Re: im curious",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-23T16:38:39.000Z",
		"content": "This is amazingly well done.  The graphics, the enginuity, the Keenishness of it all is incredible.<br /><br />If I hadn't already started on my game, I'd consider making it a mod.  Also, you've given me some really good ideas for isometric tiles.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 14753,
		"title": "Re: music and sound",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-08T19:23:45.000Z",
		"content": "it might be too late for this, and im new here. but if anybody is having problems with the music and sound still, then download VDMS ([url=http://sourceforge.net/project/showfiles.php?group_id=20091).]sourceforge.net/project/s...id=20091).[/url] after VDMS is downloaded, i cant remember exactly, but i think you might have to unzip it, then install it. after that go to the commander keen game (or any other MOD or old DOS game for that matter), right click, hit \"run with VDMS\", and then just choose your sound settings in the configuration on his watch."
	},
	{
		"id": 14754,
		"title": "Re: music and sound",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-08T19:44:15.000Z",
		"content": "We all know about VDMSound here.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14755,
		"title": "Re: music and sound",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-08T20:01:58.000Z",
		"content": "0_o i kinda thought so, i was just making a suggestion. i was also beginning to think that nobody used this site anymore or much. ive known about it for a while, only decided to make an account today. im debating weather i should try to make a commander keen game..."
	},
	{
		"id": 14756,
		"title": "Re: music and sound",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-08T22:02:26.000Z",
		"content": "That's entirely up to you, but it would be really appreciated! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />If you do so, why not post a topic about it [url=http://fortvortabella.commanderkeen.org/forum/index.php]here?[/url]<br /><br />[quote]<b><i>Quote:</i></b>[hr]0_o i kinda thought so, i was just making a suggestion. i was also beginning to think that nobody used this site anymore or much.[hr][/quote]<br />Nah, at least 5 posts a day. Sure, that's slow, but we're some devoted members. Now dosclassics.com, THAT's a dead place. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  <br /><br />EDIT: WHOA! All the spam on Dosclassics is GONE! And people actually seem to POST! When did that happen?! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 14757,
		"title": "Re: commander keen",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-08T22:10:07.000Z",
		"content": "alright, thanx a lot. although i should take time to learn how to do it properly, id also like to make it 4-6 style. since im only 15, it might take a while because of school, but i'll work on it all day every weekend (that is, after i learn how to do it properly).<br /><br />btw, is there some sort of tutorial i can read on modding and making CK games 4-6 style? and what program would you recommend?<br /><br />im also looking forward to more amazing commander keen games from everybody<br /><br />EDIT: dosclassics is where i got a lot of my commander keen mod/fangame downloads"
	},
	{
		"id": 14758,
		"title": "Re: commander keen",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-09T13:18:31.000Z",
		"content": "Welcome valued member! I hope you have the bst of luck in your activities here! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 14759,
		"title": "Re: commander keen",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-09T17:29:08.000Z",
		"content": "yes, thank you, i will try hard too. ive been playing commander keen since i was 4/5 years old back in about 1994 (cant even remember the exact date). out of all the dos games i had, CK4 was always my favourite, and still is today. i should start making a story and everything for my mod (that is, if i learn how to do it)"
	},
	{
		"id": 14760,
		"title": "Re: commander keen",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-04-09T17:45:16.000Z",
		"content": "I think there used to be modding tutorials in the Keen Newsletter from time to time...------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 14761,
		"title": "Re: commander keen",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2007-04-09T18:36:17.000Z",
		"content": "Hi and welcome [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] , if you need any specific keen 4-6 modding help feel free to email me at brianclav at family dot net.  So far I'm the only one to release a full keen4 mod, so I should be able to answer most any question you have."
	},
	{
		"id": 14762,
		"title": "Re: commander keen",
		"author_id": 1486818,
		"author_name": "pittana",
		"timestamp": "2007-04-09T18:55:57.000Z",
		"content": "since im just starting im gonna try a CK1 mod 1st, but i do plan on doing a 4-6 sometime when i understand this better. so thank you, i will remember to ask you for 4-6 help when i need it. by the way, your mod is amazing, loved it, its so keen-like, its my favourite keen mod so far, nice job. actually, i like a lot of the mods out there, so inspiring..."
	},
	{
		"id": 14763,
		"title": "Re: commander keen",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-09T20:07:04.000Z",
		"content": "Learning Keen 1-3 modding is definitively a good practice before learning Keen 4-6 modding.<br /><br />(my experience)------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 14764,
		"title": "Re: commander keen",
		"author_id": 1486631,
		"author_name": "Niborius",
		"timestamp": "2007-05-01T06:06:42.000Z",
		"content": "yeah i think i will try that too[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]"
	},
	{
		"id": 14765,
		"title": "Re: commander keen",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-01T12:20:11.000Z",
		"content": "Trust me,the tools and editors are so much easier to use, it's not funny.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 14766,
		"title": "Re: commander keen",
		"author_id": 1486631,
		"author_name": "Niborius",
		"timestamp": "2007-05-02T09:17:14.000Z",
		"content": "yeah im now working on a keen 1 mod. it will not be really a mod, but i'm changing the sprites with modkeen"
	},
	{
		"id": 14767,
		"title": "Re: commander keen",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-04T07:53:27.000Z",
		"content": "If you'n change the graphics, it's a conversion, if you change the levels, it's a levelpack, if you do both and more, it's a mod.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 14768,
		"title": "Re: commander keen",
		"author_id": 1486631,
		"author_name": "Niborius",
		"timestamp": "2007-05-04T08:23:53.000Z",
		"content": "i had a other game and then somthing is called a mod when it has got new weapons[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] <br /><br />but thanks for explaining me that[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 14769,
		"title": "Re: commander keen",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-05T04:11:48.000Z",
		"content": "Well, since we should be able to soon edit Biomenace, we'll be able to put Keen into it. (And Keen could then rescue Snake Logan.)[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 14770,
		"title": "Re: commander keen",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-07T17:14:08.000Z",
		"content": "Guys, if you really want me to add Bio Menace support on Next Generation ModKeen, fill my email with spam, please.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 14771,
		"title": "Re: commander keen",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-08T12:39:09.000Z",
		"content": "Can't access my email right now; is it okay if I spam your EZInbox?[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 14772,
		"title": "Re: commander keen",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-08T14:34:13.000Z",
		"content": "It's OK. Please send me reminders each 2 days so that I don't forget about writing that code.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 14773,
		"title": "Re: commander keen",
		"author_id": 1485839,
		"author_name": "Szymon Bartus",
		"timestamp": "2007-07-21T19:02:19.000Z",
		"content": "Hello,<br /><br />I downloaded this unofficial Keen 7 and first thing I can say is - wow, what a great job! How much time ceilick had to spend working on this!<br /><br />I've finished the whole game (few days ago), all levels passed with the score of 713.500. What do you think of this?<br /><br />Althrough the whole game was based on CK4, you (ceilick) used the maximum of that episode to create something new.<br /><br />Now a little review. Let's see.<br /><br />Pros:<br />1. I love the way you use all the creatures from CK4, especially slugs and council members. This is a complete success!<br />2. The idea of collecting keys and green gems.<br />3. The levels are mostly designed creativly, in Keenish style. I love the details, such as \"Wash your hands\" sins.<br />4. The story. You did every single detail. The ending is nice too.<br />5. The overal impression is very good.<br /><br />Cons:<br />1. The music. Althrough I like the music from CK4, I rather disliked the music in CK7, because of the fact you used the same tune (form CK4 pyramids) in most levels. It was tiring to listen to this nth time. I also think it would be hard to produce some nice, good fitting new Keen music (I don't like the .mid tunes you attached).<br />2. The hidden points. Like someone said, it was too simple to find many of the hidden goods, and mostly it was 100 or 200 point items. You can't find things like that in original games.<br />Also - there was a little bit too many of them.<br />3. The spaceship from The Fun House took me too the middle of forest. Only \"No clipping\" cheat helped me to get to the secret level. I don't know if I had a most recent version, if yes, this is alsolutely the biggest bug it can be!<br />4. Finding way to secret level required me reading your posts (or hints file) and using god mode a little bit. It was hard, but in CK4 and CK5 it was exteremely difficult too. I don't know if this feature is really a disadventage.<br />5.This is just my opinon, but I disliked the colors used in maps and creatures. They are too contrasting. In CK4-CK6 I would say the colors were more fitting themselves.<br />6. On the windo shown after not passing the level there is an option \"Exit to shadowlands\", it should be \"Exit to Krodacia\".<br />7. The place near red gem in Gem Temple. No situation like this in original series happened. And remember that not everyone reads the attached text files [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]      <br />However, I figured it myself [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]      But after loading game-killing-loading game many, many times.<br />8. Some other hard to pass places, like the situation in the Mushroom Forest, when you must collect gem hidden near that creature (I forget the name). And the \"turtle-areas\" in underwater levels - they were very, very hard to pass.<br /><br />Conclusion:<br />Althrough I mentioned more cons than pros, this is simply the best unofficial episode for me. The pros heavily overweight the disadventages.<br />Thanks for creating Keys of Krodacia. And I hope someone (maybe you?) will do the unofficial CK8. After I've read about the fact you work on the CK6 mod as the next episode, I was very excited! And today morning I read about your refusing... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img]"
	},
	{
		"id": 14774,
		"title": "Re: commander keen",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-22T08:34:03.000Z",
		"content": "I'll add my two kopeks to this discussion... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-disguised.gif[/img] <br /><br />I only recently found this for the first time, and was pleasantly surprised.  The fact that it was a complete Keen 4 mod was so exciting that I went to the trouble of transferring the game to my old Win95 laptop, which will run Keen the right way.<br /><br />I personally thought Keys of Krodacia was phenomenal.  The characters were all very original and interesting, and I liked the contrast in the game between the natural environments (ie the forests), the ancient buildings, and the modern structures.  Furthermore, I know what a pain in the arse TEDEDIT can be to use, so I commend you for making so many complex levels with it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />My complaints are all minor and don't really detract from the playability of the game.  I just want to say that the mushroom replacements got me several times because they were too reminiscent of bounders.  Nothing serious, but thought I'd point it out. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] [img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 14775,
		"title": "Re: commander keen",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2007-07-22T23:53:14.000Z",
		"content": "This was a nice mod, probably the best one I ever played for any keen episode.<br /><br /><br />It felt a little like you ran out of ideas for levels toward the end. Maybe it's just because the beginning ones were so cool. ('Course, for all I know, you could have made those last and had just gotten better at making levels as you went along!)<br /><br />Anyway, good work. I am very impressed."
	},
	{
		"id": 14776,
		"title": "Re: commander keen",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2007-07-23T01:36:51.000Z",
		"content": "Szymon Bartus:  Im really glad you liked it, its comments like these that make me want to make more mods.  But unfortunately, I dont have the time or the will to get through another keen project again [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />Keen enemies has always been my favorite part of modding, so Im really glad you like my new enemies.<br /><br />As far as music goes, I had a lot of trouble importing new songs into the game, so I released with the intent that people would play without music.  I had no idea that every level had the pyramids music.<br /><br />I dont know what the deal with the spaceship is, it should take you to the secret level and after the secret level back to the main path on the map.<br /><br />Im not quite sure what you mean by the colors, but in general I tried to use color schemes that were not used in keen 4-6.<br /><br />Thanks for the detailed review, and I really am sorry that I wont be finishing the series.<br /><br />Keegtech: glad you enjoyed it.  I actually used z-ones keen 4-6 level editor, which is much easier to use than ted5 (which I never got to work at all).  <br /><br />Feldegryph:  Glad you liked it.  It was awhile ago since I did this, but Im pretty sure I was running out of ideas toward the end with some of the levels."
	},
	{
		"id": 14777,
		"title": "Re: commander keen",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-07-23T02:58:38.000Z",
		"content": "There's a Keen 4-6 editor that ISN'T TEDEDIT!!!???  Man, where have I been!?  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] [img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 14778,
		"title": "Re: commander keen",
		"author_id": 1486155,
		"author_name": "bboy8923",
		"timestamp": "2007-10-15T00:02:58.000Z",
		"content": "*Cries* The link to the mod is inactive... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]"
	},
	{
		"id": 14779,
		"title": "Re: commander keen",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-16T02:34:02.000Z",
		"content": "Woot, found my copy. Here be a mirror:<br /><br />[url=http://files.commanderkeen.org/users/jimage/mods/ceilick-Keen7.zip]files.commanderkeen.org/u...-Keen7.zip[/url]"
	},
	{
		"id": 14780,
		"title": "Re: commander keen",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-10-29T00:53:18.000Z",
		"content": "I can't believe I hadn't tried this yet but......................<br />WOW(which is MOM upside down lol) but wow. This was great in my opinion. Graphics were very fun.Levels were well designed and kept me wanting to play more. The music was nice, but my favorite was slugged [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-poisonslug.gif[/img]  .<br />Thank you for the great mod.<br />______________________________________________________<br />So what if i ask dumb questions im only 12."
	},
	{
		"id": 14781,
		"title": "Re: commander keen",
		"author_id": 1486337,
		"author_name": "Sloths",
		"timestamp": "2007-10-29T17:49:52.000Z",
		"content": "What's happenin' with Dead in the Desert?"
	},
	{
		"id": 14782,
		"title": "Re: commander keen",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-30T15:25:51.000Z",
		"content": "It's canceled.  ceilick's done.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	}
]
