[
	{
		"id": 1305,
		"title": "Charlie and the Chocolate Factory",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-28T23:49:42.000Z",
		"content": "Have you seen this movie yet?<br />I think its one of the best movies ever!<br />The music was funny, and the main theme (in the very beginning) is  really cool.<br />It was SO funny, one of the funniest movies i've ever seen.<br /><br />Compared to the original movie (and even the book!), the others look like cheap imitations! This was such a good movie.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] <br /><br />Anyway, enough of me talking about it. What did you think of it?<br />(and if you haven't seen it, do so NOW!!)-Genius314"
	},
	{
		"id": 28060,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-07-29T20:15:52.000Z",
		"content": "I did not like Depp as Wonka.  I liked the childrens' portrayals of their roles, and thought Burton did a fabulous job helping us hate all the kids who got their Golden Tickets.  The Oompa Loompas I thought were nicely done--it was comical that they were all based off of the same individual, and it was interesting to note that Elfman did all their voices (similar to Ilsoap doing all the voices for his Shadowlands cartoons)... but really, I couldn't get over how much I disliked Depp as Wonka."
	},
	{
		"id": 28061,
		"title": "Re: well...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-29T20:30:41.000Z",
		"content": "Really? I thought he made a great Willy Wonka. He's... just so funny! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]The Oompa Loompas I thought were nicely done--it was comical that they were all based off of the same individual[hr][/quote]<br /><br />Yeah. That was funny. Especially the one that's supposed to be a girl (the scene with the glass elevator). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]it was interesting to note that Elfman did all their voices[hr][/quote]<br /><br />Yeah. Its amazing what one person and a computer can do.<br /><br />I liked the songs so much better in this movie (i've still got the welcome song stuck in my head! Willy wonka, willy wonka - i know every word!!) I like the song in the beginning so much (when you see all the candy bars being made).<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />I liked the childrens' portrayals of their roles, and thought Burton did a fabulous job helping us hate all the kids who got their Golden Tickets.[hr][/quote]<br /><br />Yeah. And \"all of the kids??\" What about Charlie??-Genius314"
	},
	{
		"id": 28062,
		"title": "Re: well...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-08-01T19:01:09.000Z",
		"content": "\"I couldn't get over how much I disliked Depp as Wonka. \"<br />Dude, Depp was amzing in that role, wtf are you talking about?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 28063,
		"title": "Re: well...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-01T19:40:55.000Z",
		"content": "I don't know the story of this Chocolate Factory whatever, haven't read the book or seen the olde movie. Well, I'll go to see this when they start to screen it here, but that may take a while (I just checked, it comes in September here).<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 28064,
		"title": "Re: well...",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-08-09T04:22:51.000Z",
		"content": "This was one of the few movies I went to that I wasn't sure if I liked or not.<br /><br />It's not that the movie's weird. I can like weird movies. It's that the movie was three different kinds of weird mashed together (although the Oompah-Loompah songs, having given them a few weeks to let settle, have grown on me).<br /><br />Oh, and Grandpa Joe was underused.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 28065,
		"title": "Re: well...",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2005-09-05T04:21:52.000Z",
		"content": "i enjoyed it but not as much as the original flim with gene wilder as wonka[img]http://www.flags2000.com.au/images/n44_small.gif[/img]<b>OFFENEDERS OF WAR &amp; HUMAN RIGHTS</b>[img]http://www.flags2000.com.au/images/n44_small.gif[/img]"
	},
	{
		"id": 28066,
		"title": "Re: well...",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-09-08T10:05:19.000Z",
		"content": "It looks awful. It basically seems like a modernised version of the old movie with Johnny Depp for the ladies, special effects for the kids, and lame vulgar jokes for the casual movie-goer.<br /><br />I'd give it a miss.[img]http://www.geocities.com/miniopolis/soul.txt[/img]"
	},
	{
		"id": 28067,
		"title": "Decent",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-09-08T13:08:17.000Z",
		"content": "Whlie not the greatest movie I've ever seen, it was certainly the first I've seen at the cinema this year (Meet the Fockers[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img] , XXX2[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  and War of the Worlds among them) that didn't have me questioning whether I should have forked out $8.50 for it (or completely certain I shouldn't) after leaving the cinema. Certainly a refreshing change.<br /><br />The Oompah-Loompahs could have been more interesting. Animated CG characters would have been better instead of clones of a single actor, IMKO. Additionally, the songs didn't live up to the classics, but I guess that's the price you pay for a one-size-fits-all production.<br /><br />On the whole it seemed much more surreal and vivid than the first movie, and I quite enjoyed the expanded focus on Wonka's psychology, along with the much more thorough ending. Great, as far as the mainstream goes.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 28068,
		"title": "Re: Decent",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2005-10-12T02:00:03.000Z",
		"content": "As always Johnny Depp gave a great proformance and was very funny in the role... but when it comes down to it, Wonka really isnt supposed to be like that, which disappointed some people.  But i found it enjoyable.  I liked how the songs this time were actually from the book and are actually extremely hilarious, but the Danny Elfman music made them completely intelligable.  I thought it was very good, and the boy who played Charley was fantastic.<br /><br />He also gave a great proformance with Johnny Depp in Finding Neverland."
	}
]
