[
	{
		"id": 1292,
		"title": "Ryksopp!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-14T01:19:09.000Z",
		"content": "(I can't honestly remember whether I have made a topic about this or not.. If I have, here's a way better topic then!)<br /><br />So, does anyone else love this band? It consist of two guys from Norway doing very beautiful electronic music. Many tracks are instrumental, but there is also singing on them, mainly on the second album, The Understanding. The first album is called Melody A.M, and it consist mainly of instrumentals. I got the first album today, the second album I got already in autumn 2005.<br /><br />[img]http://www.panorama.no/bilder/R/Royksopp01.jpg[/img]<br /><i>The artists. No, I can't remember their names nor find out who is who.</i><br /><br />I really like their music. When I first time listened The Understanding, I wasn't completely satisfied with the album. Some tracks felt pretty good but others I didn't really liked. I hadn't listened this kind of electronic music ever before. But after listening it again it started to open more and more, until after a few listenings I started to love it completely. The tracks are so detailed work with many layers and cool sounds. I suggest it to everyone.<br /><br />[img]http://images-eu.amazon.com/images/P/B0009I7ADI.03.LZZZZZZZ.jpg[/img]<br /><i>I really love the fem-- erh the cover of The Understanding album. That female always makes me think about schizophrenia.. Don't ask why.</i> [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />Some tracks are even a bit sad. Some are very uplifting. Some are just nice to listen. The lyrics are pretty good in my opinion, and the singing sounds pleasant to ear.<br /><br />Here's piece of lyrics from the track Circuit Breaker.<br /><i><br />Caressed by a pill<br />You elevated soul<br />Vanity and pride<br />An addict to one<br />A universal force<br />A one and only kind<br />A thing I can't control<br />No matter how I try<br /></i><br /><br />The official site can be found at http://www.royksopp.com/ [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 27936,
		"title": "Re: Ryksopp!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-14T02:16:28.000Z",
		"content": "Huzzahs!<br /><br />Has nobody else heard of them?<br /><br />They are t3h 1337 band; almost as good as Bjork and a lot more meaningful.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 27937,
		"title": "Re: Ryksopp!",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2006-01-15T14:20:06.000Z",
		"content": "I like some of their less monotonous songs. \"What else is there?\" is a nice one. I wish they composed more music like that, but I know that people who like this kind of music doesn't like the more \"popular\" songs...[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 27938,
		"title": "Re: Ryksopp!",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-01-23T15:55:02.000Z",
		"content": "I like Ryksopp.  I have Melody AM.  Not something I listen to all the time, but I do like it.  So Easy, Eple, Sparks, and Poor Leno are my favorite tracks.  I've heard some stuff off of The Understanding.  It seems more dancey, which really isn't my scene, but I can dig it.<br /><br />LL, I'd take Bjrk anyday.  She has some really amazing stuff.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	}
]
