[
	{
		"id": 1359,
		"title": "Roms?",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-05-30T00:21:32.000Z",
		"content": "I recently stumbled upon some old console games that used emulators to work on PCs. They are called roms. My first question is are these things even legal?"
	},
	{
		"id": 29079,
		"title": "Romans",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-05-30T01:55:00.000Z",
		"content": "Generally, only if you own the game. Although there are ROMs that have been released as freeware for non-commercial use.<br /><br />However, it's not exactly the sort of law that can be enforced unless you're particularly blatant about it and start trying to sell them on or something stupid."
	},
	{
		"id": 29080,
		"title": "Re: Romans",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-05-30T08:43:58.000Z",
		"content": "It's the same idea as with Abandonware... YES it is TECHNICALLY illegal... most of the time the authors look the other way. As with abandonware, all the rom'd console games are no longer sold. The company makes no more profit off of that game. Nintendo does not get any profits if you buy an old NES and a metroid cartrage the same way Epic Meggames won't loose money from downloading the full version of Jazz Jackrabbit.<br /><br />In fact, the company only LOOSES money due to the legal process if they would sue people for having ROMS. Most companies won't care unless you are some self importaint company that is really rich like Lucas Arts. Who went far enough to sue abandonware sites back around 1999 - 2000. But that was one guy who got sued and everyone else got scared and took down the files. (Try finding a freeware game on any website. It is only on the crappy ones, or that french abandonware site that you can find them.) Abandonware used to be a LOT more prolific than what it is. (Now I see more abandonware popping up online but it is coming back very slowly.)<br /><br />The thing with abandonware was done based on the fact Lucas Arts STILL DOES make a profit off of their old games by still selling them in their online store. Nintendo on the other hand would gain NOTHING in the way of profit by suing on something that is out of circulation. (It's like a book company suing someone for scaning in and archiving an out of print book.)<br /><br />Will you ever be procecuted for having ROMS? Naaaaah. Besides... the further you get from the early days of videogames the more of a chance you run of getting in trouble. For example... someone will more likely be sued for having a rom of Final Fantasy 7 for the Play Station then Mario for the NES. And even PS1 games don't run the risk of sueage anymore. (Rember when BLEEM came out?)-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 29081,
		"title": "Re: Romans",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2007-05-30T09:20:17.000Z",
		"content": "Epic still makes a profit from Jazz - you can still buy it. So...they would lose money by you downloading a copy for free.  Even if, IMO, US$25 for Jazz is ridiculous.------------------<br />[url=http://www.szevvy.net]www.szevvy.net[/url], for all your Wombat needs.  You know you want to.<br />A member of the LevelLord fan club."
	},
	{
		"id": 29082,
		"title": "Re: Romans",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-30T17:25:31.000Z",
		"content": "\"Even if, IMO, US$25 for Jazz is ridiculous\"<br /><br />Do you think so? It's a great game. IIRC, 3D Realms sells Keen games for US$20.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to."
	},
	{
		"id": 29083,
		"title": "Re: Romans",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-05-30T18:43:23.000Z",
		"content": "Galaxieretter: \"As with abandonware, all the rom'd console games are no longer sold.\"<br /><br />I don't know about that, some of the latest roms out there are from Gameboy Advance and DS."
	},
	{
		"id": 29084,
		"title": "Re: Romans",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-05-30T19:20:02.000Z",
		"content": "Of course, a lot of old games are now sold on newer systems (Wii, GBA, Xbox live arcade, etc.)<br /><br />Although, if you want ROMs for the sake of having them on your computer, but don't want to get in trouble: Just buy a version of the game (even if you don't own that system) and then download the ROM. That way, you own the game, but you can play them on the computer.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 29085,
		"title": "Re: Romans",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-06-09T15:13:21.000Z",
		"content": "Even that, to be honest, is legally iffy.  I believe in most of (Nintendo's at least) EULAs, there's a specific clause that says that you may not make or own copies of the game you hold, though I believe that's in violation of an American law which says you CAN make a copy for backup purposes.  Heck, if you have any computer software from the 80s or early 90s, the instructions usually TELL you to make a backup of the program, and run off that backup (to avoid loss of the original program due to degration, etc.).--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 29086,
		"title": "Re: Romans",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-06-12T17:46:46.000Z",
		"content": "Reminds me of the Amiga:<br /><br />\"PLEASE make a copy of the workbench disks BEFORE you do anything! Do not switch the read-only option off on the original disk!\" etc. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	}
]
