[
	{
		"id": 1387,
		"title": "New games topic",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-05-04T03:08:51.000Z",
		"content": "okay we have the new movies &amp; music threads, so i thought it might be a good idea to start a new games topic, your game can be ethier dos/windows or a console system. it can also be downloaded off the net or brought from anywhere<br /><br />to start this topic<br />[img]http://upload.wikimedia.org/wikipedia/en/0/03/The_Dig_cover.jpg[/img]<br /><br />purchased it off ebay for AU$15.51<br /><br />The Dig starts with a radio telescope in Borneo picking up an unidentified object, directly heading towards Earth. It is a giant asteroid that could cause catastrophic damage upon impact. A team of five is tasked with the mission of taking the Space Shuttle Atlantis to the asteroid, named \"Attila\" after Attila the Hun, and plant nuclear explosives on its surface to cause it to divert to a stable orbit around the Earth. The five members of this crew are:<br /><br />    * Boston Low (voiced by Robert Patrick), the main protagonist a retired astronaut and survival expert<br />    * Dr. Ludger Brink (voiced by Steven Blum), an archaeologist and geologist<br />    * Maggie Robbins (voiced by Mari Weiss), a reporter and fluent linguistics expert<br />    * Ken Borden (voiced by David Lodge), expert shuttle pilot<br />    * Cora Miles (voiced by Leilani Jones), NASA technician and political candidate<br /><br />After setting off the explosives and successfully causing the asteroid to enter an orbit, Low, Brink, and Robbins explore the asteroid to find out that it is hollow. After further exploration (and activation) by the crew, it turns into a starship in the shape of a shining dodecahedron, transporting the three to a distant planet of unknown position. The crew starts to explore the deserted planet (now named Cocytus by Brink), their main priority being to find a way back home. While the planet has a high state of technology, it is in a state of decay and appears to be devoid of particularly intelligent animals.<br /><br />The story's emphasis is on the stranded trio's interaction (and occasional conflict) as they spread out to explore the desolate world, each in their own way: the commanding Low determined to find the way to go home, the intelligent and stubborn linguist Maggie Robbins studying the dead civilization, and the geologist Ludger Brink, who seems to be sliding into a state of hostile obsession.<b>Rorie</b>"
	}
]
