[
	{
		"id": 756,
		"title": "Art",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-09T06:42:53.000Z",
		"content": "What say you came home one day and saw the Mona Lisa on your doorstep. Evidently you'd not assume it was the real deal here, what would the chances of that be?<br /><br />But, strippd of all its value, and relying only on its artistic merits, what would you do with it? I can't see anything amazing in the painting and I would probbably dump it on a friend or even toss it away if I needed the space.<br /><br />So what about the classics? Are they art now, or are they merely valuable because people say they are? Heck, one of picasso's table napkins was sold for $4000, just becaus ehe'd handled it. I think art people put a lot of faith in what others tell them. What do you think of it all?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19743,
		"title": "Re: Art",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-03-09T10:58:11.000Z",
		"content": "I don't like Mona Lisa that much, either.<br /><br />Yeah, it's strange how some items -- art or not -- get so high value (money wise), like for example underwear some famous person has used. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <br /><br />But naturally, a painting done hundreds of years ago with skills only a few people can match is something valuable, I guess. Can't define art, can't say what'd be art or not.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 19744,
		"title": "buh?",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-09T18:02:40.000Z",
		"content": "Are you kidding me?  If I came home and found a piece of canvas, painted with oils, on my doorstep, I'd at the very least take it inside and admire the TIME invested in creating such a work.  <br /><br />With computer aid (and multiple layers in Photoshop) we can correct any mistakes made, and refine things to a level previously unheard of--but without the aid of electronics, using nothing but oils, brushes, and canvas, there's a certain level of mastery required to create something that pleases the eye.  <br /><br />I'm not saying I'd hang it on my mantle, but I'd probably show it to a few people I knew and end up either selling it or giving it away to someone who wanted it.  There's a lot of finesse to painting... I respect the time investment."
	},
	{
		"id": 19745,
		"title": "\"Buh\"?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-03-09T22:07:41.000Z",
		"content": "A lot of \"good\" art isn't good at all, IMO.<br />Picasso, for instance, is considered a great artist. But I think cubism is just horrible looking.<br />And abstract art is all lousy. You've got this supposed \"modern art,\" which is simply just a bunch of odd shapes and lines put together. Not even in a fancy, pleasing way. Just thrown together.<br />...but yeah, it seems lately that I've been very picky about what I like/dislike. Whatever. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-redeyes.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 19746,
		"title": "...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-10T00:07:29.000Z",
		"content": "Personal taste aside, can you at least appreciate the time these people spent creating these things?  Half the reason I appreciate Picasso's stuff isn't because I think it looks incredible--it's because I can't imagine where to begin drawing something in that style.  If someone put out a Keen mod in that style, my head would explode.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />I know the subject of the art itself isn't always the most interesting (bowl of fruit lol) but the rendering of light and color, texture and weight, are all valuable.  I think some of you might just be spoiled by cameras and photoshop.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>"
	},
	{
		"id": 19747,
		"title": "Re: ...",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-03-10T00:26:35.000Z",
		"content": "Indeed, it is good practice to appreciate art, even if you're not so fond of its content (in fact, that's a good thing to remember for life in general). It gets somewhat ridiculous when people start paying insane money for obscure items used by the artist, but it's no less bizarre than anything else that goes on in our civilisation these days. And in a strange way it helps keeps history alive.<br /><br />I would definitely not throw the painting out--that would be incredibly selfish, both toward its creator and anyone who might truly enjoy the work. Not to mention just plain stupid, since it would fetch a lot of money.<br /><br />Last month, I was wandering the streets of Melbourne and saw this guy crouched on the pavewalk as a crowd watched him spraypainting insane surreal images onto large sheets of glossy paper. He uses pieces of cardboard and various other scraps as masks or general interference to the stream of paint, and ends up with effects like waterfalls, planets, stars, pyramids, foliage, etc.<br /><br />I stood there for a few minutes absolutely enthralled as I watched the final touches of one image come together, and as soon as it was done I walked up and asked how much he wanted for one of the dry images he had laid out before him. He said $50. Done. I might easily have given him $200 if I was willing to part with that much cash at the time, especially considering the amount of time it would have taken to create them.<br /><br />Sometimes you just need to accept that art isn't particularly logical, and money is even less so, and enjoy them both for what they are."
	},
	{
		"id": 19748,
		"title": "Re: ...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-10T03:02:46.000Z",
		"content": "I think that guy's art belongs in galleries, and modern art belongs in the streets.<br /><br />Preferably used to warm hoboes.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	}
]
