[
	{
		"id": 934,
		"title": "A topic about death...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-15T07:11:21.000Z",
		"content": "My grandfather died on the 10th. We buried him today. The eulogy was very philosphical and made me wonder;<br /><br />* How would you liek to die?<br /><br />* What would you liek to be remered for?<br /><br />*What would you liek your funeral to be liek?<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22599,
		"title": "Re: A topic about death...",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-12-15T08:31:28.000Z",
		"content": "My manner of death doesn't matter to much to me. As I see it, I'll be gone in, at most, a few hours no matter what happens. What do I care how I spend such a short time. In a lot of cases, I'd just be gone, so it doesn't matter much to me. The exception is some kind of disease. I don't want to waste away for months or years. I'm not cool with anything that takes more than a few days to do its thing.<br /><br />I don't know about that second one. I guess I just want to be remembered for who I am, mostly. I also wouldn't mind if many great deeds were posthumously and erroneously attributed to me. I haven't really done anything that deserves special remembrance. Regardless, I'd rather be remembered as I am. Some people become just a symbol after they die. Other people revere them as a great person who did so much or inspired so many people. In reality, they were just another person who sometimes had bad days and was grouchy and obstinate. I think it means the most when the people who know you remember you and your faults, but miss you anyway. They're remembering the real you; not some icon in your image.<br /><br />I don't care about funerals. Whatever helps people deal with my departure, I guess. Once I'm gone, it's not about me anymore.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 22600,
		"title": "Re: A topic about death...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-12-15T12:51:25.000Z",
		"content": "1.) Going out in a blaze of glory, wielding dual P90s while defending my position against countless enemies.<br /><br />No seriously though... I don't care how I die as long as it isn't embarrassing. Or painful. Like getting pinched in a car crash for hours...<br /><br />2.) Inventing 254 uses for Zibble.<br /><br />3.) Um... don't really care seeing how I am dead... probably cremation.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22601,
		"title": "Re: A topic about death...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-15T13:33:00.000Z",
		"content": "1.) Eaten alive, why? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]   Seriously, something quick. I can see no fun in suffering for years.<br /><br />2.) Hard to say yet.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  <br /><br />3.) Couldn't care less.<b>Eat your veggies!</b>"
	},
	{
		"id": 22602,
		"title": "Re: A topic about death...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-12-15T20:52:34.000Z",
		"content": "I would like it if you stopped saying liek, and started using like...<br /><br />At any rate, I do not think often on what is to come after this.  Mainly because what can we honestly know for certain about the afterlife?  I mean, we don't even no anything for certain in this life, let alone start worrying about the next, if it will happen.<br /><br />As for HOW I die, however, I would like to:<br /><br />* I do not honestly care.<br /><br />* Something that helped the world in one way or another.<br /><br />* No funeral.  I want to be cremated.  (Did you know that more bodies turn into \"soap\" from the high alkaline concentrates in the coffin?  That's disgusting, no thanks.)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22603,
		"title": "Re: A topic about death...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-12-15T22:11:44.000Z",
		"content": "1. not from disease in any case, I hope I die a good dead. A violent heroic dead would be good but unlikely.<br />2. Someone who inspired people<br />3. burned, I don't want the worms to eat my body.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22604,
		"title": "Re: A topic about death...",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2005-12-15T23:04:14.000Z",
		"content": "* Preferably either very fast, or with a chance to talk to family, friends or loved ones before I go. Either way, I'd like to go without pain and not too slowly: I don't like the idea of gradually slipping away whilst becoming a money drain on relatives.<br /><br />* As has been said before, I'd like to be remembered for who I was rather than what I did.<br /><br />* I'd like either to be cremated or to be buried without a coffin - the idea of nourishing living things after I die is a comforting one. (Of course, I would be an organ donor if I could and will probably get a donor card at some point)[url=http://last.fm/users/grafix5000/][img]http://toxicsheep.com/sigs/scrobbler.png[/img][/url]<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 22605,
		"title": "Re: A topic about death...",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-12-16T03:09:45.000Z",
		"content": "1.  Doing something freakin awesome or extreme.<br />2.  I'd like to be remembered as a nice person who went out of his way to make people happy.<br />3.  Organ donation/cremated.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22606,
		"title": "Re: A topic about death...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-17T01:04:35.000Z",
		"content": "1.) I'd like to die quickly, messily too if possible.<br /><br />2.) I'd like to be remembered for something Keen related [And given my accomplishments so far, its probbably what I <i>will</i> be remembered for.]<br /><br />3.) I wish NZ had a body farm like the US; I'd really like to end up there.<br /><br />Whats wrong with burial? Worms have to eat too y'know. [And given what they do before the bury you, what happens after looks almost nice.]<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22607,
		"title": "Re: A topic about death...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-12-17T06:30:41.000Z",
		"content": "Ok... I wasn't going to post it but LeveLord00, being the comely person she is, coerced me (through various ways) to post it.<br /><br />I decided that being cremated just wasn't the way to go. It is so lame and boring... I mean oooh... you get like... burned in fire. Wow. Like I couldn't of done that myself. Heck, I burn myself all the time at work. So I thought of all the traditional ways to have your body treated. Casket. Cremation. Entombing. Having your internal organs cut out and placed into clay jars while having your brain pulled out of your nose...<br /><br />None of those seem... how would you say... exciting? So I made up my own way to have my body handled.<br /><br />Here goes...<br /><br />First I would want my body to be dropped out of an airplane from 10,000 feet. Then I want a mile long trampoline on the ground and when I hit it I want it to launch me into the ocean, where I would get grabbed by a giant squid. The squid would be attacked by a Japanese science vessel and I would be taken to Japan where I would be eaten by 100 dogs and then thrown up, off of mount Fuji.  Then I would be run over by 50 people on ATVs, then I would have my remains put in a firecracker, loaded into a ICBM and launched for the moon. Then the warhead on the ICBM would explode when It lands on the moon and I would have the crater named after me.<br /><br />What is the lesson learned here? That being threatened with bodily harm IS a good way to have someone do what you want them to do.<br /><br />Hope you are happy now LL. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] -----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 22608,
		"title": "Re: A topic about death...",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2005-12-17T19:00:28.000Z",
		"content": "Am I the only person who doesn't want to be cremated, and have a nice quiet burial and funeral (actually I won't care cause I won't be there[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] )<br />I have a few ideas, but I don't know exactly what i'll want people to say.<br />  I'd like to die heroically (painlessly heroically!) or in my sleep."
	},
	{
		"id": 22609,
		"title": "Re: A topic about death...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-18T00:35:07.000Z",
		"content": "Hey! Me n' Gal wanted creative deaths!<br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22610,
		"title": "Re: A topic about death...",
		"author_id": 180328,
		"author_name": "DivoKeen",
		"timestamp": "2005-12-18T15:58:35.000Z",
		"content": "1)Fighting next to Keen against Mortimor, sacrificing myself for mankind..!<br />2)I don't know.. My keen mod, eh?<br />3)Frozen! (I will live forever!)-------------------------------<br />If something's HARD to do, then it's NOT worth doing. -Homer J. Simpson"
	}
]
