[
	{
		"id": 777,
		"title": "Homosexuality",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-19T16:05:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>LoG</b>[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-annoyed.gif[/img]:\"&gt; <br /><br />Here are my links and points of interest:<br /><br /><br />[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Karen Hooker executed the first psychological test done to test for biological determinism in 1957, on a grant from the National Institute of Mental Health [2]. The study was meant to explore the relationship between homosexuality and psychological development and illness. Hooker studied both homosexuals and heterosexuals. Both groups were matched for age, intelligence quotient (IQ) and education level, and were then subjected to three psychological tests. These three tests, the Rorschach, Thematic Apperception Test (TAT) and the Make-A-Picture-Story Test (MAPS), were then analyzed by psychologists, and the results were tabulated. The results of Hooker's experiment yielded no significant differences in answers on any of the three tests. Because both groups' answers scored very similarly, she concluded a zero correlation between social determinism of sexuality. <br /><br />[...]<br /><br />D.F. Swaab conducted the next noteworthy experiment in 1990. This experiment became the first to document a physiological difference in the anatomical structure of a gay man's brain. Swaab found in his post-mortem examination of homosexual males' brains that a portion of the hypothalamus of the brain was structurally different than a heterosexual brain. The hypothalamus is the portion of the human brain directly related to sexual drive and function. In the homosexual brains examined, a small portion of the hypothalamus, termed the suprachiasmatic nucleus (SCN), was found to be twice the size of its heterosexual counterpart [2]. <br /><br />At the same time, another scientist, Laura S. Allen made a similar discovery in the hypothalamus as well. She found that the anterior commissure (AC) of the hypothalamus was also significantly larger in the homosexual subjects than that of the heterosexuals [2]. Both Swaab's and Allen's results became a standing ground for the biological argument on homosexuality. The very fact that the AC and the SCN are not involved in the regulation of sexual behavior makes it highly unlikely that the size differences results from differences in sexual behavior. Rather the size differences came prenatally during sexual differentiation. The size and shape of the human brain is determined biologically and is impacted minutely, if at all by behavior of any kind. <br /><br />Simon LeVay conducted another experiment regarding the hypothalamus of the human brain in 1991. LeVay, like Swaab and Allen also did a post-mortem examination on human brains; however, he did his examinations on patients who had died from AIDS-related illnesses. He examined 19 declared homosexual man, with a mean age of 38.2, 16 presumed heterosexual men, with a mean age of 42.8, and 6 presumed heterosexual women, with a mean age of 41.2 [3]. LeVay discovered that within the hypothalamus, the third interstitial notch of the anterior hypothalamus (INAH3) was two to three times smaller in homosexual men then in heterosexual men. The women examined also exhibited this phenomenon. LeVay concluded the \"homosexual and heterosexual men differ in the central neuronal mechanisms that control sexual behavior\", and like Allen and Swaab, agreed that this difference in anatomy was no product of upbringing or environment, but rather prenatal cerebral development and structural differentiation [2]. <br /><br />[...]<br /><br />We have examined many causes for homosexuality in the preceding pages, both biological and social. And although an interesting topic of debate, no one theory or experiment leads to a definitive answer. Some believe that the characters found on Xq28 are the Holy Grail of homosexuality research, the elusive 'gay gene'. <br /><br />allpsych.com/journal/homosexuality.html<br />[hr][/quote]<br /><br />All I'm stating here, Mort, is that stating \"Homosexuality is obviously not a biological factor\" is clearly not founded on statistics and science.<br /><br />Now, I'm willing to admit that this could be wrong, but the current science is pointing to it being a ratio of biological to psychological factors that cause homosexuality.<br />[/quote]<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-what I wanna say is I did not say that quote, \"Homosexuality is obviously not a biological factor,\" (the context makes it look like I said it, not necessarily intentional) and also another thing on biology. Our physical bodies are connected to our emotions. As a simple example, if I am mad all the time, then I am probably going to develop high blood pressure. But the thing is, high blood pressure doesn't make us angry, as in totally determines it. It's the other way around. I'm sure any emotion has signs in the brain and maybe elsewhere, they just don't necessarily determine our emotions, like my example.<br />[hr][/quote]<br /><br />A decent point that we can change certain things about us, but we can't will our brain structure to change, nor can we will our genetic codes to change.<br /><br />There are a lot of things that we can change with our bodies --our heart health, what we eat, how much we excercise our muscles, how much we use our brains-- but none of the afore mentioned pysiological differences are ones that we can change.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Not that I disagree with those researches' findings, but the conclusion of that first one after your link I have a hard time believing; I've got another back there concluding the opposite. I'm going to investigate what those tests are.<br />-Now that I think about it, I wonder if there is any evidence of any emotion that is the other way around (physical determines emotion rather than emotion determines physical, like my example), other than gays, so they say. I'm using \"emotion\" very loosly here.<br />[hr][/quote]<br /><br />Very loosely indeed, if your defining emotion as the ability to change your brain pysiology.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-sorry for like countering you when you said enough of this kind of stuff; i still had more to argue, and if u do, then I say don't worry about continuing it.<br />-I was gonna say something about peadophile again, but now I don't know what everyone's arguing exactly. I think I have my argument so far on the other posts.<br />[hr][/quote]<br /><br />No problem, I just moved it over here.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20147,
		"title": "Re: Homosexuality",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-21T20:25:46.000Z",
		"content": "-okay i better list my points of interest too (its all in the peadophilia thread:<br /><br />\"<br />I found this just to back up what i said before.<br />www.narth.com/docs/1996pa...ckson.html<br /><br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />So i still say that that kind of abuse/neglect is a huge factor in homosexual development, not just chromosones.<br />\"<br /><br />\"<br />Since they have such a strong tendancy to it, it sounds like addiction to me. People can and do get addicted to sex, especially in America since America is so full of it. Notice I just named an environmental factor, but does that make it okay? Rape and pedaphile is not okay because it like obviously hurts people. If you get into that stuff again and again and associate it with violence, like a good bit of the media does, then you are much more likey gonna be a rapist. If you associate with children, then you are much more likely gonna be a pedaphile. And yeah, there are other fetishes and stuff you can get addicted to too that make sexuality complicated and w/e so I don't see how it can't be addiction.<br />-There are help programs for kinds of addiction, alchohol, drugs, etc. Some people get off them and some don't--they either choose to do the hard work to get off or choose not too, and don't forget getting into the addiction was most likely a choice too. You gotta stay away from it all in the beginning and save yourself plus others/victims pain and influence into it. That is a choice, morally.<br />\"<br /><br />\"<br />-since you've said before that you've \"never seen one actually work\", i found this. IDK what method/help program was used, and it doesnt really matter to me here; i just wanna cite source of the posibillity. new.cnsnews.com/ViewCultu...0226a.html<br />I know someone said somewhere that just cuz one guy got off doesn't mean every1 can. I just wanna cite this. And I confess I haven't found any source showing a changed, former paedophile, not yet anyway.<br />\"<br /><br />\"<br />What you said about being unable to take yourself away from sex, I don't think that's relevant because what I was saying was that you gotta avoid getting into it the bad way and thus ruining it and hurting others. (not that im saying \"getting into it\", as in promiscuity, is okay.) So my point there was avoiding those bad things about it is a choice, morally, along with choosing to get out of it.<br />\"<br /><br />end of points of interest from previous thread.<br /><br /><br /><br />-now i'm more confused; \"nor can we will our genetic codes to change\" is what you said, but I thought you said before that there was no study on missing genes or something.<br /><br />-maybe it does seem like the brain is one of those things that doesn't change like blood pressure does when angry, but I don't rule it out as impossible. And also, I never said you can \"will\" some body state to change, just that emotions have an effect on them. (though i found a source saying u can will it).<br /><br />-I found this (my quotes from it are near the bottom):<br /><br />[url=http://www.childtrauma.org/ctamaterials/trau_CAMI.asp]www.childtrauma.org/ctama...u_CAMI.asp[/url]<br />\"Yes, altered. All experience changes the brain  good experiences like piano lessons and bad experiences like living through a tornado as it destroys your home. This is so because the brain is designed to change in response to patterned, repetitive stimulation. And the stimulation associated with fear and trauma changes the brain.\"<br />\"Over the last twenty years, neuroscientists studying the brain have learned how fear and trauma influence the mature brain, and more recently, the developing brain.\"<br />this at least proves that abuse is a big factor; like what i was saying before about how homos almost always have a bad father or mother relationship.<br /><br />-these are some sources to show that emotions/environment do physically change the brain, whether short-term or long-term:<br /><br />[url=http://newswire.rockefeller.edu/?page=engine&id=445]newswire.rockefeller.edu/...ine&amp;id=445[/url]<br />\"Long-term stress, like the kind that occurs when someone cares for a chronically ill parent or spouse, can impair short-term memory. Researchers believe that this occurs because constant stress affects an area of the brain necessary for learning and memory, and the underlying mechanisms for this may also be to blame in more serious ailments, such as post-traumatic stress disorder (PTSD) and severe depression.\"<br /><br />[url=http://www.boston.com/news/science/articles/2004/11/09/emotions_can_change_brain_chemistry/]www.boston.com/news/scien...chemistry/[/url]<br />\"Professional actors who were told to put themselves into a happy or sad state of mind were able to change their own brain chemistry, according to Canadian research presented at a recent Society of Neuroscience meeting in San Diego.\"<br />this one shows that it really is possible to \"will\" yourself to change the brain in some way (though they were professionals).<br /><br />[url=http://www.agpa.org/pubs/GC_1200_words.html]www.agpa.org/pubs/GC_1200_words.html[/url]<br />\"He detailed recent advances in neurobiological research that demonstrate how psychotherapy alters brain structure and function.\"<br /><br />So i don't rule out the possibility of any kind of brain change, size or structure or w/e.<br /><br /><br /><br />-My argument here is not that since the environment is changing you, u are not responsible. LoG showed sources showing that homos have different brain strucutre or w/e, and this is just to show that the environment, not necessarily genetics, can do that. See the very first quote at the top of this reply for the environment factor i was talking about.<br /><br />edit: havent searched for those three psych tests yet- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20148,
		"title": "Re: Homosexuality",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-11-21T23:06:23.000Z",
		"content": "From the previous thread:<br /><br />[quote]<b><i>Quote:</i></b>[hr]MortimerInBlack: As for gays, I use the Bible for that, since I trust God is right.[hr][/quote]<br /><br />Whether you think so isn't the issue here, since you're trying to convince other people that homosexuality is immoral. You need to have an argument that uses logic and \"The bible says that God says so\" doesn't cut it. In order for that argument to convince people, you'd need to prove that the bible is God's actual word, and you'd need to prove that God exists. Which is pretty difficult.------------------<br />Nothing in particular"
	},
	{
		"id": 20149,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-11-21T23:19:56.000Z",
		"content": "Oh boy. This is going to end badly."
	},
	{
		"id": 20150,
		"title": "Flamebait.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-11-22T04:27:49.000Z",
		"content": "[hr]<b>MortimerInBlack</b> As for gays, I use the Bible for that, since I trust God is right.<br />[hr]So, gay people are going to hell. Why does that bother you? Apparently 90% of the population is going to the same place. More room for the righteous. Right?<br /><br />[hr]<b>The Bible</b> No man is to have sexual relations with another man, God hates that.<br />[hr]Yeah, quite a convincing argument there.<br /><br />As you can see, I don't take this argument very seriously. (Hopefully you read this post in the same light.)<br /><br />*offers match*"
	},
	{
		"id": 20151,
		"title": "Re: Flamebait.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-22T11:34:28.000Z",
		"content": "A friend of mine is quite religious - and a couple of weeks ago due to an electrical fault his church burned down, so that pretty much summed it up for me.<br /><br />It's amazing how bad things happening to others is \"God's vengeance\" but when it happens to you it's a \"test of faith.\""
	},
	{
		"id": 20152,
		"title": "Re: Flamebait.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-22T17:35:43.000Z",
		"content": "I wonder, are there any gay Keen fans here?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20153,
		"title": "Re: Flamebait.",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-11-22T17:36:14.000Z",
		"content": "Well, well, another one of these threads....<br />    Unlike some Christians, I'm not a total 'predestination' guy, so I don't belive 'every thing that happens to Christians is a test of faith planned by God, and every thing that happens to nonChristians is a punishment planned by God.<br />  In other words, if a church burns down, I'm going to think (in most cases) that God, in all honesty, had nothing to do with it.  He can use the bad to test someone's faith, but he doesn't creat the bad.  At times he does punish nonChristians and Christians alike, but I have a feeling that he'll judge Christians who sin even worse on this earth, because they have a responsibility which the nonChristians don't (the believers have the ultimate gift of heaven,).  That's why I think if God was going to choose between who he would punish first, chossing between your average homosexual guy or the head of the evangelical chruch who was caught in all these scandals, I'd say he would punish the church leader first, because he had a responsibility.  If Christians can go to hell after their salvation (imo they probably can't)  that guy would be burning in the hottest part of hell, not because of what he did, but because he had a responsibility that your average guy doesn't have.<br />  As for actual homosexuality, I would expect any Christian or Bible-believer to say its wrong and unBiblical, but since most people here aren't, I can't simply say 'it's wrong because GOd says so' because that won't convince anybody.  <br />  The only thing I could say is that it's a mindset that can be overcome, not genetics or your DNA structure, but to argue that point I'd have to do research, since homosexuality isn't one of my strong suites in debating, and I don't feel like doing research, so you guys win for now I guess."
	},
	{
		"id": 20154,
		"title": "Re: Flamebait.",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-11-22T17:41:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Yowza: Oh boy. This is going to end badly.[hr][/quote]<br /><br />Yeah, probably. I think it was probably a mistake for me to post. Religious debates rarely go anywhere pleasant. Sorry.------------------<br />Nothing in particular"
	},
	{
		"id": 20155,
		"title": "Re: Flamebait.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-11-22T19:41:22.000Z",
		"content": "To whoever asked, a guy who used to be very prominent in this community is bisexual.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 20156,
		"title": "Re: Flamebait.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-22T19:46:33.000Z",
		"content": "\"I wonder, are there any gay Keen fans here?\"<br />No idea, I don't think I have ever heard anyone confess that, at least.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20157,
		"title": "Re: Flamebait.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-22T22:50:05.000Z",
		"content": "-\"You need to have an argument that uses logic and \"The bible says that God says so\" doesn't cut it. In order for that argument to convince people, you'd need to prove that the bible is God's actual word, and you'd need to prove that God exists. Which is pretty difficult.\" --ElecDude33<br />-I know all that, but arguing that is beyond the topic here, which is what I said the first time i said that.<br /><br />-\"So, gay people are going to hell. Why does that bother you?\" -CommanderSpleen<br />-It bothers me because it bothers God. I know you're about to say, \"if it bothers God then why does he send people to hell in the first place?\" Man, I'm starting a topic for debating this whole thing.<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20158,
		"title": "Re: Flamebait.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-22T23:14:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]To whoever asked, a guy who used to be very prominent in this community is bisexual.[hr][/quote]<br />You know who asked but now you mention this I know who you mean.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20170,
		"title": "*sigh* Not all people act like irresponsible pigs.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-22T23:17:45.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]\"I found this just to back up what i said before.<br />www.narth.com/docs/1996pa...ckson.html<br /><br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />So i still say that that kind of abuse/neglect is a huge factor in homosexual development, not just chromosones.\"<br />[hr][/quote]<br /><br />You can't prove it was neglect or abuse.  We can say that certain forms of sexual abuse create homosexuality, but we cannot say that it creates homosexuality without the genetic component (As there are many rape victims who are heterosexual), nor can you state that abuse/neglect is the ONLY causation of homosexuality.<br /><br />Well, you might, but you've yet to do it.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"Since they have such a strong tendancy to it, it sounds like addiction to me. People can and do get addicted to sex, especially in America since America is so full of it. Notice I just named an environmental factor, but does that make it okay? Rape and pedaphile is not okay because it like obviously hurts people. If you get into that stuff again and again and associate it with violence, like a good bit of the media does, then you are much more likey gonna be a rapist. If you associate with children, then you are much more likely gonna be a pedaphile. And yeah, there are other fetishes and stuff you can get addicted to too that make sexuality complicated and w/e so I don't see how it can't be addiction.<br />-There are help programs for kinds of addiction, alchohol, drugs, etc. Some people get off them and some don't--they either choose to do the hard work to get off or choose not too, and don't forget getting into the addiction was most likely a choice too. You gotta stay away from it all in the beginning and save yourself plus others/victims pain and influence into it. That is a choice, morally.\"<br />[hr][/quote]<br /><br />First of all, rape and pedophilia are the same thing -- a form of rape.  Which is why pedophilia is wrong, and rape is wrong becaue it takes away the consent of a female to engage in sex, and makes females subserviant to males.<br /><br />Homsexuality does no such thing.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"-since you've said before that you've \"never seen one actually work\", i found this. IDK what method/help program was used, and it doesnt really matter to me here; i just wanna cite source of the posibillity. new.cnsnews.com/ViewCultu...0226a.html<br />I know someone said somewhere that just cuz one guy got off doesn't mean every1 can. I just wanna cite this. And I confess I haven't found any source showing a changed, former paedophile, not yet anyway.\"<br />[hr][/quote]<br /><br />Okay.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"What you said about being unable to take yourself away from sex, I don't think that's relevant because what I was saying was that you gotta avoid getting into it the bad way and thus ruining it and hurting others. (not that im saying \"getting into it\", as in promiscuity, is okay.) So my point there was avoiding those bad things about it is a choice, morally, along with choosing to get out of it.\"<br />[hr][/quote]<br /><br />Okay, but that is a moral argument that homosexuality is wrong based on nothing other than your own worldview.<br /><br />From a political stand point, that's not better than saying Hezbollah should kill Jews because they are the majority and it is part of their worldview.<br /><br />From a religious standpoint, okay, but we're not talking religion here.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-now i'm more confused; \"nor can we will our genetic codes to change\" is what you said, but I thought you said before that there was no study on missing genes or something.<br />[hr][/quote]<br /><br />I never stated anything of the like, I think someone else said it though.  Either way, I've refuted that claim.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-maybe it does seem like the brain is one of those things that doesn't change like blood pressure does when angry, but I don't rule it out as impossible. And also, I never said you can \"will\" some body state to change, just that emotions have an effect on them. (though i found a source saying u can will it).<br />[hr][/quote]<br /><br />I would.  It is impossible to significantly change genetics at this time outside of breeding.<br /><br />I think you should be fully able to admit that the notion that you can will yourself out of a genetic code is implausible, and tantamount to stating that you can will yourself to change the 10 or so genomes that keep you from being a bannana.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-I found this (my quotes from it are near the bottom):<br /><br />www.childtrauma.org/ctama...u_CAMI.asp<br />\"Yes, altered. All experience changes the brain  good experiences like piano lessons and bad experiences like living through a tornado as it destroys your home. This is so because the brain is designed to change in response to patterned, repetitive stimulation. And the stimulation associated with fear and trauma changes the brain.\"<br />\"Over the last twenty years, neuroscientists studying the brain have learned how fear and trauma influence the mature brain, and more recently, the developing brain.\"<br />this at least proves that abuse is a big factor; like what i was saying before about how homos almost always have a bad father or mother relationship.<br />[hr][/quote]<br /><br />Chemistry changes the brain without a doubt.  But to state that things that happen early in childhood affect your brain psyiology is not accounting for modern psychiatry.  During the early 20th century and before, Freud did experiments with people, and hypothesized that everything in the world of mental illness could be explained by poor parenting.  This has no scientific basis, and Frued was proved wrong.  A lot of what makes us us is genetics, and a portion of it is pyschological.  Yes, parents can seriously hurt their children, but you are patently lying if you're going to state that homosexuals --which come out of all walks of life-- all are poorly raised.  And if not all of them are poorly raised, then you are not really proving much of anything.  Sure, child rape victims are more likely to become homosexuals, but that doesn't mean it was parents or that they were not predisposed to it.<br /><br />I also don't think you can prove that homosexuals all come out of abuse situations.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-these are some sources to show that emotions/environment do physically change the brain, whether short-term or long-term:<br /><br />newswire.rockefeller.edu/...ine&amp;id=445<br />\"Long-term stress, like the kind that occurs when someone cares for a chronically ill parent or spouse, can impair short-term memory. Researchers believe that this occurs because constant stress affects an area of the brain necessary for learning and memory, and the underlying mechanisms for this may also be to blame in more serious ailments, such as post-traumatic stress disorder (PTSD) and severe depression.\"<br /><br />www.boston.com/news/scien...chemistry/<br />\"Professional actors who were told to put themselves into a happy or sad state of mind were able to change their own brain chemistry, according to Canadian research presented at a recent Society of Neuroscience meeting in San Diego.\"<br />this one shows that it really is possible to \"will\" yourself to change the brain in some way (though they were professionals).<br /><br />www.agpa.org/pubs/GC_1200_words.html<br />\"He detailed recent advances in neurobiological research that demonstrate how psychotherapy alters brain structure and function.\"<br /><br />So i don't rule out the possibility of any kind of brain change, size or structure or w/e.<br />[hr][/quote]<br /><br />True, but I'm simply stating that we've got X facts (Genetic, psychological) over here, too, that we need to look at.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-My argument here is not that since the environment is changing you, u are not responsible. LoG showed sources showing that homos have different brain strucutre or w/e, and this is just to show that the environment, not necessarily genetics, can do that. See the very first quote at the top of this reply for the environment factor i was talking about.<br />[hr][/quote]<br /><br />Responsible for what?  Once again, you are arguing morality and not science.<br /><br />If you feel homosexuals are guilty of immorality --then fine.  But do not let your own worldview interject science and logic, nor should you only look at the facts that support your case and disregard the rest.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20171,
		"title": "Re: *sigh* Not all people act like irresponsible pigs.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-11-22T23:25:02.000Z",
		"content": "Nah, I had forgotten who posted that and I didn't feel like using my back button.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 20172,
		"title": "dflkj",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-11-23T09:41:22.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The only thing I could say is that it's a mindset that can be overcome, not genetics or your DNA structure, but to argue that point I'd have to do research, since homosexuality isn't one of my strong suites in debating, and I don't feel like doing research, so you guys win for now I guess. [hr][/quote]<br /><br />Way to decide the conclusion before examining the evidence."
	},
	{
		"id": 20173,
		"title": "Re: dflkj",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-23T15:47:00.000Z",
		"content": "Who was the bisexual member, you Xtra?<br /><br /><br />I remember someone admitting they were bisexual a while ago, but I don't recall who it was.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20174,
		"title": "Re: dflkj",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-23T20:08:00.000Z",
		"content": "I'll give you a hint; he posted his photo in the photo topic and you'll know that's him when you see it.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20159,
		"title": "Re: Flamebait.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-23T22:01:11.000Z",
		"content": "<i>\"So, gay people are going to hell. Why does that bother you?\" <br />It bothers me because it bothers God. I know you're about to say, \"if it bothers God then why does he send people to hell in the first place?\"</i><br /><br />If gay people bother God, why does he create gay people in the first place?<br /><br />OH, it suddenly becomes clear - now I understand the reason why religion is so keen to prove that people *become* gay of their own free will.  If it was possible to be born gay, then it would mean God has been creating gay people on purpose..."
	},
	{
		"id": 20160,
		"title": "Re: Flamebait.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-24T01:27:39.000Z",
		"content": "I think its svvevy or however you spell his name.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20161,
		"title": "Re: Flamebait.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-11-24T08:40:35.000Z",
		"content": "No, it's Hinkle.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20162,
		"title": "Re: Flamebait.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-24T15:51:33.000Z",
		"content": "Oh, so it is!~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20163,
		"title": "Re: Flamebait.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-11-25T07:18:28.000Z",
		"content": "all following quotes by LoG (I removed the line breaks from them to compact this post)<br /><br />\"but we cannot say that it creates homosexuality without the genetic component (As there are many rape victims who are heterosexual)\"<br />-I'm not clear what that part in parentheses means/proves; did u mean to say there are many rapists that are hetero? Also, I'm more confused than ever on your view of the genetic factor. Please tell me exactly what you think about homo and genes. Also, why can't we say that it creates homosexuality without the genetic component? Is there a source out there about that?<br /><br />\"First of all, rape and pedophilia are the same thing -- a form of rape. Which is why pedophilia is wrong, and rape is wrong becaue it takes away the consent of a female to engage in sex, and makes females subserviant to males. Homsexuality does no such thing.\"<br />-I agree--it does no such thing. What you quoted by me and then talked about, that came from the peadophile post, which is what i was talking about there.<br /><br />\"Okay, but that is a moral argument that homosexuality is wrong based on nothing other than your own worldview. From a political stand point, that's not better than saying Hezbollah should kill Jews because they are the majority and it is part of their worldview. From a religious standpoint, okay, but we're not talking religion here.\"<br />-I checked my post and what I was arguing there was about peadophile, no homosexuality. Sorry 4 the confusion. Even so, it is still based on my worldview. you are arguing yours too; every1 has one; i'm sure you believe hezbollah is wrong cuz u believe every1 is equal (part of your worldview); the question is why is a particular worldview right and what are our worldviews based on. That is why we are showing our reasoning for this stuff, so please dont say im wrong just cuz i have a worldview.<br /><br />\"I would. It is impossible to significantly change genetics at this time outside of breeding. I think you should be fully able to admit that the notion that you can will yourself out of a genetic code is implausible, and tantamount to stating that you can will yourself to change the 10 or so genomes that keep you from being a bannana.\"<br />-LOL u r right. I never meant to say you can change your genes with your mindpower. What i do not rule out as impossible is that brain chaning in some state/way or something due to emotions. I found three sources for that. See, you found a source before saying something like some early research found a part of the brain bigger in homos. My point was that it does not necessarily cause homosexuality, but is a side-effect (like the anger/blood pressure example).<br /><br />\"But to state that things that happen early in childhood affect your brain psyiology is not accounting for modern psychiatry.\"<br />-I never said this is the only thing that influences people or homos or whoever. Just that it was a factor, and an apparently major one due that source I cited early on in the debate.<br /><br />\"but you are patently lying if you're going to state that homosexuals --which come out of all walks of life-- all are poorly raised.\"<br />-Yes, I would be lying if i said that, because I do not know if all, as in ALL, are. But I do have reason to believe the majority are (that source is listed below again).<br /><br />\"And if not all of them are poorly raised, then you are not really proving much of anything.\"<br />-This is not true. It would prove something. If most, say 80%, are found to be poorly raised, then it would indicate that parenting is a factor with a significance of 80%, and also that there is another factor or more with total significance of 20%.<br /><br />\"True, but I'm simply stating that we've got X facts (Genetic, psychological) over here, too, that we need to look at.\"<br />-I have no argument against this. But what do you think the genetic and psychological factors are? If I missed them, I'm sorry, but I'm looking for what you belive about homos, with regard to these factors (same as i said up at the first point of this point).<br /><br />\"Responsible for what? Once again, you are arguing morality and not science.\"<br />-Responsible for becoming Homo/peadophile. Part of the discussion *IN THE PEADOHPILE THREAD* was not only what causes it, but if you are responsible. I assumed it was also part of this, so what I was saying there about responibility was just that you are ultimately responsible, not environment/genes. I guess you could say I was arguing morality there too, but only inferred because I believe they are responsible as opposed to genes (not off topic) and it is wrong to be homo (is this off-topic? It's a homosexuality thread after all, but I don't have to keep saying it). So when I say responsible, I mean they ultimately determine being gay (which is what i mean by responsible) and not something else.<br /><br />\"If you feel homosexuals are guilty of immorality --then fine. But do not let your own worldview interject science and logic, nor should you only look at the facts that support your case and disregard the rest.\"<br />-okay i won't. But what i believe about all this (aka my worldview) has also been based on science and logic.<br /><br /><br /><br /><br />-Here're those sources again<br /><br />www.ncjrs.gov/txtfiles/break.txt<br /><br />This web address, I found, was missing in my very first post in the peadophile thread. You'll notice that thread is near the top again since i edited it in. Sorry for missing that citation.<br /><br />I have read only a little, but i did find this:<br /><br />\"For example, antisocial behavior in females such as<br />sexual misconduct or substance abuse often leads to<br />a diminished capacity for parenting, which, in<br />turn, fosters child abuse and neglect or family<br />violence. When the children of these women grow up,<br />they too may abuse or neglect their children,<br />continuing the cycle of intergenerational violence. Women who engage in prostitution or illicit drugs<br />may not establish stable relationships. Growing up<br />without a positive male role model, boys develop<br />simplistic notions of masculinity that emphasize<br />aggression and power. As a result, they tend to<br />engage in delinquent and criminal behavior.\"<br /><br />[url=http://www.narth.com/docs/1996papers/dickson.html]www.narth.com/docs/1996pa...ckson.html[/url]<br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 20164,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-11-25T10:14:02.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]First of all, rape and pedophilia are the same thing -- a form of rape.[hr][/quote]<br />Paedophilia is merely a sexual attraction to prepubescent children, whether it is acted upon or not (and even if it is acted upon, it's only rape if it involves penetration). So no, rape and paedophilia are not the same thing."
	},
	{
		"id": 20165,
		"title": "Re: re:",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-11-25T10:29:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]it's only rape if it involves penetration[hr][/quote]<br />Perhaps from a legal standpoint, but I wouldn't require that for it to \"count.\" ________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 20166,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2006-11-25T11:25:36.000Z",
		"content": "I'm not saying it makes it any better... it's still not rape though."
	},
	{
		"id": 20167,
		"title": "sfd",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-11-25T17:36:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Perhaps from a legal standpoint, but I wouldn't require that for it to \"count.\"[hr][/quote]<br /><br />So tell me, how do I go about raping someone without penetrating them?"
	},
	{
		"id": 20168,
		"title": "Re: sfd",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-25T20:00:14.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>Mort:</b><br /><br />\"but we cannot say that it creates homosexuality without the genetic component (As there are many rape victims who are heterosexual)\"<br />-I'm not clear what that part in parentheses means/proves; did u mean to say there are many rapists that are hetero? Also, I'm more confused than ever on your view of the genetic factor. Please tell me exactly what you think about homo and genes. Also, why can't we say that it creates homosexuality without the genetic component? Is there a source out there about that?<br />[hr][/quote]<br /><br />You were discussing child abuse.  I pointed out that not all gays were molested as a child, and not all molested children turn out to be gay.<br /><br />Therefore, that is clearly not the only factor.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"First of all, rape and pedophilia are the same thing -- a form of rape. Which is why pedophilia is wrong, and rape is wrong becaue it takes away the consent of a female to engage in sex, and makes females subserviant to males. Homsexuality does no such thing.\"<br />-I agree--it does no such thing. What you quoted by me and then talked about, that came from the peadophile post, which is what i was talking about there.<br />[hr][/quote]<br /><br />Okay<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"Okay, but that is a moral argument that homosexuality is wrong based on nothing other than your own worldview. From a political stand point, that's not better than saying Hezbollah should kill Jews because they are the majority and it is part of their worldview. From a religious standpoint, okay, but we're not talking religion here.\"<br />-I checked my post and what I was arguing there was about peadophile, no homosexuality. Sorry 4 the confusion. Even so, it is still based on my worldview. you are arguing yours too; every1 has one; i'm sure you believe hezbollah is wrong cuz u believe every1 is equal (part of your worldview); the question is why is a particular worldview right and what are our worldviews based on. That is why we are showing our reasoning for this stuff, so please dont say im wrong just cuz i have a worldview.<br />[hr][/quote]<br /><br />There is no way to determine if one worldview right or wrong. One worldview gets tossed aside for another, and the person move on.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"I would. It is impossible to significantly change genetics at this time outside of breeding. I think you should be fully able to admit that the notion that you can will yourself out of a genetic code is implausible, and tantamount to stating that you can will yourself to change the 10 or so genomes that keep you from being a bannana.\"<br />-LOL u r right. I never meant to say you can change your genes with your mindpower. What i do not rule out as impossible is that brain chaning in some state/way or something due to emotions. I found three sources for that. See, you found a source before saying something like some early research found a part of the brain bigger in homos. My point was that it does not necessarily cause homosexuality, but is a side-effect (like the anger/blood pressure example).<br />[hr][/quote]<br /><br />It is possible.  But the genetic code differences and the psychological indifferences makes me rather skeptical of the view.<br /><br />How can you have a self-inflicted chemical disorder without being psychologically different than anyone else?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"But to state that things that happen early in childhood affect your brain psyiology is not accounting for modern psychiatry.\"<br />-I never said this is the only thing that influences people or homos or whoever. Just that it was a factor, and an apparently major one due that source I cited early on in the debate.<br /><br />\"but you are patently lying if you're going to state that homosexuals --which come out of all walks of life-- all are poorly raised.\"<br />-Yes, I would be lying if i said that, because I do not know if all, as in ALL, are. But I do have reason to believe the majority are (that source is listed below again).<br />[hr][/quote]<br /><br />Okay, I'll check the website out.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"And if not all of them are poorly raised, then you are not really proving much of anything.\"<br />-This is not true. It would prove something. If most, say 80%, are found to be poorly raised, then it would indicate that parenting is a factor with a significance of 80%, and also that there is another factor or more with total significance of 20%.<br />[hr][/quote]<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"True, but I'm simply stating that we've got X facts (Genetic, psychological) over here, too, that we need to look at.\"<br />-I have no argument against this. But what do you think the genetic and psychological factors are? If I missed them, I'm sorry, but I'm looking for what you belive about homos, with regard to these factors (same as i said up at the first point of this point).<br />[hr][/quote]<br /><br />I don't know.  It would ignorant, imo, to st<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"Responsible for what? Once again, you are arguing morality and not science.\"<br />-Responsible for becoming Homo/peadophile. Part of the discussion *IN THE PEADOHPILE THREAD* was not only what causes it, but if you are responsible. I assumed it was also part of this, so what I was saying there about responibility was just that you are ultimately responsible, not environment/genes. I guess you could say I was arguing morality there too, but only inferred because I believe they are responsible as opposed to genes (not off topic) and it is wrong to be homo (is this off-topic? It's a homosexuality thread after all, but I don't have to keep saying it). So when I say responsible, I mean they ultimately determine being gay (which is what i mean by responsible) and not something else.<br />[hr][/quote]<br /><br />Okay, but that's an opinion.  There's no concrete evidence even pointing in that direction.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />\"If you feel homosexuals are guilty of immorality --then fine. But do not let your own worldview interject science and logic, nor should you only look at the facts that support your case and disregard the rest.\"<br />-okay i won't. But what i believe about all this (aka my worldview) has also been based on science and logic.<br />[hr][/quote]<br /><br />I dispute that.  You've stated one loose article as your science, and you've ignored the others.  That's selectively scientific and not very logical.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />-Here're those sources again<br />www.ncjrs.gov/txtfiles/break.txt<br /><br />This web address, I found, was missing in my very first post in the peadophile thread. You'll notice that thread is near the top again since i edited it in. Sorry for missing that citation.<br /><br />I have read only a little, but i did find this:<br /><br />\"For example, antisocial behavior in females such as<br />sexual misconduct or substance abuse often leads to<br />a diminished capacity for parenting, which, in<br />turn, fosters child abuse and neglect or family<br />violence. When the children of these women grow up,<br />they too may abuse or neglect their children,<br />continuing the cycle of intergenerational violence. Women who engage in prostitution or illicit drugs<br />may not establish stable relationships. Growing up<br />without a positive male role model, boys develop<br />simplistic notions of masculinity that emphasize<br />aggression and power. As a result, they tend to<br />engage in delinquent and criminal behavior.\"<br />[hr][/quote]<br /><br />This is all true, but none of it says anything on the nature of homosexuality.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />www.narth.com/docs/1996pa...ckson.html<br />\"As predicted by the hypothesis, results showed significant differences between heterosexual and homosexual groups on the father-love, father-reject, and father-attention scales of the PCR-II.\"<br />[hr][/quote]<br /><br />The statistics seem to hold up, but I'd have to read into the deeper.<br /><br /><br />Nevertheless, it still doesn't stop the fact that homosexuals have, usually, as healthy psychological status as a heterosexual.  Maybe their dads didn't play with them enough, but there are a lot of bad parents out there.  There are not, however, a lot of homosexuals out there.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20169,
		"title": "Re: sfd",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-11-25T22:49:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]There is no way to determine if one worldview right or wrong.[hr][/quote]This is because a worldview is an opinion, in case anyone hadn't noticed.<br /><br />There seems to be a lot of interesting stuff on the subject [url=http://www.religioustolerance.org/hom_caus3.htm]here[/url]."
	}
]
