[
	{
		"id": 44,
		"title": "Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-13T02:14:20.000Z",
		"content": "According to the apogee faq, which we've all seen b4:<br /><br />[url=http://rinkworks.com/apogee/s/2.8.6.2.shtml]rinkworks.com/apogee/s/2.8.6.2.shtml[/url]<br /><br />\"They had <b>one</b> son ... William Joseph Blazkowicz II\"<br /><br />However, we all know from reading the famous intro of Keen many times over, that Billy<br /><br />\"...dons <b>his brother's</b> football helmet...\"<br /><br />Seeing the unreconcilable nature of this, a few questions are immediately applicable:<br /><br />-Who's idea was it to write that info relating Keen to Wolfenstein? Surely not Tom Hall?<br />-When did it appear?<br />-Is the apogee FAQ even considered official by the true keeners, especailly Tom?<br /><br />Next thing you know, Mort is gonna be the evil long lost step-brother of Duke or something totally laaaaaaame <br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img] <br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 2104,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-04-13T03:22:15.000Z",
		"content": "We just had this discussion a few threads down the page.<br /><br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumtheoriginalcommanderkeenga.showMessage?topicID=985.topic]p072.ezboard.com/fpublicc...=985.topic[/url][center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 2105,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-13T03:27:50.000Z",
		"content": "I noticed, but those questions weren't adressed as far as I saw. If you want, I don't mind going back and reviving that one, but it looked dead, so...<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 2106,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-04-13T03:31:18.000Z",
		"content": "Maybe adoption or half/step kids?-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 2107,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-13T03:49:36.000Z",
		"content": "Blah, I don't think so. I think ID doesn't know what it's talking about. Still, if anyone knows who's idea it was to write that, i wanna know.<br /><br />And in reference to that other topic about the same thing, Keen's brother does not have to be older. Y'all were assuming that just because his brother had the helmet, he has to play football. It could have just been a gift.<br /><br />BTW, is it really said somewhere that Keen has a sister? I know the lyrics to Eat your Veggies, but does it mention a sister of his somewhere in-game, like the story or something?<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\""
	},
	{
		"id": 2108,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-04-13T04:08:35.000Z",
		"content": "Most likely explanation: iD forgot because they are too sane to be scholars capable of remembering every minute detail of the entire Keen mythos.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 2109,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-04-13T04:10:24.000Z",
		"content": "And holy fucl, the VERY SECOND I make that post I click onto Kotaku and immediately see [url=http://kotaku.com/gaming/id/dont-call-it-a-comeback-ids-been-here-for-years-251967.php]THIS[/url].[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 2110,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-04-13T09:23:03.000Z",
		"content": "Yeah, I certainly don't think it as official information. Very likely it's not written by Tom. I don't think people shouldn't care much about that, it's simply non-official (since it's not inside a Keen game) misinformation.<br /><br />And yeah, I think he has an older brother, especially because the helmet is so big, and because everybody has always think it's an older brother even if it has never been stated -- perhaps just because of the helmet. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img] <br /><br />And the sister is only mentioned in the Eat Your Veggies lyrics, but they are considered very official and Keen so I think it's good. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />Besides, Tom might have developed some larger background -- Keen having older brother and younger sister, names for all of them, but it just has never been seen in the games -- perhaps Bobby had seen that and because of that featured a sister in the lyrics. It sounds very likely there is more planned than we know of.<br /><br />And damn, I already got excited for a few seconds until realized the article had nothing to indicate there'd ever be new Keen. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2111,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-13T14:38:50.000Z",
		"content": "What about this: iD would never figure that anyone would want to try and know everything available about Keens, so small inconsistencies can appear at places? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 2112,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-04-14T00:22:25.000Z",
		"content": "It's also possible that when Keen's parents got married, his mother had children from a previous marriage, making Keen's siblings his half-brother and half-sister.<br /><br />I like the fact that his mum's surname is \"McMichaels\" - if Blazkowicz becomes Blaze, it's like they're hinting that \"McMichaels\" might've become \"McMire.\""
	},
	{
		"id": 2113,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2007-04-14T03:13:07.000Z",
		"content": "The actual Keen games, and perhaps to a slightly lesser degree Keen materials such as manuals, are obviously canon.<br />I'd consider Wolfenstein 3D not canon wherever discrepancies arise, but not if that doesn't happen.<br />On the other hand, Commander Keen for the GBC I do not consider canon.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I noticed, but those questions weren't adressed as far as I saw. If you want, I don't mind going back and reviving that one, but it looked dead, so...[hr][/quote]<br /><br />Although those questions might not have been sufficiently answered in the other thread, it never really went off-topic, and it was still relatively small.<br />Actually the fact that the thread didn't reach a satisfactory conclusion makes it the perfect example to revive, as opposed to starting a new thread about the same subject.<br />This kind of thinking is probably a form of hypercorrection... like how some people say it's always a bad thing to use tables in your HTML, which is of course nonsense.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2114,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-14T05:46:57.000Z",
		"content": "Well, I'll let a mod decide, since i don't mind either way and don't want to have bouncing around between two topics of the same thing.<br /><br />IMKO, i think the info relating Keen to wolfenstein is cool and all, even though ive never really played the latter game, but with such a discrepency (and I do consider it as such, for the possible explanations are too extensive for me), I'm not so sure anymore. I'm afraid I'll have to consent that Keen has a sister tho, despite that that will force me to do some rewriting. For some reason, I always wanted Billy or Mort to be an only child. Then I finally remembered Mort's sister is Molly lol, and that left Mr. 314. Then I rememebered he always dons his brothers football helmet, and now this. o well.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\" No one in the room had any immediate comment."
	},
	{
		"id": 2115,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-14T06:12:52.000Z",
		"content": "What I think is that this is a simple case of confusion; Keen's siblings are official, and this is merely an official document here; and we know how often those are wrong, in India you can be officially dead whilst still jogging about!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 2116,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-04-14T09:25:09.000Z",
		"content": "Yeah, I don't consider Wolf (obviously) canon either. Otherwise we could say there were actually four Billy Blazes and they all died in Doom 2 or that all those Keen cameos really happened in Keeniverse. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br /><br />\"I like the fact that his mum's surname is \"McMichaels\" - if Blazkowicz becomes Blaze, it's like they're hinting that \"McMichaels\" might've become \"McMire.\"\"<br />Wow, never thought of that. It'd be very interesting idea. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  Perhaps one day we know.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2117,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-14T17:29:20.000Z",
		"content": "That is interesting, but I sure hope they're not trying to make it look like Mort and Billy had the same mom!<br /><br />Either way, it doesnt matter to me what ID thinks anymore, cuz I've officially declared it unofficial lol (for me). And now I'm gonna have to come up with they're names--maybe I could just leave that, hmm.<br /><br />But really, when did that page of info first come into existence?<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\" No one in the room had any immediate comment."
	},
	{
		"id": 2118,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-04-15T09:27:18.000Z",
		"content": "Heh, or that Billy and Mort are cousins, if Billy's mom's brother changed his name to McMire. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />And it doesn't matter to me what iD thinks, but what Tom Hall thinks. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  I don't care whatever iD says about Keen in its other games (or in Keen GBC [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] ).3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2119,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-04-15T20:00:52.000Z",
		"content": "Heh, there's really nothing to worry about if you're talking about GBC, cuz there was like nothing in that game. No story or anything really, xcept a stupid little thing at the end where Keen says, \"I'll get you next time Mort\" or something lame.<br /><br />But the ID faq thing I would worry about. Keen is pretty original in my mind. I mean, sure there's lots of evil geniuses out there trying to take over the world or even blow it up, but how many do you know are really trying to destroy the entire Universe? And young kids? It has a lot of potential, and the minute they start doing something liek making Keen and Mort evil twins, that originiality goes way down.<br /><br />This is why I don't want Keen to get popular, so they don't ruin it. Plus they'd have a real reason to hold onto the rights. Just let Tom do his thing and get rich off a hit game, and then he can buy the rights. There's still hope.<br />\"Out of curiosity, what is that score in the Earth measurement system?\"<br />\"...That would be three hundred fifteen.\"<br />\"Three hundred fifteen... This person must be the most intelligent being throughout the entire Universe.\" No one in the room had any immediate comment."
	},
	{
		"id": 2120,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-16T03:40:26.000Z",
		"content": "Well there does seem to be a distinct similarity between Keen and Mort, possibly there is some genetic relation, cousins might not be too far out...<br /><br />I think quite a few of those Keen ameos could have happened, like Biomenace for example, how would we know?<br /><br /><br />Hmmm... with Shadow Master's new ModKeen, we may be able to import Keen into Biomenace...<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 2121,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-16T17:08:26.000Z",
		"content": "Sounds like a plan. I'm working on Bio menace modding interface, but I'm not sure when it'll be finished. I'm actually planning to re-release beta3 as the official LModKeen II release and continue working on the other stuff for LModKeen 3 instead.<br /><br />And why would you want to import Keen onto Bio Menace? It has no pogo.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 2122,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1486794,
		"author_name": "Br1ck",
		"timestamp": "2007-05-31T17:26:28.000Z",
		"content": "Everyone knows that before marrying BJ Blaskowiczs, Mrs. Blaskowiczs (formerly Frau Kuhntz)  was a sort-of prostitute, having multiple relations some of which resulted in a child (or two).  She actually worked under Helga Von Bulow in her Elite Guard division, working closely with Heinrich Von Himmler in Operation Resurrection, during which time she was impregnated by Heir Himmler himself, producing the \"big brother\" referred to in the games."
	},
	{
		"id": 2123,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-06-01T09:24:48.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  How could I forget that!3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2124,
		"title": "Re: Discrepancy: official or not?",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-06-02T21:16:36.000Z",
		"content": "And the younger sister can be traced back to Hitler![img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	}
]
