[
	{
		"id": 488,
		"title": "Edumacate Spleen: Marsology",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-08-15T15:00:15.000Z",
		"content": "I've got a project in the works for which I require as much info about Mars as I can find, whether it be factual (ie. topology, calendars, weather), Keen/Monuments of Mars-related or pure myth.<br /><br />I've got the factual stuff sorted, for the most part, so what I'd like y'all to help me out with is fleshing out the finer elements of Mars in the Keen universe (but feel free to point out decent reference sites).<br /><br />This means the various species/races (intelligent or not) that inhabit the planet and their lilfestyles/societal structures/allegiances/technologies/etc, geological places of interest, cities, and whatever other random bits and pieces happen to cross your mind.<br /><br />Don't get too definitive, though... I may need to reshape some details to suit my unscrupulous purposes.Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 13582,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-15T15:27:56.000Z",
		"content": "Heh. Cool.<br />I was going to make a whole webpage dedicated to fake facts about different keen species, but never started. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yawn.gif[/img] <br />I'll come up with some later.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 13583,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-08-15T15:35:43.000Z",
		"content": "Cool![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <font color=\"BLUE\">A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 13584,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-15T17:21:30.000Z",
		"content": "Genius314, I've had that idea too.. Too bad too little time. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />Anyways, sound like an interesting project Spleen. Too bad nothing comes to my mind at the moment (must be because of school). I hope LL will have something in her sleeve. I'm sorry.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  Perhaps later I can make up something.[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13585,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-08-15T18:31:13.000Z",
		"content": "I'll have to think about this, but in the meantime, here's some food for thought: Just who made all the artifacts on Mars? Was it the Yorps or the Gargs? They don't exactly have hands, so how could they do it? Their eye stalks are too thick to make decent manipulators. Also, how do they get to Earth to get the toys they worship? It's hard to build a UFO with no hands. Could there be other Martians besides the Yorps and the Gargs? Did visitors to Mars lend a hand (literally)? Do the Yorps and Gargs use their eyelids instead of fingers? ________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 13586,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-15T20:03:31.000Z",
		"content": "Yorp: <br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Genus: Yorphius<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Location: Mars<br /><br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The yorp is a light green, one-eyed creature of mars. They usually group together in large buildings made by them. &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp <br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp A yorps jaw is very strong, because all a yorp has is one tooth. It is its only defence.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Although yorps have no arms, they use their very flexible eyes instead. They can work together to accomplish a task, but are very limited when alone. <br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Yorps' religion is based around fun. They worship Earth toys. When they were enslaved by the Despotic Garg, they started building spacecrafts to escape. While most times their plans were ruined, some of them escaped to Earth. They went around exploring, and found some fun &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp toys. They brought some back to Mars, because they knew they couldn't stay on Earth (being acustomed to Mars.) <br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp This made the Despotic Garg angry. He had to do something about the yorps. They were slacking off their duties to play with these toys. So the Despotic Garg ordered that guard robots should be made. There were two kinds - Guards, and \"Tin-can\" patrol-bots. The guard robots were made to guard the toys away from yorps, and the patrol-bots were made to make sure they didn't have any more.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp This was when the Mars War broke out. The yorps took control of some of the robots to use against the gargs. The ice yorps stopped using their ice-cannons to build, and started to destroy. The once peace-loving yorps had become as bad as the gargs. Then, on December 14, 1547 (Mars years), a metal object was seen in the sky. An Earth spacecraft had entered the atmosphere. Quickly, all the yorps and Gargs hid in their underground homes, as it got closer and closer.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Wham!! The spacecraft landed right on the Castle of the Gargs, killing the Despotic Garg. Without a ruler, the Garg social structure collapsed, and the yorps were freed.<br /><br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Rock Yorp:<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Species: Y. Regularus<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Location: Main part of Mars<br /><br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Rock Yorps are regular yorps. They live in large caves underground.<br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Ice Yorp:<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Species: Y. Crystalus<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Location: Tundras of Mars<br /><br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The ice yorp differs from rock yorps in one way - they are, unlike most other species, Mammals, whereas the rock yorps are reptiles. They have a thick layer of green hair, which also has a very similar texture to the skin of a rock yorp.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Ice yorps are much stronger than rock yorps, because they make large buildings out of blocks of ice. To aid in the construction, the ice yorps built ice cannons to shoot blocks up to a construction site.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Because the ice is very slippery, the ice yorps have adapted feet with rough bottoms. This allows them to walk without slipping. Also, they have larger, flatter feet to keep from sinking in the snow.<br /><br /><br /><br />Garg:<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Species: Gargrush Angrious<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp Location: Mars<br /><br /><br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp The Garg is a green creature with two long eyestalks. They have sharp teeth for eating meat and opening the shells of the patpat. Their legs are very strong, allowing them to run very fast and jump very high. Gargs eat up to twice thier weight eat day, because they digest very fast. Garg's have a mean nature, and mostly like to push people around.<br />&amp;nbsp &amp;nbsp &amp;nbsp &amp;nbsp They were once ruled by a Despotic Garg, and had enslaved the yorps to do their work. However, almost as soon as the Mars War broke out, the Despotic Garg was crushed by an Earth spacecraft. The loss of a ruler caused the social structure to collapse, and the gargs became meaner and out-of-control.<br />[hr]<br /><br />Sorry about the non-paragraphs. NOt sure how to indent on the internet. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 13587,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-16T04:16:58.000Z",
		"content": "Hehe, great stuff G314! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I wish I had that talent..[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13588,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-08-16T12:52:20.000Z",
		"content": "The LLL [LeveLord Lectures; A Book]<br /><br />Chapter 28: A long briefoverview of Mars<br /><br />1.0) Astronomical data:<br /><br />[quote]<b><i>Quote:</i></b>[hr]Orbital Period: 687 days (1.88 years) <br />Synodic Period: 780 days <br />Period of Axial Rotation: 24 hours, 37 minutes <br />Greatest Latitude: 6 51'  <br />Mean Motion: 31' 27\" <br />Diameter: 4217 miles (6787 km) <br />Volume (Earth = 1): 0.15 <br />Mass (Earth = 1): 0.107 <br />Density (water = 1): 3.94 <br />Surface Gravity (Earth = 1): 0.38 <br />Distance from Sun: 140 million miles (230 million km) <br />Distance from Earth 35 - 248 million miles <br />Temperature: From -87 to 17 C (-189 to 63 F) <br />Greatest Magnitude: -2.8 <br />Number of Satellites: 2 <br />Atmosphere: Very thin, mainly carbon dioxide with nitrogen and argon (traces of oxygen, krypton, neon, carbon monoxide, xenon and water vapour[hr][/quote] <br /><br />Mars is a small cold planet, the fourth from our sun. Mostly desert with two small polar caps mad of dry ice [with underlying water ice] Small pockets of water do exist, and these sustain the local fauna.<br /><br />In some aspects Mars is simalar to Earth, with a slightly longer day, 4 seasons, but far lower gravity. [Keen can barely jump a quarter tile high on earth.] <br /><br />Those visiting Mars will want to supply themselves with a Green Bay Oxygenizer and Pressurizer Helmet, and thermal underwear as the local inhabitants describe 10 degrees as a heatwave. Bookings can be made at your local NASA outlet for 100 million for a return ticket.<br /><br />One of Mars' more famous attractions is the Pole sking tour, where tourists get to ski down the entire 25Km Arabelius Ramp, tilted at 15 degrees, where a skier may reach a terminal speed of over 50Km/h and can be seen trailing a huge plume of dry ice smoke as the rush ever downward.<br /><br />Also not to be missed are the Martian dust storms, usually occuring in Mars' spring. Planetwide they can obscure all of Mars' disk, yet at ground level be no more than a gentle, if surprisingly brisk breze.<br /><br />Forget the face on Mars, the recent Yorpian peace project, designed to 'make Mars a more friendly place' has finaly borne fruit, in this case, the smiley face crater, visible from orbit:<br /><br />[img]http://people.aero.und.edu/~jrstrege/index_files/Smiley%20(Galle%20Crater,%20Mars).jpg[/img]<br /><br /><br /><b>Life:</b> Life on Mars is traditionaly represented by two species, Yorps [Monoclopius Yorphius ] and Gargs [Diclopius KeenRussianus] both of which may consist of several subspecies.<br /><br />Gargs and Yorps are closely related, splitting only 400'000 years ago. It can be seen that Gargs resemble a 'doubble yorp' and it is believed that a twinning genetic error is responsible, G and Y DNA being 99.87% compatible, and interbreeding possible. [If seldom practised]<br /><br />Both Gargs and Yorps are carnivourus, a revalation that surprises many who do not know the friendly looking Yorps well. My colleuge W Blaze, having studied a captive specimen comments that it will consume nearly any meat presented to it, especially that intended for canine consumption when presented in a red dish.<br /><br />Yorp and Garg teeth although 'cubic' have a sharp edge which is used to kill and edvour prey. It is often said Yorps have only one tooth. This is incorrect, they have 8, a shorter almost invisible tooth in the upper jaw used to bite the bottom tooth against, and six much smaller teeth further back used to chew food. Gargs of course have 16 teeth.<br /><br />Yorps and Gargs prey on smaller 'plantimals' known as Cisplatins, four legged and extremely toxic green creatures that only venture out at night to feed off the bacterial mats that grow in moist places on Mars.<br /><br />Yorps and Gargs defend themselves mainly by being toxic to eat, and mostly by having nothing to kill them. Gargs will charge at anything interesting they see in order to investigate it, which has lead to the death of those unable to deal with the Gargs poisonus skin. Yorps are more gentle, but will often push visitors off cliffs if hungry enough.<br /><br />Another form of life worth mentioning is the plantimal 'Patpat' [Escardius Vernaculus] which spends all day filtering microdes and dus from the martian air, a difficult task given its scarcity. Consumed by Gargs and Yorps as a delicacy, the Garg hunters that gather it are known as Gaagaagarg or Nothilts [Both mean 'Honourary Yorp] due to the loss of eyestalks during this activity.<br /><br /><br /><b>History:</b> It is often said that the Yorps were enslaved by the Gargs, sometime around the great holy Pogo wars of 4442. [1243 in AlteJorp years] This is not strictly true. To see why we must investigate further.<br /><br />The Holy Pogo Wars [4439-4442] were fought between the two factions of Enfletisim, [Literally 'have fun'] the Anarkadrists and the Baalthadists. The former believing that joy and happiness belonged to all, the latter vehemently contesting that it was joyfulness and happyness. The resulting Jihad ended in a little over half of the population of Mars dead. [At the time just over 50 million individuals]<br /><br />After the war the winning Baalthadist leaders appointed a 'Grand Intelect' who was selected on the basis of thier manipulatability and stupidity, thus bringing a long line of Garg 'despots' into existence. During this time the ruling Yorp Ovelords commissioned many monuments to be built, including cities and shrines. [the Garg overlords being to busy running around shouting the traditional cry of 'Gaaaaarg!' {Lit 'Oh what a joy it is to be alive and to bask in the sunlight as it reflects off the dunes' Gargish is known to be a very compact and complex language, as opposed to Yorpish.}]<br /><br />One may wonder how this was done as Yorps and Gargs have no hands. They do however have very flexible tounges, and feet that can manipulate complex objects. Under the Overlord rule, Yorp culture at least experienced a great unpsurgence of technology, both a blessing and a curse as the Overlords manipulated it to create guard robots and ice cannons. [The Garg Overlords mad a single statue that was then stolen by an unkonwn Yorp.]<br /><br />Then in 4675 [1547 AJ] a rather popular Garg despot, Gaaarg Gargargaaarg was assasinated. Famed for his belief that '1 or 2 eyes, but 1 soul and equal [Gaaarg, garg, Gaaaarg!] and his allowances to the Yorps in his district to have their own servant robots, Gaaarg earned the disfavour of the Yorp Overlord Kentral [Big boss] Njorp Yidjyorp. On Canted 36th, 13:13pm, a extramartial vehicle landed on the despot as he made his birthday speech and celebrations, killing him, 2 daughter and his wife.<br /><br />The outrage in the Yorp community quickly contained, the sheer bloody mindedness of the despots' Garg supporters was ovelooked. Allowing themselves to be used as sheild by the Yorp resistance, or just running toward the defence bots only to be cut down in their thousands, the bloody revolution known as 'The Night of the Bloodied Eyestalk' claimed over 150'000 lives. When the derbis cleared, all that remained of the once great overlords were their hated monuments [now mostly abandoned] and a planetwide communication system. Interestingly, later an unknown Yorpish family dedicated a life size statue of Gaaarg to a local Mozzque [Lit Mosquito house]<br /><br />Today the Yorp and Garg races coexist peacefully, as evidenced by simply putting several of each species into a room, apon which they readily converse about local gossip or Ga'arg [A form of Garg sports, very populare near the equator]<br /><br /><br />I will be answering any and all questions presented to me inquiring about the information in this lecture or relating to Mars. Feel free to approach me with any queries you may have.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13589,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-16T14:49:40.000Z",
		"content": "Haha, awesome stuff LL! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Gaaarg, can't see any picture! Fascinating..[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13590,
		"title": "Re: Edumatate Spleen: Marsology",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2005-08-19T08:35:21.000Z",
		"content": "Don't forget to include the \"Commander Keen: 10 Years On\" concept of yorps, where they were like genetically engineered critters based on the computer games ones. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] ----------<br />The Chasm of Strife (deceased): www.ThisStrife.com/Sluggy/chasm.htm"
	}
]
