[
	{
		"id": 969,
		"title": "Shake #$^%ing Speare",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-16T06:32:54.000Z",
		"content": "There have been doubts about the authorship of Shakespeares plays, all the poetry and wit apparently being too classy for a simple off the street hack to have writ.<br /><br />Don't you believe it!<br /><br />This year we studied <i>Much Ado About Nothing</i> and now I'm going through it again for exams. Our english teacher is nice; she explained all the old words and expressions, translating Shakespeare into english so we knew what was going on.<br /><br />And ZOMG! The swearing! The only thing worse is the sexual innuendo! His plays are like the common gutter trash uttered by a standup comic! Only a run of the mill fresh off the street blackguard could come up with such coarse and vulgar tripe!<br /><br />So what is your opinion on this vulgar trash?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23092,
		"title": "Re: Shake #$^%ing Speare",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-16T07:21:04.000Z",
		"content": "\"Only a run of the mill fresh off the street blackguard could come up with such coarse and vulgar tripe!\"<br />Hmmm, don't know about that.. The writer could've been just anyone, including Shakespeare itself. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 23093,
		"title": "Re: Shake #$^%ing Speare",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-16T21:52:53.000Z",
		"content": "Shakespeare is nothing that extraordinary now, but when it was first created there was nothig like it, hence why it became so popular.  People need to get over him some what and move on to another group of authers...~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23094,
		"title": "Re: Shake #$^%ing Speare",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-17T01:15:02.000Z",
		"content": "You do have to consider, though, that some words that may have been common public terms, have come to be frowned opon:<br /><br />Ass - Donkey, and used a lot in the writtings of English authors in the early 20th century<br /><br />Screwed - Putting a nail into wood<br /><br />Hell - Behave you little brats...<br /><br />Damn - Behave!!!<br /><br />And more...<br /><br />Shakespere may have just been using a... wider range of common vocabulary; no one then would have taken offense to his plays...Proud Leader of the \"Tough Guys Wear Pink\" Society<br />--------------------------------------------------<br />Tough Guys Don't Follow Fads; the set them!!!<br />Kudus to Trensetters!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 23095,
		"title": "Re: Shake #$^%ing Speare",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-17T04:29:26.000Z",
		"content": "Really? Such as 'Mary'; an expletive from 'by the vigin Mary'<br /><br />Or perhaps these from M.A.A.N:<br /><br />Don Pedro: She shall be buried face upwards<br /><br /><br /><i>Hero: God give me joy to wear it, for my heart is exceedingly heavy.<br /><br />Margret: Twill be heavier soon by the weight of a man.</i><br /><br />Benedick: In so high a style Margaret, that no man living shall come over it fo in most comely truth thou deservest it.<br /><br />Margaret: To have no man come over me! Why, shall I always sleep belowstairs?<br /><br />&amp;c; it just goes on and on. To our modern ears it sounds fine, but in those days... [And M.A.A.N is one of the nicer ones.]<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
