[
	{
		"id": 885,
		"title": "Peace and Acceptance",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-03-04T23:18:25.000Z",
		"content": "ThenewmoonsidianX's invitation compelled me to offer an alternative of my own. I didn't want to start an argument in his thread, so here's mine.<br /><br />I'll stay simple too. As a very happy athiest, I'd like to invite everyone to consider my own philisophy. I only ask one thing. We all have the capacity to reason, although some people exercise it more than others. I want everyone use that capacity to the best of their ability. I'm asking you all to never take anything on faith.<br /><br />I know that goes against what most of you have been taught from an early age. Many of you have been told that religion holds all the answers. Well, I want to tell you now that no one has all the answers, and that being old or widely believed doesn't make an idea true. Evidence is the only thing that we can rely on. Don't take my word for it, of course. Think it over.<br /><br />Giving up on blind faith may seem very bleak. A lot of people have come to rely on the ideas that their parents and the church put into their head. If you were to give up the idea of a powerful protector and eternal life, it probably would be hard. But in my opinion, it's better to come to peace with the world as it is than to invent a crutch.<br /><br />When I look at the world around me, I see elegance and beauty, the same as any Christian does. But I accept it on its own terms, as the amazing wonder it is. I don't disrespect it by telling myself that there is something greater just around the corner. Without an afterlife, I know the true value of life. Instead of viewing life as something to be endured before I get to the good part, I know not to waste it. Without ancient and unfounded morals warping my thoughts, I'm free to exercise reason and my innate morality (which you all have) to decide what is right. No one can tell me to hate.<br /><br />If we, the human race, don't wise up soon, religion will tear the world apart. If we don't reject dogma and unprovable beliefs then it will always be more of the same. Religions will clash over their beliefs, but there will be no possibility for compromise. Religions will continue to persecute anyone who lives in a way they don't sanction. Everyone will be sure that their way is the only true way. But they won't have a reason, so there will be no discussion. Without reason, there can't be. Don't be a part of that. Please. You can be happy without a god, and without a god you're free to let everyone else be happy too.<br /><br />Questions and discussion are, of course, welcome.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21986,
		"title": "Re: Peace and Acceptance",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-03-04T23:57:33.000Z",
		"content": "I've chosen to be an agnostic, since I've reasoned that no one can possibly tell whether a god exists or not - and, more importantly, that it doesn't matter.<br /><br />Believing in a higher power seems right to us because it's etched deeply into our brain from way back when we all lived in packs and worshipped the alpha male. (This same pyschological relic is also the reason we blindly worship celebrities and people who we admire.)"
	},
	{
		"id": 21987,
		"title": "Peace and Acceptance",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-05T01:09:52.000Z",
		"content": "It's not just religion posing these problems, either. Blind faith in dictatorial leaders, magazine producers, and even the majority verdict on anything--who is to be trusted or hated, what to wear, what to say.<br /><br />I don't believe anything I read, though I give much more credence to anything that isn't the mainstream media, and I certainly trust my own experiences which indicate that either the universe is an extension of me/us or vice versa, and thus the world reflects our thoughts, words and beliefs.<br /><br />Thus, although as far as God is concerned I'm in the agnostic boat, I know there's something more to the world than we commonly accept. The point remains; don't believe everything you hear just because someone 'knowledgable' or 'important' said it.<br /><br /><b>Edit:</b> I don't think agnostic would be the correct term. I'm inclined to believe there exists some underlying intelligence to the universe, however I don't feel that it is apart from us. Thus I don't believe in 'God' as some sort of detached overseer/creator, but as a shared/divisible consciousness that participates in z own creation.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 21988,
		"title": "Re: Peace and Acceptance",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-05T02:11:33.000Z",
		"content": "I think you're overestimating the religion's effect a bit. Or maybe I've just been a problematic case but I've often thought and worried about metaphysical things my faith tells I shouldn't worry. And later realized that i has been rather pointless to do so. But it kinda doesn't matter since it has made my beliefs stronger. I don't think my religion gives all the answers, but I'm sure I'll get to know them later.<br /><br />In a way it's ironic you're offering your own view, since your view basically is about individual creating his own morality and view of everything, and not accepting anything as ready.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I guess many could agree with that view. But I can't see why the world wouldn't still tear itself apart even if everyone'd accept your idea. On the contrary, I think it would result in a total chaos.<br /><br />And, one can end up reasoning and begin to follow some religion (and think it's the exactly right way), or reason that so called reasoning doesn't help at all -- you can't understand many things no matter how much you keep reasoning nor does reasoning prevent you from death or whatever one doesn't like.<br /><br />Although not being agnostic myself I agree with Spleen; there's something more in all this.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-disguised.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21989,
		"title": "Re: Peace and Acceptance",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-05T02:15:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />I'll stay simple too. As a very happy athiest, I'd like to invite everyone to consider my own philisophy. I only ask one thing. We all have the capacity to reason, although some people exercise it more than others. I want everyone use that capacity to the best of their ability. I'm asking you all to never take anything on faith.<br /><br />I know that goes against what most of you have been taught from an early age. Many of you have been told that religion holds all the answers. Well, I want to tell you now that no one has all the answers, and that being old or widely believed doesn't make an idea true. Evidence is the only thing that we can rely on. Don't take my word for it, of course. Think it over.<br /><br />Giving up on blind faith may seem very bleak. A lot of people have come to rely on the ideas that their parents and the church put into their head. If you were to give up the idea of a powerful protector and eternal life, it probably would be hard. But in my opinion, it's better to come to peace with the world as it is than to invent a crutch.<br /><br />When I look at the world around me, I see elegance and beauty, the same as any Christian does. But I accept it on its own terms, as the amazing wonder it is. I don't disrespect it by telling myself that there is something greater just around the corner. Without an afterlife, I know the true value of life. Instead of viewing life as something to be endured before I get to the good part, I know not to waste it. Without ancient and unfounded morals warping my thoughts, I'm free to exercise reason and my innate morality (which you all have) to decide what is right. No one can tell me to hate.<br /><br />If we, the human race, don't wise up soon, religion will tear the world apart. If we don't reject dogma and unprovable beliefs then it will always be more of the same. Religions will clash over their beliefs, but there will be no possibility for compromise. Religions will continue to persecute anyone who lives in a way they don't sanction. Everyone will be sure that their way is the only true way. But they won't have a reason, so there will be no discussion. Without reason, there can't be. Don't be a part of that. Please. You can be happy without a god, and without a god you're free to let everyone else be happy too.<br />[hr][/quote]<br />And the religious debates begin.... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21990,
		"title": "ds",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T02:49:37.000Z",
		"content": "Ah, someone else decided the forums were too quiet.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I don't think my religion gives all the answers, but I'm sure I'll get to know them later.[hr][/quote]<br /><br />I won't say it's impossible, but if you really want them all, you should start now."
	},
	{
		"id": 21991,
		"title": "Meh.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-05T03:09:43.000Z",
		"content": "Debate? Who's debating here? These two threads sound like peaceful discussion and friendly invites to me... why must you turn everything into a war?<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 21992,
		"title": "and... the mastermind?",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T03:52:16.000Z",
		"content": "\"Because he was tipped by <b>me!</b>\"<br /><br />Spleen: \"What?  Who's there!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] : *crackle*<br /><br />Spleen: \"McMire, he who sows the seeds of evil throughout the universe!  I must warn the others!\"<br /><br />*Mort advances and gestures, and all the doors from the room shut closed.*<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] : \"I don't think so, CommanderSpleen.  I'm surprised, also, that you didn't realize the truth of all this?\"<br /><br />Spleen: \"What?  What truth!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] : \"Why do you think religious debates have been so conveniently frequent, splitting asunder the Keen community, turning you slowly into a small, loyal band...\"<br /><br />Spleen: \"I should've seen your invisible hand in all this, McMire.\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] : \"WRONG ANSWER!  I've <b>never</b> had occasion to intervene in your forums of puny intellect!  At least, not until now...\"<br /><br />Spleen: \"What?  Then... what are you saying?\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] : \"That you debate about religion because you come closer to the realization of what religion actually is.  You argue of God, for you feel ever closer God's strange proximity to yourselves.  You come ever closer to the truth, not realizing that the truth was right in front of you all along.\"<br /><br />Spleen: \"What truth?\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] : \"That there was indeed one source for all these beliefs, that there was indeed one God, and that God is me.  All religions, from Christianity to Judaism from Hinduism to Islam and the Greek Gods - all are results of my experiments in time, my first trials at enslaving the human race by showing them my Shikadi miracles and preaching to them complete obedience toward the one true God: me.\"<br /><br />Spleen: \"Oh my God, no!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] : \"Some of these experiments worked better than others, of course.  I knew you foolish mental wimps would swallow all the divine talk I had scripted up.  But none of my attempts were quite totally successful, and so I abandoned earth, for some time.  I spread rumors of a day of judgment that would not come - until I saw fit to reveal myself to you humans once again.\"<br /><br />Spleen: \"You'll never get away with this, Mortimer!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] : \"The time of phrophecy is upon us!  The day of reckoning is at hand!  Soon, when the Keeners again engage in debate on this issue, they shall discover the truth about me... they shall scatter like seeds and preach to the world the coming of the One True God...\"<br /><br />Spleen: \"NOOOOOoOOoOOOhhhH!!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] : \"Mwahwahwhah!\""
	},
	{
		"id": 21993,
		"title": "*GASP*",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-05T03:58:55.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] <br /><br />Hmm... well that explains a lot.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 21994,
		"title": "Re: *GASP*",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-05T05:00:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Without an afterlife, I know the true value of life. Instead of viewing life as something to be endured before I get to the good part, I know not to waste it. Without ancient and unfounded morals warping my thoughts, I'm free to exercise reason and my innate morality (which you all have) to decide what is right. No one can tell me to hate.[hr][/quote]<br />Which leads to a different question.  Do you guys think there are any absolute morals, such as upholding human life?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21995,
		"title": "Re: *GASP*",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-03-05T05:30:48.000Z",
		"content": "I don't think that there are absolute morals. I do, however, know what I think is right, and I don't advocate turning a blind eye to what you think is wrong. It's very important to me that there be reasons behind my morals, even if it's something as simple as, \"Is this how I want to be treated?\"<br /><br />The reason I think that having no religions is better than having many (or one) is because without dogmatic belief, everyone is (theoretically) open to discussion. You can't argue with \"This is what I believe and anyone who disagrees is wrong and/or evil.\" A person who approaches their beliefs from that direction isn't going to be swayed, no matter how much sense you make. Not everyone would be reasonable even without religion, but every roadblock removed is a good thing. I realize that most religious people aren't that extreme, and many do question their beliefs at times, but many don't. They're the ones who make religion dangerous. The rest of you are only their camouflage.<br /><br />My issue is not with religion specifically, but with not questioning everything as hard as possible, and not discarding what can't be proved. Religion is a major symptom of that, and, at the same time, perpetuates it.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21996,
		"title": "Re: *GASP*",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-05T06:40:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And the religious debates begin.... [hr][/quote] <br /><br />You stay out of this; there's room for only one pretentious blowhard in this thread ,infidel.<br /><br />[quote]<b><i>Quote:</i></b>[hr]If we, the human race, don't wise up soon, religion will tear the world apart.[hr][/quote]<br /><br />Religion? Hah, *People* will tear the world apart wether they have religion as an excuse or not.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]Religions will clash over their beliefs, but there will be no possibility for compromise[hr][/quote]<br /><br />Well thats true of many atheistic beliefs too; fortunately most of the godless beliefs extreme enough to result in violence and oppression have been largely ignored, with the possible exception of Eugenics, which resulted in forced sterilizations as late as 1956<br /><br />[quote]<b><i>Quote:</i></b>[hr]Everyone will be sure that their way is the only true way. But they won't have a reason, so there will be no discussion.[hr][/quote]<br /><br />Actually, I think the amount of discussion christianity [and in previous ages Islam] has produced is quite astounding given the strength of some beliefs. Not to mention the eastern sects...<br /><br />[quote]<b><i>Quote:</i></b>[hr]You can be happy without a god, and without a god you're free to let everyone else be happy too.[hr][/quote]<br /><br />1.) I feel happier with one.<br /><br />2.) Not if you want to make everyone else happy and atheistic. [You'd be surprised how many times I've had atheists yell at me, usually because I refuse to see 'sense']<br /><br />[quote]<b><i>Quote:</i></b>[hr]Without ancient and unfounded morals warping my thoughts, I'm free to exercise reason and my innate morality (which you all have) to decide what is right. No one can tell me to hate.[hr][/quote]<br /><br />This also allows you to come to interesting moralities such as eliminating the disabled; after all; why not? It may disgust you, but it'd certainly improve the human gene pool.<br /><br />Also, I think hate is a human characteristic; people don't need to be told to hate, or even who to hate, just so long as there's someone to hate.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Without an afterlife, I know the true value of life. Instead of viewing life as something to be endured before I get to the good part[hr][/quote]<br /><br />Well I don't look at it that way and I pity those who do. I still like the afterlife though; it'd be nice to have things as nice as they are now for as long as possible, besides, I'm afraid of total utter oblivion.<br /><br />[quote]<b><i>Quote:</i></b>[hr]A lot of people have come to rely on the ideas that their parents and the church put into their head. If you were to give up the idea of a powerful protector and eternal life, it probably would be hard. But in my opinion, it's better to come to peace with the world as it is than to invent a crutch.[hr][/quote]<br /><br />On the other hand, its nice to know somone's out there, and its in the nature of life to try and live as long as possible, so I'll stick with the afterlife, it gives me something to look forward to and work for. Besides, ateisim can be a useful crutch in itself, very few people in my opinion are at peace with the world as it is, just at peace woth their world as they like it. Even you.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Many of you have been told that religion holds all the answers. Well, I want to tell you now that no one has all the answers,[hr][/quote]<br /><br />Well, I think its obvious to a lot of people thats the case; after all, faith is believeing in something you can't rationalize, explain or 'answer' Faith of some strength is involved even in atheistic circles.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I've reasoned that no one can possibly tell whether a god exists or not - and, more importantly, that it doesn't matter.[hr][/quote]<br /><br />I like that philosophy! [Its onme of the main reasons I'm not atheist]<br /><br />[quote]<b><i>Quote:</i></b>[hr]Thus I don't believe in 'God' as some sort of detached overseer/creator, but as a shared/divisible consciousness that participates in z own creation.[hr][/quote]<br /><br />Sounds interesting; does it have an overall plan, or is it just a pointless participation?<br /><br />[quote]<b><i>Quote:</i></b>[hr]I won't say it's impossible, but if you really want them all, you should start now.[hr][/quote]<br /><br />Why? We've got eternity, and if we don't we wont be around to worry about it.<br /><br /><br />[quote]<b><i>Quote:</i></b>[hr]Which leads to a different question. Do you guys think there are any absolute morals, such as upholding human life?[hr][/quote] <br /><br />I think there are some very wide ranging morals [do not kill] but nothing is all binding; God's creation is to variable and complex for that.<br /><br /><br />In summary:<br /><br />Atheisim will not remove the negative characteristics such as hate and intolerance associated with religion; these are ingrained into human anture. Saying atheisim will bring about some kind of rational utopia is as stupid as believeing everything would be right if we were all christian.<br /><br />I dislike any religion that oppresses, in my experience its usually totally unecessary, if not contrary to my belief in God.<br /><br />I want a belief I can choose, not a religion I must accept.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21997,
		"title": "mm",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-05T08:32:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I still like the afterlife though[hr][/quote]<br /><br />Yeah, I'd like to sit in the clouds playing the mind-meld console version of Commander Keen 3D: The Afterlife is Toast. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 21998,
		"title": "Re: mm",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-03-05T08:52:39.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Besides, ateisim can be a useful crutch in itself, very few people in my opinion are at peace with the world as it is, just at peace woth their world as they like it.[hr][/quote]<br />My statement probably wasn't clear. I meant something more along the lines of \"accepting that the world is only what it seems to be\", or something. Not necessarily accepting its state.<br /><br />I don't want to give the impression that my particular beliefs are the ones I think you should have. My wish is for everyone to have well-founded beliefs, where well-founded means provable. Belief in what cannot be supported, and what follows from that, is what I'm really mad about. My current beliefs are well founded, in my opinion, and religion isn't, so I'm comfortable presenting mine as good ones. Take them or leave them, but have a damn good reason for it either way.<br /><br />I also don't want to make anyone think that I dislike Christianity especially. I'm just focusing on it because that's what most of us are closest to, emotionally and/or geographically speaking. I feel the same about any belief not based on evidence.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21999,
		"title": "Re: Peace and Acceptance",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-05T12:37:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]If we, the human race, don't wise up soon, religion will tear the world apart. If we don't reject dogma and unprovable beliefs then it will always be more of the same. Religions will clash over their beliefs, but there will be no possibility for compromise. Religions will continue to persecute anyone who lives in a way they don't sanction. Everyone will be sure that their way is the only true way. But they won't have a reason, so there will be no discussion. Without reason, there can't be. Don't be a part of that. Please. You can be happy without a god, and without a god you're free to let everyone else be happy too.<br />[hr][/quote]<br />Religion doesn't tear the world apart, it's just the biggest excuse in the world to defend your own morals at all cost. Most christians I meet just condemn behave of other people not because the bible says anything about it but it's just wrong in their own mind. Taking religion away won't really change that.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Which leads to a different question. Do you guys think there are any absolute morals, such as upholding human life? [hr][/quote]<br />I think absolute morals are based on basic instinct. But why take them for granted. If you think it's all right to kill your family go ahead, you just don't have to expect the respect of the majority and since we have law and order....-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 22000,
		"title": "Re: Peace and Acceptance",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-05T13:56:10.000Z",
		"content": "\"I won't say it's impossible, but if you really want them all, you should start now.\"<br />I'd say it's impossible to know that stuff in this life. Then again, it doesn't really matter if I ever get to know it all or not.<br /><br />\"Saying atheisim will bring about some kind of rational utopia is as stupid as believeing everything would be right if we were all christian.\"<br />Indeed, that's pretty good point. Unfortunately seems some atheists do believe so.<br /><br />Hah, nice Mort and Spleen discussion. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 22001,
		"title": "Re: Peace and Acceptance",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-06T01:15:43.000Z",
		"content": "Here's why: if you count on all of it happening in the next life, you're never going to bother to actually do it.  If you listen to yourself, you'll know what I'm talking about.  \"Ah, it's impossible\" or \"ah, it's only possible later\"; people make so many excuses never to do things.  In order to actually get the initiative, you're going to have to start in this life (although not necessarily complete it here).[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 22002,
		"title": "Re: Peace and Acceptance",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-06T09:41:07.000Z",
		"content": "I really don't know if it's possible at all to figure it out by ourselves, and especially not via science. Call me when you've figured out the correct answers. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br />And besides, if there is an afterlife or several of them, why should we start searching the answer today? There'd be time for that later..<br /><br />Hm, I guess any explanation would be just as absurd as any other. Perhaps we even shouldn't get to know it.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 22003,
		"title": "Re: Peace and Acceptance",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-08T09:41:28.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]My wish is for everyone to have well-founded beliefs, where well-founded means provable[hr][/quote]<br /><br />I have a faith; a faith is something unprovable, and well founded does not necessarily mean provable. I accept that the world is pretty much the way it is, especially when it comes to things liek ghosts, magical healing homeopathy and new age crap. That is another reason why I'm a Jehovah's witness, they don't take any of the crap most other christian religions polute themselves with.<br /><br />[quote]<b><i>Quote:</i></b>[hr]if you count on all of it happening in the next life, you're never going to bother to actually do it.[hr][/quote]<br /><br />Like I said before, thats a stupid attitude, you only live once so I don't see any reason to skimp on the happiness in this life.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And besides, if there is an afterlife or several of them, why should we start searching the answer today? There'd be time for that later..[hr][/quote]<br /><br />Thats my attitude to irreconcilable clashes like fossils and my faith, I figure I'll go along with it, it all makes good sense and God can explain it later, and if I'm wrong, well, I won't exist to know about it will I?<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22004,
		"title": "Re: Peace and Acceptance",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-08T15:04:31.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Like I said before, thats a stupid attitude, you only live once so I don't see any reason to skimp on the happiness in this life.[hr][/quote]<br /><br />How the bloody heck does that \"skimp on the happiness\" of life?[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 22005,
		"title": "Re: Peace and Acceptance",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-03-09T00:52:31.000Z",
		"content": "I find it interesting that lemur think having a religion and values are tearing the world apart...<br />  I submit that it's atheists who make things worse, for what lemur just said... He doesn't believe there are absolute truths or morals.  Let's say everyone had this attitude.  What would stop people from murdering whoever they want, or doing whatever other crap they want (rape, robbery, or whatever) <br />In all honesty, the founding fathers who made this country great were mostly Christians or believed in God (if I remember right something like 50 out of the 53 writers of the constitution claimed to be christian) and its people who have no values that have screwed this country.  I'm not saying have another crusade, i'm just saying if noone had values, what would the world be like?<br /> I also find it hard to believe (call me biast) that you can appreciate the world as much if you believe it came from one nice little amino acid, that came from an asteroid, that came from...ummmm....nothing (people think religion has no basis in science, how do you expect nothing to create all this?)<br />   Oh, and I'll admit some radicals (say like Islamic terrorists) have caused quite a bit of trouble, but come on, everyone expects in general people who have a religion to lead kinder, more peaceful lives (why do you think its such big news about gay priests, or why they make sure to mention if a murderer \"went to church or not.\"   It just seems Christians are held to a higher standard for some reason.<br /> That's just how I see it. <br />Yep."
	},
	{
		"id": 22006,
		"title": "Au Contraire",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-09T03:57:57.000Z",
		"content": "[hr]<b>narnia</b> I submit that it's atheists who make things worse, for what lemur just said...<br />[hr]<br />[hr]<b>LevelLord</b> Religion? Hah, *People* will tear the world apart wether they have religion as an excuse or not.<br />[hr]<br />Regardless of whether you are religious or not, you can choose to be a decent person, or you can choose to be an arsehole and rape the planet to your own and everyone else's peril.<br /><br />[hr]<b>narnia</b> everyone expects in general people who have a religion to lead kinder, more peaceful lives<br />[hr]Hah. On the contrary, I generally expect highly religious people to be zealous and stubburn, living in fear of what their satanic God may do to them if they make one wrong move, while sticking their nose into other people's business to make sure they're doing the 'right thing'.<br /><br />Naturally, this is only a warped generalisation, but I know there are people like that. The point remains--I don't perceive sheep who buy into a religion on blind faith to live anything more than an ordinary life.<br /><br />Huh... I just realised this reply has been sitting here for a couple of hours waiting for me to hit Add Reply. *clicks*<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22007,
		"title": "Re: Au Contraire",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-09T04:50:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]everyone expects in general people who have a religion to lead kinder, more peaceful lives[hr][/quote]<br /><br />Watch out; you might be serving Mortimer next, and I doubt that life will be very peaceful...[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 22008,
		"title": "Re: Au Contraire",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-09T04:51:04.000Z",
		"content": "Religion has an interesting effect.  It seems to make decent people better, and bad people worse.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 22009,
		"title": "Re: Au Contraire",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-03-10T00:42:12.000Z",
		"content": "I can agree with what xtraverse said.<br />  But, if i were say an islamic terrorist, i'd be burning spleen's home right now (after i found it) for talking about a \"satanic\" God.  I'm sorry you generalize Christians like that.  It just goes to show if you meet one person who might call himself a christian and acts badly, it can warp how you think of 'em quite a bit."
	},
	{
		"id": 22010,
		"title": "General Spleen",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-10T01:36:13.000Z",
		"content": "[hr]<b>narnia</b> some radicals (say like Islamic terrorists) ... islamic terrorist ... I'm sorry you generalize Christians like that.<br />[hr][img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />[hr]<b>xtraverse</b> Religion has an interesting effect. It seems to make decent people better, and bad people worse.<br />[hr]Dude, that is a gem of a statement. Couldn't have said it better.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22011,
		"title": "Re: General Spleen",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-03-10T07:41:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Religion has an interesting effect. It seems to make decent people better, and bad people worse.[hr][/quote]<br />That the best thing I've heard here for a long while.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 22012,
		"title": "Re: General Spleen",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-10T10:48:43.000Z",
		"content": "Well, that's definitely true. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 22013,
		"title": "Re: General Spleen",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-11T02:16:53.000Z",
		"content": "Hasty generalization, Xtra...<br /><br />Religion can make a lot of good people bad, and a lot of bad people... erm... better?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22014,
		"title": "Hmm.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-11T02:20:54.000Z",
		"content": "[hr]<b>Globox</b> Religion can make a lot of good people bad, and a lot of bad people... erm... better?<br />[hr]So, in conclusion, religion is... uhh... religion.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22015,
		"title": "Re: Hmm.",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-03-11T02:39:54.000Z",
		"content": "religion can make a lot of smart people stupid.  and. uh.  stupid people smarter?[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 22016,
		"title": "Ruuun, Fooohhrrest!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-11T03:11:50.000Z",
		"content": "Religion is as religion does.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 22017,
		"title": "Re: Ruuun, Fooohhrrest!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-13T05:58:37.000Z",
		"content": "Religion is a crutch, it can be an aid to the needy, and can give lazy people something to lean on.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
