[
	{
		"id": 1259,
		"title": "Thief Music",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-05-03T19:12:54.000Z",
		"content": "Might there be any taffers around here who could point me towards some music similar to that in the Thief games? I'm asking everyone I can think of yet having no luck.<br /><br />You can hear it here: [url=http://www.thief-thecircle.com/media/music/]www.thief-thecircle.com/media/music/[/url]<br /><br />The first four under \"Official Music: Thief 1 &amp; 2\" are the kind of thing I'm looking for.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 27557,
		"title": "Re: Thief Music",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-05-06T03:04:57.000Z",
		"content": "That's quite good, I've never heard the Thief music before.  The only thing I can think of that comes close is the Quake III music ([url=http://www.shikadi.net/pckf/Quake%20III%20-%20Fla2.ogg]1.2MB sample[/url]), although it's still not the exact same style."
	},
	{
		"id": 27558,
		"title": "Re: Thief Music",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-05-06T19:21:56.000Z",
		"content": "After I posted this I got to thinking that I may have asked this here before. If I did, I just want to tell anyone who was wondering when I'd shut up that this is the last time I'll do it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Anyway....<br /><br />Yeah, that Quake music is a little similar. The music in Thief sounds like it was written by someone who had heard of drum and bass but never actually encountered it, whereas the Quake music is (slightly) more normal. It's a lot like System Shock 2, actually. Thanks for having a listen though.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 27559,
		"title": "Re: Thief Music",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-05-08T12:03:34.000Z",
		"content": "The only other song I can think of that sounds similar is the last track of the Spy Game soundtrack - \"Dinner Out (Rothrock remix)\".  I probably can't post it here, which is a shame, but there are a few similarities in the styles.  That is only one song though (the rest of the soundtrack is quite different) so it's probably not quite what you're after anyway, if you want a lot more of the same."
	}
]
