[
	{
		"id": 700,
		"title": "All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-12T21:15:58.000Z",
		"content": "As you guys probably have noticed, there are wikis everywhere. There are big ones and small ones, many dedicated to one single band, program, idea, or whatever. I happened to come across a wiki called wikiHow and have to say I've got good laughs (not literally) reading it because it's the stoopidest thing since sliced bread. It's ridiculous, and I hope nobody will follow its advice. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img]  However, I guess it can come handy if you're the manipulative type who wants to control the usual, simple personalities with predictable behaviour patterns that are all written here in this wiki... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  I just find this idea very funny, they're basically telling what one should do to achieve something or how one should be or take situations, it's very naive altogether. Here: [url=http://www.wikihow.com/]www.wikihow.com/[/url]<br /><br />Also, if you know some other pointless wikis, link them here. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-freud.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18631,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-08-12T21:22:58.000Z",
		"content": "Yeah, I've noticed that WikiHow before... it did help me learn how to avoid being scammed by Apple into buying <i>their</i> iPod A/V cables (they send video through the RED cable); but it did not help me \"land a woman in 30 days or less!!1!!!!1!!!.\"<br /><br />Edit: But not that I need a website to teach me how to get a woman...-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	},
	{
		"id": 18632,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-08-12T21:29:43.000Z",
		"content": "[url=http://www.eopoint.com]Well now here's one that exemplifies your point.[/url]-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	},
	{
		"id": 18633,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-12T22:12:54.000Z",
		"content": "The Uncyclopedia can be amusing: [url=http://uncyclopedia.org/wiki/Main_Page]uncyclopedia.org/wiki/Main_Page[/url]<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18634,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-12T22:48:38.000Z",
		"content": "[url=http://encyclopediadramatica.com/]Encyclopedia Dramatica[/url] is like Uncyclopedia, but with different content of course.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 18635,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2007-08-13T13:27:07.000Z",
		"content": "I've used Encyclopedia Dramatica, SmashWiki, Wookieepedia, They Might Be Giants Knowledge Base, and a couple others I think.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 18636,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-13T15:49:51.000Z",
		"content": "So much waste of precious time and server disk space.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18637,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-13T18:58:04.000Z",
		"content": "Wow, and I thought wikiHow was as useless as one could be... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  Agree with Shadow Master. This Encyclopedia Dramatica seems like cyberbullying or something. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18638,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-08-13T20:17:17.000Z",
		"content": "Encyclopedia Dramatica is a fairly poor imitation of Uncyclopedia, and serves little purpose other than extending the lower dredges of internet subculture. It's a vaguely interesting source if you want to research internet memes, but otherwise it's a waste of time."
	},
	{
		"id": 18639,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-13T20:25:58.000Z",
		"content": "Ah, I guess it's the massification of the Internet the cause of all this trouble. Initially, Internet was restricted to military and research networks. What the hell happened? Now any n00b can control a site and do n00bish stuff there, and eventually get famous because of that, win lots of money, etc.<br /><br />Not only the case of these wikis, but also YouTube. Nonsense, loads of nonsense. Is it just that all these people don't have a life?------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18640,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-13T21:18:48.000Z",
		"content": "The problem is that it has become integrated in to almost everyone's life. All the problems and idiots are online now. And as said, everything has been made so easy that nobody needs any technical knowledge -- which of course enables more and more people to do whatever they want to. The same goes with everything. First they printed bibles, look all the printed stuff now! Look all the music now! If you ask me, people shouldn't be able to have means to do anything, they should be locked up and creativity should be blocked. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  Hah, no, but I think being in internet is stoopid, which is why I spend a lot less time in it than before, although I've always mostly just been in the same places. Can't say I rather prefer real people or something, as I'm alone, but at least I do stuff that I prefer a lot more. But, obviously most people like whatever is going on, otherwise it wouldn't be what it is. I guess the only thing one can do, as destroying it all seems impossible, is to get away. It's another society thing, or something; if you aren't connected you're crazy lunatic or loner or something. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18641,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-13T22:07:58.000Z",
		"content": "That's precisely my argument when people say that Linux needs to be more user friendly.  The fact that it's *not* user friendly means that you automatically exclude undesirable people because they can't figure out how to use it.  Red Hat tried somewhat successfully to make their version user friendly and now their discussion forums are mostly useless, filled with simple questions that you'd expect to find in a newbie-Windows forum.<br /><br />So when you make things like the Internet *too* easy, that's what you get (look at MySpace - you've been able to put your own homepage online for decades, but suddenly now you don't have to understand FTP and HTML to do it, and you end up with crap...)<br /><br />There's something to be said for things being complicated - so next time you're having trouble figuring something out, instead of complaining, maybe accept that you're being excluded for a reason [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18642,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-08-14T02:01:55.000Z",
		"content": "Then vice-versa you have people like me. I can not be bothered to learn linux, nor to spend 2 hours getting my sound card working. Windows or OS X let me get what I want, AND what I need, easier. Figuring out a computer isn't what I like to do. Let me use it, it works, I'm done.<br /><br />I think it is more along the lines of things and services offered by places like Dreamhost or EZ Boards. Now anyone who is anyone can pay $20 a month down to NOTHING in hosting and throw up a crappy web page and click a button to have a PHP BB forum appear. I have seen a lot of free hosting places where you are ENCOURAGED to use their pre-made layouts or that there is no way to upload your own HTML files. This lets my 12 year old sister make a page about her neopet and throw her crappy anime fan-fics online without even knowing what HTML stands for.<br /><br />I, myself have no technical knowlege. If it weren't for the ease of the internet, click click and you are done, I would never be able to do what I do. It has become a replacement for the TV, the telephone and the encyclopedia, all at the same time. Yet while I would rather make my webpage in Dreamweaver as opposed to typing it out, I still made my own page.<br /><br />And then there is the point, Newgrounds used to be a crappy html page way back in the day. Now look at it, it is a well designed site, has a good graphical layout with a strong server backend that hosts a majority of the crap of the internet.<br /><br />I believe such sites as \"Ebaums world\" all have PHP scripts running. You Tube has a LOT of funding put into hosting and programming. These are all highly \"Internet Technical\" sites that are deemed by MOST people as \"Crap.\"<br /><br />Likewise the \"Linux excludes the undesireables\" thing isn't all that true either. There was a kid in high school I remember, his name was \"Laptop Kid\" (Guess why.) and he refused to use anything BUT linux.<br /><br />And he was the most undesireable person to be around I ever met...-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 18643,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-08-14T02:59:45.000Z",
		"content": "That's what I love about the internet, anyone can put anything they want up, and you get beautiful websites like this: [url=http://petkohumenik.szm.sk/allindex.html]petkohumenik.szm.sk/allindex.html[/url][url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 18644,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-08-14T05:31:50.000Z",
		"content": "This inspires me... coming soon in a few days, an encyclopedia on myself.-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	},
	{
		"id": 18645,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-14T11:02:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Likewise the \"Linux excludes the undesireables\" thing isn't all that true either. There was a kid in high school I remember, his name was \"Laptop Kid\" (Guess why.) and he refused to use anything BUT linux.  And he was the most undesireable person to be around I ever met...[hr][/quote]True, but then you're comparing two different things (OS preference vs personality) - people who go to the effort of learning Linux are great on Linux forums, because sensible questions are asked and helpful answers are given.  Those people may well be undesirable in other areas, but then you're not looking at those areas.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18646,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-14T12:21:49.000Z",
		"content": "Interesting the variety of point of views it indeed is.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18647,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-14T13:11:40.000Z",
		"content": "Haha, I don't think all Linux users are that nice. I bet most of the crackers who love to cause damage and death, for example trying to break into hospital networks and destroying all the patient records or trying to mess up all the vital systems, or trying to get into military ones and do even worse, most of them probably prefer some sort of Linux setup.<br /><br />And I'm quite sure there are those mean-spirited gargs in Linux forums too, who know how to use it, but cause problems in forums just for the sake of it.<br /><br />And last, haha, that's what I've been fearing someone would start one day, Q90. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  This is truly the end of the world.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18648,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-14T13:36:33.000Z",
		"content": "KR, what you say is true, but it seems to be a minority of similar size to that minority that does the same atrocious things using Windows or MacOS.<br /><br />I know at least ONE Linux user that, while fitting in the \"hacker\" term, tends to fit in the \"cracker\" too.<br /><br />Anyone wanna have waffles for breakfast today? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />Although Linux seems to be the preferred OS for scientists too. Most fellow astronomers and physicists at college (as me) prefer it, although it seems just to be because it's the free UNIX and that. Not that FreeBSD isn't a free UNIX, but we like UNIX systems that are easy to setup, etc., etc., and that are published under a non-restrictive License.<br /><br />We, physicists and astronomers here say: you've got to love Linux.<br /><br />The engineers here say: you've got to love Windows.<br /><br />But, what the hell has this to do with the Internet n00bs?------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18659,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-14T14:04:40.000Z",
		"content": "\"But, what the hell has this to do with the Internet n00bs?\"<br />Not that that was the topic initially, either. The topic was pointless wikis! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18660,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-08-14T23:08:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]and you get beautiful websites like this: petkohumenik.szm.sk/allindex.html [hr][/quote]<br /><br />Whoa.------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 18649,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-15T03:00:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I bet most of the crackers who love to cause damage and death, for example trying to break into hospital networks and destroying all the patient records or trying to mess up all the vital systems, or trying to get into military ones and do even worse, most of them probably prefer some sort of Linux setup.[hr][/quote]Possibly, but in that case only because it's the right tool for the job - it's less restrictive than Windows.  It's like saying \"I bet people who build houses use nailguns.\"  Sure, they could use hammers, but a nailgun gets the job done much more easily.<br />[quote]<b><i>Quote:</i></b>[hr]And I'm quite sure there are those mean-spirited gargs in Linux forums too, who know how to use it, but cause problems in forums just for the sake of it.[hr][/quote]Actually you'd be surprised.  Sure, there are always people like that out there, but because Linux is still relatively 'exclusive', there's a definite community feel which for some reason makes people just get along.  Most people reach the conclusion that it's taken them so much effort to get this far, they're not going to throw all that away by behaving like an idiot.<br /><br />Bear in mind of course I'm only using Linux as an example - this applies to anything that requires a lot of effort to learn - when was the last time you saw two airline pilots bickering about something inconsequential?<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18650,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-15T10:36:26.000Z",
		"content": "Having observed people all my life, I have to disagree -- what I've seen is that people, and especially those who have mastered something complicated system (and then think they're sooo smart), can fight over something inconsequential and take that to absurd proportions. As often opinions divide about something, or then there is something that's not yet proven or is impossible to, or something that has to be just interpreted some way, but nobody knows how. Good examples are for example maths and philosophy -- or religion. Especially in the distant past.<br /><br />But anyways, if the Linux community still is that united, there'll be something to tear it apart one day. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  And probably something popular software there divides opinions just that way? Or perhaps they're sheep that obey everything their 'master programming zen gurus' tell them. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18651,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-15T10:58:34.000Z",
		"content": "[hr]<b>KeenRush</b> But anyways, if the Linux community still is that united, there'll be something to tear it apart one day. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  And probably something popular software there divides opinions just that way?<br />[hr]There are already potential flame-bait topics of that manner. KDE vs Gnome, for example. XFCE suits me better, while KDE and Gnome are necessary evils, IMKO. It's not a preference I'd argue about, but I imagine many would.<br /><br />Besides, it's probable that the people who are inclined toward fighting over such inconsequential things are those who think they know everything. As a rule of thumb, if you think you know everything about something, you don't know anything about it. Thus, they wouldn't fit into the same category as those who have invested \"so much effort to get this far, they're not going to throw all that away by behaving like an idiot.\"<br /><br />On the original topic, I don't mind the abundance of wikis and n00b-friendly services. I simply don't pay any attention to the things I'm not interested in, and put effort into creating things in a way that pleases me aesthetically and functionally.<br /><br />Regarding Linux vs Windows... aside from the fact that I wish DOS had continued to evolve into something like what Linux now is and had become standard... it depends on what you want to do with it. For coding and general use, I much prefer Linux for its stability, brain-stimulating environment, terminal environment, and overall flexibility, to state but a few of its merits.<br /><br />However, I use a broad range of applications and games, many of which have been coded for a Windows only environment, an unfortunate trend but one I must live with if I want to do anything useful. Thus, I still require Windows to be installed on at least one of my computers (preferably two, with the degree of omnitasking I have going most of the time)."
	},
	{
		"id": 18652,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-08-15T14:39:14.000Z",
		"content": "50 years ago airline pilots were among the most respected...these days they're mostly drunks.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 18653,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-08-15T20:34:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Most people reach the conclusion that it's taken them so much effort to get this far, they're not going to throw all that away by behaving like an idiot.[hr][/quote]I assume you've never read the kernel mailing lists, then... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 18654,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-15T22:05:21.000Z",
		"content": "It wasn't a perfect example, it was just to illustrate my point [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 18655,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-16T13:04:06.000Z",
		"content": "Um... as I said before, physicists and astronomers love Linux, while engineers love Windows.<br /><br />And Linux isn't so complicated if you are a programmer. Most programmers are not evil. Would you say the same of John Carmack? (disregard that paragraph of biography in Wikipedia for the answer)------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18656,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-16T13:54:52.000Z",
		"content": "And as someone else has said before, generally speaking all generalisations are bad."
	},
	{
		"id": 18657,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-16T14:06:38.000Z",
		"content": "Yep. Oh, and btw, 3D Realms' site host uses Linux. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 18658,
		"title": "Re: All these wikis... Arrggh.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-16T19:49:32.000Z",
		"content": "What host doesn't, nowadays?<br /><br />Oh yeah, MS.com and sites using ASP, lol.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	}
]
