[
	{
		"id": 1193,
		"title": "Does your country have free health care?",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-02-22T04:23:04.000Z",
		"content": "Does your country have free health care?[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 26291,
		"title": "Re: Does your country have free health care?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-22T23:58:15.000Z",
		"content": "Nope.  America does not have free healthcare --we make our companies pay for it.   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img] <br /><br />*shrugs*<br /><br />I really don't like government invovling itself in such areas.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26292,
		"title": "Re: Does your country have free health care?",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-02-23T00:21:28.000Z",
		"content": "i knew that globox, i just want people's thoughts[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 26293,
		"title": "Re: Does your country have free health care?",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-02-23T00:43:43.000Z",
		"content": "There are too many people who can't afford health care or get jobs which provide it in America. Forcing employers to pay for it drives up the cost of manufacture, putting American goods at a disadvantage when compared to cheaper imports.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 26294,
		"title": "Re: Does your country have free health care?",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-02-23T01:24:38.000Z",
		"content": "that is really interesting, thanks 4 telling me lemur821[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 26295,
		"title": "Re: Does your country have free health care?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-23T08:53:36.000Z",
		"content": "Here in the UK, we get free healthcare funded by our taxes. You might have to wait 4 hours to see a doctor in the casualty ward and a few years to get a hip transplant, but it's no worse than the healthcare in America that you'd be paying for.<br /><br />The problem with having private companies running public services is that they make profits more important than actually providing a good service. This drives up the prices of those services enormously and drops the quality to near rock bottom. And when a priavte company in the public sector starts running out of money (like Network Rail in the UK, who run the trains) the government bails them out with large amounts of cash anyway.<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url] | 2 pence an hour for godawful tech support job... [url=http://www.jobsite.co.uk/cgi-bin/vacdetails.pl?selection=915675807]yes please![/url]"
	},
	{
		"id": 26296,
		"title": "Re: Does your country have free health care?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-02-23T10:50:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]There are too many people who can't afford health care or get jobs which provide it in America. Forcing employers to pay for it drives up the cost of manufacture, putting American goods at a disadvantage when compared to cheaper imports.[hr][/quote]<br /><br />So youre saying that Americans cant go to the doctor because it will make America unattractive for trading?<br /><br />...no wait, silly me, thats not what you are saying.<br /><br />Youre saying that Americans should pay it themselves, right? But you ARE saying too that only the richer Americans can do so. Now then, lower the wages progressively and give every American health care in turn for it, problem solved.<br /><br />A country like America cant compete with other countries in labour costs anyway and should not try, productivity is much more important and can be raised by good labour quality by good health care.<br />-----------------<br />[img]http://www.jamba.nl/storage/view/335/0/sn/Snow_Ball.gif[/img][img]http://www.jamster.com/s/jcw/img/logo_jamster_navi.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26297,
		"title": "Re: Does your country have free health care?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-02-23T11:12:58.000Z",
		"content": "We have free health care in the Netherlands, but these laws are changing at the moment do there's less free health care. Meh.___________________<br />DaVince, Yet Another Amateur Game Creator! :P"
	},
	{
		"id": 26298,
		"title": "Re: Does your country have free health care?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-02-23T20:49:31.000Z",
		"content": "\"The problem with having private companies running public services is that they make profits more important than actually providing a good service. This drives up the prices of those services enormously and drops the quality to near rock bottom. And when a priavte company in the public sector starts running out of money (like Network Rail in the UK, who run the trains) the government bails them out with large amounts of cash anyway.\"<br />Yeah, that's no doubt a problem, and pretty annoying one. Naturally private companies try to maximize the income, and minimalize their own costs -- they don't really care about the customer. And yeah, if some of them gets non-functional for some reason, it may cause severe difficulties to the country. Around here they've sold a lot electricity maintenance and production to private companies. Well, there's more difficulties with electricity than ever, on some areas.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 26299,
		"title": "Re: Does your country have free health care?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-24T23:59:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Here in the UK, we get free healthcare funded by our taxes. You might have to wait 4 hours to see a doctor in the casualty ward and a few years to get a hip transplant, but it's no worse than the healthcare in America that you'd be paying for.<br />[hr][/quote]<br />Anything to validate your statement?  As far as I know, most people can get decent healthcare at a decent time.  I would personally rather have died than had to wait 2 years to get pins for my hip surgery.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />The problem with having private companies running public services is that they make profits more important than actually providing a good service.<br />[hr][/quote]<br />Depends.  You are assuming that all companies are self centered, which is a flaw in your logic.  The most bigoted people in America against poor people are the middle class, not the upper class.  People (Yes, including corporation owners) are a lot more sympathetic than the media makes them out to be.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />This drives up the prices of those services enormously and drops the quality to near rock bottom.<br />[hr][/quote]<br />That is <i>ad absurdum</i> --Just becasue the price goes up it does not mean that the quality drops.  It seems to be the opposite of that corrolation.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />And when a priavte company in the public sector starts running out of money (like Network Rail in the UK, who run the trains) the government bails them out with large amounts of cash anyway. <br />[hr][/quote]<br />Indeed.  Here we agree on something.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26300,
		"title": "Re: Does your country have free health care?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-25T11:16:55.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]As far as I know, most people can get decent healthcare at a decent time. I would personally rather have died than had to wait 2 years to get pins for my hip surgery.[hr][/quote]<br />You can still go private if you want vital surgery, but you pay a <i>lot</i> of money even with health insurance. Very few people can afford the cost, and most don't have health insurance (because of the National Health Service).<br />[quote]<b><i>Quote:</i></b>[hr]You are assuming that all companies are self centered, which is a flaw in your logic.[hr][/quote]<br />The primary motivation of a company is profit. Some may choose to focus on providing a high-quality product or service as well, but none of the companies who provide private services here (or have in the past) appear to care about their customers. I once spoke with someone who worked for a private contractor with several government contracts: he told me that his company's job was to \"provide an expensive and overpriced solution, take so long to implement it that it becomes obsolete, then repeat\". I am sure there are contractors who don't follow this model, but I've never heard of any.<br />[quote]<b><i>Quote:</i></b>[hr]People (Yes, including corporation owners) are a lot more sympathetic than the media makes them out to be.[hr][/quote]<br />This is true. However, control over a company is primarily held by shareholders - and shareholders want money. Many people (even as high as the president or CEO) may disagree with company policy, but don't have the power or support to change it. Technically, they <i>could</i> change it; our Queen technically has authority to seize land and block laws approved by Parliament, but I don't see her sticking around for long if she ever decides to use those powers.<br />[quote]<b><i>Quote:</i></b>[hr]Just becasue the price goes up it does not mean that the quality drops.[hr][/quote]<br />Not if there's no competition - and our private sector has next to none. Look at big telecoms in America; most of them have shoddy customer service, high prices and have stifled most of their competitors.<br /><br />Perhaps the best system would be one like they have in France: you have to pay for healthcare, but the government will pay for you if you don't have health insurance. And, AFIAK, France's healthcare is much better than in the UK or the US.<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url] | 2 pence an hour for godawful tech support job... [url=http://www.jobsite.co.uk/cgi-bin/vacdetails.pl?selection=915675807]yes please![/url]"
	},
	{
		"id": 26301,
		"title": "Re: Does your country have free health care?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-25T19:16:56.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />You can still go private if you want vital surgery, but you pay a lot of money even with health insurance. Very few people can afford the cost, and most don't have health insurance (because of the National Health Service).<br />[hr][/quote]<br />Yeah... That's not very effective.  But I was talking about America.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />The primary motivation of a company is profit. Some may choose to focus on providing a high-quality product or service as well, but none of the companies who provide private services here (or have in the past) appear to care about their customers. I once spoke with someone who worked for a private contractor with several government contracts: he told me that his company's job was to \"provide an expensive and overpriced solution, take so long to implement it that it becomes obsolete, then repeat\". I am sure there are contractors who don't follow this model, but I've never heard of any.<br />[hr][/quote]<br />Again, making large assumptions that none care about their customers.  Perhaps that's true in Canada.  But it is not the only thing that companies in America care about (A large majority do, I admit).<br /><br />Either way, if they were negligent then they will get sued.  Pressure to do good, no?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />This is true. However, control over a company is primarily held by shareholders - and shareholders want money. Many people (even as high as the president or CEO) may disagree with company policy, but don't have the power or support to change it.<br />[hr][/quote]<br />CEO's and their staff pretty much control the corporation.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Technically, they could change it; our Queen technically has authority to seize land and block laws approved by Parliament, but I don't see her sticking around for long if she ever decides to use those powers.<br />[hr][/quote]<br />Indeed.  There would be a revolution at hand if that ever happened.  But a revolution would not happen if a CEO demanded a change in policy.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Not if there's no competition - and our private sector has next to none. Look at big telecoms in America; most of them have shoddy customer service, high prices and have stifled most of their competitors.<br />[hr][/quote]<br />I could go through an entire lecture on how a majority of the price is because of the government.  As far as I know, you are in no place to say that it is shoddy.<br /><br />I have not received shoddy healthcare.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Perhaps the best system would be one like they have in France: you have to pay for healthcare, but the government will pay for you if you don't have health insurance. And, AFIAK, France's healthcare is much better than in the UK or the US.<br />[hr][/quote]<br />I suppose, but France is a welfare state --something America will never fully espouse, methinks.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26302,
		"title": "Re: Does your country have free health care?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-02-26T01:08:58.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Either way, if they were negligent then they will get sued. Pressure to do good, no?[hr][/quote]<br />This is true, although it didn't occur to me when I was writing my argument because our legal environment is somewhat distanced from America's lawsuit culture. (We're not quite so big on consumer litigation yet, but \"no win no fee\" legal firms have certainly helped its popularity)<br />[quote]<b><i>Quote:</i></b>[hr]As far as I know, you are in no place to say that it is shoddy.[hr][/quote]<br />Again, this is true. I do sometimes rely too much on anecdotal evidence, even when there is an abundance of it.<br />[quote]<b><i>Quote:</i></b>[hr]CEOs and their staff pretty much control the corporation.[hr][/quote]<br />Yes, but shareholders still own the corporation. If the CEO or their staff makes changes the shareholders don't like, the shareholders will fight back. (They might not win, but they'll certainly make a mess)<br /><br />I think this is one of the most important points:<br />[quote]<b><i>Quote:</i></b>[hr]But I was talking about America.[hr][/quote]<br />Obviously, many things differ between Britain and America: the system of government, the attitudes towards taxation and religion and personal rights, the sheer size of American corporations and the very different labour market. It is quite possible that private healthcare suits Americans and America as a whole quite well, and that there are corporations who can and do provide a high quality of service. (This appears to be the case from what you have told me.)<br /><br />Since a large number of both of our arguments don't apply to both sides of the Atlantic, I won't get very far by debating further; so I will accept that wholly government-funded healthcare is not always appropriate. However, I wish to state one more of my opinions: that someone (maybe governments, maybe NGOs) should make sure that all citizens can afford a decent standard of healthcare. After all, it is a [url=http://www.un.org/Overview/rights.html]basic human right[/url].<br /><br />Wow, it sure gets tiring standing up on this soapbox for so long... Thanks for reading! (Even though you probably couldn't be bothered, you lazy people :P)<br />[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url] | 2 pence an hour for godawful tech support job... [url=http://www.jobsite.co.uk/cgi-bin/vacdetails.pl?selection=915675807]yes please![/url]"
	},
	{
		"id": 26303,
		"title": "Re: Does your country have free health care?",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-01T03:18:14.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />This is true, although it didn't occur to me when I was writing my argument because our legal environment is somewhat distanced from America's lawsuit culture. (We're not quite so big on consumer litigation yet, but \"no win no fee\" legal firms have certainly helped its popularity)<br />[hr][/quote]<br />I do not support our current level of law suits, but having a few now and again helps keep companies in check.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Yes, but shareholders still own the corporation. If the CEO or their staff makes changes the shareholders don't like, the shareholders will fight back. (They might not win, but they'll certainly make a mess)<br />[hr][/quote]<br />Not even.  The most that will happen is that the stockwill go down.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Obviously, many things differ between Britain and America: the system of government, the attitudes towards taxation and religion and personal rights, the sheer size of American corporations and the very different labour market. It is quite possible that private healthcare suits Americans and America as a whole quite well, and that there are corporations who can and do provide a high quality of service. (This appears to be the case from what you have told me.)<br />[hr][/quote]<br />Some what, but their are large problems with the <i>over</i> excessive use of law suits, which needs to be curbed, but, yes, on the main that is the gist of my previous arguement.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Since a large number of both of our arguments don't apply to both sides of the Atlantic, I won't get very far by debating further; so I will accept that wholly government-funded healthcare is not always appropriate. However, I wish to state one more of my opinions: that someone (maybe governments, maybe NGOs) should make sure that all citizens can afford a decent standard of healthcare. After all, it is a basic human right.<br />[hr][/quote]<br />Yeah, that never helps too much.  Now it's time for my speach on why government involvement in the economy always does bad things:<br /><br />Cost of Healthcare:<br /><br />1. Drugs.  We spend approxomately 5-12 years making and testing a new drug so the FDA can give it the sticker of approval (AKA, you <i>might</i> not die from taking this drug).  This generally costs high millions to billions on <i>a</i> new drug.  Obviously, the company is not going to lose the money, so they take tose expenses out on the buyer.  Which, all sounds necessary until you realize that millions of people could be helped <i>now</i> with the drug than 10 years from now dead (The actual statistics done by the Cato Institute have shown that more life has been lost by potential drugs than to possible allergic reactions)<br /><br /><br />2. Monitered practice.  The AMA moniters and restricts how many doctors there are in one field at a given time.  This always puts doctors in demand, and always allows them to get the maximum amount of money from the patient.<br /><br /><br />3.  Law suits.  I know I said that the previous lawsuits provide incentive to do a good job, but in the current legal atmosphere doctors 'make no accidents'.  Everything is intentional, and therefore suiable.  This causes the doctor's mal-practice insurance to go through the roof.  Who do you think pays for it?  Want to know the kicker?  Lawyers probably get around 30%-50% of the money made by the lawsuit.  (This also gets into why companies throw up their prices every time they get sued --who do you thinks going to pay for it, them or you?)<br /><br /><br />So when you ask me whether we should have National Healthcare, forgive me while I remain skeptical.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26304,
		"title": "Hmm...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-01T03:41:30.000Z",
		"content": "[hr]<b>LoGlo</b> over excessive<br />[hr]Hehe.<br /><br />[hr]<b>LoGlo</b> 1. Drugs. ... Which, all sounds necessary until you realize that millions of people could be helped now with the drug than 10 years from now dead<br />[hr]Or even better, without those drugs through the means of <i>real</i> medicine. Alas, since natural therapies cannot be trademarked, it's not as profitable to take the humane approach.<br /><br />[hr]<b>LoGlo</b> (The actual statistics done by the Cato Institute have shown that more life has been lost by potential drugs than to possible allergic reactions)<br />[hr]Life lost by 'potential drugs'? Possible allergic reactions? What does that even mean? Smells like rhetoric.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 26305,
		"title": "Re: Hmm...",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-03-02T02:16:42.000Z",
		"content": "we have free health care in australia, don't know about new zealand, maby TMST can tell us if he comes across this topic, only problem is that he doesn't come here much anymore, maby antoher kiwi can tell us?[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 26306,
		"title": "Re: Hmm...",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-03T00:10:14.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]--------------------------------------------------------------------------------<br />LoGlo over excessive<br /><br />------------------------------------------------------------<br />--------------------<br /><b>Spleen[/i]<br />Heh</b>[hr][/quote]<br />Nice.  I made a grammatical error and you caught it.  Want to try a bone?<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LoGlo 1. Drugs. ... Which, all sounds necessary until you realize that millions of people could be helped now with the drug than 10 years from now dead<br /><br />--------------------------------------------------------------------------------<br />Or even better, without those drugs through the means of real medicine. Alas, since natural therapies cannot be trademarked, it's not as profitable to take the humane approach.<br />[hr][/quote]<br />I really cannot understand incoherent statements.  Would you mind rephrasing your argument using your full ability of the English language?<br /><br />Really, you complain about my grammer when your first sentance is a nonsensical fragment?  And then you take a stance without explaining?<br />[quote]<b><i>Quote:</i></b>[hr]<br />--------------------------------------------------------------------------------<br />LoGlo (The actual statistics done by the Cato Institute have shown that more life has been lost by potential drugs than to possible allergic reactions)<br /><br />--------------------------------------------------------------------------------<br />Life lost by 'potential drugs'? Possible allergic reactions? What does that even mean? Smells like rhetoric.<br />[hr][/quote]<br />Smells like you wouldn't know either way.  Try doing some research.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26307,
		"title": "*continues commenting*",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-03-03T02:47:19.000Z",
		"content": "You seem to have misinterpreted my tone once again. I'm indifferent to this discussion, and felt like commenting. I found your grammatical error amusing, so I laughed. I do things like that. There was no complaining, nor arguing. *shrugs*<br /><br />[hr]<b>LoGlo</b> Would you mind rephrasing your argument using your full ability of the English language?<br />[hr]It's in context. In a conversation, it would fit, and I prefer to treat these posts as conversation. Formality is a waste of effort.<br /><br /><i>millions of people could be helped now with the drug than 10 years from now dead</i><br /><i>Or even better, [could be helped] without those drugs through the means of real medicine.</i><br /><br />I could've picked on your 'than 10 years from now dead' which doesn't make syntactical sense either, but I understood what you meant, and it wasn't entirely comical so it didn't make me laugh.<br /><br />[hr]<b>LoGlo</b> And then you take a stance without explaining?<br />[hr]I didn't feel like explaining. I felt like commenting. What I was getting at is that a large portion of \"modern\" medicine *cough* is misguided and inefficient when compared to the myriad of natural therapies that have been available and in wide use for practically the entire documented history of humanity.<br /><br />I could explain further, but I don't feel like it.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	}
]
