[
	{
		"id": 825,
		"title": "Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-23T22:03:44.000Z",
		"content": "Holy cow, you people really don't post much, do you?  Even all the smallest forums I've been to, ones with only 25 active members, we've pulled in more posts.  In short, I don't think PCKF is livining it up like it could.<br /><br />I think this site could use some new graphics, new forums, and (lmao) a new server.<br /><br /><br />I mean, you can get cheap servers for small forums like this, can't you?  I know Naj was talking about that.  Does anyone else know what I'm talking about?<br /><br /><br />We could just make this a bit of a nicer site.  I think some more modern gamer-type graphics could add some interest and catch people's eyes.<br /><br />We need more activity.  The Misc. and Misc. Polls forum just isn't cutting it in my opinion.  I mean, we could atleast draw from other things like: Graphics, debate and discussion, Social lounge, Newbie introduction (Maybe, kind hard since we get like only 2 new members a year), video gaming, movies/pop culture, and much more if we wanted.<br /><br />I mean, there's a lot of activity we could have becides just sitting here watching this forum rot.<br /><br /><br />(Just a thought.)<br /><br /><i>EDIT: I know I'm talking abotu a lot here, but Jesus, can't we do something?</i>~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21177,
		"title": "Re: Inactivity.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-23T22:19:11.000Z",
		"content": "Yeah, we need more activity, and I believe autumn/winter will bring some of that back again. At summer there's always less happening in this forum.<br /><br />Anyways. If people don't seem to post enough even in these few off-topic areas, more of them might not be the solution. I think we have enough them. More than this would make the forum look a miscellaneous board with a few Commander Keen sections. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Afterall, this is a Keen forum, and not a general chit chat forum.<br /><br />However, agree on new graphics. I'd like a fresh design again, more emotikeens, and such. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21178,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-23T22:21:14.000Z",
		"content": "Well, that too.<br /><br /><br />But I was talking about a Graphics forum.  Maybe even a programming forum would work well, too.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21179,
		"title": "Re: Inactivity.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-23T22:28:28.000Z",
		"content": "Those different forums are good ideas, in a way; different topics interest me, but what about the majority? I don't think most would care about a programming forum, for example. There'd be only a few replies in every forum. And then the quality.. There are many forums especially dedicated to programming. One couldn't necessarily find that much expert advice from programming section of PCKF..<br /><br />Naturally we want people to discuss stuff, but we don't (as far as I know) try to attract the non-Keening audience with different sub-forums. (Not that many would join if she/he didn't care about Keen.)3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21180,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-23T22:35:47.000Z",
		"content": "Right, we'd have to range-cast a bit, but it wouldn't be too hard or too much hastle.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21181,
		"title": "Re: Inactivity.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-24T01:54:09.000Z",
		"content": "Well, I dunno if we *have* an activity problem; the PCKF has never been popular, but nor  has it shown any tendency to dwindle to nothing. We're remarkably stable as a community, and rather diverse. I like the place *bacuse* its quiet enough and not bloated with useless junk.<br /><br />That aside we should encourage and welcome new members and aid them in any keen way possible.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21182,
		"title": "Re: Inactivity.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-06-24T03:32:30.000Z",
		"content": "I agree with Levellord unless they are like Harvey and or Naj. Then I want to take out a .357 Mag.<br /><br />But yea... I think we all are more busy. And a lot of us have important things to do and don't necessarily have an hour or two to spend on the PCKF replying to some topic about God.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21183,
		"title": "Re: Inactivity.",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-06-24T05:00:11.000Z",
		"content": "What was wrong with najawa? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />[hr]<br /><br />The yorp shalt inherit the mars"
	},
	{
		"id": 21184,
		"title": "Re: Inactivity.",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2006-06-24T08:38:39.000Z",
		"content": "yea the board can use a new look the last time it hapend was 3-14-03 iirc and i hope that pckf moves soon to another board[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 21185,
		"title": "Re: Inactivity.",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-24T08:45:40.000Z",
		"content": "Commander Keen is simply a moderately popular old game. Unless you re-make the game and the forum your not going to get many more people joining. Instead people leaving."
	},
	{
		"id": 21186,
		"title": "Re: Inactivity.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-24T10:40:23.000Z",
		"content": "We would have moved already - but as pointed out [url=http://p072.ezboard.com/fpubliccommanderkeenforumother.showMessage?topicID=2382.topic&index=7]here[/url], chogall still owns the PCKF and keeps renewing our ezBoard subscription, and attempts to contact him so far have failed."
	},
	{
		"id": 21187,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-24T14:57:22.000Z",
		"content": "So, then let's start working on a new CK forum.<br /><br /><br />And, you guys are missing what I'm saying.  I'm not saying we are going to get more members --but more activity.<br /><br />I mean, there's very little reason to post on here.  We need specific forums and specific topics.<br /><br /><br />A lot of us do graphics, don't we?  Then wouldn't a graphics forum give people something to post about?<br /><br />People program, and could use some programming help for the various programming we do --that would be a help, no?<br /><br /><br />But like I'm saying, there is a lot of things we could be doing to increase activity.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21188,
		"title": "Re: Inactivity.",
		"author_id": 1486368,
		"author_name": "DSL",
		"timestamp": "2006-06-24T16:47:00.000Z",
		"content": "maybe with the new Multimedia Fusion and TGF we will see lots of new fan creations!<br />that's what i'm hoping for!<br /><br />i'm going to start on something once i get my hands on MMF2...<br /><br />but i'm not very much active here besides that, since the ezboard haxx most of the activity is gone here..."
	},
	{
		"id": 21189,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-24T17:26:43.000Z",
		"content": "Maybe.  But like I said, a graphics and programming lounge would do a lot for fangames and such, wouldn't it?<br /><br /><br />And also, I think a homework forum might help.  (Just spit-balling here.)~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21190,
		"title": "Re: Inactivity.",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-06-25T03:39:09.000Z",
		"content": "How is the ezBoard subcription?  Hosting and domain name are cheap as chips these days...<br /><br />edit: I see pckf.com already redirects to here.  Why not use that domain name then?  Hosting = ~40US a year for 5GB of space and 250GB transfers a month.  I doubt we need more for forums.Wombat is my little donation to all the crazy people who do stuff with old games.  [url=http://www.szevvy.com]www.szevvy.com[/url]"
	},
	{
		"id": 21191,
		"title": "Re: Inactivity.",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-25T10:06:32.000Z",
		"content": "I agree we need more sections. It would be really nice to have a commander keen forum which also has a modding section so we can get the most amount of people in here.<br /><br />Most importantly we need to make a specific section dedicated to all the files and stuff for commander keen. Kind of like spatang only integrated into the forum somehow."
	},
	{
		"id": 21192,
		"title": "Re: Inactivity.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-06-25T10:28:22.000Z",
		"content": "We are currently paying $5 a month for this community to remain a Gold Community, which wouldn't be so bad if ezBoard wasn't a buggy piece of crap with a very restricted feature set."
	},
	{
		"id": 21193,
		"title": "Re: Inactivity.",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-06-25T11:44:00.000Z",
		"content": "Hosting costs $4 a month.  Need I say more?Wombat is my little donation to all the crazy people who do stuff with old games.  [url=http://www.szevvy.com]www.szevvy.com[/url]"
	},
	{
		"id": 21194,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-25T19:23:15.000Z",
		"content": "Nah, there are plenty of free hosting sites that are a hell of a lot better than Ezboard.<br /><br /><br />And LL, you are completely missing my point.  I'm not talking about spam --I'm talking about new forums to bring new posts.  If you don't like those forums, don't go to them.  But it would, at bare minimum, attract back some of our older members.<br /><br />But my point still stands, LL, that it's not going to bring spam.  (Spam, hell, have you seen Misc. Polls?  That's freaking Spam fest 101)  It should, if done correctly, bring about a fresh angle to this forum, and everyone will get to see a fresh side of everyone else.<br /><br /><br />So if Cho'gall doesn't care about this forum anymore, shouldn't we try to start a sister site/forum?  Atleast it would be a place to go.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21195,
		"title": "Re: Inactivity.",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-06-25T20:52:05.000Z",
		"content": "We shouldn't wait for Cho'gall to stop paying before moving. We should move FIRST. That way, theres no in-between period where there isn't a forum.<br />I also think PCKF should fuse with K:M. It'd just make things SO much easier. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 21196,
		"title": "Re: Inactivity.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-26T03:25:34.000Z",
		"content": "Eh, whatever. I'm along for the ride.<br /><br />K:M is doing fine by itself, its a family hosted forum.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21198,
		"title": "Re: Inactivity.",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-06-26T03:37:34.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I also think PCKF should fuse with K:M. It'd just make things SO much easier.[hr][/quote]<br /><br />I'm not too sure about that. The PCKF allows some things which wouldn't be in K:M. This isn't nessecarily a bad thing, since K:M's focus on modding makes for some good dicussion, as well as good mods.<br /><br />At any rate, I quite like two seperate sites for seperate needs.<br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 21199,
		"title": "Re: Inactivity.",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-26T05:17:27.000Z",
		"content": "i disagree. If you want to talk about modding you can just click on the modding section. Else youll click on what ever, no need to separate anything. Thats why we have so little people.<br /><br />We need everything under the one roof. Maybe Xtra can make a forum from his site.<br /><br />Otherwise i could make a forum, i got 1.2GB space and unlimited bandwidth [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 21200,
		"title": "Re: Inactivity.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-26T15:36:30.000Z",
		"content": "I disagree as well... and agree with Alex.<br />One big forum would be easier... make for a more tight community.<br />Well, potentially, since the playing and modding community are pretty much the same right now anyway.<br /><br />[quote]<b><i>Quote:</i></b>[hr]\"The PCKF allows some things which wouldn't be in K:M.\"[hr][/quote]<br /><br />Are you talking about ezboard vs (...checking...) phpBB?<br />Because I don't think ezboard can do anything phpBB cannot... do.<br /><br />If you're talking about the actual forum, then it's not the case, because the K:M forum would be renamed to something different, maybe PCKF, maybe something else completely, and the original K:M content would turn into a sub-forum there, just like the content now in the PCKF.<br />At least, that's the way I envision it, and I think the way the rest does as well.<br /><br />I also wouldn't mind and art and programming sub-forum.<br />With disk space in mind, it's probably not a bad idea per s to clean out old threads every now and again either.<br />Most threads aren't that important anymore after a while, and if they are, they can be saved on an individual basis.<br />Perhaps someone is willing to backup everything on CD every now and again, in case someone wants to see something old again.<br /><br />I personally believe the really important stuff is better off on an old-fashioned website or a wiki than a forum.<br />Forums are made for discussions, are dynamic by definition.<br />Sort of strange, actually, that nobody started a Commander Keen wiki yet.<br />Well, there's the Keencyclopedia of course, but that's only about the actual games, enemies, items, nothing much about story-pieces, technology, etc..<br />OK, getting way off-topic here, so I'll stop. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 21201,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-26T16:33:11.000Z",
		"content": "So, let's hold a tally then, shall we?<br /><br /><br />If the majority says we should move onto a new forum, then let's all get on MSN at some specified hour (We'd have to tell our time zones and all to make sure it was the best time possible.), and decide the future of this forum.<br /><br />I'm not saying this new forum will work, but it might work very well.<br /><br /><br />*creating poll*~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21197,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-26T20:39:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br /><b>LL:</b><br /><br />Well, I dunno if we *have* an activity problem; the PCKF has never been popular, but nor has it shown any tendency to dwindle to nothing. We're remarkably stable as a community, and rather diverse. I like the place *bacuse* its quiet enough and not bloated with useless junk.<br />[hr][/quote]<br /><br />Wrong.  I thought you were right at first, but then I looked at Official Keen Games subforum.  It shows that there were atleast these many members crossing our shores in the last 6 months:<br /><br />Sanitars<br />Toni<br />Damien SR<br />Lititude<br />Stipe<br />ecner260<br />yorphead<br />pat2020<br />afgncaap5<br />calenae<br />PhiL6666<br />andrewmarrero<br /><br />The first list contained 13 names.  That's approx 2 members a month.  That's not bad at all.  They might not stay, but it certainly means there is a semi-active member pool that we aren't giving them something to chew on.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21202,
		"title": "Re: Inactivity.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-26T21:27:05.000Z",
		"content": "\"Sort of strange, actually, that nobody started a Commander Keen wiki yet.\"<br />I've been planning to do so for a long time.. You shouldn't have said everything out loud! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21203,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-26T21:46:25.000Z",
		"content": "lol, well, no matter what... Commander Keen still has a bright future.<br /><br /><br />There are many old gaming fans out there, there are kids who are coming to like Commander Keen, and there are people who just like bs'ing in OT that can be a bit of fun.<br /><br /><br />So I think it is erronious to say that CK is dead and we aren't getting activity because no one is interested.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21204,
		"title": "Re: Inactivity.",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-27T02:10:18.000Z",
		"content": "I think we should get a new forum up and running as soon as possible before it could be too late.<br /><br />It'd be nice to see a new theme UI for the forum and have every needed section. Most importantly, people will want to join and be inspired to continue on their work [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 21205,
		"title": "Re: Inactivity.",
		"author_id": 1486970,
		"author_name": "Yorpy.e",
		"timestamp": "2006-06-27T15:04:32.000Z",
		"content": "oy you people, making a new forum with a million sub forums isn't going to make new people magically appear.  If anything you'll spread things even more thin than they already are.<br /><br />It's summer, people are out doing things, more people will be around in the fall[img]http://public.clunet.edu/~ebuckle/yorpylogo.jpg[/img]"
	},
	{
		"id": 21206,
		"title": "Re: Inactivity.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-06-27T15:15:29.000Z",
		"content": "Agree with Yorpy (nice to see you again, btw [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  ). As I've said before, I don't want any misc-posters but Keeners.. New members should join because of quality Keen posts and stuff, and not because some miscellaneous sub-forums. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]   Not that we need any new members, the old ones should just get something done. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]  (Where's my Keen 3 mod? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  )3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21207,
		"title": "Re: Inactivity.",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-27T16:15:01.000Z",
		"content": "Well, an artist that's good at drawing and happened to draw something Keen-related, isn't a Keen fan per se, but still somebody that could add to the community.<br />Someone that's good at programming that feels like hanging out somewhere, maybe helping others along the way isn't a bad thing to have in a forum either.<br />People liking retro gaming in general, not just Keen...<br />I'm sure there are more examples.<br />More members wouldn't be a bad thing.<br /><br />More random people shouting random stuff would, I agree.<br />Read my post in the poll thread; I do not think lots of unrelated forums are wanted either.<br />Right now the community is small enough that with around 10 forums everything is easily overseeable.<br /><br />Of course that'd probably be moreso with phpBB or similar, since I'm pretty confident in saying more people are used to that.<br />It's easy to subscribe to threads if things get busy, so you are alerted to interesting stuff, so you can ignore the rest.<br />People might even be \"scared\" of ezboard, since it's relatively different from the norm, not to mention the screwy Search feature and other annoyances.<br /><br />OK, I'm bored writing now.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 21208,
		"title": "Re: Inactivity.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-27T16:25:25.000Z",
		"content": "Right Reto...  That's what I'm talkign about.  People are thinking that I'm trying to create 15 billion different sub-forums.  I'm not.  I'm trying to create a more focussed areas than \"Miscillanious\".  That's not organized, you guys.  I'm only talking about organization.<br /><br /><br />Yorpy and the rest: I'm also not talking about non-Keeners.  (However retro gamers should be welcome too.  It's hardly like we only discuss Keen, right?)  And that aside, I just mentioned 13 people who in the last 6 months have passed on to just discuss pure Keen topics.  There's a crowd out there who will support Keen, or will atleast post a few times a month for some fun.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21209,
		"title": "Re: Inactivity.",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-06-27T21:38:58.000Z",
		"content": "Keen's an old game, with no new games being made, it's inevitable that the forum will dry up and die, you might as well accept it. That doesn't mean you shouldn't put it on life support, but moving it from the hospital to a shiny new office building won't prolong it's lifespan, if anything, it'll shorten it."
	},
	{
		"id": 21210,
		"title": "Re: Inactivity.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-06-28T05:55:49.000Z",
		"content": "I have to agree.<br /><br />We'll be a long time in dying though.<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21211,
		"title": "Inactivity",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2006-06-28T06:02:35.000Z",
		"content": "I'll agree too.<br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 21212,
		"title": "Re: Inactivity",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-06-28T08:53:10.000Z",
		"content": "Hmmm, most other old-but-still-popular games are more recent than Keen I think, so I can't really compare it to much.<br />Still, id might just turn the games freeware, or better yet, release the source code, and that might just breathe some new life into the thing.<br />That's one of the reasons why something like Doom is still popular actually.<br />It's playable on recent systems, including things like PDAs (I think, and if not it will be soon enough), with new features like a lighting and physic engine possible, as well as the ability to go beyond using custom art, levels, and even total conversions.<br /><br />Since Keen didn't make such a big impact as Doom though, the breath of life will be smaller compared to Doom's source code release.<br />Also, perhaps id will never release the source code; who knows!<br />Still, I'm an optimist! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 21213,
		"title": "Re: Inactivity",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2006-06-28T15:33:58.000Z",
		"content": "John Carmack can't find the keen source, or it'd be out already. (and for that matter, Romero doesn't have it either)"
	},
	{
		"id": 21214,
		"title": "Re: Inactivity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-28T16:41:10.000Z",
		"content": "I have to disagree eK.<br /><br />I just pointed out how 13 ne members have come here in the last 6 months.  That's not altogether all the bad.<br /><br /><br />And also, if we 'make it more shiny' --which is not at all what I'm talking about-- then atleast we would have some new things to post about than our already beaten to death topics.<br /><br /><br />I know this forum is going to dry up and blow away sooner or later, but I'd prefer later than sooner.<br /><br /><br />We can get some new members (Hell, I have a friend online who I talk to about Keen on occasion, which could make her a 14th member) by just making this forum look like it's not a relic from the late 90's.<br /><br /><br />Asthetics does mean quite a bit, eK.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21215,
		"title": "Re: Inactivity",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2006-06-28T17:59:45.000Z",
		"content": "If we create a whole bunch of Generel sections and other stuff, sure It would bring more members but the board would lose its \"soul\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 21216,
		"title": "Re: Inactivity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-28T21:31:07.000Z",
		"content": "No it wouldn't.  It's not like all of a sudden Keen would cease to exist and then we'd start only posting OT spam.<br /><br /><br /><br />EDIT: A new member just crawled in here, making our 6 month member period increase to 14.  Still think there's no member base out there?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21217,
		"title": "Re: Inactivity",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-06-29T01:47:42.000Z",
		"content": "<b>Well if we're not going to move then at least update this forum. Change the design, the theme, add more sections. Just do somthing.</b><br /><br />It would be really nice to not have to leave the pckf just to see/talk about mods."
	},
	{
		"id": 21218,
		"title": "Re: Inactivity",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-06-29T16:21:56.000Z",
		"content": "I agree.  Hence why we need a Keen Mods section.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21219,
		"title": "blah",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-06-29T17:09:07.000Z",
		"content": "Back when Modding first became a possibility, there was still a stubborn and active fangaming community here, and there was a bit of a tear regarding whether or not \"mods\" counted as \"fangames.\"  Those who favored fangames said that 'using the official engine disqualifies it from fangame status!' while those who favored mods argued 'you can't get much more fan-based than breathing new life into the original!' ...in the end, the mods became a part of \"Other Keen Stuff\" while 'officially unofficial' fangames sat in the \"Unofficial Keen Games\" area.<br /><br />Since click'n'play and all its bretheren have mostly winked out, and the community in general disapproves of the sub-standard quality presented by fangames of that sort, what's wrong with KeenMods being a part of the Unofficial section?<br /><br />K:M arose because some of the mods at this board were unimpressed with the numerous \"How do I get started?  What do I need?  Can I get a patch to do this?\" kind of questions which were flooding \"Other Keen Stuff\" for a while.  Andy set up K:M so that those who were only interested in Keen from an original-game basis wouldn't be subjected to the modding community."
	},
	{
		"id": 21220,
		"title": "Re: blah",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-06-30T02:31:46.000Z",
		"content": "K:M and the PCKF should be separate.<br /><br /><b><font color=\"OLIVE\">B</font></b><br /><br />I think they should be brought a little closer together. More like sister forums that go hand in hand.<br /><br />I know it is at the top of the page but K:M barely gets mentioned here at all in posts.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21221,
		"title": "Re: blah",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-07-02T04:23:06.000Z",
		"content": "I think a Modding forum couldn't possibly hurt this forum, lmao.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21222,
		"title": "Re: blah",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-07-02T10:18:00.000Z",
		"content": "Since Spleen's computer won't let him access the PCKF, I'm posting this message for him:<br />[quote]<b><i>Quote:</i></b>[hr]<b>Commander Spleen</b> One thing I've long understood (but am only just beginning to live on a day-to-day basis) is that circumstances are not the cause of our problems. If you're in the right frame of mind, like I am right now, even things like ezBoard and IE (which I'm forced to use on this machine due to a strange quirk whereby Firefox refuses to add new posts to the PCKF) cannot stand in your way.<br /><br />However, a more convenient interface would always be quite welcome, and it'd be kinda nice if we could access it via an RSS feed or something--I much prefer managing things from separate programs as oppposed to within a browser window. I'm still completely in favour of moving to a new forum, despite the problems it may cause in the short term.<br /><br />I don't see how creating a pile of new miscellaneous forums could help things. The main thing I think this community needs is a central website for keeping track of news, releases and whatnot, basically summarising the events that take place on the forums for those who feel they don't have the time to sift through the myriad of posts that build up after a week or two. KeenRush and I were discussing such a possibility earlier this year, but he's been busy with other projects and I've not the skills to create it.<br /><br />A new forum would make this much easier, but it would be possible to do this with the existing ezBoard. We could give several of the most active Keeners news posting rights, and each news item would include links back to, along with quotes from, the relevant threads. It'll also be easy to do a Keen Newsletter, since all the news would already be gathered.<br /><br />If anyone's up for the challenge, we could hold a discussion on MSN/AIM/Jabber sometime.<br /><br />I'll stick to my previous vow to keep out of the 'scene is dead' debate. Most of you should know my opinion already.[hr][/quote][url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 21223,
		"title": "Re: blah",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-07-02T17:47:47.000Z",
		"content": "I think the thing is half the forum is about modding, and many people (like myself) are just keen fans who dont mod(so they can't discuss it) and just want to download the game.<br />  I don't think the problem is its an old game (I've been to some very active King's Quest sites, as that is one of my favorite games as well)  but that what is their to talk about Keen?  I mean its a sidescrolling, arcadish game.  Its not like you can talk a whole lot about the plot or characters or anything.  You can just about only talk about the enemies and the environment, as well as the moves Keen does.<br />Oh, and i'm not trying to put down keen by any means.<br />  That being said, one thing that would bring me more (myself being a rather irregular member) is trying to discuss more in the official games forum.  More conversation and polls about who the best villains are, your favorite keen, what the coolest keen moves are, and soforth."
	},
	{
		"id": 21224,
		"title": "Re: blah",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-07-02T19:29:17.000Z",
		"content": "I think the central website idea is a good one.  I think we DO need to be all under one roof.  Dos Classics, PCKF, and K:M all need to come together. People find things like Dos Classics and find a very unactive forum and think thats all thats left of keen, but there are tons of mods, games, etc.  We are too far spread out.  We need to come together and have a central place for all things Keen. I think it will bring keen fans together, and make a central place which is easy for people to find and understand. [img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 21225,
		"title": "Re: blah",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2006-07-02T20:19:59.000Z",
		"content": "Yeah, I think that's a real good idea.  Or even just K:M and PCKF would be ok."
	},
	{
		"id": 21226,
		"title": "Re: blah",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-07-11T16:18:09.000Z",
		"content": "The ideal setting for this board would be to have it integrated with the system I designed for fangames, mods, reviewing, etc I've designed at dosclassics, especially since nobody really uses that right now.<br /><br />Maybe I'll do that sometime this summer.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21227,
		"title": "Re: blah",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-07-12T02:50:49.000Z",
		"content": "That would be a very tasty plan indeed. DOS Classics and the PCKF are far too distant right now."
	}
]
