[
	{
		"id": 770,
		"title": "Goodbye.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-09-23T15:45:11.000Z",
		"content": "I have just finnished a wonderfully depressing conversation with KeenRush and am utterly out of it right now. Basically I am leaving the Keen community for I frankly don't know how long.<br /><br />I shan't be on MSN, though you might contact sarah via it, I don't know what I'm going to be doing the next few days, I really don't. I'm probbably not thinking straight, and I'm sure I'll probbably regret doing all of this stuff if I sat down for half an hour, but frankly I can't be fucked.<br /><br />I'd just like to say that several of you people are assholes.<br /><br />Thankyou, and goodnight.Szevvy Forever!<br />And Spleen never!<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 20032,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-09-23T15:54:19.000Z",
		"content": "Fucl, don't be so stupid! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img] <br /><br />Please! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20033,
		"title": "Re: Goodbye.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-09-23T16:47:02.000Z",
		"content": "Wow, so <b>that's</b> why you said \"piss off\" when I tried talking to you... Ah well, hope you'll get over it soon then. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20034,
		"title": "Re: Goodbye.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-09-23T17:30:43.000Z",
		"content": "LL, you might doubt it but I have always some respect for you but....<br />[quote]<b><i>Quote:</i></b>[hr]I have just finnished a wonderfully depressing conversation with KeenRush and am utterly out of it right now. Basically I am leaving the Keen community for I frankly don't know how long.[hr][/quote]<br />...this sound like you blame Keenrush for your depature and want to make him feel guilty or let other people think he is. I don't have a clue what's going on here but it would have been fair if you said what your problem with him is instead of putting it like this.<br /><br />Anyway, I suspect you showing up sometimes within the next days saying (or just pretending) that it was another joke.<br /><br />If not, farewell and all the best.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20035,
		"title": "Re: Goodbye.",
		"author_id": 1485864,
		"author_name": "szevvy",
		"timestamp": "2006-09-23T17:36:25.000Z",
		"content": "Sweetheart, if you don't come back I'm going to going to go nuts; at least tell me what's going on.  You know how much I care about you and it would really be unfair on me and the rest of the people here if you did this.------------------<br />[url=http://www.szevvy.net]www.szevvy.net[/url], for all your Wombat needs.  You know you want to.<br />A member of the LevelLord fan club."
	},
	{
		"id": 20036,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-09-23T18:51:51.000Z",
		"content": "Well, I never save conversations but did an exception today, and saved it, just in case -- although I'm not going to post it..<br /><br />Anyways, I don't believe it was my fault at all (even if LL tried to imply something like that in her post, which I'm sure she didn't), she had already set her mind to leaving, and everything seemed to be too late to change, when I asked is there anything to do to make her stay. She basically complained how nobody does anything, how everyone is just so damn lazy and can't get anything done. That people don't create Keen stuff. Or something like that, I'm sure I didn't understand her point 100% correctly, still. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  <br /><br />It is, indeed, damn sad. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  And a bit unreasonable thing to do, in my opinion. We can only hope she'll be back soon, or some day.<br /><br />Edit: I removed two emoticons to make my post look better..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20037,
		"title": "Re: Goodbye.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-09-23T23:18:17.000Z",
		"content": "Which of LL's personalities is leaving? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  I hope at least one of the others sticks around.----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20038,
		"title": "Re: Goodbye.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-09-24T19:01:43.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]She basically complained how nobody does anything, how everyone is just so damn lazy and can't get anything done. [hr][/quote]<br />This only crossed her mind just recently? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] <br /><br />I tell you it's worse, nobody even cares when someone got something done. So why bother doing anything at all?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20039,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-09-24T22:34:45.000Z",
		"content": "\"I tell you it's worse, nobody even cares when someone got something done. So why bother doing anything at all?\"<br />Well, that's bad, people care less these days, but there are still at least few people that do care! Why to bother doing anything at all applies to anything else as well.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20040,
		"title": "hmm.",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-09-24T23:58:11.000Z",
		"content": "Well, I hope she comes back someday.  I spent like an hour and a half getting that Keen4 sprite stuff she requested figured out!"
	},
	{
		"id": 20041,
		"title": "Re: hmm.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-09-25T16:37:36.000Z",
		"content": "Only 9 replies in two days? Poor LL. The Keen community is not what it used to be. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20042,
		"title": "Re: hmm.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-09-25T18:37:59.000Z",
		"content": "Of which three of yours...<br /><br />I hope she isn't going to stay away for too long. She always brought in a lot of the fun on these forums...____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20043,
		"title": "Re: hmm.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-09-26T01:50:24.000Z",
		"content": "I guess she had a falling-out with her co-workers on that new upcoming webcomic she announced a while back. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 20044,
		"title": "Re: Goodbye.",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2006-09-27T00:32:10.000Z",
		"content": "Where did 2000-2004 go? Those days flew by so fast[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img] <br /><br />Yes things have changed, but cherish the past[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-poisonslug.gif[/img] <br /><br /><br /><br />--<br />NicksSoftware (Games, Games, Games)<br />[url=Http://www.NicksSoftware.tk]www.NicksSoftware.tk[/url]"
	},
	{
		"id": 20045,
		"title": "Re: Goodbye.",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2006-09-27T05:04:24.000Z",
		"content": "Reading this topic makes me feel bad.<br /><br />Now theres one less person to reply.<br /><br />Sadness...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]   <br /><br />I joined this forum to make new keen patches, nobody was going to do it, and so I did.<br /><br />After that I did more though, making posts and replying about things never thought of before.<br /><br />LevelLord00 replies were both humorous and informative or sometimes just humorous.<br /><br />Goodbye LevelLord00, come back some day."
	},
	{
		"id": 20046,
		"title": "Re: Goodbye.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-10-01T17:02:15.000Z",
		"content": "Well, if her reason for leaving was because everyone around here is fucking lazy, complacent, and generally not caring about Keen anymore then hell yes she's got a point.<br /><br />The leading Admins don't even give a shit about this community anymore... I tried to get people interested in revamping the forum, and all the staff basically said was, \"Yeah, we don't really give a shit, so we'll compromise and create a new subforum.  We'll delete it if it's not active enough.\"  (Like they're ever here enough to notice)<br /><br /><br />I'm sure LL will be on MSN a few times though, but not for a few weeks.  Basically PCKF is a forum that can't get anything done, much like an American beuracracy.  It's still stuck with the same background it had in 2000, it's gotten about maybe 3 new popular members, and lost about 10 since 2001.<br /><br />I come on here like once every six months, and its still no different.  We get maybe 10 posts a day --50 is we're really pushing it.  I know of dying communities that get more posts than that!<br /><br />Then when active members who like to do shit, like LL, leave, everyone goes, \"WHY R U LEAVIN???//\"<br /><br />I'll tell you why, because it's a dead end community that never changes.  The same assholes that have been posting here now are the same assholes who were posting here in 2001.  This forum is a monument of how not to keep a community together --never change, never get new members, never bother to make fangames/mods, and never create insentives to post.<br /><br />[/tirade]~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20047,
		"title": "Re: Goodbye.",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-10-01T19:31:44.000Z",
		"content": "Revolution?[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 20048,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-01T19:32:40.000Z",
		"content": "I've just became an admin a few days ago and I do care about this board (just like before). But I really don't want to get any more sub-forums here either. This is a Keen board, not some chit chat (or whatever's the word) board for everything. If people come here because of non-Keen related subjects, I don't frankly care if they don't come here at all. If new members join they should be into Keen, I think we've seen already enough new members with no interest in Keen whatsoever. I don't think this is dying, either. If you think a forum is dying if it hasn't 30000 members that produce 100 times more stuff than this forum, I guess then we are dead. Anyways, with different forums for more non-Keen related subjects there won't be any achievement in the Keen-related progress such as mods and fan art. I don't believe such will atract more people to Keen subjects.. Better a small community that's into Keen than large that specializes on bullshit.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20049,
		"title": "Re: Goodbye.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-10-01T19:45:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I'll tell you why, because it's a dead end community that never changes. The same assholes that have been posting here now are the same assholes who were posting here in 2001.[hr][/quote]<br />Not ENTIRELY true... Or I must be an exception...____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20050,
		"title": "Re: Goodbye.",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2006-10-01T20:32:53.000Z",
		"content": "Public Commander Keen Forum or Zombie Commander Keen Forum?<br /><br />This forum isn't dead.<br /><br />I've seen worse.<br /><br />New posts are being made; some forums go untouched for years.<br /><br />Any way, I will be here, continuing to make posts about topics you may or may not care about.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]"
	},
	{
		"id": 20054,
		"title": "Re: Goodbye.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-10-01T20:40:18.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>LordOfGlobox</b> I'll tell you why, because it's a dead end community that never changes. The same assholes that have been posting here now are the same assholes who were posting here in 2001. This forum is a monument of how not to keep a community together --never change, never get new members, never bother to make fangames/mods, and never create insentives to post.[hr][/quote]<br />How should we change? There is not much to discuss about Keen that has not already been talked through many times, and apart from patching and the occasional mod, there is not much we can do to change the Keen engine.<br /><br />When you say that people \"never bother to make fangames/mods\", you make it sound like a simple task that people simply don't do because they are lazy - something like filing a tax return or mowing the lawn. (I'm sure you know this isn't the case, but that's not what you imply.) I would love to make a mod, but I have little skill at designing levels and no great deal of artistic talent, and I would hate to release something I didn't feel was of a good standard.<br /><br />How can we attract new members, and how should we create new incentives to post? The main incentive for people to join in is that they are Keen fans, and converting them is almost entirely dependent on new games or some input from the creators - neither of which we have or are likely to any time in the future (except the release of the Keen source code, which is only a small draw). The main incentive to post on most big forums is a large and diverse user base, and we can't have that without a reasonably sized core of Keen fans who can produce enough interesting content to keep them coming; since those fans either keep leaving or lower the frequency of their posting (or did, whilst there were still enough for the effect to be noticeable), the community is stuck in a vicious circle which will eventually lead to its demise.<br /><br />I honestly don't think there is a great deal that can be done to save the community: it was beginning to pass its prime when I joined three years back, and the main source of new members dried up a long time ago. It doesn't help that we've taken various hits recently, including the ezBoard hacking and the short-lived return of Shocksund. Unless someone creates an amazing game or movie that is amazing enough to attract (or even attract the attention of - there are still a fair few Keen fans floating around the net) countless people to sign up, we're doomed. Still, we might as well enjoy it while it lasts.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 20051,
		"title": "Re: Goodbye.",
		"author_id": 1486838,
		"author_name": "Captainkeen",
		"timestamp": "2006-10-01T20:43:43.000Z",
		"content": "Djaser wrote:<br /><br />-\"I tell you it's worse, nobody even cares when someone got something done. So why bother doing anything at all?\"-<br /><br />Thats one of the reasons I quit modding keen after my first mod, after all that work only a handful of people bothered to reply.<br /><br />Ofcourse you could say that one should make mods for themselves, but thats not true you make mods for other people to play. but there doesn't seem to be much interest here."
	},
	{
		"id": 20052,
		"title": "Re: Goodbye.",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-10-01T21:59:48.000Z",
		"content": "Don't forget that the Keen community is pretty small, and there are a lot of lurkers out there, so you can't really expect a huge reaction when you release a mod.  If you want a bigger reaction you'd need to mod a game with a larger community behind it.<br /><br />The problem I always have is, well, what do you say?  One post saying that it's nice to see another mod pretty much sums it up, there's only so much you can comment about.  It doesn't mean I don't like mods, I just have nothing much to say - what's good, what's not, etc. doesn't take that long to say.  More often than not there are things that could be improved, but if you comment about those aspects too much you get accused of being negative, even if you really don't mean it that way.<br /><br />So it is true, you need to mod for yourself, and if other people play it that's just a bonus."
	},
	{
		"id": 20053,
		"title": "Re: Goodbye.",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-10-02T05:11:56.000Z",
		"content": "-I came to this forum like a year ago or something, and now Ive come back cuz I got interested in making a game like....like the one im making now.<br />-Yeah, this forum is not that popular. But to tell you the truth, I like it that way. I dont like change, and I dont want a huge community. But I would like active and positive members; however, I can't really complain since Im not all that active.<br />-I guess I just dont believe in releasing my own work to the public at large. Not that I'm stopping production, but is it possible to allow dl's from here only to people who have been registered for a long while? Or maybe another site that allows u to control who dls your stuff? Otherwise...hm, I can think of one method to only allow people i want to play.<br />-I hope no one found that offensive. Only real keeners, sorry.- .... . &lt;&gt; ..- -. .. ...- . .-. ... . &lt;&gt; .. ... &lt;&gt; - --- .- ... -"
	},
	{
		"id": 20055,
		"title": "Re: Goodbye.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-10-02T09:15:11.000Z",
		"content": "Interesting...!<br /><br />...or maybe not...<br /><br /><br />While I agree for most part with LordGlobox the laziness of most of the crew members should not be the real reason for the inactivity of the boards. People can still post and chat with each other about Keen. I havent made up my mind what truly causes the inactivity of the boards but it worries me. In all the bad periods of the pckf I've never seen the core of the community fade away so much; not much familiar faces have posted lately. Maybe Keen is finally becoming to old finally but let's hope it's not.<br /><br />Concluding my little thoughts about this I must say that speaking with my own experience that ten different replies to a completed project only telling how nice it is feels a lot better than two replies even though these two replies might be of more valuable. Lurkers en active posters should therefore let people know that they took notice of their projects, I really believe that  would help the community.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20056,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-02T13:01:47.000Z",
		"content": "Definitely agree with Djaser. It's a lot better to get more replies, even if they wouldn't have that many words in them. Yeah, people who check stuff out but don't bother to reply really should reply; it takes no time and will often guarantee there will be more by the author.<br /><br />And as for the first part, part of the problem is that several of these \"core\" Keeners have became old(er). They have so many different things to worry about. It's pretty childish to say \"blah, that's not a real reason, all they need is Keen, they don't need anything else\". [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Although, I can't imagine anyone saying something so stupid (except maybe myself, but not at least anymore). What I was to say, even I have some real problematic issues now -- my folks keep saying me I should find a job until I start to study in an university. I don't care about the first, but the second part is worrying me (what to study??).3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20057,
		"title": "Re: Goodbye.",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2006-10-04T19:58:37.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I'd just like to say that several of you people are assholes.[hr][/quote]<br /><br />That's kind of vague. Who are assholes? Why?------------------<br />Nothing in particular"
	},
	{
		"id": 20058,
		"title": "Re: Goodbye.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-10-04T20:38:30.000Z",
		"content": "I'll cede that it's not simply the staff's fault, but I will say this:<br /><br />We're not going to only post about Keen.  Nor are you guys going to like talking to the same people every time you get on because it gets old quickly.<br /><br />We do need to have the do something else on this forum.  Atleast we can admit that people don't like to make mods/fangames 24/7.  Okay, that's fine.  So what do you expect them to do here?  Read another spam topic in Misc?  Discuss the same old 'classic' games?  Or maybe we should discuss the same old Keen glitch?<br /><br />We need something to do on this forum, guys.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20059,
		"title": "A message to the whip-snappers",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-10-15T07:27:44.000Z",
		"content": "The PCKF's activity has decreased a lot since I joined back in 2000-or-2001, but what do you expect? Commander Keen was something that happened one and a half decades ago, and hasn't happened again since (unless you count GameBoy Keen, but you probably don't, heh heh). <br />It's a computer game. It's not your Life's Purpose. Of course people are going to move on as they get older, and the rate of newbies is going to decrease as better games than Commander Keen get developed.<br /><br />BETTER GAMES THAN COMMANDER KEEN?!?! NO!!!!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]   <br /><br />Yes.<br /><br />Anywho, take a look at other similar forums. \"This Strife\", whose forums were full of people who enjoyed games like Keen and Duke Nukem, was huge in 2001. Now it is a wasteland. The only regularly active members are the moderators, who basically use it as a messageboard for each other.<br />The DoomWorld forums may have a lot of members, but it's still a pretty slow place. PCKF &gt;&gt; Doomworld.<br /><br />The fact that some people still care about keeping the PCKF as hyperactive as it was a few years ago means it's really not in such bad shape. It's just that all the stuff that we did back then was done in the name of fun, not in the name of the PCKF.<br /><br />Don't blame the admins. Don't blame lazy artists. Don't even blame whoever's fault it is - just help solve the problem: Do some KEEN STUFF!!! Nobody else is gonna do it because you tell them to!<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img]"
	},
	{
		"id": 20060,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-19T22:05:51.000Z",
		"content": "I agree with both Djaser and TMST.  The problem comes into play because no one posts.<br /><br />\"Oh look, another fucling fangame.  I guess I won't post... they probably won't complete it anyways...\"<br /><br />Well, no shit.  If no one is interested in your fangame, it makes it really hard to do something that's already REALLY hard.<br /><br />Show some interest you guys.  I've replied on every single fangame thread atleast once for all modern fangames.  It wouldn't kill us all to put a little effort and type a message to the people who are atleast going to give you a half hour of fun from their fangame --and even if they don't, atleast you'll get some people who will.<br /><br />As idiotic as this is to say, we need to show a little forum spirit.  It doesn't take much, just post a little bit.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20061,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-11-19T22:14:32.000Z",
		"content": "Yeah. I'm not nearly as active on the forums as I used to be. But, well, I think I'm gonna start back up on my mods again, and I'm gonna be posting more from now on.<br /><br />Maybe we should all find some friends who might like Commander Keen? Unfortunately, I've tried to tell my friends about it, but they seem to think it's too immature or something. I should tell some younger people. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oldy.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 20071,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-11-20T11:11:10.000Z",
		"content": "<i>\"Oh look, another fucling fangame. I guess I won't post... they probably won't complete it anyways...\"<br />If no one is interested in your fangame, it makes it really hard to do something that's already REALLY hard.</i><br /><br />Well that problem comes about because so many people spend five minutes thinking up of a \"good keen idea\", then write a huge post about how they're going to write a fangame, how cool it'll be, how many other people in the community want to help, and just when they've hyped it up they decide it's boring and move on to something else, or they realise how hard it actually is to write a game and give up.<br /><br />After you see that happen to 90% of people's fangame announcements, it's a little difficult to get excited about yet another probable let down...<br /><br />I think what people don't realise is that you don't write a fangame for the community, you write it for yourself.  If the community is interested in it that's a bonus, but if not you need enough interest in it yourself that you'll keep going even if nobody seems to care about it.<br /><br />That's the prime reason why I don't often mention much about the game editor I'm working on - I actually spend a large amount of my spare time on it (it's not uncommon for me to be programming for 15 hours a day on weekends), but I feel that if I start hyping it up now, people will only get disappointed, or they'll think I've given up when I don't make much progress for a few months - and hey, I enjoy it even if I'm the only one who knows anything much about it.  I'd much rather post a message one day that instead of saying \"I've just thought of a cool idea for a program\" says \"Hey I've written a program, it does this and this, and you can download it here and start using it right now.\"  I know that doing that will generate *much* more response because people won't have to worry about being let down again.<br /><br />So yes, that's my somewhat lengthy reasoning behind avoiding premature announcements [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 20072,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-21T01:10:18.000Z",
		"content": "I agree...<br /><br />I'm just hoping when you bring people together for fun, it'll help people loosen up and get the kind of support they need.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 20062,
		"title": "Re: A message to the whip-snappers",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-11-21T17:09:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Maybe we should all find some friends who might like Commander Keen? Unfortunately, I've tried to tell my friends about it, but they seem to think it's too immature or something. I should tell some younger people. [hr][/quote]<br /><br />Well, when I was 15 years old, I had a 16 years old friend that was a Keen-fanatic. He spent hours and hours... er, entire days, playing Commander Keen. Unfortunately: 1) He was too silly. 2) He didn't speak english because we (my friend and I) live in a country that only speaks spanish. 3) I haven't seen him anymore.<br /><br />Just think, I knew also some little guys (6-10 years old) that liked Commander Keen just because that was the game that was installed in the old computer of the school's secretary. I'm talking of 2004. Even with modern games filled with blood and guts that amuse millions of people over the world, there are still children that like old DOS EGA-color platform games.<br /><br />(Sorry, I don't remember what was the point of this writing.)<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  [hr]<br />\"<i>Eat your veggies!</i>\""
	},
	{
		"id": 20063,
		"title": "Re: A message to the whip-snappers",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-07T20:29:06.000Z",
		"content": "Welll, the point was that this forum, and Commander Keen, aren't dead, <i>and will never die</i> because there will always be people who will enjoy and love the classics.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>KeenRush:</b> (...) part of the problem is that several of these \"core\" Keeners have became old(er). They have so many different things to worry about.[hr][/quote]<br /><br />Yeah, that's true. It'd be great to have new, young people here, who would really appreciate the old Keeners' job. For example, I sometimes think while writing my game engine: <i>Who will enjoy this thing? After completeing it, I won't be able to use it. But I'm sure that I'll find someone who'll enjoy a game made with this.</i><br /><br />I remember that when I first saw this thread, I felt very sad, because one of the reasons I came here had just left. But life continues, and so does the forum.<br /><br />(I apologize, this is just another pointless reply, but I felt the need. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke.gif[/img] )<br />[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 20064,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-01-06T10:54:26.000Z",
		"content": "Good Lord God almighty who art in heaven.<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />What the hell did I miss?"
	},
	{
		"id": 20065,
		"title": "Re: A message to the whip-snappers",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-01-06T14:13:31.000Z",
		"content": "Galaxieretter, you're back! Welcome back, man! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />- You missed the level design competition (which is now being judged).<br />- You missed Levelord leaving. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  <br />- Someone new joined though, Levelass, who's a friend of Levelord.<br />- New forums have been set up for Commander Keen game creation and such. It's on [url=http://dev.pckf.com/]dev.pckf.com/[/url] .<br />- A new Keen-related comic was made by Levelass (and Levelord, that was around the time she left). It's called Tzen and is currently on hold because Levelord's scanner broke. [url=http://www.spheredev.org/~dnaproduct/Tzen/]www.spheredev.org/~dnaproduct/Tzen/[/url]<br />- A great new Keen4 mod was released: The Keys of Krodacia.<br /><br />That's about all I can think of right now. But hey, welcome back. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 20066,
		"title": "Re: A message to the whip-snappers",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-06T14:22:41.000Z",
		"content": "The more we are, the better. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Some new members have joined here too, as you probably have just noticed. 3 new active (?) members, to be exact.<br /><br />And there's a Keen 1 mod in progress, probably it'll be released this March. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img] <br /><br />It's good to see people coming back after some time, heh [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  Hopefully LL will return some day.[hr]<b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 20067,
		"title": "Re: A message to the whip-snappers",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-14T18:44:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What the hell did I miss? [hr][/quote]<br />Unfortunately, not much.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And there's a Keen 1 mod in progress, probably it'll be released this March.[hr][/quote]<br />Wow, one Keen mod in progress? <br /><br />There was a time when there was one released almost every week. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20068,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-14T19:36:06.000Z",
		"content": "Really? 52 a year?<br /><br />I really, really got  to look at what I've missed...<br /><br />(I have one in the works, but I'm waiting for Adis to get back to help me on my levels.)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20069,
		"title": "Re: A message to the whip-snappers",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-14T21:48:15.000Z",
		"content": "There is plenty of them under work, I'm too lazy to list but I can think of many.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20070,
		"title": "Re: A message to the whip-snappers",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-15T10:57:22.000Z",
		"content": "I know that there are in fact more in the work but how many mods were released last year? My guess is five at most, I don't have much faith that this year will be better.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20073,
		"title": "Re: Goodbye.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-15T16:12:01.000Z",
		"content": "You managed to awake my pessimism again.[hr]<b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 20074,
		"title": "Re: Goodbye.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-15T19:35:34.000Z",
		"content": "Shadow's, 1 PM3, 2 mine, 3; so we're halfway there and it's not even midyear!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20075,
		"title": "Re: Goodbye.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-15T19:44:28.000Z",
		"content": "May I sue your friend?<br />[quote]<b><i>Quote:</i></b>[hr]<b>Levellord:</b> I have just finnished a wonderfully depressing conversation with KeenRush and am utterly out of it right now. Basically I am leaving the Keen community for I frankly don't know how long.<br /><br />I shan't be on MSN, though you might contact sarah via it, I don't know what I'm going to be doing the next few days, I really don't. I'm probbably not thinking straight, and I'm sure I'll probbably regret doing all of this stuff if I sat down for half an hour, but frankly I can't be fucked.<br /><br />I'd just like to say that several of you people are /(null)/.<br /><br />Thankyou, and goodnight.<br />[hr][/quote]<br /><br />It's really stupid to blame the community. What can you expect? Keen has been abandoned for more than a decade, no much we can do these days unless Tom gets the rights.<br /><br />And I don't think you really need her to return before making levels. We all can make one or two mistakes at the start, but we all humans have the ability to learn from our own mistakes.[hr]<b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 20076,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-15T23:20:13.000Z",
		"content": "Djaser, you are correct, 2006 wasn't that good, not many mods, but still there was some good stuff. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />I hope we'll get mods by these persons (in order I think of them):<br />* Xky (any possible?)<br />* KeenRush (it'd be about the time!!)<br />* Shadow Master<br />* ceilick<br />* Retord8<br />* LL/LLa<br />* Genius314<br />* Ezjay<br />* that guy who was making that Ian Burton adventure, can't remember his username<br />* some more I can't remember<br />* Spleen<br />I hope they're all still in the case!3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20077,
		"title": "Re: Goodbye.",
		"author_id": 1485592,
		"author_name": "Slugfest",
		"timestamp": "2007-01-15T23:33:38.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]that guy who was making that Ian Burton adventure, can't remember his username[hr][/quote]<br />ZeroDiamond<br /><br />And if I remember correctly, wasn't 2005 pretty bad as well? That whole thing about there not being any Keen awards because no one did anything?"
	},
	{
		"id": 20078,
		"title": "Re: Goodbye.",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-01-15T23:41:04.000Z",
		"content": "I remember something about the awards being extended to cover 2006 as well.. are we still doing that or will it be extended even more to cover 2007 too?<br /><br />[hr]<br /><br />---Freeyorp"
	},
	{
		"id": 20079,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-16T13:13:12.000Z",
		"content": "It'd be about time to get Keen Awards back.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yawn.gif[/img]  Yeah.. I'll have to try something and talk to xtra soon.<br /><br />And Slugfest, who are you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20080,
		"title": "Re: Goodbye.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-16T19:36:11.000Z",
		"content": "He knows TMST, and knows about Zero Diamond's mod. He must have been (almost) here before. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] [hr]<b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 20081,
		"title": "Re: Goodbye.",
		"author_id": 1485592,
		"author_name": "Slugfest",
		"timestamp": "2007-01-17T02:17:42.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]And Slugfest, who are you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] [hr][/quote]<br />I'm Slugfest.<br /><br /><br /><br /><br /><br />Oh wait you mean like actual who am I.<br /><br />Yeah."
	},
	{
		"id": 20082,
		"title": "Re: Goodbye.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-17T09:27:56.000Z",
		"content": "Yes, you're real name and credit card number please.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20083,
		"title": "Re: Goodbye.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-01-17T11:36:50.000Z",
		"content": "I guess then the only reason why you don't tell who you have been earlier is that you have been banned. Well, just try to be nice this time. Or then you have been a (long-time) lurker..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 20084,
		"title": "Re: Goodbye.",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-01-17T12:21:02.000Z",
		"content": "Very few people have ever been banned from this forum so there is no reason to be paranoid unless Slugfest would behave bad.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 20085,
		"title": "Re: Goodbye.",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-01-17T19:32:07.000Z",
		"content": "Yeah, but it still affects the way others view you; anonymity can be a great comfort to some, many have behaved in ways they'd rather everyone forget.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 20086,
		"title": "Re: Goodbye.",
		"author_id": 1485592,
		"author_name": "Slugfest",
		"timestamp": "2007-01-17T21:39:55.000Z",
		"content": "Oh come on people. I was never BANED... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />I'm not THAT bad.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]"
	},
	{
		"id": 20087,
		"title": "Re: Goodbye.",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-01-18T01:14:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Shadow Master wrote:</b> He knows TMST[...][hr][/quote]<br /><br />Oh, What The Heck!!! I mistaken Slugfest for \"djgs legrandage\"!!<br />I'm sorry Slugfest. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img] <br /><br />Next time I'd better try to remember things before going to bed. I'd have corrected the big mistake before if I wasn't doing stuff for A Real Life (tm).[hr]<b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	}
]
