[
	{
		"id": 1001,
		"title": "You lucky, lucky bastards!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-23T14:32:42.000Z",
		"content": "Regardless of wether you believe in God or not [Anyone mentioning christian vs nonchristian things in this topic will be shot, I've always said, theres nothing an agnostic can't do if doesn't really know if they believe they can or not.] you are very lucky to be hare. Lets examine a few things:<br /><br />1.) Dimensions. <br /><br />Most modern theories go for 10 in total. Life can only [provably] exist in a universe containing either 2 or 3 directions and 1 time, or 2 directions, 2 time. All other combinations are lifeless. As yet we do not know why we are stuck with 4/10 of our dimensions avalible in their current order. Luck.<br /><br />2.) Universal constants.<br /><br />There are 6 famous constants such as plancks constant, gravity, and the neutron/proton mass ration which, if even slightly different would prevent life, and usuallly matter, from existing. For example, protons are lighter than free neutrons, so the universe was filled with H and He, but no so much lighter that all nuclei are unstable. The difference is one part in twenty thousand. And thats just one constant, there are also literally hundreds of others less important with more range, such as the muon mass.<br /><br />3.) Stars.<br /><br />We have an 'average' star, but far from it. Stars must be bigger than .8 solar masses, otherwise their flares will roast any planet close enough to support life. Any larger than about 5 solar masses and radiation and short lifetimes put severe pressure on any life. Our star also has a good dose of heavy elements to form planets. Our star is also one of the 50% that doesn't have a companion close enough to destroy planets.<br /><br /><br />4.) Location:<br /><br />Only 10% of the galaxy is habitable; too close and you get fried by stars or black holes, to far out and theirs not enough dust for planets. And don't even think about sitting near any large mass stars, nebulae or pulsars. All in all, its a quiet neighbourhood.<br /><br />5.) Location location location<br /><br />The three most important words baby! We are located in the small habitable zone in our solar system, Mars is just inside it, Venus just outside. You do the math. And forget Europa, it may have an ocean due to Jupiter, but the radiation, and more importantly, lack of nutrients should prevent any life.<br /><br />6.) Cosmic pinball<br /><br />So far our planet has made it to adulthood without being flung out into the ice  or fried by the sun, something that appears to happen in most solar systems when the big bullies like Jupiter decide to play pool with their smaller mated. Even now we don't know how many planets we started with, the figure is likely around 100.<br /><br />7.) The moon.<br /><br />It holds our planet steady, stabilizes seasons, absorbs coliding asteroids and provides tides that may have started life. Why not go outside and blow Mr moon a thankyou kiss?<br /><br />8.) Asteroids:<br /><br />So far we haven't been extinced by one, yays! Gotta be careful though, they pop by quite regularly and may hit us yet. Also, it is believed that many asteroid impacts made life what it is today, killing off the oldies so brave new species could appear.<br /><br />9.) Ice ages:<br /><br />One in the precambrian covered the whole globe, and started multicellular life going. Several others nudged evolution in the right direction, often accompanied by asteroids. [See above]<br /><br />10.) Volcanoes:<br /><br />Yes! Our planet is alive! Its moving crust carries waste like sulfates and carbon into the mantle, preventing our atmosphere stagnating. Surely a few eruptions is a small price to pay?<br /><br />11.) Life:<br /><br />A real biggy here. Life appeared pretty much as soon as it could, but how? Will it appear anywhere it can, or was Earth just that one in a million paradise where life struck it lucky? Life is considered so unlikely some people claim it came from outer space. Aside from Mars and Vorticon VI, Earth is the <i>only</i> place we can be more than even 0.1% sure life exists.<br /><br />12.) You are inteligent [I think]<br /><br />Intelligent life was by no means necessary, why should we have evolved [or been created?] An ice age at just the right time turned a bunch of hairy vermin into something smart enough to keep on going, and we've had quite a few near misses anyway. Odds for inteligent life given that life exists range from certainty [some crackpots believe inteligence is ineviitable] to 1 in 10^43 [Not a bad estimate given current knowledge.]<br /><br />13.) You are warm blooded:<br /><br />Big brains need sugar. Lots of sugar. And air, lots and lots of air. Far too much to be provided by gills, or by cold blood. In all history, on bird and mammal fossils show good brain/body size. [And some birdy dinosaurs that were almost definitely warm blooded.] <br /><br />14.) Water, but not too much:<br /><br />A planet covered in ocean will not evolve inteigent life, or at least, is much much less likely to. To do so, a warm blooded creature with opposible thumbs and a large brain would have to evolve, underwater. We have dolphins, but they have only fins, and became warm blooded while on land. And yet we have enough ocean to keep our Earth stable and healthy.<br /><br />15.) Your breeding:<br /><br />You are so lucky you're parents met... and their parents... and so on. Think about it, if you sneeze at some girl, their kid will probbably turn out different. From that one event. Go change someomes life now.<br /><br />16.) You are you:<br /><br />What are the chances that you, out of 10 billion sperm made yourself? And that you'd be concieved in that one night? Humans are some of the most difficult animals to get pregnant, despite the high teenage pregnancy stats. Far less than 1 in 100 attempts succeeds, and even then miscarrage is rife.<br /><br />17.) You lived:<br /><br />A lot of kids\\teenagers\\adults didn't. Remember that.<br /><br />18.) You are here:<br /><br />You have power, good food, shelter, internet acess, eduction and much more. You are very priveliged to be here reading this. As a conclusion, spend a miniute looking around you, at all the stuff you have that so many don't, stuff people would kill for, are dying without. Truly you are immesurably lucky. Go out and enjoy today, the odds were against it happening at all.<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23812,
		"title": "Re: You lucky, lucky bastards!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-10-23T15:39:47.000Z",
		"content": "Then again, how is that lucky; existance is chaos!<br />If you did not exist, if there simply was nothing, no existance at all, you wouldn't even be able mind.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 23813,
		"title": "Re: You lucky, lucky bastards!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-23T19:03:09.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]   Great post LL, just exactly what I needed! (Edit: That emotikeen is supposed to represent happy laughter.)<br /><br />*neural stuns Ret8*<b>Eat your veggies!</b>"
	},
	{
		"id": 23814,
		"title": "Re: You lucky, lucky bastards!",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-23T20:09:46.000Z",
		"content": "I wouldn't really call it luck.  Locations and situations in which all of the conditions you mentioned occur would naturally have a higher tendency for life to come out of it.<br /><br />There are likely a huge number of places in the universe like Earth and I'm sure many of them at some point in the past or future had life.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23815,
		"title": "So what? Shoot Me!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-23T21:03:16.000Z",
		"content": "Nope... I'm not mentioning christianity; just the fact that none of this would have been possible without intelligent design! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 23816,
		"title": "Re: So what? Shoot Me!!!",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-23T23:15:29.000Z",
		"content": "Throwing an idea here: The chaos thoery isn't that chaotic.<br /><br />If our universe could only be created one way (Not stating how), then this is the only way this could of happened.<br /><br /><br />Other than that, interesting post.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23817,
		"title": "Re: So what? Shoot Me!!!",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-23T23:57:34.000Z",
		"content": "I like to think of it this way: every possible reality exists.  Only a select few give rise to the possibility of such a universe as ours.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23818,
		"title": "Arbitrary.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-24T00:51:25.000Z",
		"content": "And how unlucky for life in general that a single ice age produced a breed of murderous wraithlike conquerors overcome with a superiority complex that, despite being inconceivably outnumbered, are now making their mark, for better or worse, on every corner of the globe.<br /><br />It's weird when you think about it... once there was a massive variety of human society across the globe, all dark-skinned (apart from the occasional albino, I suppose). Now after a crazy game of Reversi, a minor fluke of evolution has taken over and trashed much of the globe.<br /><br />Some things I find 'lucky', however, despite some of the less pleasant events that have allowed them to come into being:<br />- we're at our particular level of technology right now--imagine what the world would be like now if we were only just inventing the telephone... and where would we be now without DOS?<br />- the existence of the PCKF and Keen:Modding.<br />- I don't share the mainstream's ignorance, lack of imagination and stagnant mindset.<br />- the knowledge of how to manifest my own luck has found its way to me.<br /><br />The one thing that always trips me out, though, is the arbitrariness of consciousness in general. There are a presumably finite amount of psyches in existence, why was mine among them, and why this particular body? There are theoretically an infinite amount of souls that never exist, so the odds are so high once cannot even imagine it.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23819,
		"title": "Re: Arbitrary.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-24T04:50:39.000Z",
		"content": "\"There are a presumably finite amount of psyches in existence, why was mine among them, and why this particular body? There are theoretically an infinite amount of souls that never exist, so the odds are so high once cannot even imagine it.\"<br />Yeah, that is so strange.. It's hard to think it being only random. (As some of you do.)<br /><br />And yes, agree with Spleen, there's the current age of technology and stuff, just now. I couldn't imagine living at any other period of time, I feel lucky living right now.<b>Eat your veggies!</b>"
	},
	{
		"id": 23820,
		"title": "Re: Arbitrary?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-24T09:51:40.000Z",
		"content": "And now the discussion begins!<br /><br />Good point Spleen, lets make it number 19.) And something to consider; if you remember nothing of past lives when you reincarnate, is it really the same you?<br /><br />[quote]<b><i>Quote:</i></b>[hr]I wouldn't really call it luck. Locations and situations in which all of the conditions you mentioned occur would naturally have a higher tendency for life to come out of it.[hr][/quote]<br /><br />Oh yes, the point is, these  situations are rare. Throwing all sixes in a game is likely to be associtated with you getting lots of money, it is not what happens which is so amazing, but the incredible luck that this rare circumstance exists.<br /><br />[quote]<b><i>Quote:</i></b>[hr]There are likely a huge number of places in the universe like Earth and I'm sure many of them at some point in the past or future had life.[hr][/quote]<br /><br />Really? We have no idea how many earths there are out there. None at all. People are impressed by figures like '100 billion galaxies with 100 billion stars' but all those powers of ten can be quickly reduced with a few simple assumptions. What if only 1 in a billion stars were habitable? And only 1 in a billion planets? We have no idea how rare life is but we do know this, it is some kind of rare, any life we find is likely to be a good deal far away. [Of course, that still leaves room for 100's of planets in the galaxy, or only us. Who knows?]<br /><br />[quote]<b><i>Quote:</i></b>[hr]If our universe could only be created one way (Not stating how), then this is the only way this could of happened.[hr][/quote]<br /><br />Ah, but we know of this choas, we know of the randomness in atoms and molecules, the very constituents of matter. As far as we know, there are countless ways the universe could have panned out. Besides, would you like to be typing that reply just because thats the only way the universe could turn out?<br /><br />[quote]<b><i>Quote:</i></b>[hr]I like to think of it this way: every possible reality exists. Only a select few give rise to the possibility of such a universe as ours.[hr][/quote] <br /><br />Really Xtra, thats as unscientific as God. The many worlds theory is bunkum IMKO.<br /><br />[quote]<b><i>Quote:</i></b>[hr]And how unlucky for life in general that a single ice age produced a breed of murderous wraithlike conquerors overcome with a superiority complex that, despite being inconceivably outnumbered, are now making their mark, for better or worse, on every corner of the globe.[hr][/quote]<br /><br />Not really, every year billions of rats gather in the sewers of cities worldwide to celebrate Humanity day. Many weeds, insects, viri, bacteria, mammals, and even some birds wish us a long and fruitful existance on this planet. Sure some life dies, even maybe most of it, but even if we nuke ourselves out of existance, life will shrug, evolve and continue on, with only the cave paintings of primitive rats to remember us.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23821,
		"title": "Re: Arbitrary?",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-24T10:52:15.000Z",
		"content": "If you note the way I prefaced my comment, I didn't give any indication that I thought it was scientifically valid.  It's a way of organizing reality in my head that eases my mind.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23822,
		"title": "Re: Arbitrary?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-24T11:34:47.000Z",
		"content": "\"And something to consider; if you remember nothing of past lives when you reincarnate, is it really the same you?\"<br />In a way it would be, but there is no way I could know it or even care about it, in that case. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />\"It's a way of organizing reality in my head that eases my mind.\"<br />How does that ease your mind? It would make me feel worse..<b>Eat your veggies!</b>"
	},
	{
		"id": 23823,
		"title": "You're in a game",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-24T12:54:57.000Z",
		"content": "[hr]<b>LevelLord</b> As far as we know, there are countless ways the universe could have panned out. Besides, would you like to be typing that reply just because thats the only way the universe could turn out?<br />[hr]There's an intriguing analogy found in the third book of the <i>Conversations with God</i> series, which claim to be a dialogue between a man named Neale Donald Walsh and God.<br /><br />[hr]<b>God:</b> Think of the Cosmic Wheel as [a computer game*]. All the endings already exist. The universe is just waiting to see which one you choose <i>this time</i>. And when the game is over, whether you win, lose, or draw, the universe will say, \"Want to play again?\"<br />[The game] doesn't care whether you win or not, and you can't \"hurt its feelings.\" It just offers you a chance to play again. All the endings already exist, and which ending you experience depends on the choices you made.<br /><br /><b>Neale:</b> So God is nothing more than a CD-ROM?<br /><br /><b>God:</b> I wouldn't put it that way, exactly. But throughout this dialogue I have been trying to use illustrations that embody concepts everyone can hold in their understanding. So I think the [computer game] illustration is a good one.<br />In many ways, life <i>is</i> like a [computer game]. All the possibilities exist and have already occurred. Now you get to select which one you choose to experience.<br />[hr]<br /><br />The more I think about this, regardless of whether or not these words were from God themself, the more it seems to make sense.<br /><br />Then again, I haven't heard any arguments against it. There may yet be reason to disregard the idea entirely. <br /><br /><b>Edit:</b> Forgot to explain the \"*\". Originally, the term 'CD-ROM' was used, whereas I found the idea of a computer game more appropriate.Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 23824,
		"title": "Re: You're in a game",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-25T00:21:04.000Z",
		"content": "Reality confuses the hell out of me.  I have no explanation for why anything exists.  It's just a simple lame explanation I can substitute for lack of knowing anything, and it sounds reasonable enough to me.  Whether or not it is scientifically based it makes more sense to me then \"well there's this omnipotent being, and he made the universe, and, well, he's always been around, always will be...\"<br /><br />If you answer the question of the origin of the universe by saying that someone/something created the universe, it just creates another question about the origin of that someone/something.  That's why I like to think that the universe gave rise to itself simply because it was possible.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23825,
		"title": "Re: You're in a game",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-25T13:33:24.000Z",
		"content": "1.) The concept of something that has always ezisted is fine, our univesre will in theory exist forever, and thus, at some point, have existed forever. I like the concept of an eternal God who decided to bring this into existance. What I hate is:<br /><br />2.) The universe appeared because its possible. Why? Out of what? Was there time 'before'? Has the universe existed forever then? What did it appear in? Will it end because thats possible? When?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Then again, I haven't heard any arguments against it. There may yet be reason to disregard the idea entirely.[hr][/quote]<br /><br />The biggest arguments for is \"Why not?\" And the biggest against is \"Why?\" As with Xtra's [or my] belief, there is no real way to prove it, or disprove it. Each to his own, but if life is a computer game, who wrote the program, why, and what will we do if they release a sequel?<br /><br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23826,
		"title": "Re: You're in a game",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-25T14:22:52.000Z",
		"content": "Yeah, agree. The concept of eternal God has much less problems than the one of Universe just appearing outta nowhere. Doesn't make sense at all.<br />Ok, nothing makes any sense. That's just the way it is, is all I can say.<b>Eat your veggies!</b>"
	},
	{
		"id": 23827,
		"title": "Re: You're in a game",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-25T19:45:37.000Z",
		"content": "I wouldn't exactly call it a belief, it's mainly an organization of ideas because of the lack of knowledge.  I don't necessarily believe that it is true and would do nothing to back it up in an argument, but since I don't have any real knowledge, I feel more comfortable with a psuedosubstitute.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23828,
		"title": "Re: You're in a game",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-25T22:26:36.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Ah, but we know of this choas, we know of the randomness in atoms and molecules, the very constituents of matter. As far as we know, there are countless ways the universe could have panned out. Besides, would you like to be typing that reply just because thats the only way the universe could turn out?<br />[hr][/quote]<br /><br />But do you truly know if the chaos of molycules is not truly that chaotic?  But rather, a complexity that we do not comprehend as of the now?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 23829,
		"title": "Re: You're in a game",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-26T00:45:25.000Z",
		"content": "Well, we're almost 100% sure.<br /><br />On the other hand, people ignore the 'collective principle'; a butterfly flapping its wings makes squat difference to the weather, because there are so many butterflies. If you wnet back to Xtra's birth and killed him, odds are we'd all still be on this forum; results tend to cluster together and not be as capracious as people think.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23830,
		"title": "Reality:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T03:34:21.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Reality confuses the hell out of me.[hr][/quote]<br /><br />And thus you have become a Administrator of a computer game forum; because it is not true reality?<br /><br />-- NAJAWA --"
	},
	{
		"id": 23831,
		"title": "Re: Reality:",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-26T22:22:17.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]If you wnet back to Xtra's birth and killed him, odds are we'd all still be on this forum[hr][/quote]<br />Ah..but is that even possible?  I speculate you'd get hit by a bus or something else would stop you.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 23832,
		"title": "Re: Reality:",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-10-26T22:30:19.000Z",
		"content": "ditto~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
