[
	{
		"id": 347,
		"title": "Keen 2 Level Competition VOTE:",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-03-19T23:34:12.000Z",
		"content": "Ready, Set, Go!  <br /><br />First off, get the pack here: [url=http://levellord.toxicsheep.com/Keenstuff/Keen%20Day%20Levelpack.zip]levellord.toxicsheep.com/...elpack.zip[/url]<br /><br />Then, vote!<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Originally Posted by: Levelass</i><br />Don't forget to vote for your favourate levels! Levels are numbered thusly; a gold block by the level is +4; a red block +1; much like in the Keen 1 competition.<br /><br />1.) Most Keenish; the level that best capturs that feeling of playing Keen 2 all over again for the first time.<br /><br />2.) Elite: That level that's so damn hard, huge or complex you just wanna smack your head against the screen and burst into tears.<br /><br />3.) Scrubbed; that level that was the most fun or easiest to get through. We're talking putting on cruise control, turning up the radio and enjoying here.[hr][/quote]<br /><br />So yeah, the vote is on...let's say until then end of the month.  The 31st is your last day to vote, and then the tally.  Get on it!--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 10344,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-20T07:20:35.000Z",
		"content": "Yay!<br /><br />Many thanks flaose for ordering all of this!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10345,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-03-24T03:00:55.000Z",
		"content": "Level 01: The switches make for interesting puzzles, but it takes a while. This was a difficult level, and I had to revisit several spots over and over.<br /><br />Level 02: The robot pit was a great idea, and is simple enough once you know its there and have your timing correct. Im dont know what the scrub at the bottom was there for though.<br /><br />Level 03: This was a great level, though the drop onto the flames near the robot arena caught me out a few times. I think this had the best overall keen feel. <b>Most Keenish Vote</b><br /><br />Level 04: Argh. This was definitely the hardest level! There are kill tiles in the most difficult positions, and the key to the first bridges was at the top of a nearly impossible jump over some more kill tiles! I did not finish this level. <b>Elite Vote</b><br /><br />Level 05: This level is nice. The jump at the start can make the level short if you miss but the rest is actually quite keenish. The lava tiles at the top make for some tricky jumping, even with the bridges, but overall I quite liked it. <i>Keenish runner up vote</i><br /><br />Level 06: The top right segment of the level can be tricky once the vorticon falls to the ground, as it will involve a blind fall down the pipe (and often I died at this point) The rest of the level is very colourful.<br /><br />Level 07: Dodging the vorticons without ammo is no fun, and I cannot see how anyone can get the second red key. The switches can block the level if you dont know in advance what they do, and even getting out of the start can be trouble. I did not finish this level. <i>Elite runner up vote</i><br /><br />Level 08: Another very difficult level. The bridge at the start seems pointless and hard, and pogoing off a scrub going the other way avoiding kill tiles is no fun. I did not finish this level.<br /><br />Level 09: Not overly difficult as long as you time the jumps right, and the lava in the bottom middle is brilliant. <i>Scrub runner up vote</i><br /><br />Level 10: A great level, the lava arrows were great, and there were puzzles that werent too hard or too easy. <b>Scrub Vote</b><br /><br />Level 11: A short level, but a tricky one. The one tile jumps make for a tricky start, and I had to revisit this once I realised I needed to turn left over right. I did not finish this level. <br /><br />Level 12: The sign says yeahs piece of cake, but Im not so sure. The switches dont do anything, there is a misspelt swear word in the lava and I dont think there is even a blue key to get.<br /><br />Level 13-16 : Its just too easy. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />[hr]<br /><br />Is anyone else going to vote?<br /><br /><br />---Freeyorp"
	},
	{
		"id": 10346,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-03-24T19:14:39.000Z",
		"content": "I'd vote if I could finish any of the levels. My Keen skillz need sharpening. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] ------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10347,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-03-24T22:13:22.000Z",
		"content": "Likewise. I couldn't even play my own level all the way through :P (<i>edit: have actually finished own level, will try and do rest when I've cleared my homework backlog and my new computer is up and running</i>)"
	},
	{
		"id": 10348,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-24T22:58:27.000Z",
		"content": "That worries me intensely, I don't want to vote until at least another person has.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10349,
		"title": "Votes!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-25T22:05:51.000Z",
		"content": "Level 01 -- I really liked the trickery involved with the Scrub off to the left of start, until I discovered you could do the whole thing without it by heading right first... Bummer.  There's a lot of switches here, but it's usually pretty clear what they do.  I think the level invovled a little too much backtracking, but it is solidly designed and feels like it was playtested well.  A little too complicated for me.  Contender for Elite Award.<br /><br />Level 02 -- \"LOL\" in background tiles, no level borders?  It definitely strays from the \"core Keen2\" feel I was hoping for, but the level itself is pieced together nicely.  I like the circular design.<br /><br />Level 03 -- Ooh!  Starting in the darkened area--bonus points.  I appreciated the safe fall onto the red tiles above the plasma tiles... but then was disappointed by the plunge into fire to the right of the purple SentryBot.  \"Tantalus Seattle\" was a nice touch, but I'm not sure how I'm supposed to fight those 3 Elites in that confined area--even with the lights off.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>  Solid design, but quite difficult.  <b>Keen Award</b>.<br /><br />Level 04 -- Woah, Hello danger tiles.  Lots of back-and-forth here.  I really hate the jump for the (first) Yellow card.  Really inventive use of switches and puzzles, here!  I like it a lot, but I think it's set up in a very frustrating way.  This would still be challenging with half as many death tiles.  The use of map tiles in the level, and the ability to screw yourself (trapped with the green keycard upper left) really hurts.  <br /><br />Level 05 -- Cute and nicely put together.  It seems like there's more than one way to beat this level--especially if you've played it more than once.  I like that, though it does make me wonder if it was intentional or not.  <b>Scrub Award</b>.<br /><br />Level 06 -- \"BananaPhone,\" hmm?  Great level.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  I enjoyed it.  <i>Keen Award Runner Up</i>.<br /><br />Level 07 -- Mortimer's Helmet, this one robbed me of my sanity.  Who designed this!?  Cruelty personified.  I cried.  The final \"screw you for not falling into the right place\" was too much to bear.  <b>Elite Award</b>.<br /><br />Level 08 -- Hmm.  I'm not sure what to say, really.  I got myself trapped/killed very easily in this level.  After the 4 switches, I fell down and right, and wound up stranded on a platform with nowhere to go.  There's a lot of places the player can absolutely screw themselves... I don't like it.  <i>Elite Award Runner Up</i>.<br /><br />Level 09 -- Cute, but a little too easy to get all those VortiTeddies in the lower left.  The Elite in the upper right fell down into the area by the door--that should have been playtested more.  Very easy.  <i>Scrub Award Runner Up</i>.<br /><br />Level 10 -- I'm really torn, here.  The level is a visual hodgepodge of map tiles, wasted space, and flashing lights... but the gameplay of the level is fine--pretty enjoyable, in fact!  I really don't know what to say; I can't decide if I love it or hate it!<br /><br />Level 11 -- Wow--great opening shot.  The level looks fantastic at first blush.  Once we fall down to the elevators, though, it's tough to say what's going on; we can't see the plasma below, and after that, there's no right border on the level.  It's like the level got cut off on that side, or something.  The starting section is GREAT, but the rest of the level is a little confusing--I found it frustrating that the elevator could push me off the Green Keycard platform to my doom.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>  Would've got the Keen Award for sure.<br /><br />Level 12 -- Uh... Where is the Blue Keycard?  Cute level, pun and all, but feels incomplete.  Would've got the Scrub Award if not for that."
	},
	{
		"id": 10350,
		"title": "Re: Votes!",
		"author_id": 1486548,
		"author_name": "ceilick",
		"timestamp": "2007-03-26T03:05:42.000Z",
		"content": "Level 1<br />Great level, I really enjoyed the switch puzzles.  My favorite part was the room with the Vorticon Elite.  It was very cleverly done so the player could trick the Elite into falling down the tube and out of Keens way. <br /><br />Level 2<br />Good level, nice and short, a few good enemy challenges and some jump puzzles. Scrub Vote.<br /><br />Level 3<br />Good level.  I liked how the level transitioned from in the dark to the lighted rooms.  Cool use of the tiles to make a new Tantulus City too.<br /><br />Level 4<br />Very clever switch puzzles at the start.  It was extremely hard to figure out initially but I really enjoyed it.  I was really disappointed that after solving that first big puzzle with the switches that the level kept going, I was expecting to go to the exit after the yellow door.  I just gave up after that and just cheated. The first part was hard enough, but what came next was insane.  This felt like two levels combined.<br /><br />Level 5<br />Nice level, not extremely complicated and having two ways to the upper area was a neat idea.<br /><br />Level 6<br />Great level and use of backtracking.  Nice use of tiles too.  Also the final battle with those Elites was pretty cool.  Most Keenish.<br /><br />Level 7<br />Hard level, right from the start.  I wasnt able to beat it.  Elite Vote.<br /><br />Level 8<br />Ugh, disgustingly hard.  Interesting use of the some the tiles, the start looked really cool in an artistic sense.  Elite runner up.<br /><br />Level 9<br />Fun level.  I liked the Scrub puzzles and the end was challenging with that elite in the way.  Keenish runner up<br /><br />Level 10<br />Good level, pretty small and straightforward, which was a nice change from the previous incredibly hard levels.<br /><br />Level 11<br />Nice short level, not too challenging.  It could have been longer, but it was still nicely done.  My only major complaint is the blind drops. Scrub runner up.<br /><br />Level 12<br />Another nice short level.  It was somewhat challenging, but I liked it.  Yummy cake."
	},
	{
		"id": 10351,
		"title": "Re: Votes!",
		"author_id": 1485981,
		"author_name": "freeyorp101",
		"timestamp": "2007-03-31T05:45:03.000Z",
		"content": "I was expecting more votes than this.<br /><br />Are we going to close the voting on the 31st as planned or extend it so more people can vote?<br /><br />---Freeyorp"
	},
	{
		"id": 10352,
		"title": "Vote!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-31T06:38:33.000Z",
		"content": "We should at least get Levelass, Grafix, and ElecDude to vote, since they've all commented in the thread... C'mon, guys!  Vote!  :P"
	},
	{
		"id": 10353,
		"title": "Re: Vote!",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-03-31T07:03:22.000Z",
		"content": "I'll be voting... once I've played it some more."
	},
	{
		"id": 10354,
		"title": "Re: Vote!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-03-31T18:15:30.000Z",
		"content": "I already said I can't vote, since I can't complete any of the levels. Don'tcha go puttin' pressure on me now, y'hear? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] ------------------<br />www.ericmushroomwilson.co.uk My website is going to go back online <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10355,
		"title": "Vote!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-31T19:01:59.000Z",
		"content": "Even if you can't COMPLETE the level, you can still give your impressions of it--clearly, one of the twelve is going to strike you as \"Keen,\" one as \"Elite,\" and one as \"Scrub.\"  Some of the already-cast votes said \"I couldn't finish this level.\"  You can just have a disclaimer at the very start of your whole vote set that you \"didn't finish anything.\"  <br /><br />Personally, I don't care that you don't finish all the levels--but I do care that you're not voting at all because of that.  :P"
	},
	{
		"id": 10356,
		"title": "Re: Vote!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-03-31T19:18:42.000Z",
		"content": "Well, okay. I'll vote for some votes, hopefully soon. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] ------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10357,
		"title": "Re: Vote!",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-04-01T07:30:43.000Z",
		"content": "Yeah, I'll extend it, I'm only about half done the levels, and I also want to review.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 10358,
		"title": "Re: Vote!",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-04T12:08:48.000Z",
		"content": "Still need time to play them all and vote. If I don't get around to playing them all, warn me when this is closing soon so I can post what I typed so far.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10359,
		"title": "Re: Vote!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-04-04T12:10:46.000Z",
		"content": "I haven't been on the computer as much as usual lately, so I haven't played/written about the levels yet, but I'll try to get around to it. Sorry. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] ------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10360,
		"title": "Re: Vote!",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-04T17:03:04.000Z",
		"content": "Sniff. You convinced me. I'm gonna download it and vote. I should be voting next week (college stuff, sorry).------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 10361,
		"title": "Re: Vote!",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-04-05T09:51:35.000Z",
		"content": "I forgot I was going to be away for around two days, probably with no internet. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />At this point it'd be unwise to promise anything as regards the voting. Sorry guys. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] ------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10362,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-05T14:04:32.000Z",
		"content": "<b>I wrote:</b> <i>Is there a way to determine each level's number without viewing them with a Keen level editor? There are some signs in the game map, but I don't understand it.</i><br /><br />Never mind, I should have read the topic more carefully in first place.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 10363,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-04-09T22:44:27.000Z",
		"content": "Keenest: <b>Level 3</b>. This level sort of seemed to have the least instances of out of place tiles and other things that don't \"look right\" for a Keen 2-esque level. I liked the atmosphere created by the lack of light at first, as well.<br /><br />Elite: <b>Level 7</b>. They were all ridiculously hard, at least for me, but this seems to stand out as one where it's difficult to even get past the very start of the level.<br /><br />Scrub: <b>No vote</b>. I couldn't finish any of the levels, so I can't really vote for this one I don't think.------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 10364,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-04-20T02:22:03.000Z",
		"content": "So, a month late but...<br /><br /><b>Level 01:</b> Fun level, not too hard, I enjoyed it.<br /><b>Level 02:</b> Very easy (but fun)...the lack of borders was disappointing though (Vortikids just walked through the edge).  <b>Scrub Vote</b><br /><b>Level 03:</b> Guns!!!  Seemed a little incomplete at the beginning though, with lots of empty space.<br /><b>Level 04:</b> Delightfully challenging, I had a huge sense of accomplishment when I finally got through it.<br /><b>Level 05:</b> Kind of basic, but the multiple paths were cool.<br /><b>Level 06:</b> A decent level...those Vortikids made my skin crawl.  Having the Elites boxed in seemed a bit of a cop-out though.<br /><b>Level 07:</b> So freaking sadistic and unfair to the player...it took me forever to beat, and I didn't enjoy it.  <b>Elite Vote</b><br /><b>Level 08:</b> Somewhat difficult.  Some of those traps were a bother.<br /><b>Level 09:</b> Nice and easy.  I liked the Teddy Bear secret.  The vertical shaping was a nice switch.  All-in-all: <b>Most Keenish Vote</b><br /><b>Level 10:</b> Very easy.  Other, impossible levels that came before prepared me to beat the level without using the keys.<br /><b>Level 11:</b> Simple, short, can't complain.<br /><b>Level 12:</b> Uh...how did this one make it in?  \"Piece of Cake\"?  Whatever!   Unfinished and untested.<br /><br />So there we have it!  I dunno if there's a clear winner but...hey, it's better than nothing!<br /><br />Tallies coming up soon.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 10365,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-04-20T12:06:01.000Z",
		"content": "Garsh darnit, I can't seem to find myself playing the mod again. So here are my results.<br /><br /><br />1: This one was very difficult. There are lots of enemies in one place at some spots, and there are places you can get stuck in inevitably (which makes you have to reload/restart the game).<br />Some spots are quite difficult, like the part on the northwest of the level with the Vorticon. I wasn't able to make it through this level without cheating. The right half of the level was better and a lot more enjoyable.<br />I found this level mediocre.<br /><br />2: Pretty good, not too easy, but not too difficult either. Played through nicely and in only one try. Enough shots available, key placement and overall level design are pretty smart. I liked this level.<br /><br />3: This one is pretty difficult, but the map design is great. It wasn't impossible to do until I had to get the red keycard, after which I stopped trying to get it, since it seems impossible.<br />This level was good from what I played, too bad there's an impossible part in it.<br /><br />4: This one played ok in the beginning, then became impossible. Am I that bad at Keening, or are these levels just damn hard?<br /><br /><br />I typed these some time ago now, so I couldn't say who's best in my opinion.____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 10366,
		"title": "Re: Keen 2 Level Competition VOTE:",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-04-20T16:59:27.000Z",
		"content": "Don't wait for me, I'm definitively not voting for this. Sorry.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	}
]
