[
	{
		"id": 1134,
		"title": "Does the United States need universal health care?",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-08-02T23:49:10.000Z",
		"content": "Does the United States need universal health care?<br /><br />[url=http://en.wikipedia.org/wiki/Universal_health_care]en.wikipedia.org/wiki/Universal_health_care[/url]<b>Rorie</b>"
	},
	{
		"id": 25592,
		"title": "Re: Does the United States need universal health care?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-03T00:21:05.000Z",
		"content": "Well, every single country would need one, but that's not just possible.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 25593,
		"title": "Re: Does the United States need universal health care?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-08-03T21:05:52.000Z",
		"content": "Keenrush wins.<br /><br />Thread closed.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 25594,
		"title": "a bad joke",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-08-03T22:01:02.000Z",
		"content": "It'd be nice to have Universal Health Care... who knows what'd happen if I got the Vorti-Pox or that embarassing Shikadi Skin Rash.  :P"
	},
	{
		"id": 25595,
		"title": "Re: a bad joke",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-04T21:24:14.000Z",
		"content": "KeenRush wins. But I don't get ill. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />(Isn't \"the US\" plural btw? So ARE the US, not IS the US?)____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 25596,
		"title": "Re: a bad joke",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-08-04T21:31:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr](Isn't \"the US\" plural btw? So ARE the US, not IS the US?)[hr][/quote]<br />I don't see what you are talking about. As in, I don't see who made that mistake in this thread...<br /><br />But not really. If you talk about the US as a country then it is a single entity. If you talk about the States inside the US then it is plural.<br /><br />The United means combined into a single entity. So therefore it is single.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 25597,
		"title": "Re: a bad joke",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-04T21:33:19.000Z",
		"content": "Weird. But ok. (Why wasn't I taught that in school, dammit! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] )____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 25598,
		"title": "Re: a bad joke",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-04T23:47:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't see what you are talking about. As in, I don't see who made that mistake in this thread...[hr][/quote]<br />[quote]<b><i>Quote:</i></b>[hr]Does the United States need universal health care?[hr][/quote]<br />That would've been \"Do the US need[...]?\" otherwise.<br />I'd have to agree that regarding the US as singular is strange.<br /><br />If I have a bag of stones, I say \"the stones are in the bag\", but with the way the US-thing works when talking about the collection of stones I'd also say: \"the stones is too heavy to carry\", which simply sounds wrong.<br />Oh well, I suppose it's the same for the Netherlands when referring to it in English.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 25599,
		"title": "Re: a bad joke",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-08-06T15:09:43.000Z",
		"content": "The United States.  Key word there being \"United\".  Since it's the name of a country and not of the States, it is treated as singular. (Leastways, in every single American conversion I've ever had is has.)<br /><br /><br /><br />Now, the answer to the OP:  No.<br /><br />Everyone needs food, land, and a house, too.  Should the government provide that?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 25600,
		"title": "Re: a bad joke",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2006-08-07T05:26:29.000Z",
		"content": "[hr]<b>Globox</b> Key word there being \"United\". Since it's the name of a country and not of the States, it is treated as singular.<br />[hr]I don't think logic counts here. Most of the time it's referred to as the United States, yet its citizens call themselves Americans (which theoretically should include Canadians since they're on the same continent [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  HERESY!).<br /><br />Anyway... yeah, KeenRush said it all. It makes sense that everyone should have access to health care, but economics is by definition don't make sense. [Bad grammar intended]"
	},
	{
		"id": 25601,
		"title": "Re: a bad joke",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-09T12:18:44.000Z",
		"content": "If Spleen and I joined forces, we'd have... well, joined forces, or combined forces if you prefer.<br />If I would refer to that, I'd still use plural, unless I was referring to the idea.<br />(I didn't just say: \"If I would refer to those\".)<br /><br />\"Our combined forces is very strong!\" just sounds strange.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 25602,
		"title": "Re: a bad joke",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-10T05:24:01.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I don't think logic counts here. Most of the time it's referred to as the United States,[hr][/quote]<br /><br />Indeed, this has become a collective noun, like the 'flu<br /><br />[quote]<b><i>Quote:</i></b>[hr] yet its citizens call themselves Americans (which theoretically should include Canadians since they're on the same continent [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-surprise.gif[/img]  HERESY!).[hr][/quote]<br /><br />They believe themselves to belong to a political entity 'America' not the continent america. Thus Germans are in germany and don't count other eurpeans in it. Its a coincidence of names. Call the thin canarica or something.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 25603,
		"title": "Re: a bad joke",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-09-25T03:46:57.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The United States. Key word there being \"United\". Since it's the name of a country and not of the States, it is treated as singular. (Leastways, in every single American conversion I've ever had is has.)[hr][/quote]<br /><br />people who can afford health insurance need to think about the millions of americans who can't afford health insurance + the u.s government should start funding a universal health care system cos america's poorest need it, i know there's [url=http://en.wikipedia.org/wiki/Medicaid]medicaid[/url] but as it says not every american can apply for it, there's always a [url=http://en.wikipedia.org/wiki/Free_clinic]free clinic[/url] but not everyone gets in plus the doctor's aren't paid anything for offering their services in a place like that<br /><br />think about it<b>Rorie</b>"
	},
	{
		"id": 25604,
		"title": "Re: a bad joke",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-10-06T02:53:23.000Z",
		"content": "just found this on foxnews.com<br /><br />if you don't want to scroll down just [url=http://www.foxnews.com/story/0,2933,215838,00.html]click here[/url]<br /><br />Americans should have universal access to health insurance by the year 2012, a congressionally mandated report concluded Monday.<br /><br />The report calls on Congress to move by next year to pass insurance reforms protecting all citizens from catastrophic medical bills using either market-based insurance policies or taxpayer-funded methods.<br /><br />It then calls for new laws guaranteeing universal access to affordable health insurance to be in place by 2012.<br /><br />The report was issued by the Citizens Health Care Working Group, which was directed by Congress to hold a series of public forums nationwide on how to reform the health care system. Congress is required to hold hearings on the report next year.<br /><br />The overwhelming majority of Americans that the working group heard from  want health care system change to begin now, the report states.<br /><br />Approximately 46 million Americans are estimated to lack health coverage. Meanwhile, the cost of private health insurance for a family of four now tops $10,000. The report does not endorse a particular policy for expanding coverage, though experts acknowledged that progress would likely end up encompassing a combination of private incentives and government expansions.<br /><br />Statewide Efforts<br /><br />Sen. Ron Wyden, D-Ore., who co-authored the bill creating the working group, pointed to recent bipartisan reforms in Massachusetts that spread insurance coverage statewide with a combination of market incentives and coverage mandates.<br /><br />Thats the kind of mix that can produce some common ground, Wyden tells WebMD.<br /><br />A report released last week by the Commonwealth Fund think-tank gave mostly dismal scores to the U.S. health care system for running high costs without enough attention to efficiency and quality care.<br /><br />That reports authors acknowledged fundamental reforms would likely have to be incremental because of the electrified politics of the $2 trillion-per-year American health care system.<br /><br />Congress has recently moved to expand access to tax-free health savings accounts. Supporters, including President Bush, say the accounts can increase efficiency by allowing individuals to save and spend more of their own money on medical care. The accounts have been taken up by more than 3 million people, according to health industry estimates.<br /><br />Michael Cannon, director of health policy at the Cato Institute, a free-market think tank, criticized Mondays report for pointing the way to an expansion of governments role in health care.<br /><br />Their market-based model would increase taxes and increase spending. This is not free-market stuff, he says.<br /><b>Rorie</b>"
	},
	{
		"id": 25605,
		"title": "Re: a bad joke",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-11-11T22:37:07.000Z",
		"content": "Well, rorie, you're failing to note a very important part of the American legal system: the amount of lawsuits that go against doctors.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br /><b>rorie:</b><br /><br />people who can afford health insurance need to think about the millions of americans who can't afford health insurance + the u.s government should start funding a universal health care system cos america's poorest need it, i know there's medicaid but as it says not every american can apply for it, there's always a free clinic but not everyone gets in plus the doctor's aren't paid anything for offering their services in a place like that<br /><br />think about it[hr][/quote]<br /><br />I have, and I'm still not inclined to argee.<br /><br />At the end of the day, Rorie, no matter how hard or how powerful your nation is, you're still left with a very basic fact: there is only so many recources.<br /><br />Now, you coul make it fair and give everybody free healthcare.  This sounds great on a moral level, but it fails miserably on a practical level:<br /><br />There is only X amount of money to give to everybody on medicl bills and still function as a nation.  Each middle-class person can recieve a mediocre healthcare, upper-class superior, and lower-class limited/none.<br /><br />Well, that's the system that would be inplace for a true capitalists system, but America is a socialist system, so we have: healthcare providers for old, sick, and orphaned children; and drug prescription help for the elderly.  Now, we want to allocate X money to give to Y poor people.<br /><br />There's only so much X money.  In order to give Y poor person healthcare, you need to take Z middleclass person's money and A rich person's money.<br /><br />Okay, well, if there weren't a lot of poor people, that would be as much of a problem.  But the real problem is, poor people tend to get injured more than middleclass/upperclass people do, and have a lot more kids that middleclass/upper class people do (As I've noticed, poor people get sick more and are more likely to get a STD's)  Sad, but emotions aside, this is going to cost a hell of a money.  Like, a HELL of a lot of money.<br /><br />You are asking for people to lower their healthcare standards so that someone else can get healthcare.  I'm not comfortable with that idea.  Charity is a great thing, but not forced philanthropy.<br /><br />If there was a way to give people free drugs and healthcare without damaging everyone else, I'd think about supporting that model, but there is no real way to get around the problem of there only being X amount of money for healthcare.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
