[
	{
		"id": 914,
		"title": "Survival",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-20T07:06:04.000Z",
		"content": "My mother sent me this; its something for the older peoples in the forum to ponder. [Joo young peoples can bugger off!]<br /><br />WE SURVIVED the 1930's 40's, 50's, 60's &amp; 70's !! <br /><br />First, we survived being born to mothers who smoked and/or drank while they carried us. <br /><br />They took aspirin, ate blue cheese dressing, tuna from a can, and didn't get tested for diabetes. <br /><br />Then after that trauma, our cots were covered with bright colored lead-based paints. <br /><br />We had no childproof lids on medicine bottles, doors or cabinets and when we rode our pushbikes, we had no helmets, not to mention, the risks we took hitchhiking. <br /><br />As children, we would ride in cars with no seat belts or air bags. <br /><br />Riding in the back of a ute on a warm day was always a special treat. <br /><br />We drank water from the garden hose and NOT from a bottle! <br /><br />We shared one soft drink with four friends, from one bottle and NO ONE actually died from this. <br /><br />We ate cupcakes, white bread and real butter and drank soft drink with sugar in it, but  we weren't overweight because  WE WERE ALWAYS OUTSIDE PLAYING! <br /><br />We would leave home in the morning and play all day, as long as we were back when the streetlights came on.. <br /><br />No one was able to reach us all day. And we were O.K. <br /><br />We would spend hours building our go-carts out of scraps and then ride down the hill, only to find out we forgot the brakes. After running into the bushes a few times,  we learned to solve the problem. <br /><br />We did not have Playstations, Nintendo's, X-boxes, no video games at all, no 99 channels on cable, no video tape movies, no surround sound, no cell phones, no personal computers, no Internet or Internet chat rooms..........WE HAD FRIENDS and we went outside and found them! <br /><br />We fell out of trees, got cut, broke bones and teeth and there were no lawsuits from these accidents. <br /><br />We ate worms and mud pies made from dirt, and  the worms did not live in us forever. <br /><br />We were given slingshots for our 10th birthdays, <br />made up games with sticks and tennis balls and although we were told it would happen, we did not put out very many eyes.   <br /><br />We rode bikes or walked to a friend's house and knocked on the door or rang the bell, or just walked in and talked to them! <br /><br />Under 12 footy had tryouts and not everyone made the team. Those who didn't had to learn to deal with disappointment.<br />Imagine that!! <br /><br />The idea of a parent bailing us out if we broke the law was unheard of. They actually sided with the law! <br /><br />This generation has produced some of the best risk-takers, problem solvers and inventors ever! <br /><br />The past 50 years have been an explosion of innovation and new ideas. <br /><br />We had freedom, failure, success and responsibility, and we learned <br /><br />HOW TO DEAL WITH IT ALL! <br /><br />before the lawyers and the government regulated our lives for our own good. <br /><br /><br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 22349,
		"title": "Re: Survival",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2005-12-20T12:26:01.000Z",
		"content": "Lol, It was supposed to be fake right?___________________________________________<br />[url=http://greenftechn.com/brandon]greenftechn.com/brandon[/url]<br />-proud member of the      \"tough guys wear pink\" society- <br />[img]http://greenftechn.com/brandon/images/tough_guys_wear_pink.gif[/img]"
	},
	{
		"id": 22350,
		"title": "Re: Survival",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-20T13:30:00.000Z",
		"content": "I wish my childhood would've been like that.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  Almost all but not 'no personal computers' part.<b>Eat your veggies!</b>"
	},
	{
		"id": 22351,
		"title": "Re: Survival",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-12-20T20:22:53.000Z",
		"content": "Suggested title: \"The way things should be\".<br />Thanks, LevelLord [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 22352,
		"title": "Re: Survival",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-01-12T17:53:35.000Z",
		"content": "Necessity, ever the mother of invention.  I do miss this.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	},
	{
		"id": 22353,
		"title": "Re: Survival",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2006-01-12T19:06:07.000Z",
		"content": "It's strange seeing things through parent's eyes. It was their lives and their world, but now it's not. It can be hard to deal with it, and we too will know what it's like 30 or 40 years from now. But till then, I don't care [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  I wouldn't like to live in their world even though ours could be better or different.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 22354,
		"title": "Re: Survival",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-01-12T22:49:24.000Z",
		"content": "(completely unrelated), Gosh, I can't believe I still have that sig!  That must've been three years ago![quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote]"
	}
]
