[
	{
		"id": 1057,
		"title": "Good news for graphics",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-08-03T04:00:09.000Z",
		"content": "Hey I forgot to mention this a couple days ago, and now you have to log in to read the article yourself. (meaning, obtain a login... but that's pretty easy.)<br /><br />Looks like good news for those around here who have copies of Photoshop that may have been, shall we say, obtained through non-standard methods [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pirate.gif[/img] .<br />(I'm sure most of you paid $600 for your copy, so this doesn't matter to you [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  )<br /><br />Near the end of an article on www.thejakartapost.com, Adobe's South East Asia Group Manager made the following comments:<br />\"If you make money using our software, then you must pay us\" \"You use it for hobby, we won't bother so much\"<br />(Those were the relevant quotes, the article was from August 1, 2005, titled \"King of graphics making formal entry into Indonesia\".)"
	},
	{
		"id": 24664,
		"title": "Re: Good news for graphics",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-08-03T11:55:42.000Z",
		"content": "I think most companies that produce big software packages are like that - if you use it yourself they don't mind if it's pirated, because then you're learning how to use it.  Once a lot of people know how to use it, corporations are more likely to standardise on that product, and that's where the software companies make their money.<br /><br />If they forced everyone to buy it and threatened home users with lawsuits, a lot less people would actually get hold of the software (would you spend $600 on a program you'd never used before, if you weren't sure it would do what you want?)  If this happened the program wouldn't be as popular, so the companies that did this would only make their money through relatively small sales to end users.<br /><br />This is why when I went through school Apple were giving schools free computers - they realised that if the kids grew up using Apple computers, their parents would be more likely to buy Apple and when school was finished there'd be a bunch of Apple experts out in the workplace - all of which would help future sales of their products.  It's the same in the software industry, a limited amount of piracy actually helps sales."
	}
]
