[
	{
		"id": 1251,
		"title": "Stop Making Sense",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-07-10T05:16:22.000Z",
		"content": "Has anyone here ever seen this great concert film? The direction is <i>amazing</i> on it (it was done by John Demme years before Silence of the Lambs), allowing you to enjoy the film even if you don't enjoy the music (Talking Heads). In my opinion, it is far superior to [url=http://en.wikipedia.org/wiki/The_Last_Waltz]The Last Waltz[/url].<br /><br />Has anyone else out here seen it? If not, I urge you to, <i>pronto</i>.-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	},
	{
		"id": 27342,
		"title": "Re: Stop Making Sense",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-07-10T06:28:46.000Z",
		"content": "I'm in the process of downloading it now, and shall post here when I've watched it. I vaguely recall looking up some Talking Heads music and not really liking it much, but I'll give it a shot anyway."
	},
	{
		"id": 27343,
		"title": "Re: Stop Making Sense",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2007-07-12T22:37:41.000Z",
		"content": "As the music was so... well... diverse (the first album had punk overtones, the second sounded like 60's pop music, the third was more 70's rock, the fourth was African funk, the fifth was pop-funk, the sixth was straight-up pop, the seventh was \"American,\" and the eight was an \"interesting\" African-Latin hybrid), you have to <b><i>really</i></b> listen to them <b><i>alot</i></b> to like them.<br /><br />At least you're trying it out, though. I'm excited to hear your response...<br /><br />Edit: And in case no one has realized this, my sig is a quote from a Talking Heads song [\"Born Under Punches\" from Remain In Light].-----------------------------------<br />[url=http://youtube.com/watch?v=izxrocVNVOk]Dnde Esta Jeff? [/url]<br />Take a look at these hands! The hands speaks. The hand of a government man."
	}
]
