[
	{
		"id": 1153,
		"title": "Drugs",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-20T22:10:10.000Z",
		"content": "No, not whether they should be legalized, I'm talkin 'bout the already legal ones; namely, medicines.<br /><br />Over the last two decades the definition of 'ilness' has been widened, and we're even hoping for 'superhealth'; trying to be healthier than whats normal. To this end we now consume record numbers of antidepressants, sleeping pills, weightloss tablets, vitamins, Statins and supplements, many of which have no or negligible benefit, and may even cause harm. The drug companies themselves have adopted a 'sell to everyone' policy, and are now providing considerible 'incentive' and 'training' to medical practitiors to encourage 'proper perscription and use of products' So the question is; 'do you think we need to find some way of curbing our 'medicine' intake?'A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 25882,
		"title": "Re: Drugs",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-21T08:56:31.000Z",
		"content": "Well, personally I take absolutely nothing (except medicine to prevent allergic reactions, on some summer days when I feel horrible [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] ). But yeah, people eat a lot pills these days, and it may be somekind of a problem. Probably some of the stuff should be dropped and be replaced by something like eating other food than just junk-food, going outside -- however I see in big cities going out is out of question, and people don't have time or interest or are too tired to cook anything.. Anyways, a lot of those things are just another way to rip of our money.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 25883,
		"title": "Re: Drugs",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-08-21T21:02:49.000Z",
		"content": "I think people do tend to medicate too readily. Some people really do need them -- pain killers after surgery, antihistamines for the severely allergic, and so on -- but taking whatever medication you think might help every time you get mildly ill is overkill, and some people do that. I'm lucky enough not to require medication for anything serious, so I never take any medicine at all.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 25884,
		"title": "Re: Drugs",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-08-22T04:06:56.000Z",
		"content": "Drugs have saved my joints from destroying themselves once, so I like them.  But some people do tend to take them too much.  Also, a lot of prescription drugs are quite a bit more dangerous than many illegal drugs, so at least in the US, the scheduling system really needs an overhaul.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 25885,
		"title": "Re: Drugs",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-22T15:17:26.000Z",
		"content": "Where I live, nobody takes pills.<br /><br />My dad once took pills after his heart attack, but they gave him the wrong pills which made his heart beat too fast, instead of calming his heart. He stopped taking them immediately.<br /><br />Drugs can be dangerous, when people take the wrong ones at the wrong moments. And a mix of pills can even become more dangerous.____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 25886,
		"title": "Re: Drugs",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-23T11:44:50.000Z",
		"content": "Yeah. It may be the best to stay away from that stuff entirely unless one really needs something to stay alive.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
