[
	{
		"id": 154,
		"title": "KEEN 6 song question",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-07-31T20:27:42.000Z",
		"content": "In the final level of Keen 6 where you get Molly, there's this one song that only appears on that level. Near the beginning of that song, there's this sequence of beeps that is morse code. I'm pretty sure it starts out, S.O.S, S.O.S, but I don't remember the rest that my dad told me (which was a long time ago). You kinda have to know morse code cuz it goes by a bit quick. Does anyone know the full message?The Universe is Toast..."
	},
	{
		"id": 3827,
		"title": "Re: KEEN 6 song question",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-31T20:55:09.000Z",
		"content": "It's something that i think doesn't make sense. I used the midi, though, so i'll have to look at the imf.<br /><br />EDIT: hmm... It looks like _.././_._/././_./_._ in the midi, but the imf goes too fast to decode (at least for me). Hmm... just one \".\" isn't a letter. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] -Genius314"
	},
	{
		"id": 3828,
		"title": "Re: KEEN 6 song question",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-07-31T21:03:57.000Z",
		"content": "Long live Google!<br />[url=http://www.3drealms.com/faq/keenfaq199.txt]www.3drealms.com/faq/keenfaq199.txt[/url]Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 3829,
		"title": "Re: KEEN 6 song question",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-31T23:41:00.000Z",
		"content": "I knew they did a morse code thing in Wolfenstein, but I didn't know they did this in Keen, too. Interesting.-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 3830,
		"title": "yay",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-08-01T00:39:42.000Z",
		"content": "At the time this was originally discovered, we learned that DE is abbreviation in morse code for \"This is,\" and K was short for \"Over,\" or \"End,\" or something.  So the entire message, which was SOS SOS DE KEEN SOS SOS K, would just be saying \"Hey, help, this is Keen, over.\"  :-)<br /><br />If I remember correctly, Bobby Prince confirmed it, too."
	},
	{
		"id": 3831,
		"title": "Eye eye eye...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-08-01T02:45:08.000Z",
		"content": "Wow. That's classy... it never crossed my mind that that could be morse code at the start of the song.<br /><br />Something else I just remembered about that level... did anyone else ever save the game while standing on that dangling eyeball on the roof of the first purple room after the door maze? When you load the game back up again, the screen doesn't centre on Keen, but instead watches the area in which Molly is kept captive (IIRK).<br /><br />I don't think I've tried it since the early nineties, so I'm not sure if it's a certain version that does it.Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 3832,
		"title": "Re: Eye eye eye...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-08-01T05:19:50.000Z",
		"content": "OMG! You noticed it too? I still have that saved game! I thought it was a total error.A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 3833,
		"title": "just one dot...",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-01T06:49:28.000Z",
		"content": "actually, just one dot IS a letter, letter \"e\" to be exact.<br />[url=http://www.babbage.demon.co.uk/morseabc.html]www.babbage.demon.co.uk/morseabc.html[/url]<br />that's a link to a translation page.<br />I only have a few characters memorized, but I couldnt pick it out from hearing it, I would have to read it on paper.<br />...--  .---- ....- (314 in morse code)The Universe is Toast..."
	},
	{
		"id": 3834,
		"title": "Re: just one dot...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-01T07:25:33.000Z",
		"content": "Yeah, I knew there was morse code in it by I didn't remember the message anymore. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  It's really cool, though. If I remember correct Retodon8 posted the deciphered translation as first post when he joined the board.<br /><br />\"Something else I just remembered about that level... did anyone else ever save the game while standing on that dangling eyeball on the roof of the first purple room after the door maze? When you load the game back up again, the screen doesn't centre on Keen, but instead watches the area in which Molly is kept captive (IIRK).\"<br />Yeah. I can't really remember the version number either..<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 3835,
		"title": "re:",
		"author_id": 1486167,
		"author_name": "Yowza",
		"timestamp": "2005-08-01T08:02:13.000Z",
		"content": "That happened to me just a few weeks ago... it was the first time I'd noticed it. It annoyed me, I had to start the level again :/<br /><br />I might still have the saved gave too. The version I was using was 1.0 if anyone wants to know."
	}
]
