[
	{
		"id": 1266,
		"title": "Hoodwinked",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-08-04T14:15:51.000Z",
		"content": "I liked this movie quite a bit; while primarly a kids movie, I qualify, so stop sniggering. It has quite a bit of adult aimed humour in it though, and it takes a wacky look at an old fairytale I've always thought was a bit suspect.<br /><br />My favourate part was 'I found some candles!' 'What kind?' '*lights* 'Dee-no-mee-tay!'<br /><br />All in all its a movie I'd actually buy a video of, rather then wait for it to appear on tv, so yeah, better than most animated crap.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 27650,
		"title": "Re: Hoodwinked",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-04T16:15:20.000Z",
		"content": "\"I qualify\"<br />Yeah, as it's probably for kids from 4 to 8 years old. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />Anyways, no, haven't seen it, but I know it. I guess it could be fun.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 27651,
		"title": "Re: Hoodwinked",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-08-04T17:23:15.000Z",
		"content": "Hey don't go dissing her KeenRush.<br /><br />I liked Lilo and Stitch. (Then again who didn't?)<br /><br />I heard hoodwinked was pretty good. But didn't it come out like last year?-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 27652,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-08-04T17:52:55.000Z",
		"content": "*raises hand* I did not appreciate Lilo and Stitch.  <img src=\"http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif?ttinline=true\"/>  I felt that the art direction of the movie strayed too far from Disney's rich animation heritage, and looked far too computer-assisted for me to really appreciate it.  Same with Mulan, and to a lesser extent, Hunchback and Tarzan.  I won't even touch the disaster that was Atlantis, even if it did try to adopt 101 Dalmations-style character designs.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  {/critic}<br /><br />I haven't seen Hoodwinked, but from a 3d-animation perspective, the preview looked extraordinarily sloppy, and the character design didn't appeal to me at all.  A co-worker of mine who watched it said that the writing was lackluster and he confirmed my suspicion about the level of animation.<br /><br />That said, I'm glad you enjoyed it, anyway.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  I hope the 3d animation business continues to thrive--but I also hope that the quality increases as directors become more familiar with the differences between 2d and 3d animation.<br /><br />I'd be curious what Ilsoap had to say about such stuff... he's going into a CAREER of this stuff, isn't he?"
	},
	{
		"id": 27653,
		"title": "Re: hehe",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-08-04T18:58:44.000Z",
		"content": "Yes it was incredibly behind in the 3D. It almost looks like a 3D TV show instead of a movie. But if something looks cheap that doesn't neccacarilly mean it will be bad. Take for example, Aqua Teen Hunger Force...<br /><br />Okay horrible example.<br /><br />Take for example Rocky and Bullwinkle. It looks like garbage but it is still very funny. (If you understand what they are talking about.)<br />Or South Park. (Personally I don't like it but a lot do.)-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 27654,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-08-04T20:22:08.000Z",
		"content": "Rocky and Bullwinkle had good quality writing, but suffered from being low budget... you know they actually crossed the border from southern California down into Mexico to have the cels painted cheaper, and actually re-used much of the acetate to save costs... as a result, there are very few 'original' cels available for auction/collection.  Either way, the writing saved the show--without it, it'd be \"just another cartoon.\"  <br /><br />From what I hear, Hoodwinked didn't really have writing.  Interesting premise, horrible execution.  Don't get me wrong; I'll probably end up renting it some time just to be 'literate' in 3d movies (I've been putting off seeing Shark Tale because I hear it's worse than anything I can imagine)... but my initial impression of this wasn't enough to warrant purchasing a ticket.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 27655,
		"title": "Re: well...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-08-04T21:31:45.000Z",
		"content": "I wasn't really bored by it, but the humour wasn't too funny either, so my parents turned it off around 1/4 of the movie. (It was on TV.)____________<br />I have a boring signature.<br /><br />...<br />Ah, [url=http://DaVince.sitesled.com/]site[/url]."
	},
	{
		"id": 27656,
		"title": "Re: well...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-05T08:29:53.000Z",
		"content": "It only recently got to theatres around here! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img]  Damn time lag!<br /><br />\"(Then again who didn't?)\"<br />I didn't. I think both of them were annoying. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 27657,
		"title": "Re: well...",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-10-15T07:45:23.000Z",
		"content": "XKY, Shark Tale is tolerable. It has a lot of \"trying to be cool\" in it, and a lot more \"and then some stuff happened\" writing, and ends in a pretty terrible moral that I doubt anyone who isn't a zombie could swallow (without retching). But it's still alright. It's not as juvenile as most CG movies are.<br /><br />Anyway, back on topic... I gave Hoodwinked a miss, because the characters looked like they were designed by a 10 year old with a 3D graphics program, and the teaser clips I saw proved that the writers were basically scraping up all the fairytale remnants that were overlooked by Shrek and Chicken Little and Shrek 2 and Shrek 3D and Shrek's Chistmas f**king special etc etc et-f**ing-c.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-disguised.gif[/img]   <br /><br />----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	}
]
