[
	{
		"id": 1340,
		"title": "Achtung!: Wolfenstein 3D Mods",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2007-03-06T01:05:33.000Z",
		"content": "I wrote this article for another forum, but I figure you guys around here would be far more interested.<br /><br />Everyone on the internet ought to know about Wolfenstein 3D.  It's pretty much a given.  But just in the event that you aren't in the know, Wolfenstein 3D is considered the granddaddy of all first person shooters, and thus is often referred to as the first FPS ever.  (This is wrong, of course; Wolf3D comes in at third following Hovertank 3D and the Catacomb series.)  Still, it is the one that truly popularized them all.  The story follows the adventures of one-man army William J. Blazkcowicz, known to his friends as BJ, and his legendary World War II exploits.  It was a very fun game, as was the sequel, Spear of Destiny.<br /><br />What most people DON'T know is that there is a [url=http://diehardwolfers.areyep.com]thriving online Wolf3D community[/url] that's still going strong to this day.  Not only that, but ever since the release of the game's source code a number of years ago, a number of high-quality mods based off of the engine with various enhancements have been released.  Some of the games are so great in terms of upgrading the engine that you'd hardly know they were based off the same engine if you weren't downloading them from a Wolfenstein 3D website.  Others still have very few changes to their name but still create a unique and fun game environment.<br /><br />I'm here as an advocate for these games, which are relatively unknown outside of the Wolfenstein 3D community.  You can find a multitude of these games at the [url=http://www.wolfenstein3d.co.uk/news.htm]Wolfenstein 3D Dome[/url], which is by and large the biggest and best resource for Wolfenstein 3D mods that's out there.  And just to make it convenient for all of you, I'm going to include a list of my personal favorite mods ever and short plot descriptions thereof as a good place to start for anyone who's interested.  Most of them have won Dome Awards for high quality, so I assure you they're worth playing.<br /><br /><ul><li>\"[url=http://www.areyep.com/RIPandMCS-EoD-Main.html]End of Destiny[/url]\", by AReyeP and MCS.  Sequel to an earlier mod, \"Spear: Resurrection\", EoD is acclaimed as one of the best--if not the best--Wolfenstein 3D mods ever made.  The story here picks up where SR left off.</li><li>\"[url=http://www.areyep.com/RIPandMCS-Spearres-Main.html]Spear: Resurrection[/url]\", by AReyeP and MCS.  Designed as a sequel to iD's \"Spear of Destiny\", this game follows the story of the recapture of the legendary spear that pierced the side of Christ, this time with the intention of resurrecting the mad leader of the Third Reich, Adolf Hitler!</li><li>\"[url=http://www.brlowe.co.uk/FullSpear.zip]The False Spear[/url]\", by WLHack.  This game takes place far into the end of WWII, and follows BJ Blazkowicz deep into a plot involving the order of Himmler and an ultimate weapon designed by the mad Dr. Schabbs.</li><li>\"[url=http://www.brlowe.co.uk/wolfreloaded-final.rar]Wolfenstein Reloaded - Final Version[/url]\", by KFH Games.  WR is a complete retelling of the original Wolfenstein 3D's story, only with a much more advanced version of the engine, including new levels, smarter AI, more accurate weapon functionality, the ability (and necessity) to hide dead bodies, and much more.  (Note: To play this game, you need the two AUDIO files from the registered version of the original Wolfenstein 3D.)</li><li>\"[url=http://mods.moddb.com/2466/the-orb-of-dilaaria/downloads/]Orb of Dilaaria[/url]\", by Adam Biser.  One of the most advanced mods ever released, this one takes place in medieval times in a fantasy world of magic and monsters.  In this one, you play as a royal guard who has to defeat the Dark Army of Wersin to recover the Orb of Dilaaria and save the seven kingdoms from being plunged into darkness!</li><li>\"[url=http://www.brlowe.co.uk/MED030306.zip]medEvil[/url]\", by Majik Monkee.  Another medieval adventure, medEvil casts you as Ardrynn, the last in the line of Chosen Warriors who are the only ones able to destroy the evil Count Barcruel.  Just as the evil wizard Orlax has brought the Count back from the dead, so too have you been brought back to Wisenheim to track down and destroy this monster.</li><li>\"[url=http://www.brlowe.co.uk/TrenchWarfare1.0.zip]Trench Warfare[/url]\", by The Josh.  A highly advanced game which accomplished many things never seen in the Wolf3D engine before, Trench Warfare is the story of allied Sgt. Raynor, a one man army on a mission to recover stolen documents, and make the Nazi spies who stole them pay!</li><li>\"[url=http://www.wolfenstein3d.co.uk/Blobs3D.zip]Mutant Blobs from Uranus 3D[/url]\", by Ringman.  A very funny, very early 90's feeling mod, MBU3D is the story of one astronaut and his struggle against mutated blobs that hail from Uranus.</li><li>\"[url=http://www.wowway.com/~da59/wolfenstein/todpfad.html]Operation: Todpfad[/url]\", by Kyle Albert.  The strange tale of a depressed Eva Braun looking to take over the world after the death of Adolf Hitler, and our hero BJ Blazkowics heading to her castle to stop her.  A very professional looking mod.</li><li>\"[url=http://www.haasboy.com/]Double Trouble[/url]\", by Haastboy Software.  Sequel to another mod, \"Rising Evil\", Double Trouble finds our constant hero BJ following the trail of mad scientist Franz Schabbs as he creates twisted abominations against God and nature and attempts to bring life back to his brother, Dr. Artz Schabbs.  (Note: This mod features voice acting by yours truly!  :d)</li><li>\"[url=http://www.wolfenstein3d.co.uk/OMS2final.zip]Operation: Mutant Strike 2[/url]\", by Majik Monkee.  The sequel to the earlier \"Operation: Mutant Strike\", this installation was put together by the older brother of the original's.  In this installment, BJ Blazcowicz has been kidnapped by a terrorist agent calling himself \"The Silver Fox\", who appears to be the man who was behind the chemical weapons used by the Nazis during the original \"Operation: Mutant Strike\".  It's now up to special agent Jill Hunter to break into the labs where BJ is being held and help him escape, and to put an end to all of this.</li><li>\"[url=http://www.wolfenstein3d.co.uk/omsfinal.zip]Operation: Mutant Strike[/url]\", by Dumscheissekopf.  After the end of \"Operation: Letzterschutz\", an evil figure known only as \"The Raven\" has resurrected all the soldiers who died in that particular affair as horrible mutants, and now only special agent Jill Hunter can put a stop to them.</li><li>\"[url=http://www.wolfenstein3d.co.uk/OL083104.zip]Operation: Letzterschutz[/url]\", by Majik Monkee.  After the end of WWII, a large portion of the remaining Nazis led by Wolfgang Eisenkreiger and Emmet von Braun took refuge under a South American dictator while trying to rebuild their army and create a military masterpiece, the \"gyropanzer\".  But lining El Presidente's pockets and building a war machine proves too expensive, and they take a sub to Germany to recover more hidden treasure.  The allies had discovered the plan by this point, however, and an unexpected passenger was taken aboard in Germany.  BJ Blazkowicz.</li><li>\"[url=http://www.belowe.com/HOS_SE.zip]Halls of Stonehenge: Special Edition[/url]\", by ack and Majik Monkee.  Taking place after the events of the original Halls of Stonehenge, this brings our everpresent hero BJ back to Stonehenge to ward off an otherworldly evil force once more.  This iteration features several new enemies, two updated weapons, and all new levels.</li><li>\"[url=http://www.belowe.com/cstorm.zip]Coming of the Storm[/url]\", by Wolf Skevos-Jones.  BJ Blazkowicz has been sent to Austria to investigate Nazi activities at a castle rumored to be built above the ruins of an underground temple alledged to have been used by a cult called the Faceless Brotherhood who tried to bring about the end of the world by opening a rift between our world and another.  It's rumored now that the Nazis may be doing the same.</li><li>\"[url=http://www.belowe.com/HOS.zip]Halls of Stonehenge[/url]\", by Majik Monkee.  BJ's taken a vacation to England, but the work of a hero is never finished.  A crazed gunslinging archaeologist named Draven has led a group of zelous Nazi occultists into a series of catacombs discovered beneath Stonehenge, where they're resurrecting an ancient evil known as Sarron.  Informed by Professor Von Reinstein of the imminent danger, BJ must venture underground and stop the Nazis before they can bring about the apocalypse.</li><li>\"[url=http://www.wolfenstein3d.co.uk/Quest.zip]Quest For The Amulet[/url]\", by Ian Skevos-Jones.  This mod takes place in Egypt, where the Afrika Korps are searching for an all-powerful relic known as the Amulet of Anubis.  Will BJ be able to stop them in time?</li><li>\"[url=http://www.wolfenstein3d.co.uk/sotgd.zip]Secrets of the Grauburg Dungeons[/url]\", by Kuki.  You play a Nazi soldier who's turned traitor following a series of terrifying, vivid nightmares about the ancient dungeons you've been assigned to guard.  Now, having turned against your comrades, you set out deep into the Grauburg Dungeons to find out what secrets the Third Reich has been searching for.</li><li>\"[url=http://www.wolfenstein3d.co.uk/hzahlung.zip]Operation: Heimzahlung[/url]\", by Wolf-Skevos Jones.  Hitler himself has called for a major offensive against England and France, which could very well spell the end for the allied resistance in the war.  Nobody's sure where the supplies for this offensive, but allied command in the United States has discovered that a good deal of them are being shipped to Castle Stahlburg.  It's your job to put a stop to this military action and save the allies from certain doom!</li><li>\"[url=http://www.belowe.com/prjeisen.zip]Project Eisenritter[/url]\", by Wolf-Skevos Jones.  Dr. Erich Fleischracker has been contracted by the Third Reich to build for them the \"ultimate soldier\".  Once a colleague of Dr. Schabbs, Fleischracker has been doing hideous experiments on human beings for years--with horrifyingly efficient results.  You must stop him before Project Eisenritter is completed!</li><li>\"[url=http://www.wolfenstein3d.co.uk/pvphase1_v1.3.zip]Projekt: Vertilgung[/url]\", by Zach Higgins and James Ingham.  It's a nightmare come true as it's revealed that the mad doctor Artz Schabbs hasn't died after all.  And not only does it seem he's up to his old mutant making tricks, but he's working on a way to clone the Fuhrer himself, allowing for his immortality!  It's up to you to put a stop the the mad doctor and those who are backing his evil project.</li><li>\"[url=http://www.belowe.com/tkopfv12.zip]Castle Totenkopf[/url]\", by Wolf Skevos-Jones.  Your mission was to steal secret plans from Castle Totenkopf, but something went horribly wrong.  After a heavy blow is dealt to the back of your head, you wake up in a cell of the dungeons below.  You're interrogated brutally for weeks, and your will is slowly slipping.  Amidst the cries of other tortured souls, a plan for escape forms.</li><li>\"[url=http://www.belowe.com/welt.zip]Project: Weltuntergang[/url]\", by Kuki.  Disturbing reports of chemical shipments have been going in to the castle Blutigbeil.  Many people in the nearby village have died from drinking water near the castle.  It's up to you to stop the beginning of a new chapter in chemical warfare!</li></ul><br /><br /><br />Note that if you're running them from Windows NT/2000/XP, you'll likely need to run them with either DOSBox or VDMSound.  And if you're at all interested in having a look at any more mods, again, you'll want to check out the [url=http://www.wolfenstein3d.co.uk/news.htm]Wolfenstein 3D Dome[/url].  For extensive news on any new and upcoming mods, you'll be wanting to look at the \"Addons/Mods/TCs\" board at the \"[url=http://diehardwolfers.areyep.com]DieHard Wolfers[/url]\" forums.  DHW is also a great resource for anybody who'd like to make their own game based off of the Wolf3D engine.<br /><br />So yeah, hey, play these games if you're interested.  And then discuss them, and stuff."
	},
	{
		"id": 28721,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-03-06T11:23:33.000Z",
		"content": "I actually knew, and was really surprised when I found it out a few years ago, that there's so many Wolf mods and the scene is still very alive. I've never played any, however.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 28722,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2007-03-08T18:13:10.000Z",
		"content": "Woaah! Pretty good article! Thumbs up! I'll deffinetley try some of these mods! Thanx for posting here.----<br /><br />[img]http://img294.imageshack.us/img294/1923/untitled116qa.gif[/img]<br />Tough Bloogs eat princesses"
	},
	{
		"id": 28723,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-09T07:32:55.000Z",
		"content": "It's like the Keen community.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 28724,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1486271,
		"author_name": "RoboRed",
		"timestamp": "2007-04-12T02:55:40.000Z",
		"content": "Yeah, I just started getting into Wolfenstien again (especially since I got Return to Castle Wolfenstein: Enemy Territory). I've already beaten Wolf 3D and Spear of Destiny in the past two months. I'm trying that Spear Ressurection mod right now. I tell you, that's a good mod, and darned hard too...even on easiest difficulty.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]"
	},
	{
		"id": 28725,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-06-30T09:07:35.000Z",
		"content": "Good ol' Wolfenstein...I never got into that the way I got into Commander Keen, Doom or Hexen, but it's surprising how amusing Wolfenstein 3D can be.<br /><br />\"MEIN LEBEN!\""
	},
	{
		"id": 28726,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-06-30T12:46:16.000Z",
		"content": "What's Bentley Web Sharing?  Your avatar wants me to put in a password for it [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 28727,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-06-30T17:07:38.000Z",
		"content": "me too i have to keep canceling out of it<br />______________________________________________________<br />So what if i ask dumb questions im only 12."
	},
	{
		"id": 28728,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-06-30T17:59:33.000Z",
		"content": "Same here, it's taken me ages to find one that works.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 28729,
		"title": "Re: Achtung!: Wolfenstein 3D Mods",
		"author_id": 1485733,
		"author_name": "Schabbs1",
		"timestamp": "2007-09-21T17:57:08.000Z",
		"content": "Good to see there's a Wolf3D section here. <br /><br />If anyone's interested, as well as the DHW forum mentioned above, there's another forum called Wolf3d Haven. It's at [url=http://wolf3d.darkbb.com/]Wolf3D Haven [/url]"
	}
]
