[
	{
		"id": 220,
		"title": "Super Keen Fighter 4 - Keen Fighting - Online Support Coming",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-07-08T00:51:48.000Z",
		"content": "[img]http://www.spatang.com/nickssoftware/images/skf4ss2.jpg[/img]<br />EDIT:<br /><br /><b>Happy 3/14</b><br /><br />It has been awhile hasn't it? Well I figure I better announce this and announcing it on 3/14 makes it even better. Sometime by the middle or end of this year Super Keen Fighter 4 will have online support! This means you can fight anyone accross the world! Right now 2 player online is planned, but 4 player online is possible! Stay tuned and if you haven't tried SKF4 yet, get it below [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Have Fun!<br /><br />[url=http://www.spatang.com/nickssoftware/games/skf4install.zip]Super Keen Fighter 4 V1.5+CoC 30 Characters - Full Version - No Installer[/url]<br /><br /><br /><br />-----------------------------------<br />Hello everyone from the pckf, I have been here since July 2002 ever since I released my first fan game entitled \"Super Keen Fighter 2\" this was a very buggy 2 player only commander keen fighting game. NicksSoftware had attemped to improve this and make Super Keen Fighter 3. Super Keen Fighter 3 was a vast improvement, but still many MANY features were missing... Then all was quiet at the end of 2002...<br /><br />Then 2004. Super Keen Fighter 4 was announced. We promised everyone that this game would not be as buggy like the previous ones. This game would have to also include AI, which means you no longer have to play with 2 human players. Super Keen Fighter 4 would feature Story mode, 4 player battles whether human or computer and Stage Selection. We didnt start creating this game till September 2004 in which we were making some characters with the little known information of the engine. By January 2005, we had known a lot more about the engine and creating characters. We released a crude demo, this demo had slighty OKAY artificial intelligence, and 4 characters.. With feedback from the pckf saying imnprove AI and graphics, we did the best we could too. (at least the boss has super AI) lol.... Graphics are also better as well.... Each Character has Melee Moves (punch, kick) as well as a special move (Boobus Tuber - Potato Throw)...<br /><br />May 2005, PCKF user ThaSpaz offers to create a card game for SKF4, after seeing some samples we accept and the card game has begun.. 50 cards come with Super keen Fighter 4 and instructions on how to play the card game will be posted shortly... (Many CKFAN artwork was used for these cards, credit is listed in the PDF manual.. If you would like your artwork removed tell us)<br /><br />PLEASE read the Manual included for full information on how to perform the movesets, instructions, credits and more. Its a PDF file, so it requires adobe acrobat. Without any knowledge of controls, you will not be able to play the game right.<br /><br />So Now NicksSoftware gives you Super Keen Fighter 4, Enjoy this game as we enjoyed making it.. Feedback/Ratings/Mirror sites of the game would be awesome. Please post everything you wish to see improved in later versions and everyone you like about the game...<br /><br />[url=http://www.spatang.com/nickssoftware/]NicksSoftwares Website (More Keen Fan Games)  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]      [/url]"
	},
	{
		"id": 5428,
		"title": "Re: Ladies & Gentlemen. I give you Super Keen Fighter 4!",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-07-08T01:42:39.000Z",
		"content": "Erm... Will the SKF TCG be a collection of downloadable images, or will it be a playable card game on our PC? Cause I think the latter will actually be a lot of fun to play.[img]http://www.geocities.com/miniopolis/soul.txt[/img]"
	},
	{
		"id": 5429,
		"title": "Re: Ladies & Gentlemen. I give you Super Keen Fighter 4!",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-08T02:16:22.000Z",
		"content": "So far, it's extremely buggy. It's difficult to fight with such an unintuitive keyboard system. Several times I've tried to fight only to have the opponent stop moving and become un-damagable. Several times I'd get partly stuck and start falling slowly while being attacked giving the opponent huge combos. There's also almost no character balance.<br /><br />But this is only from four minutes of playing.-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 5430,
		"title": "Re: Ladies & Gentlemen. I give you Super Keen Fighter 4!",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-07-08T03:06:47.000Z",
		"content": "You can always adjust the controls...<br /><br />Yes there is a bug where you can \"shock\" the oppenent for defending the rest of the match. Sorry it will be fixed in future versions, just press F4 to restart match for now..<br /><br />thanks"
	},
	{
		"id": 5431,
		"title": "Re: Ladies & Gentlemen. I give you Super Keen Fighter 4!",
		"author_id": 1035697,
		"author_name": "0 UNFLEEXABLE 0",
		"timestamp": "2005-07-08T22:52:41.000Z",
		"content": "Ok then cool. Well, i'm sure that it'll be worth the wait.<br /><br />Anyways, I downloaded SKF4 yesterday, and i'll be off to play it now. :-)[img]http://www.geocities.com/miniopolis/soul.txt[/img]"
	},
	{
		"id": 5432,
		"title": "hmmm",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-07-10T15:07:41.000Z",
		"content": "does anyone else try it?<br /><br />somebody?<br /><br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img]"
	},
	{
		"id": 5433,
		"title": "Re: hmmm",
		"author_id": 1486493,
		"author_name": "Superadammario64",
		"timestamp": "2005-07-10T16:28:19.000Z",
		"content": "I played around with it for a little bit. Its definatly better than the other skf games but still can be improved on. Like the bugs and the fact the attacks are too simplistic when in fact your using a powerful fighting game maker capable of making Marvel vs capcom or street fighter type games. Hopefully for skf5 you can take advantage of the engine and make an amazing fighter. The end is near. An evil force returns. And only Commander Keen can stop him, but this time he must team up with a super sonic hedgehog and a two tailed fox. Follow the adventure:[url=http://www.geocities.com/superadammario/chaos.html]Dimension Chaos[/url]<br />A Commander Keen and Sonic The Hedgehog Crossover Fan Fiction<br /><br />Visit my website at [url=http://www.geocities.com/superadammario]www.geocities.com/superadammario[/url]"
	},
	{
		"id": 5434,
		"title": "Re: hmmm",
		"author_id": 1485776,
		"author_name": "therealdopefish",
		"timestamp": "2005-07-11T09:33:44.000Z",
		"content": "It is a lot better than  your previous attempt, but compared to your older version of Super Keen Fighter 4 is that it only has more options and not much changes even though the AI has improved(but is still very easy). The characters are unbalanced:<br />Dopefish is too big for a regular character(if Mortimer is the final boss that is).<br />May be it is just me but Mortimer's laser is placed on the wrong height. As long you don't  jump it is useless(the computer AI keeps jumping however if I play as Mortimer, making the characters that jump low being the tough CPU opponents).<br />Why is Mortimer available from start?<br /><br />Also I would highly suggest to make the characters less pixelated. For testing purposes this might be handy, but if you really want to have something special you'll need to spend some time on the animations(yeah, I know they are lots of work to do especially for a fighter).If Dopefish is for real, what would it be evolved from?"
	},
	{
		"id": 5435,
		"title": "Re: hmmm",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-07-12T16:10:35.000Z",
		"content": "Well, it's slightly better than the demo. The AI actually tries to fight back this time, but the change that a weird bug prevents them from doing anything is 1 out of 2.<br />And why is their, for example, a story fighting mod when there's is no story?<br />And why are all characters equally easy, no matter how far you got in the game?-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 5436,
		"title": "okay",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-07-12T19:23:07.000Z",
		"content": "Dopefish is too big for a regular character(if Mortimer is the final boss that is).<br /><br />And why are all characters equally easy, no matter how <br />far you got in the game? <br /><br />The Shock Bug<br /><br /><br />okay thanks for the comments, Im sure a lot of these will be fixed in V1.1 , Is the Commander Keen Newsletter still going on? If so, whos in charge, I would like them to review SKF4[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-british.gif[/img]"
	},
	{
		"id": 5437,
		"title": "Re: okay",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-13T00:48:16.000Z",
		"content": "I'm considering redoing Gnosticus VII with a CSS layout. Perhaps <i>I</i> could review it then.-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 5438,
		"title": "Re: okay",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-13T00:51:33.000Z",
		"content": "Redoing? Its fine the way it is. Whats CSS?<br />And that means you'll review other keen stuff?[img]http://img.photobucket.com/albums/v609/genius314/picturekeen.bmp[/img]"
	},
	{
		"id": 5439,
		"title": "Re: okay",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-13T01:00:40.000Z",
		"content": "I want to redo the site with CSS, which means it would be a whole lot easier to update and manage the layout. I also want a more simplistic-looking site with more content.-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 5440,
		"title": "Re: okay",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-07-13T06:56:19.000Z",
		"content": "Don't forget a PHP backend! I almost coded a system for reviewing Keen games similar to Gnosticus VII, seeing how well-suited it would be.<br /><br />I actually preferred your old layout to your new one - it was clearer and less bloated. Using CSS would be a huge improvement."
	},
	{
		"id": 5441,
		"title": "Re: PCKF, I give you Super Keen Fighter 4 Released!",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-07-25T18:44:41.000Z",
		"content": "Version 1.1 released! Look all the way up [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]"
	},
	{
		"id": 5442,
		"title": "Re: PCKF, I give you Super Keen Fighter 4 Released!",
		"author_id": 1485822,
		"author_name": "lv4n",
		"timestamp": "2005-09-27T17:48:40.000Z",
		"content": "Well except some crashes, the game runs fine. On easy it's very easy to complete the story. On hard there is some challenge, but if you play with some creature that have only one button to fight.<br />It's funny to see so unbalanced creatures, but it's not fair. It's too easy playing with Keen. Maybe in the hard difficulties he should be limited by his ammo to five shots.<br />With real player maybe will be fun, but playing with AI is not realy joy.<br />But definetly a good work, since there aren't many beat em up games around and even the idea of implementing the CK creatures into this genre is great.----"
	},
	{
		"id": 5443,
		"title": "Re: PCKF, I give you Super Keen Fighter 4 Released!",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-09-27T21:05:05.000Z",
		"content": "Nice work! The screen flashes a lot, but basically works great.<br />Good jorb!<br />One complaint, and don't take this the wrong way, but there's no uninstall program."
	},
	{
		"id": 5444,
		"title": "thanks",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-09-27T23:17:43.000Z",
		"content": "great to here tha you like it Vitamin Zach"
	},
	{
		"id": 5445,
		"title": "Re: thanks",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-09-28T18:02:47.000Z",
		"content": "It's still a weird game, but this time the AI managed to beat me a few times. That's some good improvement.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 5446,
		"title": "Re: thanks",
		"author_id": 1486749,
		"author_name": "yodablob",
		"timestamp": "2005-09-28T23:02:19.000Z",
		"content": "I only played it on easy mode but it seems to have a few problems.  I would suggest limiting keens ammo (and any other character with gun/long range shot) and make it so it isn't so easy just to kick and enemy in the corner then rapidly press kick to beat him in ten seconds."
	},
	{
		"id": 5447,
		"title": "heh",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-09-28T23:54:40.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shockshund.gif[/img] nice to hear that you all like it more, ill look more into the game"
	},
	{
		"id": 5448,
		"title": "Re: heh",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-09-29T09:08:33.000Z",
		"content": "A great improvement! Keep up the good work!A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 5453,
		"title": "great guys",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2005-10-10T22:44:58.000Z",
		"content": "Im glad you all like it, I will still be improving the game. Expect V1.2 to have more characters such as<br /><br />Shakadi Master<br />COSMO!!<br />Duke Nukem<br />And other keen characters<br /><br />In version 1.2 I will also be adding more sounds, intros, endings and more story options. Of Course A.I. will be slighty improved.. <br /><br />I hope you guys are excited enough to wait for that V1.2 [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-deadkeenvort.gif[/img]"
	},
	{
		"id": 5454,
		"title": "Re: Super Keen Fighter 4 - Keen Fighting - V1.5 + 30 Charact",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2006-03-26T17:50:08.000Z",
		"content": "V1.5 is up, goto main message [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  loads of new stuff[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-christmas.gif[/img]"
	},
	{
		"id": 5455,
		"title": "Re: Super Keen Fighter 4 - Keen Fighting - V1.5 + 30 Charact",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-03-26T19:54:11.000Z",
		"content": "The problem isn't really characters...<br />its more of gameplay and graphics<br /><br />First off, the graphics, especially the character icons are messed up.<br />-The transparancy on the icons is messed up<br />-Some characters are JPG-ish<br />-The backgrounds don't fit<br />-some graphics are badly stretched out<br /><br />Also, the AI is horrible, and waaaay too easy to beat.<br /><br />Still, it did last longer than some fangames. Just fix those small problems and the game would be awesome.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 5456,
		"title": "Re: Super Keen Fighter 4 - Keen Fighting - V1.5 + 30 Charact",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-03-29T08:26:36.000Z",
		"content": "T3h increasing completion!<br /><br />Yaaaaaays!<br /><br />Its t3h 13373r than t3h alst one!<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 5457,
		"title": "skf4",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2007-03-17T17:53:39.000Z",
		"content": "<b>Happy 3/14</b><br /><br /><br />It has been awhile hasn't it? Well I figure I better announce this and announcing it on 3/14 makes it even better. Sometime by the middle or end of this year Super Keen Fighter 4 will have online support! This means you can fight anyone accross the world! Right now 2 player online is planned, but 4 player online is possible! Stay tuned and if you haven't tried SKF4 yet, get it below  <br /><br />Have Fun!"
	},
	{
		"id": 5458,
		"title": "Re: skf4",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-17T22:50:49.000Z",
		"content": "Below where?<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 5459,
		"title": "below",
		"author_id": 1485549,
		"author_name": "Nickssoft",
		"timestamp": "2007-03-18T00:43:45.000Z",
		"content": "I mean you may get the latest SKF4 on the first page of this topic, but the online version where you can play anyone over the world will be coming sometime this summer! Stay Tuned!"
	},
	{
		"id": 5460,
		"title": "Re: below",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-18T20:58:54.000Z",
		"content": "Excellent! I shall do so!<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 5449,
		"title": "Re: heh",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-03-18T21:41:04.000Z",
		"content": "Nooooo! Steer away from horrible resizes!<br /><br />When you resize an image:<br />- DON'T resize the width more than the height, and vice versa. Resize the whole of it at the same scale.<br />- DON'T take an \"in-between\" resize, unless you use a filter. With in-between I mean 1.3x, 2.8x, 0.7x etcetera.<br />- do resize in multiplications. 0.5x, 1x, 2x, 3x, 4x etcetera.<br /><br />When resizing more than 3x...<br />- Use a filter. Something like HQ3x and HQ4x do the trick pretty well. www.hiend3d.com<br />- Rather don't, but keep the game resolution a bit smaller instead.<br /><br />This counts for the entire intro, menu background, character selection screen (especially bad), and the game itself, in other words, YOUR WHOLE GAME.<br /><br />Oh yeah, and the game put my music and sample volume to the max, which quite startled me.<br /><br />Good initiative, but it looks like crap, to be honest. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]  ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 5450,
		"title": "Re: heh",
		"author_id": 1485776,
		"author_name": "therealdopefish",
		"timestamp": "2007-04-12T16:07:52.000Z",
		"content": "To add to DaVince21's comment: resize everything the same scale if you do want to resize so not one item looks pixelated and the other character not. Plus I highly suggest you redraw the characters for a higher resolution since this pixelated look makes the game feel rushed. If you can't draw I suggest you look for someone that draws for you. And a lower resolution will make it more pixelated but prevents unaware people to resize their graphics.<br /><br />Also stop adding features and characters and focus on the engine first. If your engine sucks then your game will not be great no matter how much characters you add. It's just a waste of time for you and the person who downloaded it to test it(since he needs to download more). First make the engine working without looking crap and then add extra features and characters. Sure it takes some time before you can show something concrete but it will pay back in the long term.If Dopefish is for real, what would it be evolved from?"
	},
	{
		"id": 5451,
		"title": "Re: heh",
		"author_id": 1486631,
		"author_name": "Niborius",
		"timestamp": "2007-05-03T13:35:20.000Z",
		"content": "Nice created game but the graphics aren't that good.<br />its fun to watch the fights btw, i almost never fight myself[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 5452,
		"title": ".",
		"author_id": 1486896,
		"author_name": "bp",
		"timestamp": "2007-05-24T00:43:37.000Z",
		"content": "I'd go smaller or detail te pixels a bit more, but its a good engine. It could be an excellent game - just work on the graphics. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-moon.gif[/img]"
	}
]
