[
	{
		"id": 272,
		"title": "New Keen Game Almost ready!!!",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T01:17:05.000Z",
		"content": "I should have this game ready around midnight tonight (EST), which is in like 3 hours, except for one or two things.<br />First of all, who was that person who had that \"are you good or evil?\" picture with Keen and Mort together. I can't find it anymore, and I want to ask that person if I can use that pic (kinda edited).<br />Secondly, can someone tell me what to say as a disclaimer. For example, \"Commander Keen and all respective tradmarks are copyrighted by ID software.\" Will that work?<br /><br />This is a two player game (not over the net tho : /) and the whole objective is to defeat your opponent, either Keen or Mort. It was inspired by Creative Madman's CKGI. You control the BWB and Mort's ship and try to destroy each other.<br /><br />If I get those two questions answered before the game is finished, then I should have it ready by tonight.<br /><br />NOTE: for those of you who know me, I have another game in the works that I mentioned before. This is not that game, this is a different one that I just started working on today, and it's almost complete. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  - .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8030,
		"title": "Re: New Keen Game Almost ready!!!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-05T01:28:09.000Z",
		"content": "[img]http://img.photobucket.com/albums/v177/memsys/goodorevilp.png[/img]<br /><br />This?<br />It's Memsys' signature, so ask him.<br /><br />And that copyright thing you said might work, i don't know, though.<br />But you might want to put \"trademarks\", not \"tradmarks\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] -Genius314"
	},
	{
		"id": 8031,
		"title": "Copyright, Scmopyright.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-08-05T01:56:30.000Z",
		"content": "Don't stress over the copyright issue. As long as you're not charging money for it, you're really not going to have a problem. The disclaimer's a good idea, though, so throw that in if you like.Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 8032,
		"title": "signature",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T02:16:52.000Z",
		"content": "I can't find Memsys in the search. Are you sure that's not a typo?- .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8033,
		"title": "Re: signature",
		"author_id": 1486021,
		"author_name": "Creative madman",
		"timestamp": "2005-08-05T07:32:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]It was inspired by Creative Madman's CKGI[hr][/quote]<br /><br />ohhhhhhhhhhhh &lt;tears of happiness&gt;<br /><br />those bastards where wrong i do have a reason! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img]"
	},
	{
		"id": 8034,
		"title": "Re: signature",
		"author_id": 1485611,
		"author_name": "BBalazs",
		"timestamp": "2005-08-05T07:33:39.000Z",
		"content": "I think it was with a small m. - memsys.------------------------------------------------------<br />Keep in mind, I'm not an artist.<br /><br />\"Take evasive action!\""
	},
	{
		"id": 8035,
		"title": "Re: signature",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-08-05T07:46:08.000Z",
		"content": "Hi thanks for asking if you may use my sig (unlike level lord ho just steals it [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  ) and i find it ok if you want to use it(thanks if you give me credit)<br /><br />I am the bad you are the ugly There is no good"
	},
	{
		"id": 8036,
		"title": "Re: signature",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-05T09:35:12.000Z",
		"content": "Remember to post screens when you release it.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 8037,
		"title": "Re: signature",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-08-05T11:36:55.000Z",
		"content": "Don't be so lazy. It usually takes only five minutes of my time to play a fangame if I don't like it.-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 8038,
		"title": "Re: signature",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-05T16:22:29.000Z",
		"content": "But I hate the installing. Especially if it comes some annoying installer that creates stuff to menus without asking me permission first.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 8039,
		"title": "Update",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T17:25:25.000Z",
		"content": "No installing neccessary, this will be a simple executable file, and Thanks Memsys for your logo - I will give you credit.<br />Well I guess my game is all ready then. Leme get some screenshots on this post for all.- .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8040,
		"title": "Re: Update",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-08-05T17:41:30.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]But I hate the installing. <b>Especially if it comes some annoying installer that creates stuff to menus without asking me permission first.</b> [hr][/quote]<br /><br />You got a point there, but since this game doesn't have such a programme I can see no reason why you couldn<br />t spend five minutes of your time on it. Whetever it's a good or bad game.-----------------<br />[img]http://www.jamba.nl/storage/view/upload/logo/image_multijpeg/DevilFrogVerwandlung.jpg[/img][img]http://www.jamster.com/s/jiw/img/US_logo_big.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 8041,
		"title": "Re: Update",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-05T17:48:58.000Z",
		"content": "I will, now, since I heard that this game will not have an installer.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 8042,
		"title": "Screenshots....",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T18:32:58.000Z",
		"content": "OK, well I have no website, so who should I send these pics to so they can put them up here?- .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8043,
		"title": "Re: Screenshots....",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-08-05T18:51:25.000Z",
		"content": "We can't see the image because none of us have a d:/blacklaser/gamemaker/examples/bwbvstqd/ directory. You'll have to upload it so it's actually on the internet. We can't see files that are on your harddrive.-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 8044,
		"title": "Re: Screenshots....",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-05T19:23:13.000Z",
		"content": "Send them to me at \"genius314 at spatang dot com\"<br /><br /><br />EDIT:<br /><br />Ok, here's screens:<br /><br />[img]http://planetck.spatang.com/pics/ss1.gif[/img]<br /><br />[img]http://planetck.spatang.com/pics/ss2.gif[/img]<br /><br />[img]http://planetck.spatang.com/pics/ss3.gif[/img]<br /><br />[img]http://planetck.spatang.com/pics/ss4.gif[/img]<br /><br />[img]http://planetck.spatang.com/pics/ss5.gif[/img]<br /><br />The colors got a bit messed up from saving in gif format. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] -Genius314"
	},
	{
		"id": 8045,
		"title": "Re: Screenshots....",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T20:14:22.000Z",
		"content": "Ok, in those screens you can see the energy bomb going off and also the victory screen...it generates random faces for Keen/Mort winning or losing to keep it interesting.<br />BTW there is no sound in this game, but there are 3 music tracks to listen to. I didn't wanna rip sounds from somewhere else, and it's SO hard to find a good, free sound library with what you're looking for.<br /><br />EDIT. Those circular explosions are actually much more smooth in the game. .GIF messed that up too, but's it's all good.<br /><br />EDIT. Ok, the game should be up soon.<br />Sorry that I named Mortimer's Ship such a hard-to-pronounce name, but I think it's still kewl. Can anyone figure out what it's literal translation is? It shouldn't be too hard.<br />Let me know what you all think of it, and tell me anything I might have forgotten. You can give me suggestions for things you want in a new version too. I'm especially interested in what you all think of the ship movement, like if you can get a good feel for it and if it makes for a good fight.- .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8046,
		"title": "Re: Screenshots....",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-05T20:28:37.000Z",
		"content": "Hehe, doesn't look that bad judging by the screens. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I may try it out when it's uploaded somewhere.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 8047,
		"title": "New Keen Game IS Ready!!",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-05T20:47:04.000Z",
		"content": "[url=http://planetck.spatang.com/downloads/BWBvsTQD.zip]Here[/url]<br /><br />Sorry, i started to upload it but forgot the readme. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br />And it took long to upload...-Genius314"
	},
	{
		"id": 8048,
		"title": "Hints for Game",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-05T20:56:34.000Z",
		"content": "Here are some manuevering hints.<br /><br />If someone is chasing you in a straight line and is at the right distance, you can turn around and fire an energy bomb at him. Depending on the distance, it may blow up right in his face! you can do this with your normal blasters too.<br /><br />The screen view shows more to the sides then to the top and botom. If you can, attack your opponent from above or below for more surprsie.<br /><br />If I think of some more hints, I'll put them here, but as of yet I havnt played this with anyone else, and am thus lacking in experience. I gota get my buds over here!<br /><br />EDIT: This is what I get for putting this game together in a couple days. I just fixed a small music error (although the first track still won't loop, I suspect it to be a thing with WMP) and I gave it a version number, 1.0 (let's just all refer to the first release as the beta version). So please post any more bugs you find or things you want fixed so I can put them in too.<br />Oh, and I ADDED SOUND! Why did I not put that in before??? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]  <br />Becuase I didn't want to rip other game's sounds that may be copyrighted, but I finnaly took a look at a copyright info website (particulary at public domain and fair use), and found that it was all ok. Sorry in advance for making anyone DL this 3.5 MB file twice [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  <br />I could put up the new version now if you want, Genius314, so you can all get the game with sound. If so, let me know and I'll email ya. If not, then let's wait for some opinions on what to put in the next version.<br /><br />YET ANOTHER EDIT!!!! Ok, I made the ships bounce against the boundaries properly, fixed another music problem, stupid thing, so there are no music errors now. Any more errors or things you want in the game, post here please.- .... .   ..- -. .. ...- . .-. ... .   .. ...   - --- .- ... -"
	},
	{
		"id": 8049,
		"title": "Re: Hints for Game",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-06T00:30:17.000Z",
		"content": "No, lets wait untill you fix more bugs. Seriously it took like 3 minutes to upload (well my computer is really slow)<br /><br />You could also email it to Xtraverse (xtraverse at spatang dot com), but since he doesn't seem to be around that often, I thought it'd be quicker for me to host it.-Genius314"
	},
	{
		"id": 8050,
		"title": "Re: Hints for Game",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-08-06T09:40:12.000Z",
		"content": "lol fun game<br /><br />edit if you have the softwere use anti analise on my sig but not the outer black border it can look better [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] I am the bad you are the ugly There is no good"
	},
	{
		"id": 8051,
		"title": "Update",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-06T19:13:06.000Z",
		"content": "Memsys, you're talking about anti-alianising whatever it's called on the SGA font right? Actually, it was AA-ed in the beginning, but the gray edges looked bad against the green-to-red background, so I personally edited it out pixel by pixel. Hehe, but there's a big differencing between editing existing art and making your own, so it's all good.<br /><br />Ok, well, no one seems to be commenting much on my game, I guess it wasn't that great. But I have the updated version ready now, so as soon as Genius or Xtraverse says it's ok to put up the new one, I will.<br />Here are the updates so far<br />-Added sound!!!!!!!!!!!!!<br />-Fixed small music problems (tho first track will stil not loop)<br />-Ships now bounce off boundaries correctly<br />-cannon blasts cancel each other out<br />-cannon blasts now have a limited capacity and quickly recharge <br />over time so that you can't saturate your enemy with blasts indefinitely<br />-set the default values of the Energy Bomb power higher<br />-changed max speed to 15<br />-shots no longer disspear when you fire at where the destroyed ship used to be<br />-changed the arena to 5000x5000 pxls (previously 8000x8000)<br />-the way to change values is more easy<br />-you can exit the game from the victory screen<br />-Added an indicator that points in the direction of the enemy<br />-The values you change do not return to default after a game<br />-you can now stop the music not just in the title screen but anywhere<br /><br />EDIT: I just tested this game on my old computer, and it is not running. If you experience this problem, all I can tell you is what the requirements are:<br />A modern PC (Pentium or higher) running Windows 98SE, ME, 2000 or XP (or later) is required. The program requires at least 65000 colors (high color, 16-bit). It requires at least 800x600 screen resolution. A 3D graphics card compatible with DirectX 8.0 or higher and with at least 16 MB of video memory is required (preferably 32 MB or more). Also a DirectX 8.0 compatible sound card is required. Make sure all graphics and sound card drivers are up to date. DirectX 8.0 or higher is required.<br /><br />Apparently an older version of the program I used to make this has lower requirements, so I may rewrite it.<br />If you have my game, please go to the Commadner Keen voting booth section and enter wether or not the game runs on your computer.- .... . &lt;&gt; ..- -. .. ...- . .-. ... . &lt;&gt; .. ... &lt;&gt; - --- .- ... -"
	},
	{
		"id": 8052,
		"title": "Re: Update",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-08-06T19:36:49.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Ok, well, no one seems to be commenting much on my game, I guess it wasn't that great.[hr][/quote]<br /><br />I haven't had a chance to play. My video card doesn't have enough memory to play it, so i need to play it on my other computer (which i haven't had a chance to.) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] -Genius314"
	},
	{
		"id": 8053,
		"title": "Re: Update",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-08-07T00:31:55.000Z",
		"content": "And unless you release a version that runs under Linux, I won't be able to play it (another reason why screenshots are good [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] )"
	},
	{
		"id": 8054,
		"title": "Re: Update",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-08-07T01:38:45.000Z",
		"content": "I'll download it when I get back to my home PC in two weeks time. The screenshots look nice, though."
	},
	{
		"id": 8055,
		"title": "Re: Update",
		"author_id": 1485611,
		"author_name": "BBalazs",
		"timestamp": "2005-08-09T06:14:34.000Z",
		"content": "I DID play it and it was quite fun. Some areas you could improve at:<br />- The GUI (some menu system, probably mouse compatible)<br />- In-game graphics (not so important though)<br />- Shield and weapon energy micromanagement------------------------------------------------------<br />Keep in mind, I'm not an artist.<br /><br />\"Take evasive action!\""
	},
	{
		"id": 8056,
		"title": "Version 1 practically ready",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2005-08-11T21:58:58.000Z",
		"content": "All right, it's been a while, and I've added many new things to the game, as you can see in my above post, which I just edited again. Many of the new things are just small things, but not all. However, I was really hoping for some more feadback on this game so I could make it how you all want it.<br />BBalazs, I'm not sure what you meant by the weapon micromanagement, but I made it so that your normal blasters have to recharge before firing at full stream; otherwise they fire more slowly but it's still not slow.<br />If you have this game and it works, please tell me what you thought if you havn't already. If you don't have this game, then I would advise you to wait for the new release, unless you have a good net connection and don't mind downloading the 3.5 megabyte file twice.<br />The last thing I'm working on now is being able to change the music while playing. Should be ready in a jiff.- .... . &lt;&gt; ..- -. .. ...- . .-. ... . &lt;&gt; .. ... &lt;&gt; - --- .- ... -"
	}
]
