[
	{
		"id": 843,
		"title": "Galaxieretter hates flash.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-05-15T02:30:04.000Z",
		"content": "[url=http://www.deviantart.com/deviation/33306006/]I really do.[/url]<br /><br />See if you can find the hidden bonus \"Commander Keen bonus feature footage\".<br /><br />Seriously... why does flash not want to do the things it is supposed to do?"
	},
	{
		"id": 21428,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-05-15T12:18:26.000Z",
		"content": "Becuase TMST bribed it to make sure that only *he* would make 1337 Keen flashes.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 21429,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-05-16T02:37:50.000Z",
		"content": "Erhm.. I guess there's lot of effort put to that work and erhhh.. Yeah, it's hard to create a better animation.. Glad you decided to upload that excellent creation for everyone to look at.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21430,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-05-16T03:26:44.000Z",
		"content": "Haha. :P<br /><br />It's not that I have trouble animating... I mean I am not an animator by any means. I don't even know the first thing about it. But it's that I have trouble with <i>Flash</i> not doing what it is supposed to do.<br /><br />For example why doesn't the Paint Bucket tool fill in what it is supposed to when I can SEE the lines connecting, leaving no gap... but on other parts where there <i><b>is</b></i> a gap in the lines it fills it in.<br />Gaaarg![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <br /><br />Or when you make a...<br />Actually... my brother hates Flash for the same reasons I do. And he can say what the problem is better than I can. [url=http://www.notablogtm.com/topics/flash.htm]Go read what he has to say here.[/url]<br /><br />I nearly pop a blood vessel when I try to use it. I can only hope that since Adobe bought out Macromedia that they will finally put in a decent UI and make the program intuitive.<br /><br />I mean I have been doing stuff in Flash for over a year, so it isn't like I don't know the program. I just find it easier to draw each frame of animation OUTSIDE of flash and import it that way. Only problem is, it is bitmap data then and not vector, which Flash is based off of.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21431,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-05-16T08:30:40.000Z",
		"content": "If you can import SVGs, just use an external SVG editor then (Something Vector Graphics, lol).___________________<br />DaVince, Yet Another Amateur Game Creator! :P"
	},
	{
		"id": 21432,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-05-20T04:59:27.000Z",
		"content": "'Laxi is right, Flash is so riddled with bugs and inconsistencies that it makes it one of the worst programs ever written, in my books. However, so strong is my desire to make animations that I always try to find a way around these bugs. Often, I succeed. Sometimes it takes a long time, though.<br /><br />Flash is like an irritable old donkey that you have to whip to get it to move.----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 21433,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-05-20T09:24:41.000Z",
		"content": "Flash is especially bad at shape tweens. Even with 50 or so shape hints, it <i>still</i> won't make it look right. Its tendency to randomly eat up all your memory when left unattended is also pretty irritating. Of course, there really isn't another animation format as full-featured and easy to use to share content."
	},
	{
		"id": 21434,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486477,
		"author_name": "Mr12000",
		"timestamp": "2006-05-20T19:34:08.000Z",
		"content": "Flash sounds bad.  The iTunes bashing that guy is doing is stupid though!  First of all, the way it organizes is perfect for me and is how id do it by myself, but may not be for everyone... Good thing the auto-organize isnt a default setting and in iTunes itself you can sort by genre!  Seems like he just didnt know how to use the program.[img]http://www.denness.net/rpi/username/mr12000[/img]"
	},
	{
		"id": 21435,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-05-26T04:39:53.000Z",
		"content": "NEVER USE SHAPE TWEENS. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />I only used them once, in a very recent Flash, just coz I wanted a really cruddy looking effect.<br />If you want a shape to morph into another, inbetween it yourself. Gosh knows what shape-tweening  was put into Flash for. Just ignore it. It's always worth transforming things the old fashioned way! The difference is simply putting in a bit of extra time, and it makes something that looks cool, rather than something that looks like poop on the table.----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 21436,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-05-27T04:01:25.000Z",
		"content": "Hopefully now that Adobe owns Flash that they will fix everything that is wrong. (Like the shape tween for example.)<br /><br />And maybe... just MAYBE they will put in a GUI like the REST of the Adobe products have...<br /><br />PLEASE GOD ALMIGHTY let Flash be FIXED!<br /><br />I haven't had a chance to poke around Flash 8. Does anyone know if anything is improved on it?-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/New-blegd-smeeg-banner-60.png[/img][/url]"
	},
	{
		"id": 21437,
		"title": "Re: Galaxieretter hates flash.",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2006-05-29T06:37:21.000Z",
		"content": "It doesn't seem to be backward-compatible, so that doesn't bode well! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 21438,
		"title": "Um... ooookay",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2006-06-05T21:19:00.000Z",
		"content": "I've never noticed the kinds of problems with Flash you're talking about... either that, or I know why it does certain things, and know how to fix them.<br /><br />For instance, Paint-bucket tool has different modes... if you have it on \"Don't Close Gaps\", it won't fill unless there are absolutely no gaps in the actual line (line thickness is not considered in this). Easiest way to figure that out is to press the little colored square in the layer you're drawing on to see what the program understands the lines as.<br /><br />I still like it."
	}
]
