[
	{
		"id": 442,
		"title": "And still Keen  lives...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-23T06:00:00.000Z",
		"content": "In 1940 Drumknott described the angel of history thus:<br /><br /><i>\"She stands facing the past; while we see many events she is aware only of one single calamatious disater, that smashes the works of man into a pile of rubble at her feet. How much she owuld like to stop and wake the dead  and tend to the wonded, but alas she cannot; for a great storm is blowing from paradise; it has caught her wings so that she cannot turn, nor even pause, merely struggle helplessly, watching as this same wind drags her ever toward the future to which her back is turned as ever more pain and suffering is caused by it, piling the ruins ever higher. This wind is what we call progress.\"</i><br /><br />Poetic no? And David Lawrence reminds us about the art/computer game 'Moonbeam' released just one scant year before Keen. \"I was asked to present a running model of the game at the next confrence on my schedule; problem was the origional 51/4 inch disks would work with modern computers; in fact, the game was incompatible with modern operating systems too. Well, lucky for me I could find a copy on the net; sadly I needed a commodore 64 to run the damn thing, but I needed one produced earlier; a small hardware change means that the later computers wouldn't run the sound. The another problem! The only joystick I had worked with later versions! In the end I gave up.\"<br /><br />For every program that dies, eight are produced, average lifespan 14 months. The computer age is littered with the corpses of dead computers, operating systems, languages and... stuff. Computer speed doubbles every 18 months, the net in 2 years.  A floppy disk lasts 2.5-4 years CD's 12 [If not actually used] computers less than 5 years.<br /><br />Who remembers Kangaroo? Twoflip? D-Based? And all those old games nobody remembers. [I forget the names]<br /><br />This was brought to my mind today as I heard the lamentations of our teacher [whilst shopping, no school! Yays!] about the tragic blanks in our knowledge from 1950 onwards. Sure we know a lot, but not the history; all the documents have been burnt, or the storgae media made obsolete.<br /><br />And yet Keen lives. Despite everything, the rush and bustle, our ever faster, ever better, ever more society, something as quaint and oldfashioned as Keen survives; boldy holding on to precarious existance with a will of steel.<br /><br />We shoud take a moment to celebrate a program that has survived 11 times longer than the averge, and still going strong!<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12830,
		"title": "Re: And still Keen  lives...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-12-23T11:54:42.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Gotta agree. Long live Keen!<b>Eat your veggies!</b>"
	},
	{
		"id": 12831,
		"title": "Re: And still Keen  lives...",
		"author_id": 1180427,
		"author_name": "The Dixie Dazzler",
		"timestamp": "2005-12-25T06:26:33.000Z",
		"content": "Long Live The Keen! Long Live The Keen! Dude!"
	}
]
