[
	{
		"id": 1372,
		"title": "IMF to MIDI, music remix (work-in-progress)",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-11T01:11:29.000Z",
		"content": "I found an IMKO excellent freeware (???) MIDI composer linked in Bobby Prince's website. I've been practicing with it to produce MIDI files from existing IMF files. Well, IMF2MIDI produces MIDI files, but it doesn't select appropiate instruments, tempo, etc., so it's mandatory to edit the output MIDIs with another application.<br /><br />So here it is. My first semi-remix, of xcircles.imf, one of the Bio Menace music files. Hope you like it. It's work in progress anyway, I haven't even finished working with that file:<br /><br />[url=http://shadowm2006.sitesled.com/music/XCIRCLES.MID]xcircles.mid[/url]<br /><br />I'll probably continue working on it for the next boring afternoon. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] [hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 29260,
		"title": "hmm",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-12-11T08:35:41.000Z",
		"content": "Edit2: This appears to be a remix of \"AUD 129\" from Bio Menace Episode 3.  At least, that's what it's named in my files. <br /><br />It's a start.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  If you're looking for input, I'd say 1) Ditch the brass on the low Bb, unless you plan to have it change pitch as the song modulates.  2) Make sure the drum part evolves as the song changes--and don't use the toms (C3) so much.  3) Don't be afraid of changing instruments partway through.  Your file had pianos and strings waiting, but all you used was flute!  <br /><br />Edit: And bring back the descending bassline from the original!!<br /><br />Looking forward to the finished product.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	}
]
