[
	{
		"id": 466,
		"title": "Fan-Fiction: Commander Keen in: Earth is doomed!!!",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-23T16:19:08.000Z",
		"content": "This is my first fan-fiction![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   It takes place after Super Keen Fighter 4.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]     <br /><br /><b>Chapter one: Keen is marooned on mars once again</b><br /><br />Keen Hasn't seen mortimer for years. Suddenly, Keen receives a call on his Photachyon Transceiver: \"Bzzzp Bzzzp Save Bzzzp the planet Bzzzp Mars! Bzzzp Bzzzp\". Keen hops into his B-W-B and blasts to mars then jumps out of his B-W-B, only to find it the call was a hoax.<br /><br />Then when he realizes something fishy. Someone has stolen his B-W-B! If he doesn't get off mars, the thief could destroy earth! \"Aw, nuts\" says Keen. \"how will I ever get of mars?\" Keen sits on a red rock and ponders.<br /><br />Suddenly, Keen gets an idea:\"If I could tame a garg, I would teach it to throw me off the planet! But how will I ever do that?\" Keen notices a garg taming school.<br /><br />He gets a garg to chase him in there and the garg runs into a room. A female yorp says to Keen \"This is how you tame a garg.\" The yorp pushes a ring to Keen. \"Now hold it to your left if your a lefty, or hold it to your right if your a righty.\"<br /><br />Keen holds it to his right and the garg jumps though the ring. Then the yorp says \"If you want to teach a garg how to throw, give it an item like a soda can and say \"throw\".\" Keen grabs a soda can and gives it to the garg.<br /><br />The garg grabs it with his arm (The things that hold the garg's eyes) and then Keen says \"throw!\" The garg throws it of the face off the planet. Keen says \"grab me!\" and the garg grabs him. Then Keen says \" throw me\" and the garg throw him to an other planet. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13143,
		"title": "Re:",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-24T02:12:09.000Z",
		"content": "I'm not going to read that until you learn what a paragraph is."
	},
	{
		"id": 13144,
		"title": "Re: Re:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-07-24T10:23:19.000Z",
		"content": "A few tips [from someone who couldn't write her way out of a paper bag]<br /><br />1.) As mentioned, try to paragraph your writing.<br /><br />2.) Describe things a lot more fully, a story shouldn't just say 'it has been years since' <br /><br />3.) Don't rush your story, spread it out so it can be enjoyed.<br /><br />I'd start your story something like:<br /><br /><br />Billy Blaze took a sip of his orange juice and sat back in his chair, savouring the work he had just completed. Before him sat a wrist mounted neuralizer, something inspired by his last battle all those years ago. He was just about to try it out when a burst of static emenated from his phototachyon transciever.<br /><br />*brrzzzt!* hel*zzt*p! Mar*zzz* in terrible Danger! Commander *zzztt!* please h*izzzt*elp uzzzz!<br /><br />Before the message had even ended Keen was dashing...<br /><br />[I'll stop now before I start writing a whole story.]A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13145,
		"title": "Chapter two: The lost planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-24T12:42:56.000Z",
		"content": "The planet Keen landed on was familiar in a way. It looked similar to earth but more volcanic. It was entirely made of stone. It had lava instead of water. And it's sky was red.<br /><br />Keen thought there was nothing that could live there but he discovered his B-W-B behind him. \"How could my B-W-B get here if nothing lives here?\" Then a man who looked similar to an oracle member but had a orange beard said \"People do live here.\"<br /><br />Keen asked \"Who in the world are you??\" The man answered \"I am the emperor of this planet. My name is Kungoo\" Keen asked \"Why did you take my B-W-B?\" Kungoo answered \"The people need it-- It's our only source of planet transportation!\"<br /><br />Keen asked \"Why do you need planet transportation?\" Kungoo answered \"There are no foods that can grow on our planet.\" Keen asked \"Why don't you eat meat?\" Kungoo answered \"Me and all of our people are vegetarians.\" Keen asked \"Why not try diary?\"<br /><br />Kungoo answered \"Me and all of our people are lactose intolerant.\"<br /><br />Keen asked \"Why not try soy?\" Kungoo said \"Yuck!\" Keen said \"Are you kidding me? I love soy\" Then keen asked \"Why not try bread?\" Kungoo said \"Me and all of our people are allergic to bread-- ACHOO!!\" Keen said \"God bless you.\" Then Keen asked \"Why not try fruits?\" Kungoo answered \"All me and our people eat are fruits and veggies.\"<br /><br />Keen asked \"Why not try fats and oils?\" Kungoo answered \"Me and our people don't wanna get fat!!!\" Keen asked \"Why do you always say \"me and our people\" instead off 'we' or 'us'?\"<br /><br />Kungoo answered \"'We' could be anyone in a group of 2 through infinite, and 'us want this, us want that, us don't like that, us do like that, us are allergic to it, etc.' doesn't make any sense.\" Keen simply replied \"oh\". Just then, someone stolen his B-W-B once again!<br /><br />Keen asked \"Can I use that cannon?\" Kungoo answered \"sure\" Keen goes inside the cannon. Just before he fires the cannon, Kungoo says \"Be careful!\" Keen says \"Okay.\" and fires the cannon, and Keen flies off the face of that planet.<br /><br />Keen lands on yet an other planet. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13146,
		"title": "Re: Chapter two: The lost planet",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2005-07-24T13:31:00.000Z",
		"content": "Better, but repetitive. Try to avoid situations where a character has a long block of repetitive speech (I'm refering to the whole \"food groups\" thing). If that's not possible, try and vary the way the character asks/answers the question or make the speech shorter.<br />[quote]<b><i>Quote:</i></b>[hr]someone steeled his B-W-B once again![hr][/quote]<br />Steeled isn't a word - you should use \"stolen\". Also, who stole the BwB? Why weren't they mentioned in the story? Why did Keen not say anything that might indicate that he'd noticed his BwB had been stolen?[url=http://www.toxicsheep.com]www.toxicsheep.com[/url]<br />[img]http://www.toxicsheep.com/sigs/scrobblersig.php[/img]"
	},
	{
		"id": 13147,
		"title": "Re: Chapter two: The lost planet",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2005-07-24T14:57:25.000Z",
		"content": "You also periodically switch between narrating in present and past tense.<br /><br />Instead of \"Keen opens the door\"<br /><br />It should be \"Keen then opened the door.\" or something to that effect. Also, keep in mind that you cannot have quotation marks inside other quotation marks. You can, however, use ' inside a \".-----<br />[img]http://gnosticus.spatang.com/PBF056BCPuppyWish.jpg[/img]"
	},
	{
		"id": 13148,
		"title": "Chapter three: The planet of evil and darkness",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-24T15:03:12.000Z",
		"content": "The planet Keen landed on is strange; It is built like a giant rocket ship. Soon, Keen figured out that it is not a planet at all but a space ship that is about to destroy earth! But Keen was so close to the deactivator it wasn't funny. Keen just activated the deactivator.<br /><br />After 5 seconds, the ship exploded! Keen was the only one to survive the explosion. Keen sees his B-W-B right next to him. He went inside and flied to a dark planet that Keen thought started the whole mess.<br /><br />The planet Keen landed on is dark and scary. Keen sees a dark, gray mansion and boldly entered it. Inside is a dark being. The being said \"I am Master Deadly. PREPARE TO DIE!!!\" Keen took out his stunner and shot Master Deadly, only to find that he is invincible!<br /><br />Keen ran inside his B-W-B and flied off the planet. Then he turned around and shot the planet with the guns on his B-W-B, destroying the planet and killing Master Deadly.<br /><br />Keen thinks his job is done when he gets sucked into a black hole and transported to Plane Mortimer, a planet owned by Mortimer. Keen assumes that the planet was once on sale and Mort bought the planet. On the planet, Keen searches for Mortimer McMire. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13149,
		"title": "Re: Chapter three: The planet of evil and darkness",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-07-25T02:15:34.000Z",
		"content": "You need to describe the action a little more. Here's an example: \"The planet Keen landed on is strange; It is built like a giant rocket ship.\" That one sentence (nice semicolon use, by the way, although you don't need to capitalize \"It\".) could easily be several paragraphs. When you add the next sentence it could easily reach a coupe pages! Think about this:<br /><br /> Keen probably sees this planet as he approaches it, and would probably comment on it. Then you could describe its look. Then Keen might land on it. Falling from space to a planet is a big thing; it's worth talking about. After that, Keen needs to climb to his feet and look around. He's probably got something to say, or think, and we'd like to know what he's seeing, and hearing, and smelling. Eventually he connects the dots and realizes that it <i>is</i> what it looks like! And not only is it a rocket ship, it's also poised to destroy the planet!<br /><br />He probably won't know what it's about to do until he explores a bit. Maybe he sees Earth through a window, then sees an empty control center showing Earth on its display screen, and finally he overhears a conversation about the plans to destroy his planet. He's shocked, but he quickly realizes how close he is to the deactivator. What a relief! Describe this deactivator to us. Does Keen have to crack a code? Open a lock to reach it? Is it a lever, a knob, or maybe a button? What color is it? Is it hard to work the switch, or does it move easily? Does it have a soft handle? Is he seen as he activates it, barely doing it in time?<br /><br />Then the ship explodes! The exclamation point is a step in the right direction, but I'd like to know what Keen thinks of this. Maybe a quote would be appropriate?<br /><br />That's the kind of detail we'd like to see. Think about how it would look if it were a movie, and describe all the important things you see and hear. All the things that would catch your attention.<br /><br />If you wanted to turn what you've written into a full length story, a good place to start would be to use each of the events you've written as a starting point, then expand your descriptions of them.<br /><br />Here's a sample of how I'd expand the next couple lines:<br /><br />Keen woke with a start as the BWBM's autopilot chimed. In front of him was a dark red-lit planet. He took a deep breath as he reached for his joystick. He didn't like what he saw below him, but there was something down there which needed Commander Keen to set it right. He set his Ion Propulsion Unit to \"shag carpet\", and moved in.<br />--<br />With a thump, the Bean-with-Bacon Megarocket came to a landing. Keen peered cautiously through his window at his murky surroundings. \"I can't see a thing in this gloom!\" he muttered. \"Maybe if I turn off my nightlight... Nope. I guess I'll have to get out and look around.\" He cracked the seal on his cockpit and swung the canopy up. He put his hands on the side of his ship and clambered out onto the wing. \"My -- Achoo! -- raygun!\", he sneezed. There was so much dust in the air that he could barely....<br /><br />I'd better quit, because this post is super long, but notice how I try to show the world through Keen's speech and actions, and how I mention notable sounds and smells, like the autopilot chime and the dusty air. That's the way to write an engaging story.<br /><br />EDIT: Oh, and although you should describe things fully, you should always do it with the minimum amount of writing possible. Notice how my first sentence shows that Keen had used the autopilot to get there, the autopilot chimes when you reach your destination, he had napped during the flight, he had reached his destination, he was startled awake, and he was in the BWBM (we already knew that, but it is in there). Give as much information as possible with as little writing as possible.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 13150,
		"title": "Re: Chapter three: The planet of evil and darkness",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-25T02:39:27.000Z",
		"content": "And practice writing a lot.<br />A few more stories and you should have quality writing.<br />(so waste all your practice on bad stories. If you have a really good idea, save it untill you can write really well.)-Genius314"
	},
	{
		"id": 13151,
		"title": "Chapter four: Mortimer's planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-25T11:18:18.000Z",
		"content": "Keen entered a house that looks like Mort's house. Inside it wa a laboratory, a labrador, and a labyrinth. The laboratory was the inside itself, the labrador is just to make Mort feel comfort, and the labyrinth was to make intruders literally get lost.<br /><br />Keen finds Mort. Keen asked \"What are you up to this time, Mort?\" Mort answered \"I WILL DESTROY THE WORLD! MWAHAHAHAHAHAHA!\" <br />Keen and Mort fight!<br /><br />After knocking mort out twice, Keen think that he won and activates a deactivator, destroying planet Mortimer. Keen flied back to earth, and his B-W-B crash landed on his club house! Keen cried \"NOOOOOOOOOOOO!!!!\"<br /><br />Mort and his labrador landed in mort's yard and get knocked out cold. Keen said \"Well at lest I got victory over Mortimer McMire.\" But Keen finds out about a strange planet that is in great danger. Keen fixes his B-W-B thin flies to that planet. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13152,
		"title": "Re: Chapter four: Mortimer's planet",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-25T12:57:57.000Z",
		"content": "Well, there's a lot happening. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 13153,
		"title": "Chapter five: The land of eternal weirdness",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-25T18:02:15.000Z",
		"content": "The planet Keen landed on was weird... Not only was it in ugly CGA colors, everything on it went in slow motion, and fish sometimes jumped out of the ground, but Keen's B-W-B had mysteriously disappeared while Keen was inside it!<br /><br />Keen slowly said \"wwhheerree  iiss  mmyy  BB--WW--BB??\" Then Keen was transported to a planet just like Earth except for the fact that the gravity was reversed. Keen, who ended up in a house similar to his said \"I'm finally--\" Then Keen fell up.<br /><br />\"Woah!\" Keen shouted. Keen grunted when he landed on the ceiling. Then Keen felt so dizzy that he threw down. Soon, Keen felt much better. He exited the room he was in, which looked like his room but upside-down.<br /><br />He climbed a self to get down to the ground, then grabbed a chair, which fell upwards as soon as Keen tipped it. \"ARGH! I'll never get down!\" Keen shouted. Then Keen and the chair fell down. Keen returned to the room he was first in. Then Keen started growing rapidly!<br /><br />But it wasn't out of age. Soon, Keen had to go outside. Keen soon grew so big that he fell off the planet! And then he started shrinking. He landed on the planet once again and reentered the house he was first in. He stopped shrinking when he was the size of a mouse.<br /><br />Keen found a mouse hole he had never saw in the house and went inside it. It led to a small, wooden area with little comfort that was large enough to give Keen pleanty of room but still rather small. Keen said \"I definitely wouldn't fit here if I were normal sized.\"<br /><br />After one night, Keen noticed that he was on the ceiling of the room. Keen said \"Aw man, I thought that anti-gravity bologna was over!\" Keen noticed more oddness; the colors of everything in the planet he was on had been inverted; including Keen himself! Keen furiously said \"WHERE IS THIS, THE LAND OF ETERNAL WEIRDNESS?!?!?!?\" Calming down, Keen answers \"Probably.\"<br /><br />Mortimer appears out of nowhere. He shrinks to the size of a mouse and enters the mouse hole. \"You can't grow if you don't go out of the hole\" Mortimer said with an evil tone of voice. He exited the mouse hole and grew to normal size. \"Come on out, you know you want to grow.\" Mort said.<br /><br />Keen said \"I'm not coming out! You will squish me before I grow!\" Mort furiously said \"Come out now or I will shoot!\" Keen did as mort commanded. Keen grew to normal size.  Keen said \"I don't trust you.\" Mort said \"Why not?\" Keen said \"You killed my cousin!\" Mort said \"I didn't kill your cousin; I AM YOUR COUSIN!\" Keen shouts \"NOOOOOOOOOOOO!\"<br /><br />After calming down, Keen asked \"Well how do we get out of this mess?\" Mort answered \"Follow me.\" To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13154,
		"title": "Re: Chapter five: The land of eternal weirdness",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-25T18:21:10.000Z",
		"content": "It seems like your just randomly throwing things together. Keens BwB disappeared so many times, and Keens been on so many planets -- all in one story!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] -Genius314"
	},
	{
		"id": 13155,
		"title": "Chapter six: How to escape the land of eternal weirdness",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-25T21:19:29.000Z",
		"content": "Mort leaded Keen into the Mortimer Space Ship. They flied to Planet Mortimer. Keen said \"I though I destroyed that planet!\" Mort replied \"I bought auto-repair for it long before you discovered it.\"<br /><br />Mortimer pulled out a bomb from his pocket and said \"PREPARE TO DIE!!\"<br /><br />Keen punched Mortimer in the face and Mort got knocked out cold. Keen finds a switch. He presses it with out thinking.<br /><br />Keen is transported back to yet an other planet. To be continued...<br /><br />EDIT: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]  Sorry KR![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img]  I changed The story.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I only added that because I didn't know you liked gargs.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  I'm really sorry.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  (gargs are actually smarter than anything that exists; they know everything!)-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13156,
		"title": "What??",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-25T22:03:43.000Z",
		"content": "Another Planet??<br /><br />And keenrush won't be happy [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] -Genius314"
	},
	{
		"id": 13157,
		"title": "Re: What??",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-07-25T22:54:29.000Z",
		"content": "[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  You don't need to change the story because of me.. As well, I didn't even get a chance to read whatever you wrote.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 13158,
		"title": "Re: What??",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-25T23:01:52.000Z",
		"content": "He said that gargs were the 4th dumbest creatures and that they can't learn much. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] -Genius314"
	},
	{
		"id": 13159,
		"title": "Sorry!",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-25T23:11:59.000Z",
		"content": "I only added that because I didn't know he liked gargs.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img]  I just changed it.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  (i even added that gargs know everything.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  )<br /><br /><b>Chapter seven: The planet of the jungle</b><br />Keen wakes up in a very tropical planet-- the entire planet is covered with jungle. Then, a beautiful woman flied by on a vine, allmost hitting keen with her feet. She landed on the ground and said \"I'm sorry! I didn't see you.\" Keen said in a nervous voice \"It's okay\" The woman said My name s Jill.\" Keen said in amazement \"Jill of the Jungle!\"<br /><br />Keen said furiously \"I'm much cooler than those Epic MegaGames characters!\" Jill said in a teasing voice \"Oh yeah, well--\" Then Jill sticks her tongue out at Keen. Keen and Jill fight! Keen kicks Jill in the stomach, knocking her out.<br /><br />Keen explores more of the jungle. Soon, Keen find a warp that warps him to a familiar place. He had been warped to his home! But his planet has been sucked into a black hole, and now it has an extreme ice age! To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13160,
		"title": "Re: Sorry!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-07-26T00:32:11.000Z",
		"content": "She got knocked out by a kick in the stomach?________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 13161,
		"title": "Chapter seven: The ice age",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-26T11:34:18.000Z",
		"content": "Keen must get the earth out of the black hole! He makes a clone of the B-W-B and modifies the clone B-W-B to push planets. He used it to push earth back where it belongs.<br /><br />Then he saw an other earth where he thought the one he was pushing belonged. Then, he found out the one he was pushing had snow being living one it, and pushed it back into the black hole. Then Keen flew to an other lava planet that was more dangerous than the previous one.<br /><br />Keen thought some one was trapped in side it. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13162,
		"title": "Re: Chapter seven: The ice age",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T20:40:02.000Z",
		"content": "Huh?<br />Sorry to discourage a new member but...<br /><br />[quote]<b><i>Quote:</i></b>[hr]Keen hops into his B-W-B and blasts to mars then jumps out of his B-W-B, only to find it the call was a hoax. Then when he realizes something fishy. Someone has stolen his B-W-B![hr][/quote]<br /><br />How far did he go before the ship was stolen? Two steps?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Suddenly, Keen gets an idea:\"If I could tame a garg, I would teach it to throw me off the planet! But how will I ever do that?\" Keen notices a garg taming school.[hr][/quote]<br /><br />Um... throw him off the planet. That's sort of impossible and deadly. Garg taming school?<br /><br />[quote]<b><i>Quote:</i></b>[hr]Then a man who looked similar to an oracle member but had a orange beard said \"People do live here.\"<br /><br />Keen asked \"Who in the world are you??\" The man answered \"I am the emperor of this planet. My name is Kungoo\" Keen asked \"Why did you take my B-W-B?\" Kungoo answered \"The people need it-- It's our only source of planet transportation!\"[hr][/quote]<br /><br />People do not live here, my people need the BWB.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The planet Keen landed on was weird... Not only was it in ugly CGA colors, everything on it went in slow motion, and fish sometimes jumped out of the ground, but Keen's B-W-B had mysteriously disappeared while Keen was inside it![hr][/quote]<br /><br />Uh...<br /><br />[quote]<b><i>Quote:</i></b>[hr]Mort leaded Keen into the Mortimer Space Ship. They flied to Planet Mortimer. Keen said \"I though I destroyed that planet!\" Mort replied \"I bought auto-repair for it long before you discovered it.\"[hr][/quote]<br /><br />When did keen though he destroyed that planet? Mortimer bought auto-repair?<br /><br />The story is very horrible. I not wants to read; it. Why keep posting? Crap! I gotten transported to planet 12 in the story.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Keen must get the earth out of the black hole![hr][/quote]<br /><br />It's kind of too late when it's in the black hole.<br /><br />Again, I'm sorry for pointing out all the crap in this story but it is  just so bad. Editing this story would probably be hard, or at least everything after the first paragraph would be gone. Then the first paragraph would be much different.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 13163,
		"title": "Chapter eight: The other lava planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-26T22:33:03.000Z",
		"content": "Hey![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img] <br /><br /><b> Chapter eight: The other lava planet</b><br /><br />The other lava planet was empty... There was nothing there but dirt and a bunch of volcanos. Keen noticed that they were trapped in the closest volcano to Keen. Keen rushed into that volcano, and found out Jill, who was inside there, had imprisoned Cosmo and his parents!<br /><br />Keen asked Cosmo \"What's your name?\" Cosmo answered \"Cosmo\" Keen asked \"Are you okay, Cosmo?\" Cosmo answered \"Yes.\" Cosmo asked \"Who are you?\" Keen answered \"I am Commander Keen-- Defender of the universe!\"<br /><br />Cosmo replied \"Cool! I remember you from your games! Can I have your autograph?\" Keen said \"sure\" Keen wrote \"Commander Keen\" on a piece of slate that Keen found on the ground and gave it to Cosmo, who loves slate.<br /><br />Cosmo said \"Thanks, Mr.Keen!\" Keen replied \"No problemo.\" Then Jill stole the slate. Cosmo said \"That's mine, Jill\" Jill just laughed. Cosmo began crying. Jill said \"Now, for revenge for what Keen did to me in the jungle!\"<br /><br />Jill took out her throwing-star and attacked Keen. Keen grabbed it, and threw it at Jill. It went right through her! Jill said \"I don't get hurt by my own weapons!\"<br /><br />and then Jill laughed cruelly. Keen pushed Jill into the lava. Jill didn't get killed though; just before she landed in the lava, a man transported her back her planet The man said \"I am Malvinious.\"<br /><br />Malvinious said \"I'm sorry she attacked you. She lives on a planet that still thinks Apogee is dumb.\" Malvinious said \"I do not think that Apogee is dumb.\" Malvinious said \"I agree with Apogee, but do not work with it.\"<br /><br />Keen freed Cosmo's family. Cosmo said to Malvinious \"Hi...\" Malvinious replied \"Hi.\" Malvinious said to them all \"Let's go home.\" But Keen's B-W-B has been stolen once again! Keen asked \"How will we get out of here?\"<br /><br />Malvinious transported all of them, including himself, to Keen's home. Malvinious said \"I've played Commander Keen before. It's more fun than my friends at Epic Mega-Games say it is.\"<br /><br />Keen asked \"How do you transport from place to place?\" Malvinious answered \"A special warping machine. You can have the extra one I keep, I don't need it. Cosmo and his parents get some to.\"<br /><br />Then Malvinious gives a warp machine to Keen, Cosmo, Cosmo's mom, and Cosmo's dad. Just before Keen gets to ask where Malvinious gets all those warp machines, Malvinious warps to his home.<br /><br />Keen said to Cosmo \"I can teach you karate.\" Sense it was Cosmo's only defense, Cosmo's parent's let Keen teach Cosmo karate. Cosmo became very good at karate, and after 10 years, Cosmo was a black belt.<br /><br />Cosmo's and his parents warped back to they're planet. Then Jill warped to Cosmo's home and stole Cosmo's favorite piece of slate. Cosmo beat up Jill and sliced her Throwing-Star in half with a powerful karate chop!<br /><br />Jill just cried. Keen found about an strange planet and went there, just to explore it. To be continued...-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13164,
		"title": "Re: Chapter eight: The other lava planet",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2005-07-26T22:37:37.000Z",
		"content": "Seriously, stop chnaging the planet. It's too confusing. Or at least change the title of the story to \"100 random planets\" instead of \"the earth is doomed\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] -Genius314"
	},
	{
		"id": 13165,
		"title": "Re: Chapter eight: The other lava planet",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-26T22:44:28.000Z",
		"content": "You know, when you add another plotline and another planet and another another planet to a story that already makes no sense. Sentence fragment.<br /><br />I have no problem with mixing characters from different \"worlds\", but maybe you should fix up the messed up story you have before you make it more complicated.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Cosmo's and his parents warped back to they're planet. Then Jill warped to Cosmo's home and stole Cosmo's favorite piece of slate. Cosmo beat up Jill and sliced her Throwing-Star in half with a powerful karate chop![hr][/quote]<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stoned.gif[/img] [center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 13166,
		"title": "Chapter nine: The \"colorful\" planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-27T00:26:39.000Z",
		"content": "The planet Keen visits is very colorful; The colors are just randomly placed pixels (Each are a random color of the EGA palette). Keen finds out that there are TONS of perfectly yellow bananas on the planet on the planet.<br /><br />Keen is very hungry, and he loves bananas. Keen eats 50 bananas and was about to return home when 1. He got diarrhea and 2. Jill was going to destroy Keen's home planet with a space ship that she stole. After 10 trips to the bathroom, Keen decided to fight Jill in a space baattle.<br /><br />Keen shot Jill's space ship with the guns on his B-W-B, which made Jill's ship explode. Jill warped back to her planet, and decided that she should stay on her planet; besides, she has a husband and 12 children; 6 girls, 6  boys.<br /><br />Keen returned to his home planet. Then he received an other call on his Photachyon Transceiver about a lost planet that was under attack. A hero's job is never done!<br /><br />To be continued... (question: How many chapters should I add?)-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13167,
		"title": "Re: Chapter nine: The \"colorful\" planet",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T00:37:05.000Z",
		"content": "Look here it is, it's coming out. The answer is zero. Your story is horrible. I hate to say it, but someone was bound to let it out at some point. Go learn some rudimentary writing skills, develop a strong and intriguing plot, and learn to add details to one story rather than having 1000 small and idiotic paragraphs that have little or nothing to do with each other.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 13168,
		"title": "Re: Chapter nine: The \"colorful\" planet",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-07-27T08:19:02.000Z",
		"content": "Ha, I kind of made it into someone's story...I can't say anything bad about it now [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shucks.gif[/img] <br />[quote]<b><i>Quote:</i></b>[hr]After 10 trips to the bathroom, Keen decided to fight[hr][/quote]I have to admit, I did find that bit rather amusing...  It's gotten to the point where the story is so bizarre, unpredictable and freaky that it's funny.  It's no longer a story, it's fantastically absurd ideas spewed out faster than you can figure out what's going on.<br /><br />Stop trying to read it as a story, and try reading it as fast as you can and you'll see what I mean [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />Oh, and just out of curiosity, why did Jill want to blow up Keen's home planet?  I always thought Jill came from Earth as well..."
	},
	{
		"id": 13169,
		"title": "Re: Chapter nine: The \"colorful\" planet",
		"author_id": 1486832,
		"author_name": "SpikeNexus",
		"timestamp": "2005-07-27T08:50:52.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>Harvey:</b><br />Keen wrote \"Commander Keen\" on a piece of slate that Keen found on the ground and gave it to Cosmo, who loves slate.[hr][/quote]<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br /><br />Haven't actually got around to reading the story yet, but I just saw the above as I was scrolling down the page. Cosmo's apparent love of slate seemed so random that I found that part a bit funny.--------------<br />[url=http://spikenexus.toxicsheep.com/pccw/][img]http://spikenexus.toxicsheep.com/pccw/imgs/links/pccwsml.gif[/img][/url]"
	},
	{
		"id": 13170,
		"title": "Re: Fan-Fiction: Commander Keen in: Earth is doomed!!!",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-07-27T10:45:11.000Z",
		"content": "Yes, this story has finally gotten so bizare that it has passed out the opposite side of nonsense, into esnes [like antimatter, nonsense is the absence of sense, but esnes is the total opposite, a kind of sense built out of pure randomness.]A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13171,
		"title": "Chapter ten: The ancient planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-27T17:07:32.000Z",
		"content": "-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13172,
		"title": "Chapter eleven: Just another senseless planet",
		"author_id": 1486686,
		"author_name": "DasBrot",
		"timestamp": "2005-07-27T17:30:20.000Z",
		"content": "Please, look at the comments and try to improve your writing skills... Your problem is, you just have to much ideas and you throw them together in a weird story... Try to write a story with only ONE planet (less planets -&gt; more details)<br />Look at this: [quote]<b><i>Quote:</i></b>[hr]Seriously, stop changing the planet.[hr][/quote]    No more planets please! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-stunned.gif[/img]    -&gt;DasBrot&lt;-"
	},
	{
		"id": 13173,
		"title": "Re:",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-27T18:02:03.000Z",
		"content": "Keen found A wrench, a hammer, a screw-driver and a new windshield. so returns home and lives happily ever after. The end.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  I'm bad explaining how planets look and deciding how big they are.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  I need to change this into a movie to explain planets better.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  But I don't know how to use flash [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  and I don't own a green screen.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] -------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13174,
		"title": "Re: Chapter ten: The ancient planet",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-07-27T18:06:14.000Z",
		"content": "This story seems to be caught up in a weird time warp. Consistently, Keen goes to these planets that are sending false alarm distress signals (with NOBODY on the planet).<br /><br />[quote]<b><i>Quote:</i></b>[hr]The planet Keen landed on had an obvious name: Vorticon I. Thousands of years ago (2000 B.C-1000 B.C to be exact), the Vorticons lived on that planet. They were very similar to the ancient Egyptians except they never got bothered by anyone from a different place.<br /><br />By the year 1000 B.C., they got an english style King who said they needed to be more fancy. So the whole civilization moved to Vorticon II. The King was hoping it would be took by someone else, but it was abandoned.[hr][/quote]<br /><br />What are everyone's motives in this story? To be more fancy? The King was hoping it would be took by someone else,? I'm assuming you mean the 1st planet.<br /><br />And the ending is an obviously dumbed down version of Marooned on Mars.<br /><br />I don't see the \"bizarre funniness\" in this story, much less the common sense or plot. Even reading it without looking for the storyline, joke by joke, sentence by sentence, it's just a lame attempt at making a bad story through random junk and stupid ideas.<br /><br />Obviously, some people are giving this whole thread a lot more credit than it deserves. Let me tell you a little story of my own.<br /><br />Years ago I used to have this CD program that helps you write. It had different buttons for different parts of grammar. Sometimes I would just press the buttons as fast as I could and would come up with a weird jargon paragraph. I'm going to see if I can use it one more time to demonstrate.<br /><br />(Installing the program first-took about 30 seconds. LOL. It needs 256 colors to run.)<br /><br />Annabelle, the truthful cow operated heavy machinery in the frozen north while millions watched As Charles Kettering said, \"We should all be concerned about the future because we will have to spend the rest of our lives there.\" A cockroach can live ten days without a head beneath a slimy toadstool while the stars twinkle. To rescue the princess, Buddha refused to answer the phone.<br /><br />The above paragraph is basically randomly generated, just like Harvey's story. I capitalized and added a few commas but all in all this story took 1 minute to make. If I edited it to make it Keenesque, added lots of planets, the bwb disappearing every chapter, details that lead nowhere, and other nonsense, tadaa! It would be like I was plagiarizing Harvey's story!<br /><br />Oh, too bad.<br /><br />To prove my point even further, how about I add my own story starter, like the beggining of a good fan fic. It was swirling around my head before I got to the randomly generated story. To keep the time of writing it down, I'll add a few elements of Harvey's story such as the distress call. I feel like adding Mort in here too.<br /><br />BEGIN Story<br /><br />Keen's small white spaceship zipped through the outer atmosphere of a strange, greenish planet. He pondered his ultimate reason for being here. Commander Keen was taking a nice hyperspace ride among the stars when he received a strange signal on his Photachyon Transceiver. Hearing only a faint but fluctuating buzzing noise, Keen ran the sound through a few filters on his onboard computer. The search turned up a similar sound, identified as one of a few standard distress calls in these parts. The noise being produced now was a bit more primitive than the standard, but it was worthy of investigation.<br /><br />And so Keen was now flying towards this slimy planet. He detected only one small landmass. The rest of the planet seemed to be a semi-ocean of marshy goop. Charming place really.<br /><br />Keen managed to find a spot that he deemed safe to land on. After landing, he braced himself for the BWB Megarocket to sink straight through the surface of this sturdier goop. He was lucky though. He seemed to have landed on a small hill of flexible alien vines, forming a net that kept land together on this obviously second-rate planet. Climbing out of the BWB, he checked his surroundings to get a better picture of this planet.<br /><br />What he saw were many tree like objects coming out of the... swamp. They didn't seem to have branches or leaves, instead they were like huge green spikes with veins of crimson red poking out of this god-forsaken place. Treading around the spikes and making sure to walk on the nets of vines, Keen proceeded down a trail of nothing in particular. That was when a few humanoid robots hovered in from behind a spike and extended there arms into heavy laser guns. That was there way of saying hello.<br /><br />It was also the custom of someone he knew rather well, too well in fact. Mortimer McMire strolled out from behind the spike as well.<br /><br />Morty looked Keen in the eye with a flash of hatred and evil. \"Well, well, Captain Keen. Even I underestimated your stupidity. Did it look like anyone would be on this planet that would need your help? Maybe a makeover but...\" Mortimer's voice trailed away and he turned to his bots.<br /><br />\"Stun him, I want him to suffer later.\"<br /><br />END Story<br /><br />This was just a test.[center][img]http://members.cox.net/aborlan/sig/signature2.gif[/img]<br />[/center]"
	},
	{
		"id": 13175,
		"title": "Oh-No!",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-07-27T19:53:04.000Z",
		"content": "I really did add to many planets! Oh man, I added so many planets that I can't come up with any more planets!! Oh Good Grief, HELP!!!X_X-------------------<br />A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)"
	},
	{
		"id": 13176,
		"title": "Re: Oh-No!",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-07-27T22:07:57.000Z",
		"content": "Instead of spending all your time thinking up planets, you could spend your time practicing your writing. Don't just say, \"I'm bad at describing things, so I'm not going to try.\" You'll never write anything readable that way. You just need more practice doing it. There are very few things that you won't get better at with practice. You probably won't get better at being tall if you spend twenty minutes on stilts every day, but if you work on writing engaging stories for twenty minutes every day, then you will get better.<br /><br />Unfortunately, you can't just type any old thing and call it practice. Learning to write requires you to look <i>honestly</i> at what you've written and evaluate it. You have to pick it apart and decide what could be better, and then you have to make it better. Soliciting and <i>listening to</i> criticism is a big part of that. If you just throw something you're not absolutely happy with out there you'll never improve. I can walk in circles all I like and never get anywhere. If I want to go somewhere, then I have to figure out where I'm going and how to get there. Learning to write is much the same.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 13177,
		"title": "Re: Chapter ten: The ancient planet",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-07-28T12:38:22.000Z",
		"content": "ROTFL, this story is hilarious![quote]<b><i>Quote:</i></b>[hr]Keen left his warper at home because he just forgot about it.[hr][/quote]LOL, \"Here Keen, this is an incredibly powerful device, you can warp to any location in the known universe, move people around, steal spaceships, anything you like!  This will be the most powerful device on your planet!\"<br />\"Whoops, I forgot about it.\"<br /><br />Seriously guys, forget the story writing element.  This is going to sound a little mean, so I don't mean to offend you Harvey, but it's immediately obvious from Harvey's writing style that he's still quite young.  I'd be surprised if he was older than Billy Blaze himself.  It doesn't matter how many times you explain the finer points of story writing to someone of this age, it won't sink in until they're a little older.<br /><br />You've all seen babies trying to draw?  It doesn't matter how many times you show a baby how to draw slowly and purposefully, it never will - it simply lacks the motor skills to duplicate that kind of physical movement, as the skills don't develop until the baby grows into a child.  The mind is the same, up until a certain age it lacks the ability to properly organise ideas, think things through, etc. and it is literally impossible for this to be taught.  That's why with all this coaching, Harvey's writing style hasn't changed.<br /><br />No offence to those who have been explaining these points, they're all very good, but don't expect Harvey to take them on board - I think it will take a few years before he's ready.  Most of you haven't yet seen the funny side of it, so I suggest you just avoid the topic - without wanting to be rude, you really will be just wasting your breath - you're trying to help someone who can't yet be helped.<br /><br />For those wondering why I find the 'stories' so funny, I'm sure you've seen those stand up comedians who are funny simply because they talk about bizarre things - it's so unexpected it's funny.  That's how I see these stories.  They're not supposed to tell an actual story (how could they?), they're just a string of truly bizarre and unrelated concepts - once you're in the right frame of mind, they can really be funny.  You just have to stop your amusement from being suppressed by the bad literary style [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   I should point out that I was getting really annoyed at them too, until they just got so bad I couldn't help but laugh... (no offence Harvey!)"
	},
	{
		"id": 13178,
		"title": "Re: Chapter ten: The ancient planet",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-06T20:40:37.000Z",
		"content": "Delete this thread!!!![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-furious.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 13179,
		"title": "Re: Chapter ten: The ancient planet",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-10-06T21:13:07.000Z",
		"content": "Umm..no.<br /><br />The overlords here are not subject to the whims of their peons.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 13180,
		"title": "Re: Chapter ten: The ancient planet",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-06T21:47:02.000Z",
		"content": "Heh, we'd all forgotten about it anyway until you posted your message and brought it to the top [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 13181,
		"title": "Chapter eleven: The new topic",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-06T22:47:29.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Heh, we'd all forgotten about it anyway until you posted your message and brought it to the top [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  [hr][/quote]<br /><br />I didn't forget it! (Yes, I do have good memory)<br /><br /><br />If you liked this story, then [url=http://p072.ezboard.com/fpubliccommanderkeenforumothercommanderkeenstuff.showMessage?topicID=1143.topic]The earth is doomed 2[/url] is what you'll want to read! But I know nobody liked this one, so...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 13182,
		"title": "Re: Chapter eleven: The new topic",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-19T22:28:53.000Z",
		"content": "Jill: Hiya! *chops block in half*<br />Cosmo: See, I told you that you could learn Kung Fo! *practices Kung Fo*<br />Keen: Wow what an adventure that was![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br />Harvey: Copycat *insert a million [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] s here*<br />Malvinious: Harvey... Please.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	},
	{
		"id": 13183,
		"title": "Re: Chapter eleven: The new topic",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-20T10:27:07.000Z",
		"content": "As the dyslexic monk said; Ummmmmmm.... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13184,
		"title": "Re: Chapter eleven: The new topic",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-21T07:06:43.000Z",
		"content": "Well at least you got my reaction right... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 13185,
		"title": "Re: Chapter eleven: The new topic",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-10-22T18:14:09.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Well at least you got my reaction right...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]   [hr][/quote]<br /><br />Malvinious: Harvey, stop drooling![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  Your making me sick![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img] <br />HS: [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br />Malvinious: I don't feel to good...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sick.gif[/img]  *runs to nearest trash can*<font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />\"I always try to consume interesting animals.\"-LevelLord</font>"
	}
]
