[
	{
		"id": 609,
		"title": "What Keen game do you hate? What Keen game do you love?",
		"author_id": 1486253,
		"author_name": "KeenzTheKing",
		"timestamp": "2005-11-07T04:44:10.000Z",
		"content": "I love Keen games, Aliens\\Babysitter especially, but I don't love all of em. I hate Armageddon. I just don't think its that great. But Keens 4 and 6 are my faves! What Keen games do you love? Hate?"
	},
	{
		"id": 16026,
		"title": "Re: What Keen game do you hate? What Keen game do you love?",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-11-07T07:46:53.000Z",
		"content": "I can't really stand Keen 2 for that long; sue me, but it is just sooo white, and streamline. It makes me actually consider getting a mac!!!<br /><br />I don't have that kind of money; I just bought a website... oh, that was supposed to be a suprise.<br /><br />It isn't finished, but I'll tell you later (It's going to have a unique Keen section).<br /><br />BTW - Shouldn't this post be in the \"Keen Voting Booth\"?Proud Leader of the \"Tough Guys Wear Pink\" Society<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/LLMod.jpg[/img]<br />\"Tough Guys Wear Pink!!!\"<br />-- NAJAWA --"
	},
	{
		"id": 16027,
		"title": "Re: What Keen game do you hate? What Keen game do you love?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-07T11:57:01.000Z",
		"content": "I...it...wha?<br /><br />H...hate...Keen?<br /><br />I, I kinda see that it mught be philosophically possible to do that, that logically since so many people love Keen there must be an opposite, but I always figured it'd be like dark stars, or military inteligence, possible but  not tangible.<br /><br />On the other hand, I loove Keeen 1; its versitile, and the origional. Specifically I loooooove the XkyKeen series.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 16028,
		"title": "Re: What Keen game do you hate? What Keen game do you love?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-07T13:30:40.000Z",
		"content": "Hmmm, I love them all!<br />But I like Keen 3 the least. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>Eat your veggies!</b>"
	},
	{
		"id": 16029,
		"title": "hmm...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-11-08T03:25:35.000Z",
		"content": "I think I dislike Keen4 the most, honestly.  Keen2's my favorite.<br /><br />The enemies in Keen4 seem the least interesting, insofar that the primary enemy you face is a freakin' Slug, which doesn't have any AI to move toward or away from you--it simply poops and changes facing occasionally.  <br /><br />Keen2 has Scrubs, and I need not elaborate beyond that.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 16030,
		"title": "Re: hmm...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-09T05:21:25.000Z",
		"content": "Oh I dunno; if the slugs didn't chug so much snail poison they'd have a lot more friends. [And be a pleasant shade of  blue.]<br /><br />I've always had a like for the naturalic tiles of Keen 4.<br /><br />Scrubs are suckers; if you push them off a wall they just get up and keep on going; if you put something in their way they just climb over it. If it weren't for their mysterious champion 'Sky Scrub' who prowls the halls of the vorticon mothership defending them, they'd be toast.A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/lind.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 16031,
		"title": "Re: hmm...",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-06-30T08:54:13.000Z",
		"content": "I can't profess to hating any episodes, really, but there are definitely ones I like more than others.  Keen 6 is the best, by far.  It combines the technological feel of Keen 5 with the more natural look of Keen 4.  It looks, more than any of the others, like an alien world.  Keen 5 was once my favorite, but I think I tire of it pretty fast.  Keen 2 is much the same way, and for the same reasons: aboard a space station, there is little room for variety.  Keen 4 is great, if for no other reason than for the nostalgic appeal.  Keen 3 is fun, but the levels get really frustrating at times.  I like Keen 1, but I think I may have played it too much or something.  Keen Dreams is most likely my least favorite, since it doesn't really seem to fit in the Commander Keen universe."
	}
]
