[
	{
		"id": 1298,
		"title": "MacGyver",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-11-08T20:00:20.000Z",
		"content": "MacGyver is (was?) my favorite tv show of all time. The only reason I decided to mention it here is because the release date for season 5 on dvd has been set. Much to my delight, this is to be released on 3/14 (2006) [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br /><br />(edit: forgot to add the link...)<br />[url=http://www.tvshowsondvd.com/newsitem.cfm?NewsID=4466]www.tvshowsondvd.com/news...ewsID=4466[/url]"
	},
	{
		"id": 27984,
		"title": "Re: MacGyver",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-08T21:39:26.000Z",
		"content": "MacGyver is the man.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 27985,
		"title": "Re: MacGyver",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-09T07:54:25.000Z",
		"content": "Yeah, have to agree with xtra, although having seen only couple of episodes. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  The guy sure knew how to blow things up.<b>Eat your veggies!</b>"
	},
	{
		"id": 27986,
		"title": "Re: MacGyver",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2005-11-09T23:39:06.000Z",
		"content": "He's pretty much the ultimate badass.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 27987,
		"title": "MacGyver",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-11-11T20:16:31.000Z",
		"content": "I've only seen Richard Dean Anderson in Stargate SG-1, which he's great in, which I watch all teh time.<br /><br />So just what is MacGyver about? (Short summary)"
	},
	{
		"id": 27988,
		"title": "Summary",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-11-15T18:16:05.000Z",
		"content": "Short summary: Awesome. Best tv show ever. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   <br />Oh, wait you want a REAL summary. Here goes...<br /><br />MacGyver is a show about the adventures of this \"MacGyver\" guy. Due to his personality, training and education, he ends up \"employed\" by the Phoenix Foundation. The Phoenix Foundation is contracted to do various good things: Sneaking in foreign lands to rescue captives who can't be rescued by the military because that would be an act of war. Providing security for foreign art exhibits within the US. And a lot of James Bond-like missions.<br />But what makes MacGyver awesome?<br />Due to the nature of these missions, there's always somebody with strong motivation to stop whatever MacGyver is doing. Inevitably, Mac gets into a situation that looks hopeless. But MacGyver is something of a renaissance physicist/scientist. Meaning he has a broad range of knowledge in physics, science, chemistry and history. So he comes up with really clever ways of getting out of bad situations that most people wouldn't think up.<br /><br />For example, in the last episode of season 3, MacGyver and a friend are locked in the basement of an old house. (With gunmen upstairs planning to kill them.) They discover that this house was inhabited by Chinese immigrants in the 1800s. Mac's knowledge of history leads him to believe that they would have a hidden cave entrance in this basement. (Watch the episode to understand.) There is an old television set in the basement. Mac tears it apart to get to the speakers. By turning the volume way up (with no sounds signal, so all you hear is a little static), he uses the two speakers to discover the hollow part of the wall. (It is a brick wall, banging on it would not work.) This works due to the physics of speakers and sound feedback.<br /><br />Edit:<br />P.S. Stargate SG-1 is awesome. Hopefully that game will be out soon..."
	},
	{
		"id": 27989,
		"title": "Re: Summary",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-11-16T00:34:14.000Z",
		"content": "mmmph. the game has been undergoing some issues with developer/company changes I believe. I think they showed it at E3 but I wouldn't expect it to be out soon because they were making it better or whatever.[hr]<br />\"Don't ask, don't tell.\" -ME<br />[img]http://img447.imageshack.us/img447/4808/dimesterrulez24aa.gif[/img]"
	},
	{
		"id": 27990,
		"title": "Re: The alliance",
		"author_id": 1485919,
		"author_name": "Vitamin Zach",
		"timestamp": "2005-11-16T05:31:02.000Z",
		"content": "Maybe this is technically off-topic, but who cares...<br /><br />Good signs of life:<br />[url=http://www.the5thrace.net/forums/showthread.php?t=5772]www.the5thrace.net/forums...php?t=5772[/url]<br /><br />And this one's pretty good:<br />[url=http://www.stargate-game.com/]www.stargate-game.com/[/url]<br /><br />(Please excuse any spelling problems to follow, it's very late and I'm not very awake...)<br />It was a contract dissagreement between the publisher (JoWood) and the developer (Perception). Just looking from the sidelines at the public comments by both JoWood and Perception and some of the other little bits of news from these companies as well as MGM (the television studio that owns the show and therefore anything SG-1), I'm almost certain that what happened was this:<br />1. Perception told JoWood they would have the game completely finished by this fall. (By 9/30 or something.) And asked for some amount (about $5 million?) to cover their costs.<br />2. The $5 million wasn't required all at once, since it is to cover mostly salaries, you could pretty evenly spread it out. So JoWood agrees to pay this amount as the developer shows progress.<br />3. JoWood, being a small-time publisher, runs into financial problems, isn't quite able to keep up with their end of the bargain.<br />4. Perception misjudged the time required, and realize that they will need a couple more months to finish the game. (More time = more money.)<br />5. Perception asks JoWood for more time and more money.<br />6. JoWood already wasn't able to get the original amount to Perception, much less the additional money. Plus to stay alive, they need to start selling something, specifically Stargate on time. <br /><br />So now both companies haven't kept up their sides of the contract. JoWood has now paid Perception some amount (almost $5 million), but has not recieved anything for it. Similarly, Perception has done $5 million worth of work, but has not been paid $5 million.<br />JoWood has no way to afford paying what is needed, so they just want all of their almost $5 million back (or for Perception to just give them the equivalent to what they've paid for.)<br />But remember that MGM is really the company that owns SG-1. Perception actually licensed stuff from MGM. So they cannot just give this to JoWood and forget it.<br /><br />So that may sound complicated... The bottom line is that it's all good news:<br />MGM wants the game finished.<br />MGM likes what Perception has shown them.<br />Perception needs a new publisher.<br />The new publisher will \"buy\" the game from Perception by paying whatever it is that Perception needed from JoWood.<br />Perception will then pay JoWood back the nearly $5 million.<br /><br />Now JoWood gets their money. They are happy.<br />Perception gets paid and finishes the game, we get the game.<br /><br />Finally: A lot of this is out-dated, and Namco doesn't even make this page official, but this page would seem to imply that Namco did/will pick the game up:<br />[url=http://www.namco.com/games/stargate/]www.namco.com/games/stargate/[/url]<br />(Namco has very deep pockets, if they think the game will sell enough, they will have no problem paying out whatever Perception needs.)"
	},
	{
		"id": 27991,
		"title": "Re: The alliance",
		"author_id": 1486837,
		"author_name": "narnia4",
		"timestamp": "2005-12-06T00:17:17.000Z",
		"content": "I looked at the alliance website forums, and they are going looking for alpha testers(in Australia.)  I heard they may have a new publisher for the game. Hopefully it'll be out sometime in 2006.<br />  I have lots of DVDs of Stargate SG-1, and I'd like to see MacGyver too.<br />Too bad Richard Dean Anderson isn't gonna be in Stargate season 9."
	}
]
