[
	{
		"id": 761,
		"title": "Just for a laugh",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-20T05:15:30.000Z",
		"content": "While I'm loathe to agree with Rorie's proposition that Americans are brain dead because the elected Bush, I have new proof of people's ability to avoid education: Kathy Evans, the single  dumbest  contestant to ever get on \"Who Wants To Be A  Millionaire?\"   <br /><br /><br />* * *<br /><br />NEW YORK  Idaho resident  Kathy Evans brought humiliation to her friends and family Tuesday when she  set a new standard for stupidity with her appearance on the popular TV  show, Who Wants To Be A Millionaire.<br /><br />It seems that Evans, a  32-year-old wife and mother of two, got stuck on the first question, and  proceeded to make what fans of the show are dubbing the absolute worst  use of lifelines ever.<br /><br />After being introduced to the  shows host Meredith Vieira, Evans assured her that she was ready to play,  whereupon she was posed with an extremely easy $100 question. The question  was:<br /><br />    Which of the following is the  largest?<br />    A) A Peanut<br />    B) An Elephant<br />    C) The Moon<br />    D) Hey, who  you calling large?<br /><br />Immediately Mrs. Evans was  struck with an all consuming panic as she realized that this was a  question to which she did not readily know the answer.<br /><br />Hmm, oh boy, thats a  toughie, said Evans, as Vieira did her level best to hide her disbelief  and disgust. I mean, Im sure Ive heard of some of these things before,  but I have no idea how large they would be.<br /><br />Evans made the decision to use  the first of her three lifelines, the 50/50. Answers A and D were removed,  leaving her to decide which was bigger, an elephant or the moon. However,  faced with an incredibly easy question, Evans still remained unsure.  <br /><br />Oh! It removed the two I was  leaning towards! exclaimed Evans. Darn. I think I better phone a  friend.<br /><br />Using the second of her two  lifelines on the first question, Mrs. Evans asked to be connected with her  friend Betsy, who is an office assistant.<br /><br />Hi Betsy! How are you? This is  Kathy! Im on TV! said Evans, wasting the first seven seconds of her  call. Ok, I got an important question. Which of the following is the  largest? B, an elephant, or C, the moon. 15 seconds hun.  <br /><br />Betsy quickly replied that the  answer was C, the moon. Evans proceeded to argue with her friend for the  remaining ten seconds.<br /><br />    Come on Betsy, are you sure?  said Evans. How sure are you? Puh, that cant be it.<br /><br />To everyones astonishment, the  moronic Evans declined to take her friends advice and pick The Moon.  <br /><br />I just dont know if I can  trust Betsy. Shes not all that bright. So I think Id like to ask the  audience, said Evans.<br /><br />Asked to vote on the correct  answer, the audience returned 98% in favor of answer C, The Moon. Having  used up all her lifelines, Evans then made the dumbest choice of her life.  <br /><br />Wow, seems like everybody is  against what Im thinking, said the too-stupid-to-live Evans. But you  know, sometimes you just got to go with your gut. So, lets see. For which  is larger, an elephant or the moon, Im going to have to go with B, an  elephant. Final answer.<br /><br />Evans sat before the dumbfounded audience,  the only one waiting with bated breath, and was told that she was wrong,  and that the answer was in fact, C, 'The Moon.'  <br /><br /> [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19793,
		"title": "Re: Just for a laugh",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-02-20T11:48:26.000Z",
		"content": "Aye, mildly comedic. At least it's only satire. A true story like this would be truly unpleasant."
	},
	{
		"id": 19794,
		"title": "Re: Just for a laugh",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-02-20T11:52:47.000Z",
		"content": "Just in case anyone has doubts as to the veracity: [url=http://www.snopes.com/radiotv/gameshows/millionaire.asp]www.snopes.com/radiotv/gameshows/millionaire.asp[/url]"
	},
	{
		"id": 19795,
		"title": "Re: Just for a laugh",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-20T11:56:18.000Z",
		"content": "I'd say the elephant, meaning the space-elephants of Trunkella II. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img] <br /><br />Was this real? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 19796,
		"title": "Re: Just for a laugh",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-02-20T12:06:42.000Z",
		"content": "Snopes says No.<br /><br />Though not being able to know what orbits Earth is pretty stupid, too. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 19797,
		"title": "Good ol french",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-20T14:57:01.000Z",
		"content": "You've got to love those frenchies; that video is hilarious."
	},
	{
		"id": 19798,
		"title": "Re: Good ol french",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2007-02-23T08:26:26.000Z",
		"content": "Obviously Evans is from somewhere on the Discworld. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	}
]
