[
	{
		"id": 1203,
		"title": "Xenofobic parties",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-24T19:51:32.000Z",
		"content": "Parties with ideas that goes against the equality of men or if other word ideas that approve racism or discrimination. Should they be forbidden by law?<br /><br />Some examples I'm reffering to: Front National (Le Pen), Vlaams Belang (De Winter), and FP (Haider).<br />Do you think that this kind of parties should be forbidden because they can be a danger to democracy and the equality of men?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26440,
		"title": "Re: Xenofobic parties",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-24T21:20:07.000Z",
		"content": "I shouldn't admit this but I don't know much about those parties. There are many things I'd forbid, but human stupidity would be against me. And besides, it's a possibility that maybe I am the stupid one (not likely though [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  ).<br /><br />*EDIT* If people voted for parties that are against democracy, then it may be that people don't want democracy...[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 26441,
		"title": "Re: Xenofobic parties",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-24T22:46:31.000Z",
		"content": "Well while I don't agree with the ideas these groups entertain, my outlook on life tends to be \"live and let live\" - so providing they're not harming anyone I think they should be allowed to do whatever they want."
	},
	{
		"id": 26442,
		"title": "Re: Xenofobic parties",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-25T16:56:40.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]*EDIT* If people voted for parties that are against democracy, then it may be that people don't want democracy... [hr][/quote]<br />But wouldn't that be dangerous, we all know what happened with Germany when a lot people voted against democracy by voting for the SDAP.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Well while I don't agree with the ideas these groups entertain, my outlook on life tends to be \"live and let live\" - so providing they're not harming anyone I think they should be allowed to do whatever they want. [hr][/quote]<br />How do you know they won't? Filip DeWinter leader of the Belgium Vlaams Blok partie abused a student once when he refused a Vlaams Blok partie.<br />And the Le Pen said and did don't make me really happy either:<br />- He has made remarks which are widely considered to be anti-Semitic; for example, on 13 September 1987 he referred to the Nazi gas chambers as \"a point of detail of the Second World War.\" Le Pen once made the infamous pun \"Durafour-crmatoire\" (\"crematory oven\") about then minister Michel Durafour, a Jew; the corpses of the victims of the Nazi gas chambers were incinerated in such ovens. In February 1997, Le Pen accused President Chirac of being \"in the pay of Jewish organizations, and particularly of the notorious B'nai B'rith\". <br />[quote]<b><i>Quote:</i></b>[hr]- In May 1987 he advocated isolating those infected with AIDS (whom he calls \"sidaques1&amp;quot[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  from society by placing them in a special \"sidatorium\". <br />- On June 21, 1995, he attacked singer Patrick Bruel on his policy of no longer singing in the city of Toulon because the city had just elected a mayor from the National Front. Le Pen said \"the city of Toulon will then have to get along without the vocalisations of singer Benguigui\". Benguigui, a Jewish name, was Patrick Bruel's real name. <br />- In 2005, he claimed that the occupation of France by Nazi Germany \"was not particularly inhumane\".[2] During the Second World War, Nazi Germany occupied France, deported section of its Jewish population to extermination camps, retaliated against Resistance actions by killing civilians, tortured people suspected of being in the Resistance, and took civilians into forced labor. [hr][/quote]<br />And this are just Le Pen examples; Haider, Janmaat, and the Winter have said similair things. All of them are of were pretty succesfull, so do you still think they are not dangerous?-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26443,
		"title": "Re: Xenofobic parties",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-25T17:05:24.000Z",
		"content": "They may be dangerous, but banning them would mean the end of democracy too in a way... I don't like democracy though. We depend too much on the average non-thinking citizen.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 26444,
		"title": "Re: Xenofobic parties",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-25T17:07:11.000Z",
		"content": "The larger blow to democracy would come about by stopping freedom of speech....~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26445,
		"title": "Re: Xenofobic parties",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-25T18:01:14.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]They may be dangerous, but banning them would mean the end of democracy too in a way... [hr][/quote]<br />Might be true but allowing these parties spread their ideas may be a bigger problem. Besides in the Nethelands, and I'm sure that goes up for othe countries as well, there is a law that forbids racisme so in fact they're already against the law.<br /><br />[quote]<b><i>Quote:</i></b>[hr]I don't like democracy though. We depend too much on the average non-thinking citizen. [hr][/quote]<br />Well that's true however a smart politician knows how to play with those people, besides only letting the smart people vote won't be fair for the 'stupid' ones because the smart people will only try to be good for themselves.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26454,
		"title": "Re: Xenofobic parties",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-26T00:19:03.000Z",
		"content": "What do you suppose we put the trust into then?  A group of leaders who will be more apt to be corrupt than the citizens are stupid.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26455,
		"title": "Re: Xenofobic parties",
		"author_id": 1486226,
		"author_name": "z hyphen one",
		"timestamp": "2005-11-26T00:42:48.000Z",
		"content": "I would only let those vote who don't fail some kind of economic knowledge and iq/eq tests. Every politician wants power, so they would change if they were not elected otherwise.<br /><br />Unfortunately no such tests can be objective, and with the current democracy, not many would like this to happen.[hr]<i>The human brain is not user-friendly...</i>"
	},
	{
		"id": 26446,
		"title": "Re: Xenofobic parties",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-26T00:51:58.000Z",
		"content": "<i>\"Might be true but allowing these parties spread their ideas may be a bigger problem.\"</i><br /><br />That's what they said about communism, but providing people have a choice I'd like to think that the majority would choose something sensible."
	},
	{
		"id": 26447,
		"title": "Re: Xenofobic parties",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2005-11-26T07:22:23.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]That's what they said about communism, but providing people have a choice I'd like to think that the majority would choose something sensible. [hr][/quote]<br /><br />But do they?<br />Some statistics:<br />Vlaams Blok 23,2 and 24,2 of the two elections in 2004.<br />Front National 17% of all votes in 2002.<br />FP 22,7% of all votes in 1994.-----------------<br />[img]http://jamba.nl/storage/view/335/0/cr/CrazyFrog___Axel_F_Rocket.gif[/img]<br />Jamster! rules!"
	},
	{
		"id": 26448,
		"title": "Re: Xenofobic parties",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-11-30T20:56:50.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />I would only let those vote who don't fail some kind of economic knowledge and iq/eq tests. Every politician wants power, so they would change if they were not elected otherwise.<br />[hr][/quote]<br /><br />Hey, guess what?  If you do not agree with me on the accepted \"norm\"  of what economics(/anything you will change it to) is, then you are not allowed to vote.  Sounds reasonable, no?~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26449,
		"title": "Re: Xenofobic parties",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2005-12-08T02:33:21.000Z",
		"content": "wth, I'll bump this<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Might be true but allowing these parties spread their ideas may be a bigger problem[/qoute]<br /><br />The biggest problem in the world is fighting ignorance with greater i[hr][/quote]~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 26450,
		"title": "Re: Xenofobic parties",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-12-08T08:09:21.000Z",
		"content": "And I'll rebut with this<br /><br />'Its not ignorance that is a danger, but ignorance of ignorance'<br /><br />- John Dawson Davies<br /><br />Recently in my country there was an attempt to pass ;'hate speech legeslation' banning any public speech that 'was derogatory to any minority group' this was very dangerous, as it would, in my opinion stifle debate and be used in a negative way to crush dissent.<br /><br />The question Djaser asks is 'Would the benefits to society by banning these parties and shunning their ideals outweigh the damage to fee speech and expression of opinion?'<br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 26451,
		"title": "sdfds",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2006-01-16T08:27:58.000Z",
		"content": "You guys haven't seen Stormfront, have you?  www. stormfront.org  Personally, the aggregate effect was that it sickened me out (and that's not \"just\" after glancing at it).  How fundamentally horrible some people can be...<br /><br />Which not all of them are, either.  It's those who say that \"bringing a [mixed-race child] into the world is the worst crime I can think of\" that I'd like to shoot.<br /><br />And if these global stats aren't alarming...<br /><br />Threads: 219,714, Posts: 2,393,386, Members: 71,723, Active Members: 23,900 <br /><br />But as Levellord phrases Djaser's question, yes, yes, the benefits to society Would severely outweigh the infringement of free speech.  The only danger, of course, is that such a banning would serve as precedent to reducing free speech even further... and further..."
	},
	{
		"id": 26452,
		"title": "Re: sdfds",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-17T07:24:41.000Z",
		"content": "Well, fucl them; interbreeding is occurring and there's nothing they can do about it.<br /><br />It might surprise them to know that less than 10% of americans are 'pure' and that the percentage is lower in Europe. It can be quite surprising what breeds you have in your family tree...A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 26453,
		"title": "Re: sdfds",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-01-21T19:13:46.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<br />Threads: 219,714, Posts: 2,393,386, Members: 71,723, Active Members: 23,900 <br />[hr][/quote]<br /><br />I saw this forum.  Yes, it is disgusting.  But worldwide, 23,000 people is not even a slight majority.  Also, they would have to re-write our consitution and over-turn Brown v. Board of Education.<br /><br />Either way, it is their right to be ignorant, hypocritical fools.  They want to be just that, then so be it.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	}
]
