[
	{
		"id": 1295,
		"title": "The Dukes of Hazzard... (NOT THE DUMB MOVIE)",
		"author_id": 1180427,
		"author_name": "The Dixie Dazzler",
		"timestamp": "2005-12-15T22:24:13.000Z",
		"content": "the best tv show in the world! that what I say! I mean common, Hot cars, Good ol' boys... Daisy [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  . but there was one bad thing, and that happend when Tom (Luke) And John (Bo) Went On strike! and thay put those Loser cousins in Coy and Vance (I dont know there real names) but that just about killed the show! then came the movie... complete slaughter! the only thing I liked about it was some of the stunts and well jessica wasnt the best Daisy but common, what guy would not like to see her half naked [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img]  ?... But the morals where all gone... it should not have even been called the dukes of hazzard... the only thing duke about it was the car and names... other then that its about a bunch of rednecks, not the good ol' country boys we know and love. when it comes to the dukes, theres just no Substitute. Its gotta be John And Tom!"
	},
	{
		"id": 27967,
		"title": "Ugh.",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-12-17T05:52:10.000Z",
		"content": "Ugh, the movie sucked arse, I agree with you entirely. I watched 40 Year Old Virgin while the rest of my friends saw Hazzard in the other cinema, and saw a DVD rip of it a couple of days later. Horrible stuff, but somehow almost everyone else enjoyed it.<br /><br />I've never seen the show, and it doesn't sound like something that would interest me either.<br /><br />[hr]<b>Dixie</b> jessica wasnt the best Daisy but common, what guy would not like to see her half naked [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img]  ?<br />[hr][img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img]  You kidding? She's so bloody plastic... all that makeup and bimboness... and she couldn't act her way out of a paper bag, for lack of a better metaphor.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 27968,
		"title": "Re: Ugh.",
		"author_id": 1486568,
		"author_name": "Ilsoap",
		"timestamp": "2005-12-28T08:30:40.000Z",
		"content": "The original TV show is decent to watch in reruns... but nothing more.[url=http://www.screenhog.com]www.screenhog.com[/url]"
	},
	{
		"id": 27969,
		"title": "...",
		"author_id": 1180427,
		"author_name": "The Dixie Dazzler",
		"timestamp": "2005-12-30T00:32:15.000Z",
		"content": "well... I like it! I'm guessing neather one of you are from Dixie U.S.A.? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] ... thats ok... not all of us are that lucky! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  lol anyway... its worth it to me to watch it every day! It comes on CMT 4 times a day... at 10:00 A.M., 11:00 A.M., 6:00 P.M., And 10:00 P.M. anyway [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-embarrassed.gif[/img] ... its a good show!I wish I was in the land of cotton, Good times there are not forgotton, Look away! Look away! Look away! Dixieland...<br />And I wish I was in Dixie Hooray! Hooray! In Dixieland I'll take my stand, To live and die in Dixie."
	}
]
