[
	{
		"id": 51,
		"title": "In a similar vein to low score, speedrunning...",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2006-11-04T18:03:35.000Z",
		"content": "How about not killing any enemies? (I apologize if this has been discussed before, but I am a noob to this community).<br /><br /><br />A few weeks back I tried to see if I could beat Keen 4 on 'hard' without firing a single shot. <br /><br />It was pretty challenging, but it was working okay. There was one level where you *have* to shoot a slug or something because the ceiling was too low to jump over it. It was the Pyramid of Gnosticene Ancients, I think. <br /><br />But most of the levels needed to finish the game can be done without shooting anything.<br /><br /> Maybe you guys can figure out a way to get past that part I mentioned. I haven't tried it for any of the other Keen games--Obviously you have to fire once to finish Keen1, and my disk for the other two games in that trilogy is at my parent's house.<center><b>crymorenub</b></center><br />"
	},
	{
		"id": 2246,
		"title": "Re: In a similar vein to low score, speedrunning...",
		"author_id": 1485755,
		"author_name": "Scizor CT",
		"timestamp": "2006-11-04T18:43:49.000Z",
		"content": "I tried this in my low score Keen 4 hard run. The short answer is that it's impossible, primarily because of Sand Yego and Pyramid of the Forbidden. It <i>might</i> be possible if you only play the required levels, but even then I think both of the pyramids would trip you up. Ruddy tight passages. Going through all of the levels requires something like 15 or 20 shots, sans maybe one or two."
	},
	{
		"id": 2247,
		"title": "Re: In a similar vein to low score, speedrunning...",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2006-11-04T18:52:14.000Z",
		"content": "Yeah. I only did the required levels, and it was one of the pyramids where I ran into problems.<br /><br />I'm sure you could finish on 'easy' without firing a shot though. But that isn't really the same.<center><b>crymorenub</b></center><br />"
	},
	{
		"id": 2248,
		"title": "Re: In a similar vein to low score, speedrunning...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-11-04T22:33:32.000Z",
		"content": "Yeah, those small passages are problematic. Not 100% sure, haven't tried it for a while, but I think it's impossible with easy as well, mainly because of some slug filling a passage.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2249,
		"title": "Re: In a similar vein to low score, speedrunning...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2006-11-05T00:22:46.000Z",
		"content": "Keen 1 can be completed without firing a shot; getting past that last Vorticon is rather difficult, but you can usually get past him after a dozen or so tries. <br /><br />Keen 2 requires at least 15 shots for me (Not all are needed for tantalus rays; simply touching the sparky thing saves a city)<br /><br />Keen 3 requires seven shots to finnish, all in level 16.<br /><br />Keen 4 I have found I can only do with 16 shots, though I may be able to use a few less.<br /><br />Keen 5 I have not done, but initial levels look promising.<br /><br />Keen 6, especially with the impossible bullet trick requires only 8 shots for me.<br /><br />Keen dreams I required 18 shots, including Boobus Tuber; it was pure hell to finnish.<br /><br />(All done on hard0<br /><br /><br />As you can tell, I am quite a pacifist. I have practised this often.<br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 2250,
		"title": "re",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2006-11-06T04:26:27.000Z",
		"content": "Keen 5 Hard = 4 shots"
	},
	{
		"id": 2251,
		"title": "Re: re",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2007-02-18T23:20:27.000Z",
		"content": "I was screwing around some more with this over the weekend.<br /><br /><br />I found that Keen 4 is possible with just one shot. <br /><br />In the Pyramid of the Shadows, when you first get to the elevator-jumping part over the tar there is a passage with a slug which you simply cannot get past without shooting.<br /><br /><br />But then again, I thought a lot of other parts in the pyramids were impossible too, but I eventually figured out how to get past them. Maybe somehow if I time the jump just right I can get past that slug.<br /><br /><br />I should note that I am skipping all the non-essential levels. I don't know how much things would change if you tried to do every level in the game.<center><b>crymorenub</b></center><br />"
	},
	{
		"id": 2252,
		"title": "Re: re",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-19T00:27:02.000Z",
		"content": "I say vital levels only, if Keen were really being humanitarian. (Slugitarian?) I'm sure he'd not bother anybody that didn't need bothering.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 2253,
		"title": "Re: re",
		"author_id": 1485928,
		"author_name": "Feldegryph",
		"timestamp": "2007-02-19T17:10:16.000Z",
		"content": "Well, I did it!<br /><br />Have you noticed how if you pogo jump, hit the ceiling and switch pogo off, keen will stay in the air for a few nanoseconds longer?<br /><br />Well, if you get a running start and time it just right you can jump over this slug,<br /><br /><br /><br />I have taken sort of a 'Quod Erat Demonstradum' approach to this. I saved the game before a difficult part, tried it a whole bunch of times and eventually got past it. So it is technically possible to finish the game without firing a shot. <br /><br />But think actually getting through the game in one go like this would be just about impossible, as there is a lot of luck involved in a few of the parts.<br /><br />But hell, I'll see if I can make a video of it all the same.<br /><br />The bad news is, I've already forgotten how I did parts of the other pyramid!<center><b>crymorenub</b></center><br />"
	},
	{
		"id": 2254,
		"title": "Re: re",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-02-20T02:56:17.000Z",
		"content": "Just do video fragments, heck, you could even edit them and stick them together.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 2255,
		"title": "Re: re",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-02-20T11:11:58.000Z",
		"content": "Wow, excellent! Definitely gotta try that technique. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	}
]
