[
	{
		"id": 80,
		"title": "Tiny bit of Help needed...",
		"author_id": 1486296,
		"author_name": "WizardyMan",
		"timestamp": "2006-08-09T13:55:42.000Z",
		"content": "I know this has been asked a million times on PCKF, but <i>how</i> exactly do you do the <b>Impossible Pogo Trick</b> in CK4, 5, and 6?<br /><br />(And is it possible in the original trilogy?)"
	},
	{
		"id": 2794,
		"title": "Re: Tiny bit of Help needed...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-08-09T18:23:16.000Z",
		"content": "Impossible pogo means that you just push control quickly right after pressing alt. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  (Or whatever your jump and pogo keys are.)<br />And yeah, it's possible in the original trilogy as well.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2795,
		"title": "Impossible Pogo Trick!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-08-09T20:08:30.000Z",
		"content": "If you've got Keen6, a good way to explain the difference can be found in Guard Post One.  Put the game on Easy and head left from the start, until you can't go left any more--you should be at a tall pillar of earth with two beams firing up above you.  <br /><br />If you jump into the air, pull out your pogo stick, and hold the jump button down, Keen will bounce so that his helmet is somewhere near level with the top of the pillar of earth.  This is the 'normal' pogo height.<br /><br />Now, take a step back, then run to the side and press pogo+jump in rapid succession, and hold the jump button down... notice that Keen's head goes about half a Keen-height higher than it did before.  On Easy mode, this height difference is enough to let you turn the pogo off and grab the top of this pillar of earth, pulling yourself up to take a shortcut, skipping the entire level by continuing left.  <br /><br />That's the simplest demonstration I can think of.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />Edit: The EzCode seems to be screwing up my signature... I hope this is fixed soon.&lt;!--EZCODE IMAGE START---&lt;img src=\"http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png\"/&gt;&lt;!--EZCODE IMAGE END---"
	},
	{
		"id": 2796,
		"title": "Re: Impossible Pogo Trick!",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-08-11T11:06:00.000Z",
		"content": "Perhaps this is really obvious and I am just dense, but I only discovered a couple of weeks ago that the IP trick is possible to do while standing still as well.<br />I've been doing a running start before jumping everytime up until then, which makes it a harder to go where you want to sometimes.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	}
]
