[
	{
		"id": 472,
		"title": "Commander Keen comic update (again)",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-10-04T05:06:28.000Z",
		"content": "Well it has been a while hasn't it. I have decided that I should give an update as to the progress (or lack there of) of my comic.<br /><br />As you may or may not know, I have, for quite a while now, been working on a Commander Keen comic. I posted some stuff about it before. I also promised myself that I would have it done before the end of July.<br /><br />I broke my promise. Things just didn't work out. I had more important things to worry about. What can be more important that Commander Keen you say? Trust me... there are things more important. Anyway those things have nothing to do with this story.<br /><br />So after MONTHS of getting things sorted, I FINALLY got down to drawing the comic. I have drawn this comic out about 8 times. Never actually finishing it because I didn't like the visual style. But I have finally hammered out how I want the comic to look and, surprisingly enough, am pleased with the results. For the past week or so, I have been busting my BUTT on this comic. THIS IS THE REAL RELEASE OF THIS COMIC! And it is coming soon. Currently I am about 50% done with the line art. I then need to color it. And then I need to put all the panels together to make a comic.<br /><br />Anyway as an introduction for this comic I have decided to give a little background on the comic and characters. I have made up many characters and a few species. Here are some of the main characters. This comic takes place after \"The Universe is Toast\".<br /><br />(Sorry on the quality of some of the images. Photoshop didn't resize them correctly.)<br /><br /><br /><br /><br /><br />[img]http://img64.imageshack.us/img64/9576/keencopy0au.png[/img]<br />Commander Keen. The hero. The main character. The defender of earth. The Galaxieretter. If you don't know who this is you need to be shot, then stabbed, then shot again. Maybe even be punched in the face.<br /><br />[img]http://img64.imageshack.us/img64/6970/mortandic21xl.png[/img]<br />Mort(Left). The villian. The arch rival. The nemesis. Wants to rule the galaxy. For some reason I drew him with his helmet off. After being defeated once again by Commander Keen Mortimer disappeared. After narrowly escaping with his life and only one measly battlecruser. Mort went into hiding. Rumors are floating around that the Shikadi are hunting him down for reasons unknown.<br /><br />I C-2(Right). Mortimer's right hand... thing. After being cut off from all communication from earth, Mort needed a new, temporary right hand man. Looking through the plans he stole from various sources he discovered the design for this experimental android-ish design just labeled \"I C-2\". Why did mort choose a robot for his right hand man? Because robots don't die from neglect.<br /><br />(I could not think of a background for this picture.)<br /><br />[img]http://img64.imageshack.us/img64/7355/taeandtie7nq.png[/img]<br />Tae(Left). Older of the two brothers of the Vegillis family. Captains the Talrigmite mining ship \"The Inspiration\". Pretty much runs the Vegillis family estates and deals with the grand shadow being.<br /><br />Tie(Right). Younger of the two brothers of the Vegillis family. He is really stupid and doesn't do many things besides eat. Is usually an embarrassment to the Vegillis family.<br /><br />Notes on the Vegillis family:<br />The Vegillis family is one of the few rich families left after the Grand Shadow Being took control of their home planet.(note the eye tree from Fribbulus Xax and the centipede from SR-383) The Vegillis gained wealth by mining rare metals in asteroids. Vegillis was the first to accept the Grand Shadow Being to the Talrigmite home world. Tae and Tie's father, George, was the first to have dealings with the Grand Shadow Being. (Before his true intentions were known.) <br /><br />[img]http://img64.imageshack.us/img64/1254/gandshadowbeing3aq.png[/img]<br />Nothing much is known about this mysterious figure. The only thing that the Talrigmites know about him is that he/it saved their planet from resource exhaustion. When the Talrigmites started to become space faring to the degree of light speed, they realized that their population was becoming so great that the planet didn't have enough resources to support their ecosystems. The Grand Shadow Being stepped in, giving the Talrigmites advanced technology to keep their planet from dying. Unfortunately this made the Talrigmites dependent on the Grand Shadow Being who know controls the Talrigmite home world. If they were to revolt againt the GSB he would remove his technology, letting the planet slowly die.<br /><br />[img]http://img64.imageshack.us/img64/7976/spot0kb.png[/img]<br />Spot. The lovable, play full companion of Commander Keen. Native to mars Commander Keen took Spot home with him after his fiasco on mars with the Vorticons. Still trying to learn English. Spot is happy to be part of the Blazes family.<br /><br />[img]http://img64.imageshack.us/img64/5498/spike8wb.png[/img]<br />Spike. The Talrigmite bounty hunter who does almost anything for the right price. Spike was granted freedom by Grand Shadow Being if he would agree to do certain tasks. The only Talrigmite that talks to the Grand Shadow Being in person. Pilots a heavily modified USP Talon personal space craft. A favorite of bounty hunters because of it's experimental phase shift technology.<br /><br />These are the main characters that I decided to reveal right now.<br /><br />Oh I won't add this character without Xky's permission. He was just Sooooooo cool in LevelLord00's Fanfic that I wanted to add him in the comic.<br /><br />[img]http://img64.imageshack.us/img64/4886/xky2uz.png[/img]<br />Xky. Mortimer's right hand man. Takes orders from no one save Mort. Is fluent in omnispeak and loads of other languages. Knows what to do in every situation that arises. Keeps his cool when others would of cracked. Is staying on earth keeping a watch on Mort's earthbound possessions in his absence. Remains loyal to Mort for unknown reasons. Some rumors exist that he is being controlled by a mind control belt. Some say that he was raised by dogs. These rumors cannot be confirmed nor denied. All major governments have knowledge of Xky although all deny his existence. Few have met this mysterious man, and even fewer lived.<br /><br />He shaved his beard since the incident with the mercury mines.<br /><br />Well hope you like this preview. Later!<br /><br />-GR<br /><br />HEY 100 POSTS! WOOO HOOO! I think I earned this one time to spam emotikeens [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img]   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img]   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortvort.gif[/img]   [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pogo.gif[/img]    <br />It only took... 10 months. I think I might be posting too much.-----------------------<br />\"The Adventures of Commander Keen\" issue #1: [img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br />\"Fat people buy lots\""
	},
	{
		"id": 13261,
		"title": "Re: Commander Keen comic update (again)",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-04T07:14:18.000Z",
		"content": "Hah! Love the pic of Xky! He's exactly as I've always pictured him [Although the art looks smarter] If only it were in colour.<br /><br />Hmmmmm...A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13262,
		"title": "Re: Commander Keen comic update (again)",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-04T08:03:20.000Z",
		"content": "Haha, can't wait this! Awesome characters! Tie is fun.<br /><br />And yeah, having Xky in the fiction would be definitely fun, great picture. Not exactly how I've imagined him, but makes sense. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13263,
		"title": "Awsome!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-04T22:34:53.000Z",
		"content": "Now that's talent!!!<br /><br />I like Xky; he looks pretty cool. I imagned him to be a bit nicer looking (morally in-tune), he was soo nice to the Vortican.<br /><br />This should be cool.<br /><br />*Sits back, and waits very eagerly*<br /><br />-- NAJAWA --"
	},
	{
		"id": 13264,
		"title": "Re: Awsome!!!",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2005-10-07T02:35:19.000Z",
		"content": "[img]http://img64.imageshack.us/img64/6970/mortandic21xl.png[/img]<br /><br />All hail Zim! And GIR!  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Nice.----------<br />The Chasm of Strife (deceased): www.ThisStrife.com/Sluggy/chasm.htm"
	},
	{
		"id": 13265,
		"title": "Re: Awsome!!!",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-10-07T03:55:44.000Z",
		"content": "Woah... Now that you mention it...   Hahaha!<br /><br />[quote]<b><i>Quote:</i></b>[hr]If only it were in colour.[hr][/quote]<br />Don't worry. The entire comic will be colored in a fashion similar to my avatar. Actually... I should color these pictures.-----------------------<br />\"The Adventures of Commander Keen\" issue #1: [img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br />\"Fat people buy lots\""
	},
	{
		"id": 13266,
		"title": "Re: Awsome!!!",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2005-10-07T05:07:50.000Z",
		"content": "Niiiice. I can't wait. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />Say... would you like to have your comic series published at www.StrifeStrips.com as well? The plan is to expand and nurture other webcomics as well as our own. You'd get free hosting, no adverts, and you'd still have all the rights to your comic. I think there's also an \"automatic-publishing\" thingy on the site, too. Get in early! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 13267,
		"title": "gah",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2005-10-07T06:37:17.000Z",
		"content": "Hehe... eek.  Go ahead and use the character, but I'm personally not fond of trenchcoats at all--I think that doodle of me looks like a reject from The Matrix.  Maybe one of these days I'll get an actual picture of myself posted.  :-P"
	},
	{
		"id": 13268,
		"title": "Re: COLOR! EEEEE!",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-10-08T03:15:03.000Z",
		"content": "Ok to show off what the coloring will look like, and because a forumer, who shall remain nameless, hinted at colored pictures, I have colored in the above picture of Commander Keen. The first picture is the line art. The second picture just a 50% reduction of the working copy. The third pic is about the size it will be when I panel the comic.<br /><br />[img]http://img64.imageshack.us/img64/9576/keencopy0au.png[/img]<br /><br />[img]http://img156.imageshack.us/img156/3389/keencolorcopyrgb4vj.jpg[/img]<br /><br />[img]http://img156.imageshack.us/img156/9319/keencolorcopysmallrgb5oz.jpg[/img]<br /><br />(Note, this is done pretty quickly, in about 30 minutes. Please excuse the mistakes. Like the shadow I forgot on the top part of the pogo stick shaft.)<br /><br />And before Najawa EXPLODES in my face, YES his shirt is more on the RED side. Although I made it maroon to make people more happy. Hear me out. I believe that the only reason that Commander Keen's shirt was pink was, as Tom Hall stated himself, pink was the only color left over in EGA. I think that the original intention was for him to have a red/non pink shirt. But the thing is, I am doing this for the Commander Keen community more than I am doing it for myself. So if you have a concern about how I draw/color/shade something NOW is the time to yell. Oh and all comments that are just:<br />[quote]<b><i>Quote:</i></b>[hr]\"OMG WTF?!?! ReD? XDXD Joo SuxoRz! O.o Doood!!!11!1!ONE1ONE!!\"[hr][/quote]<br />will be ignored.<br /><br />I think I might open a series of polls on matters like this.<br /><br />Later<br />-GR-----------------------<br />\"The Adventures of Commander Keen\" issue #1: [img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br />\"Fat people buy lots\""
	},
	{
		"id": 13269,
		"title": "red???",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-08T04:36:09.000Z",
		"content": "Hey... I just opened up the pictures... and broke through 7 floors, and broke the tile in the basement!!! My mouth just dropped like lead!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br /><br />I didn't notice the red shirt, until I read the actual post.<br /><br />I think it looked pretty good in that one. This is an instant where I'd leace the shirt be; The hallways were darker, and thus the pinkish-red looked red. I don't mind red, as long as it hints pink. You, on the other hand, and a sort of street style to your writting; keen looks like a teen-age kid, and not a 8 year older. Red gives him a more rebelious air, and fits perfectly with your style of writting. And your remembered the 'G', and so I'm happy. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />I actually think pink would ruin the effect of the drawing; it really depends on the style of art. I just did a painting of keen, and he has a red shirt, with hints of white swirls. It looks okay, and I'll post it if you really want me too.<br /><br />-[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] - NAJAWA -[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] -"
	},
	{
		"id": 13270,
		"title": "Re: red???",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-08T08:17:35.000Z",
		"content": "The coloured versions look extremely good!<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img]  Red shirt?! Well, it looks good too..[url=http://www.keengrid.net/]keengrid.net[/url]"
	},
	{
		"id": 13271,
		"title": "Hmm...",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-10-08T08:47:25.000Z",
		"content": "Interesting style. You've certainly got some talent there. Some things thing that bug me, however:<br />1. His head seems too round--I think it needs to be elongated vertically some. Somehow you've also made his jaw look too square.<br />2. The shadows are, IMKO, a bit too dark compared with their lighter counterparts.<br />3. The nose makes him look too old. I'd have made it curvier from the top and not follow through as far at the bottom. Something like this: [img]http://img.photobucket.com/albums/v192/Jimage/keenlike/illustration/keennose.png[/img] Less pointed, though.<br />4. A pot belly!?Cave assectatorem Ductoris Alacris <br /><br />The development of the hardware, and the greater ability to express every idea that flies into a programmers head, mean that game creators have made the new games congested with every technique in their power. The basic games behind all this are so blurred that people cant catch up. We should go back to basics  like Pac-Man  and play in an easier, more relaxed way. -Toru Iwatani<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 13272,
		"title": "Re: Hmm...",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-08T11:30:05.000Z",
		"content": "W00t! T3h 1337 Artwerk.<br /><br />[quote]<b><i>Quote:</i></b>[hr]because a forumer, who shall remain nameless, hinted at colored pictures[hr][/quote]<br /><br />I'm sure all they were thinking about was putting a few of those pictures through Quickfix as per this example:  [img]http://img.photobucket.com/albums/v410/Gannalev/xky2uzd.jpg[/img]A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 13273,
		"title": "Re: Hmm...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2005-10-08T14:33:09.000Z",
		"content": "Najawa:<br />Thanks for the nice comments.<br />[quote]<b><i>Quote:</i></b>[hr]keen looks like a teen-age kid, and not a 8 year older.[hr][/quote]<br />That bothered me a little too. Although I decided to make him look a bit more like an older person BUT have the world around him big, as if seen through his eyes. An example of this can be seen below. Also, at the end of Commander Keen 3, Commander Keen looks a lot older than 8.<br /><br />Spleen:<br /><br />1.) This raises a problem as I am about 50-55% done with the line art right now. If I were to change the shape of his head, I would have to go back and re draw a lot of it, lengthening the delay. By a lot. I don't think I will change it unless some people second that opinion.<br /><br />2.) Thanks for the input, I'll tone down the contrast for most of the comic.<br /><br />3.) I didn't notice that. Thanks. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Easily fixable.<br /><br />4.) The reason he looks potbelly is because of the stance he is in. Most of the time he doesn't have a belly like that. As shown in the picture I link to in my sig. <br /><br />[img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br /><br />LevelLord:<br /><br />Ah yes, I'm sure that's what they meant... That's exactly how he should be colored too... Although I would of made the hat grey and steer clear of the Communist-esque red color. Although that works too. XD<br /><br />Thanks everyone for your input. Remember this is as much your comic as it is mine.-----------------------<br />\"The Adventures of Commander Keen\" issue #1: [img]http://img170.imageshack.us/img170/5541/newteaserdarker1xh.png[/img]<br />\"Fat people buy lots\""
	},
	{
		"id": 13274,
		"title": "Keep It!!!",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-08T17:39:30.000Z",
		"content": "It looks really cool teenish!!! I mean; we're so used to the little innocent keens; why not make one which looks like he killed someone before. IMKO, His head and nose just add to the picture, and the extreame shadows add a really neat contrast.<br /><br />LL: Woa!!! Nice color in!!! Man, I should give you some of my old coloring books to work with [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] <br /><br />Keep it up!!!<br /><br />Can't Wait!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br /><br />-- NAJAWA --"
	},
	{
		"id": 13275,
		"title": "Re: Keep It!!!",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-09T08:31:36.000Z",
		"content": "Yeah, nice colours LL! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] [url=http://www.keengrid.net/]keengrid.net[/url]"
	}
]
