[
	{
		"id": 755,
		"title": "Typing Tutor Programs",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-03-16T05:05:36.000Z",
		"content": "I'm on a mission to find a good typing tutor that I can recommend to people. Google presents me with a desolate scene, so naturally the PCKF is my next bet.<br /><br />There was one I used ten years ago at secondary school, simply called 'Type', IIRK. It was a nice little text-based DOS utility, and served me very well. Has anyone come across this one?<br /><br />Any other recommendations would be great."
	},
	{
		"id": 19736,
		"title": "Re: Typing Tutor Programs",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-16T05:25:51.000Z",
		"content": "Typing Tutor '89; with letter invaders!<br /><br />It taught me all I know about tpying and made my WPM scores so arsh beter!<br /><br />(I don't know if you can still get it, but I have the file on a floppy disk somewhere.)<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19737,
		"title": "Re: Typing Tutor Programs",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-16T08:31:52.000Z",
		"content": "Gah!  You'd better not use Typing Tutor '89 then Spleen, otherwise you might start \"tpying\" as badly as Levelass [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 19738,
		"title": "Re: Typing Tutor Programs",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2007-03-16T23:01:44.000Z",
		"content": "You can get Typing of the Dead from Home of the Underdogs. I hear good things about it, but I never got around to playing it. I've just found typing to work fine.________________<br />[img]http://img80.imageshack.us/img80/8498/missouriansf9.png[/img]"
	},
	{
		"id": 19739,
		"title": "hmmm...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-03-16T23:37:05.000Z",
		"content": "Well, I took the typing course in high school in 9th grade.  As I recall, they start you off doing nothing but \"Home Row,\" which is the resting position for your hands... ASDF JKL;<br />We had a sheet with rows of 'words' to type--some real, some not.  Stuff like FJFJFJFJF DAD K:K DAD K:K SFS JLJ and so on.  Just practice for your coordination.<br />From there, we introduced fingers' upper and lower neighbors one at a time.  E and I, C and N, and so on.  I think the last letters we learned were the \"reach for the middle\" guys like T, Y, B, and N.  <br />Really, I'd say if you were determined to learn to type, look for a booklet/packet that sets a progression up for you, and work through it one page per day.<br />The alternative would be to find a chart that shows you which fingers to use for which keys, and take the time to drill yourself with it--even if your typing is mind-bogglingly slow, force yourself to adhere to the keys.  It'll pay off in a week when you're able to type 30-40 wpm... and later, when you're blazing away at over 70.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/><br /><br />My crowning achievement in the typing class was doing 72wpm, using the backspace key over 100 times in the 60 second test.  BAM."
	},
	{
		"id": 19740,
		"title": "Re: hmmm...",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-03-17T01:42:13.000Z",
		"content": "That sounds pretty similar to the way they taught us in high school too.  My crowning achievement was 127wpm, thanks to the predictable nature of the words and the fact that you could start typing about two seconds before the screen was drawn - by the time the program was ready to start accepting input you could already be about five characters from the end of the line [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img] <br /><br />Although I already knew how to type then (although not \"properly\") I did notice a real improvement in my made up typing style after doing those progressions, so it really does help!"
	},
	{
		"id": 19741,
		"title": "Re: hmmm...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-03-17T03:38:55.000Z",
		"content": "They never taught us typing in school.<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 19742,
		"title": "Re: hmmm...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-03-17T13:53:25.000Z",
		"content": "I actually learned nothing from those types of programs and games. I learned how to type just from practice. (Starting out slow, looking at the keys as I type, until I got used to the layout.)-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	}
]
