[
	{
		"id": 344,
		"title": "Custody",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-29T11:29:47.000Z",
		"content": "Inspired by recent discussion.<br /><br /><br />Custody<br /><br /><br />The media had been buzzing about the case for days, and a cameraman from the local TV network had had to be forcibly removed when it was discovered he'd snuck a camera into the public gallery. Judge Dawkins tapped his spectacles and shuffled the case notes in front of him. This would be a definitive case, nobody had sued for custody of a virtual character before.<br /><br />Judge Dawkins banged his gravel, more for effect than anything, and hushed the courtroom as the plantif and prosecution filed in. The prosecution looked harmless enough, a rather tired but stern looking man surrounded by a small group of supporters. He looked very nervous, and no wonder.<br /><br />The defence were the most sullen and pasty faced group of individuals the judge had ever seen; they all wore identical grey suits, with a smart company logo emblazoned on the pockets. Along with them came a legal team of a dozen pinstriped lawyers, and, for some strange reason, a youth in a natty black suit and a football helmet. He was smiling in a smug way that sent a shiver of terror down the  judges spine for some reason.<br /><br />As soon as everyone had been seated the case was read; it seemed straigtforward enough, if a little shocking; the prosecution was seeking custody of the computer game character William Blaze III, also known as Commander Keen, under the pretence that the defence, the design, development and attack team of ID software, now 3D Realms, had been abusive.<br /><br />The first witness was the prosecution himself, a Mr Hall. The man in question was his own representitive and so would be presenting his case first.<br /><br />\"Your honour,\" he began, \"I never though I'd see the day when it came to this; when Keen was concieved, it... it's almost another time to me. We were young and carefree back then; Romero still had most of his hair, we were still part of SOftdisk, and good games fit on a single floppy. Those were happy days, Keen was our finest moment, with him we soared to the apogee of the gaming world.\" He paused for a moment, lost in recollection, then his face darkened with the pain of recolection.<br /><br />\"Then they went and stabbed him in the back; it was all 3D this and render that, and Keen was dumped faster than a republican vote. All I ask is to be given custody of my creation so that together we can finnish what we always had planned. That your honour, is my case.\"<br /><br />There was a pause as cross examination was prepared. To judge Dawkins' surprise, the cross examiner was the oddly dressed youth rather than one of the lawyers. For some reason the witness flinched whenever the boy looked at him. He cracked his knuckles, one by one and began a scathing attack.<br /><br />\"Mr Hall, tell me, have you stopped sexually abusing children yet.\"<br /><br />\"What? No, I-I never-\"<br /><br />\"So the abuse is ongoing then?\"<br /><br />\"But I never said I-\"<br /><br />\"Indeed, you haven't sought help, or even admitted your guilt have you Mr Hall? Is it not true or not that you do indeed not wish to use the character in question to produce a series of grapic pornography that may or may not be entitled 'Keen XXX -Let's play\"? Is that not true?\"<br /><br />\"What? I... I don't understand, what on earth-\"<br /><br />\"Then perhaps you could give us a few details about the explicit photographs of you and the character I believe is known as 'Princess Lindsey? That <i>is </i>statutory rape is it not?\"<br /><br />\"That's not true! What are you talking about?\"<br /><br />\"AHA! So you see ladies and gentlemen, the witness is both elusive and unwilling to comment on his perverted and disgusting activities. Can we really allow this, and I hesitate to use the word for such a demented case, man to gain custody over an innocent and impressionable character? I rest my case!\"<br /><br />There were boos and hisses from the jury, and someone had bought in a barrel of hot tar and some feather matresses. Judge Dawkins called for order, and after handing out three dozen happy meals finally managed to restore order, it was time to call witnesses.<br /><br />To be continued...<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10204,
		"title": "Re: Custody",
		"author_id": 1486199,
		"author_name": "Zero Diamond",
		"timestamp": "2007-04-29T22:15:10.000Z",
		"content": "Good stuff, except 3D Realms is the new name of Apogee, not iD Software.  The latter is still known by the same name."
	},
	{
		"id": 10205,
		"title": "Re: Custody",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-04-29T22:24:09.000Z",
		"content": "Ha ha, this is great! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 10206,
		"title": "Re: Custody",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-04-30T09:21:55.000Z",
		"content": "Haha. It'll be interesting to see how this continues. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 10207,
		"title": "Re: Custody",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-04-30T13:57:34.000Z",
		"content": "ZD! Hush! Don't spoil my surprise!<br /><br />Part 2:<br /><br />Mr Hall stepped down, looking confused and shaken, several thrown eggs barely missed him. Cautiously making his way to his chair he opened his briefcase and removed a large bottle of what looked suspiciously like spirits, and took something to large to be a sip but to small to be a gulp. He shuffled his notes despondently before calling his first witness. \"Your honour, I'd like to bring to the stand B.J. Blazkowicz.\"<br /><br />There was an expectant hush as the witness appraoched; the man was certainly past his prime, clad in a nightgown, bedroom slippers and a walker. It took a full five miniutes, and two custodians to maneuver the old man into the witness box, hampered by the fact that he seemed to think he was in Guantanamo bay. Mr Hall approached the witness who was glaring defiantl back at him, or at least, three feet to the left of him, evidence that his perscription needed strengthening.<br /><br />\"You are B.J. Blazkowicz, correct?\"<br /><br />\"Yessir! I need only give you my anme and number sir!\"<br /><br />\"Indeed Mr Blazkowicz, but this is in the interests of your grandson, a certain William Blazkowicz III; that is his name, is it not?\"<br /><br />\"Damn right he is! Ungrateful little sod too! The whole bunch of them! Never visit me! Where's my prune juice?\"<br /><br />\"In a moment sir, could you identify <i>this</i> screenshot for me?\"<br /><br />\"What are you? Kibbutz? Of course, that's from one of my games, the one with all the pixels and the memory and the stuff kids like.\"<br /><br />\"So it is in fact part of the story from <i>Wolfenstein 3D</i>?\"<br /><br />\"Sounds about right.\"<br /><br />\"This was officialized by ID, was it not?\"<br /><br />The senior nooded. At this Mr Hall  flourished the printout towards the jury. \"Yet, while this references your son, and his wife, it mentions William Blaze, also known as B. Blaze, as an <i>only</i> child.\" There was a pause as the court considered this, wondering what it could mean, before Mr Hall continued, his voice starting quiet and graduly rising to a crecendo. \"Or at least, he's the only p<i>rofitable</i> child! And thus the only one worth considering!\" There was a gasp from the assembled, pandemonium on the streets and two journalists fainted.<br /><br />\"Mr Blazkowicz, now that you're retired, and are no longer making any money for Id, please enlighten the court as to how you've been rewarded for your years of unending service producing the Wolfenstein series, during which it is recorded that you were shot twice, placed on a starvation diet, forced repeatedly to relive the horrors of the war and.. learnt German.\"<br /><br />The shock of this last revelation was too great for the hardened policeman guarding the door, he turned pale, fled, and was violently sick outside. Several jurors looked around in horror, lest a lingering tense should sneak up upon them as they are wont to do. For a moment, the old man's face was contorted with pain, but then this was overcome with anger, or at least, sheer peeved-offedness.<br /><br />\"I got dumped into the 'Happy Pixels' retirement village! You'd think my son, my own son, would do something about it, but no! And I keep telling those nurses I can bathe myself dammit!\"<br /><br />\"Thankyou Mr Blazkowicz. Your honour, no further questions.\"<br /><br />The tide had turned in a few short miniutes, now the press were definitely set against the defendants. The strange kid was up again. As he passed Mr Hall there was a crackling noise and the smell of ozone. Mr Hall fell flat on his face and remained tthat way for the rest of the thanfully short cross examination.<br /><br />\"Mr Blazkowicz, is it not untrue that you've been officially diagnosed with senile dementia, and thus, that if so, your testimony is null and void?\"<br /><br />\"Wha?\"<br /><br />\"A very illustrative answer. Tell me, what is e to the power of pi minus pi?\"<br /><br />\"19.99909998 to ten significant figures.\"<br /><br />\"That- I- um... correct.\" The cross examiner floundered, seeming to have lost his footing, stuttering even as the jury considered the new evidence. Was it coincidence? Divine providence? Or just a relic of the arbiarty integer based decimal system used by most societies? The defence were looking decidedly shaky now, things weren't going well, but nevertheless they managed to rally themselves and called their first witness. (This of course broke all legal precedent, but that was what this trial was for, wasn't it?)<br /><br />\"Your honor, we'd like to call Jill\"<br /><br /><br />To be continued...<br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Cute bunny!"
	},
	{
		"id": 10208,
		"title": "Re: Custody",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-03T18:01:04.000Z",
		"content": "The same Jill of Epic Megagames' game? Why's she supposed to be in a Keen-related fanfic?------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 10209,
		"title": "Re: Custody",
		"author_id": 1486023,
		"author_name": "Too Much Spare Time",
		"timestamp": "2007-05-06T11:34:56.000Z",
		"content": "Foob me, this is hilarious. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rollhead.gif[/img] ----------<br />www.StrifeStrips.com! Woot! We're back, baby!"
	},
	{
		"id": 10210,
		"title": "Re: Custody",
		"author_id": 1486631,
		"author_name": "Niborius",
		"timestamp": "2007-05-06T16:25:36.000Z",
		"content": "a girlfriend of me is named 'jill'[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  but that will not interest others i think[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shucks.gif[/img]"
	},
	{
		"id": 10211,
		"title": "Re: Custody",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-07T13:25:36.000Z",
		"content": "Part 3:<br /><br />The judge scowled. \"Mr Hall, can you give us the witness' full name?\"<br /><br />\"No your honour, it's indeterminate at the moment.\"<br /><br />\"This is rather odd, but what the hell this sounds interesting. Proceed.\"<br /><br />This next witness was definitely an improvement on the last; nearly the entir courtroom's attention was drawn to the demure young lady as she strode towards the stand clad in a red vinyl top-to-toe outfit. She gave the room a smile that sent shivers up the judge's spine, sat down and began talking, not even waiting for questioning. Strangely, nobody stopped her.<br /><br />\"Right, well your honour, I guess I'm up here because of the whole 'slide rule' thing; honestly, it was just s little snide comment in one of my games, totally innocent! Me and the Id team were all cool about it, there were cross references everywhere in those days y'know? Like sparring between friends? I was all fun and games back then. But now? Geez! I tell you, I'm sitting at home, minding my own business, polishing a few daggers, when some nut in a suit barges in and tells me I'm being sued! Well, at first I thought it was that Croft B-; you know, the one who'd fall over if you prodded her in the back? I know she has it in for me, just because I was first and I didn't have to sell myself like a two dollar whore to make game of the year. I-\"<br /><br />There was a short bout of coughing from Mr Hall.<br /><br />\"Oh. Right. Anyway, no it wasn't her, she knew I'd be able to so kick her tush, but its some bigwig from Id right? And they tell me because of some quip like, seven  years earlier I'm to go to court! How stupid is that? Fortunately the judge was a <i>very</i> understanding man and threw the case out, but I mean, what the hell? If you ask me,Id's gone totally nuts, it's no wonder Hall left, he was the only one with any sense in the first place!\"<br /><br />With that statement, she sat back in a satisfied manner. It was quite evident that Mr Hall had nothing to add for his part, so once again the strange kid was up. And once again his questioning was short, sharp and devesating.<br /><br />\"So, Mrs... Jill correct? Your name is somewhat in limbo, may I ask why?\"<br /><br />\"Well, there's the divorce proceedings, and I want my maiden name back, but it's not all set in stone yet.\"<br /><br />\"Ah. Divorce. You left your husband of nearly a decade I see, would you mind telling us why?\"<br /><br />\"I hated all the paparazi, being married to a prince leaves a girl with no privacy, and marrying someone just because you rescued them from mortal danger? Baa-aad idea! But I found someone else and we-\"<br /><br />\"Ah! Someone else! What is the name of this undoubtedly lucky young man?\"<br /><br />\"Oh; that's Nibby, we met online.\"<br /><br />\"By that I believe you refer to to the individual know by all as 'Niborius'? How interesting, it says here he recently joined the PCKF, do you know what that is Mrs Jill?\"<br /><br />\"Well, its some chat room...\"<br /><br />\"A <i>Commander Keen</i> support group! On with links to anti-Id websites, and one that has made grevious threats against Id software and it's supporters! But that's not the real problem is it Jill? This trifling error of witness impartiality isn't the biggest problem is it? The big issue here is age. Specifically the age of your new friend. How old <i>is</i> he Mrs Jill?\"<br /><br />\"I...I don't know, I never asked.\"<br /><br />\"Oh, I think you did,  think you're just a little unwilling to reveal that he is in fact, under 16. Quite a <i>bit</i> under 16 as a matter of fact. Young enough to be your <b>son</b> I'd say! This is beginning to sound like Mr Hall all over again! And you also support this, this, <i>sick</i> old man? I'm beginning to see a pattern here, no further questions your honour!\"<br /><br />Again pandemonium, more rotten fruit was thrown. The witness fled the scene red faced and downcast to a chorus of jeers. (Unseen by the majority of the court, a plain white car emblazoned with a dutch flag, freshly nabbed from the embassy down the street, drove up, opeed a door and whisked her away.)<br /><br />Through all of this the creepy kid remained calm.<br /><br />\"Your honour, we'd like to call our first and last witness now if we may? This is becomming a farce.\"<br /><br />To be continued...[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 10212,
		"title": "Re: Custody",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-05-07T13:52:50.000Z",
		"content": "I see you've continued the LevelLordian tradition of randomly including new forum members in your fanfic. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Good stuff, keep it coming."
	}
]
