[
	{
		"id": 892,
		"title": "The word 'blaringly' isn't even a real word.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-02-20T20:56:15.000Z",
		"content": "Discuss.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 22052,
		"title": "Re: The word 'blaringly' isn't even a real word.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-02-20T22:00:35.000Z",
		"content": "OK LETS DISCUSS!<br />Hey people Blaringly isn't a real word!<br /><br />People: Oh that's cool.<br /><br />I guess that is all there is to it then... Yea I'ma go now... *leaves.*<br /><br />Some guy: What a dick.-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://img360.imageshack.us/img360/548/blegdandsmeegnewbanner2wf.png[/img][/url]"
	},
	{
		"id": 22053,
		"title": "Re: The word 'blaringly' isn't even a real word.",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-02-20T23:13:09.000Z",
		"content": "Also, I just today realized why the word 'misunderestimated' isn't a word either, because I hadn't thought about it previously. The word 'unproportional' isn't a word either, but I already knew that before today.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 22054,
		"title": "Re: The word 'blaringly' isn't even a real word.",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-21T00:51:59.000Z",
		"content": "\"misunderestimated\"? \"blaringly\"?<br /><br />Do we live in third world nations?  Misunderestimated? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 22055,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-02-21T00:58:52.000Z",
		"content": "\"Blaringly\" probably comes from blending \"glaringly\" and \"blare.\"  When a trumpet plays a loud, blasting note, we say that the trumpet is blaring.  When a mistake is as easy to notice as the nose on one's face, we say that it is glaringly obvious.  By mixing the two, we have a blaringly obvious problem.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  Discuss'd and dismiss'd.  Or disgust and dismist, either way.<br /><br />As for \"misunderestimated,\" I believe that was a snippet from George W. Bush, wasn't it?  It makes sense, in a way, if you think about it.  I underestimated my opponent, which was a mistake, and so you could say I misunderestimated.  It could mean I either underestimated him by a mistakenly large or small amount, or it could simply mean I underestimated him, period.  It's a silly error, either way.<br /><br />The one which has always bothered me was the \"your / you're\" mistake, which continues to be made.  It was even made in Nintendo's Animal Crossing: Wild World, where a character says \"I bet your doing well.\"  Garg.  It's YOU'RE.  I bet YOU ARE doing well.  <br /><br />Edit: \"Unproportional\" is a mistaken form of \"disproportional.\"  Seems the schools aren't doing their job in teaching students the correct way to oppose an adjective.  Or something.  *laughs*  I strongly suspect that, as time goes on and our language continues to evolve, \"disproportional\" will disappear, and \"unproportional\" will become common use. <br /><br />Heck, Webster recently added \"Ginormous,\" a word which combines \"gigantic\" and \"enourmous\" into a single, silly adjective.[img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 22056,
		"title": "FUCL n00b ZOMG D000D! >.> <.< Looky ma, 0 wurds!",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2006-02-21T01:02:18.000Z",
		"content": "We must ask ourselves, though, what's in a word?<br /><br />Really... they're just weird sounds we emit (or swirly lines we draw/press/whatever). Blaringly is composed of letters, and can be pronounced... so I figure that makes it a word. Maybe not an English word, but certainly some kind of Jibberish.<br /><br />It's not like most of us adhere to what our dictionary tells us is language anyway. We use all sorts of nonsense words, especially myself. And the funny thing is, since the vast majority of communication is non-verbal, you can have a conversation using only Jibberish words that have no meaning to either participant and still be talking about something interesting.<br /><br />Though that doesn't work quite as well in pure text situations such as this. If I sat here and told you elabord nei heieagrous niu deg geh pleusneri deldfut heeas, you'd give me--well, the chunk of letters that represents me--a weird look. Maybe you'd reply with o.O or :/ but you'd be hard pressed to express your full reaction.<br /><br />I don't entirely remember my point any more, but I'm sure it's there somewhere. Unfortunately you'll never understand everything I just communicated, because you only received the ~10% portion that was communicated via speech/text (interesting how text seems to be perceived as if spoken).<br /><br />Then again... I didn't express alot of body language in typing this, so maybe you're not missing that much. Perhaps a few facial expressions, but I've basically been sitting here staring blankly. *shrugs*<br /><br /><b>EDIT</b><br />[hr]<b>Xky</b> The one which has always bothered me was the \"your / you're\" mistake, which continues to be made.<br />[hr]YES! I can't believe how frequently that happens! It annoys me just as much. As well as there/their/they're. People just don't seem to think beyond the syllables--'they' + 'are' somehow = 'there\".<br /><br />Its and it's is another, but I'm still not convinced the official spelling is correct either so it can be forgiven. When you think about it, it + possessive should be it's, shouldn't it? There must be more to it.<br /><br />But still, 'it is' somehow being truncated without an apostrophe is something to complain about.<b></b> Cave assectatorem Ductoris Alacris <b></b><br /><br />A concerned member of the Preservation of Endangered Spleens Society<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	}
]
