[
	{
		"id": 999,
		"title": "Time Travel and Teleportation proven possible?",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-10-25T07:25:34.000Z",
		"content": "Whats your honest opinion on what happened in July 1943?<br /><br /><br /><b>_________________________________________</b><br /><br /><center><b>THE PHILADELPHIA PROJECT</b><br /><i><b>PROJECT RAINBOW AND THE USS ELDRIDGE</b></i></center><br /><br /><br />In July 1943, the destroyer U.S.S. Eldridge pulled into the Delaware Bay area for a United States Naval experiment that involved the task of making the ship invisible. The project's official name is Project Rainbow, but was nicknamed and more commonly known as the Philadelphia Experiment.<br /><br />Much has been written and speculated about the legendary experiment into invisibilty, but sorting fact from fiction is a near impossible task, especially with the recent influx of misinformation and deliberate disinformation that has been spread by those connected to the U.S. Intelligence community and professional skeptics.<br /><br />There is much controversy over what exactly happened, but one thing is for sure. For some reason, soon after the test was completed, a massive blanket of secrecy and denial was placed over what happened in Delaware Bay. It is thought that a huge scientific breakthrough was made, and <b>the ship was accurately transported over space and time, disappearing in Philadelphia, Pennsylvania and reappearing in Norfolk, Virginia.</b> Whatever did happen is still not known, but different theories are discussed below:<br /><br /><center><i><b>The \"Official\" Navy Record</b></i></center><br /><br /><br />The Navy admits that the U.S.S. Eldridge took part in an experiment that involved wrapping wire around the hull of the destroyer in an attempt to cancel out the magnetic fields of the metal on the ship. This is known as degaussing. This would render the ship \"invisible\" to underwater magnetic mines that rely on proximity sensors to trigger the detonation. These sensors operate by detecting magnetic fields around ships. Without the magnetic field, the ship would be able to pass through regions mined with these sensors, invisible to enemy mines, but not to radar or vision.<br /><br />The Navy's report is very plausible, and doesn't mention any exotic results or circumstances. But could this just be a believable account to drop the interest by the general public, leaving only the true minority of investigators in doubt?<br /><br /><center><i><b>Physical Invisibility</b></i></center><br /><br /><br />Some scientists have developed the theory that the Navy was working on a way to make the ship invisible to vision. However, it didn't involve warping space time or any complex task of a similar nature. This theory suggests that the Eldridge was equipped with high frequency generators that would heat up the surrounding air to cause a mirage, making the vessel invisible.<br /><br />This phenomenon is naturally occurring, and there have been cases where entire islands have disappeared from view in the right weather conditions. The high frequency generator would heat up the surrounding air and the water (creating a green-colored fog that was said to have engulfed the ship), causing a mirage to form, concealing the ship from view.<br /><br />The generator would also account for the sickness (physical and mental) of the crew after the experiment. A high freqency generator can cause serious harm to a person's wellbeing, especially at close range. This is more plausible than the degaussing theory, and would also explain the crew's sick condition as a result of the test.<br /><br />The main problem with these theories though, is that it doesn't explain how the U.S.S. Eldridge was seen in Norfolk, Virginia by the civilian crew of the SS Andrew Furuseth, when the ship disappeared from view in Philadelphia in a space of only about fifteen minutes. <b>There are also details such as crewmen being fused to the hull of the ship and some not even reappearing.</b><br /><center><br /><i><b>Transported across space and time?</b></i></center><br /><br /><br />The most interesting theory about the Philadelphia Experiment is that the destroyer did in fact disappear and was teleported across space and time. <b>Supposedly, there was a great number of ingenious scientists (including Tesla and Einstein) that were taking part in the experiment</b>. However, Nikola Tesla was supposed to dead at the time of the Naval experiment.<br /><br />The theory is that light has to be bent around the ship to make it invisible. To accomplish this, the Navy wrapped the ship's circumference in wire and passed a measured current through it. This caused a huge oscillating magnet to form a magnetic field around the ship, <b>not only bending the light, but space and time as well</b>. The physics of the experiment are reminiscent of Einstein's Unified Field Theory that once you bend light, you are also unwittingly bending space and time as well.<br /><br />The first time this experiment was undertaken, the ship didn't completely disappear, and an imprint of the hull could be seen sitting in the water. <b>The second time, the ship totally disappeared in a green fog</b> and was sighted in Norfolk, Virginia.<br /><br />A haunting fact is that <b>when the ship reappeared, the crew were all in a state of disorientation</b>. <b>Some were mentally ill</b>, while <b>other crewmen didn't even return</b>. <b>There were also crewmen that returned embedded in the hull</b>. Later accounts arose about the crewmen, including a former crew member who was involved in a bar fight, and <b>all the participants froze in time</b>, as reported by a local newspaper! There were also accounts of <b>people who were on the ship, spontaneously combusting.</b><br /><br /><center><i><b>The mystery remains</b></i></center><br /><br /><br />It is still not known what happened that day in 1943, mainly due to the lack of witnesses coming forth who served aboard the Eldridge. There is also no documentation available to the public which details Project Rainbow. It may have simply been a degaussing experiment. But how did <b>the destroyer appear seconds later in Virginia?</b> Its possible the answer will never be known, but the mystery may be solved when scientists rediscover what happened in Delaware Bay. <br /><br />Source: www.AboveTopSecret.com<br /><br />[img]http://mirror1.spikedhumor.com/5310/PhiladelphiaProjectEldridge.jpg[/img]<br /><br /><br /><b>_________________________________________</b>---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 23740,
		"title": "Re: Time Travel and Teleportation proven possible?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-25T10:27:17.000Z",
		"content": "Ha, that's an experiment I've always wanted to try myself one day (albeit on a slightly smaller scale.)<br /><br />Personally I doubt the ship was transported through time OR space, as it would presumably take quite complex calculations to get the ship to reappear at ground level somewhere else on the surface of the planet - it would seem much more likely that it would've appeared inside the Earth or out in space somewhere.  Plus the fact that it returned when the power was cut off seems to indicate that it was just a projection at any rate - they didn't have to work out how to \"transport\" the ship back again.<br /><br />The bit about the crew being fused to the hull is interesting though, and IMKO plausible.  Most people believe what stops you from falling through the ground is the atoms in your feet colliding with the atoms in the ground, but it's actually the electric fields of the atoms that stops you passing through solid objects.  It would make sense then that a strong enough magnetic field would cancel out the 'electric repulsion' and allow two solid objects to pass through one another.  The only problem is that as most biological things aren't very magnetic you'd need a HUGE magnetic field to do it, and with a field that strong you'd think the metal in the ship's hull would bend out of shape...<br /><br />So an interesting story, but it probably can't be proven one way or another just yet [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	},
	{
		"id": 23741,
		"title": "Re: Time Travel and Teleportation proven possible?",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-25T13:24:07.000Z",
		"content": "1.) I'd like some pictures<br /><br />2.) Why no time travellers back here? I'd send me a copy of TUIT from 2012<br /><br />3.) Why, after 60 years has the military not come up with invisibility suits, teleporters and the like? What good is a breakthrough if it isn't used? Who in their right mind would keep that secret, and what for? The commies are defeated, shouldn't we at least be using this in Iraq?<br /><br />This is as nuts as Roswell and that theory that Americia created AIDS.<br /><br />There is a nice book about all these, its called <i>'Conspiracy Theories'</i> and rates all the theories on evidence and plausibility.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Mod2.jpg[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23742,
		"title": "ur Wrong:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-26T02:54:19.000Z",
		"content": "No; tuit is planned to be made on the 12th of Never, 2114 N.H. (Not Happening).<br /><br />I don't think it is possible for time travel...<br /><br />There are two people; Keen, and Mort.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  \"Hi\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  \"Wassup?\"<br /><br />Mort and Keen grow up.<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  \"Watch me flex!!!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  \"You popped a shirt button\"<br /><br />Mort messes up his IQ test, and Keen gets a better score<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  \"Hahaha!!! You loser!!!\"<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  \"We'll see about that!!!\"<br /><br />Mort goes home, and tells his younger self the answers to the IQ test<br /><br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  to [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  \"The dumbest creature is not the dopefish, it is Najawa\"<br /><br />Now there are two Morts.<br /><br />Lil' Mort Takes Test [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] ... Big Mort Goes to future [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] .<br /><br />In the future... The lil' mort (Now big), has no need to go back in time, and tell his younger self the answer... so Big Mort becomes unnescessarry. He can't go to the future, cause then there would be two morts there [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] , and he can't go into the past.<br /><br />If time travel were possible, there would be a bunch of duplicate people running around!!!<br /><br />Mort Says: \"Time Travel is not possible!!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortvort.gif[/img] \"<br /><br />-[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] - NAJAWA -[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] -"
	},
	{
		"id": 23743,
		"title": "Re: ur Wrong:",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-10-26T05:27:34.000Z",
		"content": "\"Why, after 60 years has the military not come up with invisibility suits, teleporters and the like? What good is a breakthrough if it isn't used? Who in their right mind would keep that secret, and what for? The commies are defeated, shouldn't we at least be using this in Iraq?\"<br />1. You haven't seen the invisibility suits because they're invisible.<br />2. No teleports? Then how get the USAian troops \"defending democracy\" so quickly?<br /><br />Nah, I really don't see it being possible.<br />Edit: I mean any other way than with a DeLorean and a Flux-Capacitor..<b>Eat your veggies!</b>"
	},
	{
		"id": 23744,
		"title": "Re: ur Wrong:",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-10-26T05:52:26.000Z",
		"content": "well, the fact is, time travel and teleportation <b>IS</b> possible. Its been scientifically proven. The only real question is, did it happen back in 1943 and if not, how long will it take.---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 23745,
		"title": "Re: ur Wrong:",
		"author_id": 1486085,
		"author_name": "eK",
		"timestamp": "2005-10-26T06:17:03.000Z",
		"content": "time travel... unproven<br /><br />teleportation... well, there's quantum tunneling"
	},
	{
		"id": 23746,
		"title": "Re: ur Wrong:",
		"author_id": 1485591,
		"author_name": "alex87",
		"timestamp": "2005-10-26T07:11:22.000Z",
		"content": "they have the scientific solutions that prove that it is possible, they just dont know how to accomplish it yet, thats what i tried to say.<br /><br />So if it is possible, did it happen?---------<br />[img]http://img250.echo.cx/img250/9885/comicstrip9vf.gif[/img]"
	},
	{
		"id": 23747,
		"title": "Re: ur Wrong:",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-10-26T09:29:59.000Z",
		"content": "<i>\"they have the scientific solutions that prove that [time travel] is possible\"</i><br /><br />Ah yes, that'd be that \"proof\" that involves the rearranging of a few hundred suns, fashioning them into a cylinder and rotating it at close to the speed of light...or something like that.  I can't see any reason why they couldn't do that in 1943, can you? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]"
	},
	{
		"id": 23748,
		"title": "Re: ur Wrong:",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-10-26T10:37:23.000Z",
		"content": "And that proof itself is shaky. The problem is, time travel lies on the other side of infinity, and we don't know if that infinity actually exists, wether its a mirror, tunnel, or wall.<br /><br />And as for teleportation, only small things small distances under unusual circumstances.<br /><br />The problem is decoherence; basically, the bigger the thing you want to teleport, the harder it is to do so, as it must not be 'obseverd' to teleport. This rules out 1943 as the amount of light striking the ship would rapidly decohere it [10^-43 seconds] even if by some miracle you could cohere the whole thing at once.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23749,
		"title": "Re: ur Wrong:",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2005-10-27T03:12:16.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]well, the fact is, time travel and teleportation IS possible. Its been scientifically proven. The only real question is, did it happen back in 1943 and if not, how long will it take. [hr][/quote]<br /><br />Um... how? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />-- NAJAWA --"
	}
]
