[
	{
		"id": 56,
		"title": "Can the Keen engine be \"open-sourced\"?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-02T02:46:54.000Z",
		"content": "This morning I was thinking about the Keen: \"Goodbye Galaxy!\" engine. After reading a brief story of Bio Menace's development, it seems that the Id Software guys were thinking on using the Keen engine for other non-Id games then.<br /><br />So they <i>licensed</i> the engine to Apogee Software for Bio Menace. At least that's what I understood from the text file that comes with the freeware distribution of Bio Menace.<br /><br />These days I think it's *impossible* to make money with that game engine. If I remember correctly, Id Software and Apogee no longer distribute/register the original (registered versions) Keen: Galaxy games. Correct me if I'm wrong. If I'm right, would it be possible to open-source the Keen: Galaxy engine like the Quake engine?<br /><br />Note that I'm referring to the Keen *engine*, not the artwork or data files. Only the program, like Duke Nukem 3D or ROTT by Apogee.<br />[hr]<br />\"<i>Eat your veggies!</i>\""
	},
	{
		"id": 2268,
		"title": "Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-02T02:51:18.000Z",
		"content": "It's entirely possible, but good luck persuading them.  Although there was some talk of John Romero releasing the Keen source a while back..."
	},
	{
		"id": 2269,
		"title": "Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 1485688,
		"author_name": "Litude",
		"timestamp": "2006-12-04T13:46:20.000Z",
		"content": "Okay, first of all, Commander Keen 1-5 and Keen Dreams are still being sold. The only title that has been discontinued is Commander Keen 6.<br /><br />I remember someone here making a post about an interview with John Carmack on g4tv and they asked about the Commander Keen source code, and John responded that he can't find it."
	},
	{
		"id": 2270,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-04T21:18:33.000Z",
		"content": "They're still selling Duke3D and Shadow Warrior, but they released the source code for those two games some time back.<br /><br />I also remember the interview with John (although I thought it was Romero) saying he couldn't find it - but then Tony Gles I think it was posted here saying he was talking with Romero about releasing it..."
	},
	{
		"id": 2271,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-12-04T22:29:03.000Z",
		"content": "Remember there are two Johns -- John Romero and John Carmack. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2275,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2006-12-04T22:53:59.000Z",
		"content": "WHAT??? They lost that precious source code!? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-redeyes.gif[/img]  I hope they find it if they're really going to release it.<br /><br />According to the Keen5 credits, Jason Blochowiak, John Carmack and J. Romero are the software engineers. I *suppose*, if it's possible to convince all of them to release the source code, we'll have Keen engine's source code.<br /><br />And yeah, the games are still being sold by their original publishers (Apogee for all games except KDR and K6, which were published by Softdisk) and creators (Id Software).[hr][img]http://img136.imageshack.us/img136/983/vegetableswk2.gif[/img]"
	},
	{
		"id": 2272,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2006-12-05T07:57:56.000Z",
		"content": "<i>Remember there are two Johns -- John Romero and John Carmack.</i><br /><br />Yep, and I thought it was Romero who couldn't find the code.  But you would think they'd each have a copy they could get their hands on...assuming the floppy hasn't degraded by now...<br /><br />And selling the games never seems to be a problem - when you buy the game you're buying all the artwork, music, levels, etc.  These are rarely open sourced, so you'd still need to buy the games to play the original levels even if the source code was released."
	},
	{
		"id": 2273,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-12-05T17:42:58.000Z",
		"content": "Maybe this is obvious by now, but just in case:<br />Releasing source code and making a game freeware are not really related at all.<br />Usually in the beginning neither is the case.<br /><br />If a game is then made freeware, it's still illegal to make new games with the source code the game uses.<br />It's only that one games, the engine (source code) might still be sold and/or used to make more games with.<br />Bio Menace is an example here.<br /><br />If the source code is released, it's still illegal to distribute the game (except for official resellers of course), even if it hasn't been sold for 20 years (although eventually copyright becomes void, but I'd have to look up after how many years exactly).<br />There might still be games that use this engine that are sold.<br />Doom is an example here.<br />That's why in the case of Doom you still need the WAD-file with all the maps, textures, sprites, sounds, music, etc. in it to play a Doom port (although there is \"FreeDoom\", which uses home-made all-of-the-above so you can play).<br /><br />I don't think I can recall an instance where both are true.<br />Maybe ZZT?<br />Usually this happens with smaller games, smaller independant developers.<br /><br />I'm still hoping either John did in fact find the Commander Keen source code like mentioned in the other thread, but I still doubt it as much as when it was first mentioned, which is very much so.<br />It's just the no-new-information-thing, no-updates-thing, and nothing-about-it-from-John thing that make me doubt it.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2274,
		"title": "Re:  Re: Can the Keen engine be \"open-sourced\"?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-12-05T18:50:22.000Z",
		"content": "AFAIK, the ZZT fans are still trying to get the source code (Tim Sweeney has claimed to have \"lost\" it for several years)."
	}
]
