[
	{
		"id": 316,
		"title": "The Universe is Toast (your version)",
		"author_id": 1486673,
		"author_name": "Mort01",
		"timestamp": "2007-08-20T14:11:44.000Z",
		"content": "Okay, obviously the 7th (and final?) installment of Commander Keen, \"The Universe is Toast\" will probably never get made.  <br /><br />BUT... If it did, how would you make it?  What would be the story? What new or old characters would you have?  What would the gameplay be like?<br /><br />I personally like the idea that it would be the final grand finale to the Keen saga, and who knows what could happen.  I would bring back the Vorticons, since now they would be on Keen's side.  Other than that, I have no idea.<br /><br />This is just to have fun throwing ideas out there.  Any takers?<br /><br />(I couldn't find any other threads about this; but if there are, let me know.)"
	},
	{
		"id": 9339,
		"title": "Re: The Universe is Toast (your version)",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-20T14:37:42.000Z",
		"content": "Something like a game that revisits all previous places Keen has been before, only of course changed throughout the time Keen hasn't been there. Keen is in pursuit of Mortimer, who is going throughout the galaxy, planting beacons or whatever to destroy the galaxy. Keen has to stop him by taking out the beacons and finding Mortimer!____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 9340,
		"title": "Re: The Universe is Toast (your version)",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-20T15:18:11.000Z",
		"content": "Revisiting places? Um... no, kind of dislike that idea. I'd prefer to discover all-new places. Of course, one or two secret levels with existing places would be great.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 9341,
		"title": "Re: The Universe is Toast (your version)",
		"author_id": 1486673,
		"author_name": "Mort01",
		"timestamp": "2007-08-20T17:33:05.000Z",
		"content": "I'm not sure, but in the end I think he would fight a thousand Mortimer clones in a Matrix-like battle sequence, then face off with Mortimer who sits in his throne with a gigantic brain attached to his head.... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  ... and then?<br /><br />[Edit: took out a really stupid part]"
	},
	{
		"id": 9342,
		"title": "well..",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-08-20T23:12:57.000Z",
		"content": "To be honest, I always imagined the \"final confrontation\" in Keen7 being surprisingly low-key--a few exchanged words, and a tense silence, followed by a simple surrender.  <br /><br />Mortimer, for all his bravado and ego, doesn't seem the sort to take on Keen in a true one-on-one battle.  He may send out lackeys, henchmen, robots, an android dummy or two (I doubt he'd use straight-up clones)... but in the end, when Keen stepped out of the wreckeage, Neural Stunner in hand, Mort would quietly accept defeat, and then escape somehow, much like Doc Proton in the first Duke Nukem game.  <br /><br />In the event that Keen7 was to be the conclusive, be-all-end-all of the Keen universe, I can only see some humorous belittlement of the child genius--being brushed out of the crumb tray of the intergallactic toaster he was preparing, or otherwise being indirectly foiled by his own megalomania.<br /><br />In my mind, Keen never gets the joy of ending Mortimer himself... it's got to be indirect, almost coincidental.  (Totally just my opinion, though.)"
	},
	{
		"id": 9343,
		"title": "What Tom has said so far....",
		"author_id": 1485988,
		"author_name": "Lava89",
		"timestamp": "2007-08-20T23:57:40.000Z",
		"content": "Let's remember what Tom Hall has said so far (from 3D Realms' [url=http://www.3drealms.com/keenhistory/keenhistory2.html]A Look Back at Commander Keen[/url] )<br /><br />   <b> \"Well, I don't want to talk too much about it, as I may do it someday, but as you know from the end of Keen 6, Mortimer McMire is back, and he has big, bad plans for the end of the Universe as we know it...<br /><br />    If I can ever get the rights back to Keen, or if I can strike a deal with id so I have creative control of him forever, then you'll see Keen again. I don't want to start Keen back up, only to have him taken away again if he's successful. That just wouldn't seem fair.<br /><br />    I would love to do another Keen. My last idea for Keen 7-9 was a game world was 3D, and at certain places the camera rotated with you for different games. It was halfway between Super Mario 64 and Pandemonium. This was two years before those games came out. I wish I'd been in a place where I could've made that happen back then.<br /><br />    I do miss the good ol' days of Keen. I love the universe and the gameplay, and I'd love to make another chapter in the saga. We will see how the future unfolds..\"</b><br /><br />Joe Siegler also has this to say about Keen 7...<br /><br />    <b>\"When Tom Hall was working here at Apogee, I used to pester him about Keen, because quite frankly, I was a customer of Apogee's before I started working here.  I used to ask him a lot about what he had planned for Keen 7, and I remember him being really annoyed when Super Mario 64 came out, because Tom said that was exactly what he had planned for Keen 7 - he wanted to be first to market with that kind of game concept.<br /><br />    When I asked which characters he said would be back from the original Keen games, he replied \"All of them - a level Idea I had was that in the first level, you'd have every single character from all of the previous Keen games in there all at once - sort of a Galactic Zoo type of thing.  Then I'd start introducing new stuff after that.\"  Whether or not Tom actually uses this idea or not, you can tell he was thinking on a grand scale.\"<br /></b><br /><br />So I'd definately see the Vorticons in the game, and everyone else....lol.<br /><br />Also from what Tom Has has said, he referred to it as 7-9 implying it as a trilogy, so I wouldn't really expect the final battle till Keen 9."
	},
	{
		"id": 9344,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-21T09:34:44.000Z",
		"content": "I still believe it will be made one day. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br /><br />Xky, seriously, that sucks. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  I hope it won't end just that easily! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  I've \"always\" imagined it as a grand battle on some circular space station, something Universe-o-Toast in the middle of it, perhaps already in action so Keen has to be quick to defeat Mort, or then Mortimer was just about to press some button when Keen appeared and placed the stunner to the back of his head, \"not so fast, Mortimer!\". Then there'd be a big fight all around the collapsing (I like to think it as collapsing because of some force) space station. Or something really grand, I'm sure Tom has it all nicely worked out. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />Yeah, that zoo level sounds interesting, and after that into adventures in three episodes full of Keenishment and wonder. Oh man, I can't wait it! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9345,
		"title": "Re: What Tom has said so far....",
		"author_id": 1486673,
		"author_name": "Mort01",
		"timestamp": "2007-08-22T03:09:29.000Z",
		"content": "Oh man. Thanks for those quote Lava89.  <br /><br />I don't think I've ever played Mario 64. What does he mean by that kind of gameplay?<br /><br />I guess it does make sense to have the last part be a trilogy, so it would be like three trilogies.  I just always assumed that 7 would be the last one since the first three games are related, then 4+5 are related, but 6 kind of stands alone, so I figured 7 would be a direct continuation of that. (Does that make sense??)<br /><br />The thing is that the series has never had a REAL face-to-face between Mort and Keen, so you have to imagine the entire series building up to that final confrontation (dun dun duh DUUUUUUN)."
	},
	{
		"id": 9346,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-08-22T13:00:02.000Z",
		"content": "I would imagine the game as Pandemonium, a side-scrolling plattformer taking place in a world of 3D - with the cameras twisting and turning throughout the levels.<br />And actually, I'd appriciate it if it where Cell-shading, becouse it would add that Keenish feeling even in a world of 3D.<br /><br />Of course, lots of Vorticons, Dopefish and stuff.<br />I'd really like to visit more than just one planet, so there will be some kind of spacetravels or something between the levels.<br /><br />The final battle between Mort and Keen? I dunno, I guess Mort is just an enhanced-Shikadiclone of Commander Keen.<br />That explains everything. (I think there's a online-comicseries which reveals that? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img]  Hmm...)<br /><br />I hope that it would be multi-weapons, of course.<br />A multiplayer would be great... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]"
	},
	{
		"id": 9347,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-22T15:08:53.000Z",
		"content": "I on the other hand really don't care to see Vorticons except maybe jailed in zoo, I don't care much about them. And I don't want any more weapons than the old stunner. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />Yeah, it was TMST's (great) comic that had that. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9348,
		"title": "Re: What Tom has said so far....",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-22T15:26:06.000Z",
		"content": "Zidane, in that case, Mort would be my minion, and I didn't even know that! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 9349,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485720,
		"author_name": "ZidaneA",
		"timestamp": "2007-08-22T19:55:13.000Z",
		"content": "Zidane<b>A</b> othwise. : O<br />You're right! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  <br />But in the end, Keen will defeat Mortimer and he will do no good too you! Which means you have no use of him... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-helmet.gif[/img]"
	},
	{
		"id": 9350,
		"title": "Re: What Tom has said so far....",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-22T19:58:57.000Z",
		"content": "Indeed. That might be the reason because of which I chase Keen in my mods.<br /><br />So Joe Siegler (the 3D Realms webmaster) was a Keen fan back then?------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 9351,
		"title": "Re: What Tom has said so far....",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-08-22T21:30:40.000Z",
		"content": "Well, you can see my \"version\" in the cc314 fan fic section<br /><br />nowadays, however, i get these weird images of HP7 and Keen finding horcruxes :P[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 9352,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-23T10:53:27.000Z",
		"content": "Although Mortimer probably thinks conscious is purely connected to brain and its functions, and there is no such thing as a soul. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img]  I think he's willing to die, the only reason he wants to destroy everything is that he's afraid to die alone and wants to go with everything. This is just my idea, but we don't know any official one either. But it might be a bit too morbid and non-Keenish to be true. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9353,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-23T11:20:05.000Z",
		"content": "Well I have always wondered what would happen if he blew up the Universe - presumably he'd go with it, which seems unlikely as then he wouldn't be able to gloat about it - so he must have some secret way of escaping to some other Universe.  Or maybe it's just another ploy to distract Keen.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 9354,
		"title": "Re: What Tom has said so far....",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-08-23T23:47:19.000Z",
		"content": "I guess, among other things, we would have to figure out what Mortimer's motives for obliterating the universe are.  Either he plans to be in a different universe at the time of destruction, after which he can return and mold the universe to his own design, or maybe he's just destroying it because he can.  He seems to have a fetish with blowing things up.[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 9355,
		"title": "TUIT",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-08-25T21:09:35.000Z",
		"content": "The only stories of TUIT we have, whether it be a game or art comic or just a story, is KeenEmpire's series and that web comic where Keen's grandaddy came and took them away at the end. If there's another i don't know about, please let me know. I think KE's owns everything, they are great stories--still can't believe they're oneshots.Every notice how Master Mind and Mortimer McMire coincide?<br />Finish Keen! 315!"
	},
	{
		"id": 9356,
		"title": "foaijdfoi",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-08-28T04:54:53.000Z",
		"content": "where is that webcomic anyway, if you don't mind me asking."
	},
	{
		"id": 9357,
		"title": "Re: foaijdfoi",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-28T07:34:27.000Z",
		"content": "Wish I'd know! I tried to search it, in vain -- but fortunately I took a backup of it a long time ago! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   Now just hope I still have it! I don't think TMST would mind if I upload that great piece of art to keengrid.<br /><br />Fortune is on my side today!<br />[img]http://www.keengrid.net/tuit/0.png[/img]<br />[img]http://www.keengrid.net/tuit/1.png[/img]<br />[img]http://www.keengrid.net/tuit/2.png[/img]<br />[img]http://www.keengrid.net/tuit/3.png[/img]<br />[img]http://www.keengrid.net/tuit/4.png[/img]<br />[img]http://www.keengrid.net/tuit/5.png[/img]<br />[img]http://www.keengrid.net/tuit/6.png[/img]<br />[img]http://www.keengrid.net/tuit/7.png[/img]3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9358,
		"title": "Re: foaijdfoi",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-08-28T18:24:34.000Z",
		"content": "It's been a loong time since I read that thing...still just as funny as before.  (I took the time to translate the plaque on Spot's monument. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] )[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	}
]
