[
	{
		"id": 972,
		"title": "Sound-recording-and-editing programs, anyone?",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-11-15T00:38:58.000Z",
		"content": "You see, I want to add groovey sound effects to my voice and save it on my computer... and some monsterish ones.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mort.gif[/img] <br /><br />I also want to increase the speed of my voice (without having to do it by 100%, darned sound recorder on my computor), increase the speed of my voice without modifying the voice, and modify my voice.<br /><br />Anyone found any good sound-recording-and-editing programs?[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />I will not be interested in it if:<br /><br />1. I have to buy it to get all the features or avoid a time limit (I hate it when they add a time limit to the demo versions)<br />2. If the sound you get sounds too foggy<br />3. It's hard to use<br />4. It plays the sounds too choppy<br />5. I already have it (I only have one sound-recording-and-editing program, and it doesn't have enough abilitys)<br />6. If it doesn't have any groovy effects, or it doesn't enough groovy effects<br />7. It doesn't work.<br /><br />I would prefer it if<br />1. If it doesn't save the files as anything but .wav (I like being able to open the files and hear it)<br />2. It only works on Windows, all versions (eMacs stinkzorz)<br />3. It has more than 6 groovy effects.<br /><br />Thanks.<br /><br />BTW- I already have a sound-recording-and-editing program, but it doesn't have enough groovy effects for me. (I mean, all it has is the ability to change an sound's volume and speed, add echo to an sound, and reverse the sound. Yep, that's basically it.) It's called sound recorder (wow, big surprise!), and it came with my computer. I want more than just the dreadfully effect-free sound recorder, though.<font color=\"BLUE\">Signed, Harvey Smith<br />A proud member of the beta testing society<br />\"I help entertain!\" -Harvey<br />Tough guys have no table manners![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img]</font>"
	},
	{
		"id": 23135,
		"title": "Re: Sound-recording-and-editing programs, anyone?",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-11-15T01:06:51.000Z",
		"content": "[url=http://audacity.sourceforge.net]audacity.sourceforge.net[/url]<br />It's not Windows only, but that's a pretty dumb requirement anyway. You may have to look around a little to find a plugin that does what you want, or it may be included already.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 23136,
		"title": "LAME library",
		"author_id": 1486621,
		"author_name": "Alecswrld",
		"timestamp": "2005-11-15T01:58:02.000Z",
		"content": "\"Export MP3s with the optional LAME encoder library.\"<br />HahaHahaHaha. Ha. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />Well that was a cheap shot."
	},
	{
		"id": 23137,
		"title": "Re: LAME library",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-11-15T03:00:36.000Z",
		"content": "Ah LAMENC.dll, where would I be without you?A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 23138,
		"title": "Re: LAME library",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-11-15T06:44:13.000Z",
		"content": "Yeah, Audacity is a pretty good program!<b>Eat your veggies!</b>"
	},
	{
		"id": 23139,
		"title": "Re: Sound-recording-and-editing programs, anyone?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-11-15T22:51:20.000Z",
		"content": "[url=http://goldwave.com/release.php]Goldwave[/url] is also probably one of the best sound editing programs I've ever used, and it's very simple to master.  It has a lot of good effects (you can adjust the speed of files arbitrarily, so the start of your sound might be slowed down a bit but by the end it's faster, and it has a few effects like 'Mechanise' which might be what you're after.)<br /><br />Unfortunately it's only shareware, but from memory it doesn't have any sort of annoying timeouts, so you might want to try it."
	}
]
