[
	{
		"id": 1051,
		"title": "Sub-dreams (again)",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-02T08:50:51.000Z",
		"content": "I saw some strange dream that was partly a nightmare and featured a sub-dream (I call them those). Both of the dreams felt very real.<br /><br />First dream was something nice, and then I woke from that sub-dream -- I woke up in bed from a sub-dream, in that other dream. (So, I was still asleep in reality.) There I was puzzled and confused what was real and after something 15 minutes I realized it was just a dream and was very sure that I'm now awake. Then, that dream was nightmare, and I woke up from that along with my usual waking thoughts: \"Thanks heaven it was just a dream..\"<br /><br />Anyways, to say, these sub-dreams can really confuse you sometimes. I'm pretty sure this isn't a dream anymore, since anything bizarre hasn't happened. Hopefully I don't accidentally wake up. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24547,
		"title": "Re: Sub-dreams (again)",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2005-08-02T10:25:00.000Z",
		"content": "You can always tell when it's a dream, because you never stop to question whether you're actually dreaming (not properly anyway.)  If you do this properly, you'll immediately realise that you are in fact dreaming, and that's when you can take control of your dreams and do whatever you want (so called 'lucid dreaming.')<br /><br />Unfortunately (for me at least) once I've realised I'm dreaming I always start to wake up, and if I try to 'return to the dream world' I almost immediately forget that it is in fact a dream, thus defeating the point of continuing with the dream (you can force yourself to return to your dream by doing something in the dream world that requires a lot of effort on the brain's behalf - most people find standing up and spinning around does the trick, as the feeling of being spun around apparently is quite complicated - trying to simulate it is enough to make your brain forget about waking up, anyway!)"
	},
	{
		"id": 24548,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1486940,
		"author_name": "CommanderSpleen",
		"timestamp": "2005-08-02T13:31:27.000Z",
		"content": "Actually, I had one of these dreams last Friday morning. I was at my girlfriend's house, and she'd been called in for work at 9am while I slept in. Here's how it went:<br /><br />[hr]I'm in Tess' room, and 'wake up'. I scroungs around for my dream journal [There's A4 page and a half prior to this part, involving a school and part of my house], but realise Tess has moved some things around. I find it in the open drawer. Tess enters and announces that she only had half an hour's work. \"It's better than nothing,\" she says, shrugging it off.<br /><br />  Again, I awaken, searching for the journal. I locate it and start writing. Tess enters once more. I look at her strangely, \"You only got an hour's work?\" [I'd guessed it was about 10am by now] She confirms. \"Well, it's better than nothing,\" I tell her.<br /><br />  \"No it's not,\" she retorts. I then ask, \"So are you a dream this time?\" She shrugs, \"I don't think I am...\"<br /><br />  Now the couch [from the spare room at my place] is present [It had threaded its presence throughout the earlier dreams], and Tess and Charlotte [her sister] are sitting on it. I describe one of my dreams. Charlotte dismisses the dream's credibility with a snigger.<br />[hr]<br />I was disappointed when I actually awoke to find I had to write my dream down again, after all that effort I'd spent writing during the dream.  I was also amused to remember my dream journal was at home.<br /><br />Also, in 2003, IIRK, I had a rather unnerving dream where my bed was out the backyard during a lightning storm. I 'woke up' several times to the exact same scenario.<br /><br />[hr]<b>Malvineous</b> You can always tell when it's a dream, because you never stop to question whether you're actually dreaming (not properly anyway.) If you do this properly, you'll immediately realise that you are in fact dreaming, and that's when you can take control of your dreams and do whatever you want (so called 'lucid dreaming.')<br />[hr]Indeed. I'm yet to manage this, but I read some time ago that an effective strategy is to form the habit of checking whether you're dreaming during your waking hours. The habit transcends into your dream state, making it much easier to lucid dream (if you can hold your concentration properly--I'll have to try that spinning around technique).Cave assectatorem Ductoris Alacris <br /><br />\"This is how liberty dies--with thunderous applause.\" -Padme<br /><br />[url=http://jimsoft.spatang.com/]JimSoft Lair[/url]"
	},
	{
		"id": 24549,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-02T15:42:19.000Z",
		"content": "Hehe, too bad you had to do double the work Spleen, when writing the dream down. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />I haven't tried that lucid dream stuff (although it could be a good way to get to Shadowlands (along with drugs)), but sometimes I've wondered whether I've accidentally got into it. Sometimes when I wake up I remember faintly that I had controlled the dream, at least a bit. Not sure though.<b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24550,
		"title": "Re: Sub-dreams (again)",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-08-02T16:25:20.000Z",
		"content": "I've never tried having a lucid dream. I have to try it out.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   I have pretty weird dreams. Once I dreamed about a weird \"Full version\" of Keen 6![img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img]   Of course, it didn't look a thing like the actual full version of Keen 6, but it sure looked interesting.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]   (and fun [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img]   )<font color=\"BLUE\">A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	},
	{
		"id": 24551,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2005-08-02T16:25:37.000Z",
		"content": "Cool dreaming what you want to dream<br />I some times dream that i can fly mostly ala dbz (dragon ball z) but some times like a bird I am the bad you are the ugly There is no good"
	},
	{
		"id": 24552,
		"title": "Re: I Nag A Dumbass",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-08-02T17:25:05.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]You can always tell when it's a dream, because you never stop to question whether you're actually dreaming (not properly anyway.) If you do this properly, you'll immediately realise that you are in fact dreaming, and that's when you can take control of your dreams and do whatever you want (so called 'lucid dreaming.')[hr][/quote]<br /><br />First of all, I did manage to do some lucid dreaming a couple of times.<br />It happened early in the morning, probably in the weekend so I could sleep in.<br />I dreamt, woke up, or sort of woke up, and fell right back asleep again.<br />At that time I realised it wasn't real and managed to consciously influence what happened.<br /><br />But... the questioning thing doesn't work for me.<br />At least, I remember 1 instance where after I woke up I remembered a dream where I tried to figure out if it was one or not.<br />(Usually I just assume it's real and go with the flow.)<br />During some of my waking hours I realised I missed a lot... actually all of the finer details in my dreams.<br />I had this dream about a cool 3-tailed frog I think it was, eXistenZ-style I suppose, and once I was awake and tried to draw it, I couldn't, because I didn't really know what it looked (, or not anymore?).<br />So in that non-lucid dream I was looking at a wall, realised I needed to check for texture, and sure enough, it was there.<br />I checked out everything up close, and it was as detailed as real life, so it had to be real.<br />Later on I woke up, and it was still a dream.<br /><br />Then again, dreams aren't really any less real than \"real life\", at least I don't have any proof otherwise.<br />Maybe I'm asleep now and once I wake up you'll all be gone, because this whole community is just something I made up some night.<br />Poor things...Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24553,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-02T20:43:06.000Z",
		"content": "\"Maybe I'm asleep now and once I wake up you'll all be gone, because this whole community is just something I made up some night.\"<br />Well, it makes perfect sense. It was still fun knowing you, though. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-british.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24554,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-08-03T01:56:20.000Z",
		"content": "I can never tell if I'm dreaming or not, because my dreams are all lame enough to actually happen. The last dream I remember was about my cell phone reception. Cell phone reception! In one spot I had a strong signal, and in another I had a weak one. Thrilling! My real life is more exciting than that.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 24555,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2005-08-03T08:26:08.000Z",
		"content": "*naps*<br /><br />Hmmm, I think I'll count all the dirt I can find...1,2,3....<br /><br />...165780,165781,165782...<br /><br />*awakes*<br /><br />Zzzzmmggh? Wow, I bored myself awake!<br /><br />*Harvey enters*<br /><br />Harvey: OMG! Guess what? Yesterday while watching the Doom movie, I actually <i>died</i> of boredom! I ascended to the dream plane, but eventually returned to my body, but not before bringing <i>this</i> back!<br /><br />Spleen: <i>Keen 7: Keens calculus exam</i>?<br /><br />Harvey: Yeah, my dreams are pretty dull too.<br /><br />A proud member of the signature stealing society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/Kazz.gif[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 24556,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2005-08-03T09:00:15.000Z",
		"content": "Hehe.. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />lemur821.1: Captain, we got a strong signal!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dexter.gif[/img] <br />lemur821.2: Thr1llin'! Real lif3 iz excitin'! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] <br />lemur821.1: Captain, we lost the signal! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img]  Wait.. we got a weak signal!! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-birthday.gif[/img] <br />lemur821.2: Oh behave! Yeah baby, yeah! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-british.gif[/img] <b>You hear in your mind: GAAARRRRRGG!</b>"
	},
	{
		"id": 24557,
		"title": "Re: I Nag A Dumbass",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2005-08-04T18:27:30.000Z",
		"content": "Well, that CPR (Cell Phone Reception) dream sure sounds like barrels of fun! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 24558,
		"title": "Re: I Nag A Dumbass",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2005-08-12T02:30:35.000Z",
		"content": "Meh... Not really. It just left me depressed that there isn't really a spot in my house where I get a decent signal. Oh well. I wish they would install a tower on one of my neighbors' houses or something. They could even disguise it as a tree if they wanted. There's lots of nice trees around here.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/YorpEye.png[/img]"
	},
	{
		"id": 24559,
		"title": "Heehee",
		"author_id": 1486547,
		"author_name": "Harvey",
		"timestamp": "2005-08-12T11:49:46.000Z",
		"content": "Dyeing of boredom. lol [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  <font color=\"BLUE\">A proud member of the beta testing society<br />[url=http://www.garfield.com/comics/comics_todays.html]www.garfield.com/comics/comics_todays.html[/url]<br />Down with VGA! Up with EGA!<br />Email me a beta at [url=mailto:HarveySmiths3rdemail@hotmail.com] HarveySmiths3rdemail@hotmail.com[/url]! :-)</font>"
	}
]
