[
	{
		"id": 664,
		"title": "Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-23T22:51:33.000Z",
		"content": "It's been a long while since we heard anything about this supposedly imminent forum move. Is Cho'gall still planning something? This place is now well beyond stifling."
	},
	{
		"id": 16894,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-08-24T11:45:11.000Z",
		"content": "Agreed. Honestly, I don't care so much if someone is paying for this service. We haven't been in contact with them the same way they haven't been in contact with us. And besides...<br /><br />I AM STILL EXPOSED TO ADS WHEN I LOG IN! Or is that just me?<br /><br />The person paying for this \"subscription\" is someone who was gone from the community before my time. And it's been well more than 2 years since I joined! I usually don't participate in the \"When are we going to move\" threads but... you got to admit... Ez Board is ass. (But to be fair, I do like some of the features that aren't in PHP BB and the GUI is pretty solid.)<br /><br />Like I said before, I don't care if someone is paying for this. They aren't USING THIS! I say screw it and we move. If no one can email Chogall or get ahold of him... that's not our problem. He would be wasting his money just the same if say, the community had fallen apart 6 months ago.<br /><br />I mean... yes, I am greatfull for the service... and at the same time I'm not. Hell, even *I* have my own forum and I didn't have to pay ANYTHING for it. It was a nice gesture back when I was 16, didn't have a job and knew nothing of webhosting. Now it's like investing in a mud farm. The service you pay for is right in your own back yard.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16895,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T12:10:29.000Z",
		"content": "Right. And I get exposed to ads when I login, too. Although I don't have to login so often thanks to Firefox keeping the login cookies, sometimes they expire prematurely and I have to go to the stupid login page and say \"No, thanks\" every time.<br /><br />It's time to realize it, phpBB kicks ass.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16896,
		"title": "Re: Status of Move?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-08-24T14:19:15.000Z",
		"content": "I think vBulletin has more features than phpBB, but either choice is better than ezBoard.<br /><br />You know, though, we don't *have* to wait for Cho'gall to move the board. We could always create one on the side, and then Cho'gall might notice and close this board.<br />Anyway, when the board moves, is it going to move to CC314? Because I think it'd be much easier if it were hosted on its own site. After all, typing \"pckf.com\" is easier than typing \"classicgaming.com/cc314/forum.\"-Genius314"
	},
	{
		"id": 16897,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T14:53:57.000Z",
		"content": "vBulletin is paid IIRC. And not cheap. phpBB is free (as in freedom), on the other hand.<br /><br />Talking with eK, KeenRush and Xtra about his would be good, as they are the official, active, admins. eK is almost always on AIM.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16898,
		"title": "Re: Status of Move?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-08-24T17:39:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]vBulletin is paid IIRC. And not cheap.[hr][/quote]<br /><br />Oh. I didn't realize that it wasn't free. Heh, then phpBB *is* better. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] -Genius314"
	},
	{
		"id": 16899,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-24T18:13:40.000Z",
		"content": "Again, I'm waiting for Chog'all to do something. And no, haven't heard anything about this for a while.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16900,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T18:14:47.000Z",
		"content": "Can't we just bug eK via AIM? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16901,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-08-24T18:21:19.000Z",
		"content": "What does eK have to say in this? Can we please leave him alone? I like this place a lot better without his presence.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16902,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T18:25:08.000Z",
		"content": "I feel there's something like bad memories or dreams in this history.<br /><br />All I can say, is that somebody is willing to start an \"unofficial PCKF\", count me in.<br /><br /><b>Unless it's far from the style of this one.</b>------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16903,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-24T18:39:37.000Z",
		"content": "Well, feel free to bug eK, I can't forbid that, but I just don't think he has that much influence in this, he certainly doesn't know Chog'all in real life and thus can't remind him about it in person, or anything.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16904,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T18:57:30.000Z",
		"content": "Hah. In such case, we just need someone with lots o' money to travel to Cho'gall's homeland to bug him to release the sourc... er, wrong topic... forum.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16905,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-24T19:51:04.000Z",
		"content": "I can volunteer, I'd love to go to Norway. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16906,
		"title": "Re: Status of Move?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-24T21:27:32.000Z",
		"content": "About the forum system, don't bother with vBulletin, because it's paid, and don't bother with phpBB because it attracts spambots pretty easily and some of the actions are a bitch to do (like deleting users and all their posts (spambots)).<br /><br />If you want quality, and useful bandwidth saving stuff like quick reply, I say we should use Simple Machines Forums. Face it, phpBB is getting old too, even if they're working on a new version.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16907,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-24T21:44:33.000Z",
		"content": "Spambots? That's what moderators are for.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16908,
		"title": "Re: Status of Move?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-08-24T22:59:08.000Z",
		"content": "Andy had a good idea at K:M to keep spambots away - putting several Keen-related questions in the sign-up form. It seems to work.-Genius314"
	},
	{
		"id": 16909,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-08-24T23:59:46.000Z",
		"content": "OR we could do what they did over at the strife forums and MAKE your own forum system. It isn't hard.<br /><br />And I have to agree with Djaser... the last time EK came here well... That was retarded.<br />*Starts singing Tool*-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16910,
		"title": "Matus of Stove",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-25T01:16:22.000Z",
		"content": "[hr]<b>Gal</b> I AM STILL EXPOSED TO ADS WHEN I LOG IN! Or is that just me?<br />[hr]Indeed. Though it's quickly avoided by typing pckf.com back into the address bar once logged in, it's stupid that we're still getting such intrusive ads with a paid service.<br /><br />[hr]<b>Gal</b> *Starts singing Tool*<br />[hr]\"You just BANED djaser\"<br />\"I am leaving now\"<br /><br />IMKO, Cho'gall is no longer a key player in the Keen community. Nor is eK. I don't know either of them anywhere near as well as I know the regulars here. Sure, they made great contributions to getting the community off the ground, and I appreciate their effort. However, they're no longer relevant to the community and those of us that are need to take control of things and set the place up in a way that serves our growing needs. <br /><br />We've procrastinated for years, and we've probably lost a fair few potential members due to sign up issues (like confirmation emails not going through), which would be manageable with a better forum. This forum would still remain open until its payment (hopefully) runs out, and gradually we would lock sections out as more people move to the new one. So there would be no interruptions.<br /><br />I don't want to divide the community, but if we keep procrastinating the move will never happen. A new forum is easy to setup, and there's enough collective expertise between us to get things up and running in no time."
	},
	{
		"id": 16911,
		"title": "Re: Matus of Stove",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-25T05:49:02.000Z",
		"content": "Okay then, well where are Grafix and Xtra?  I'd expect either of them would be hosting it, possibly Xtra because of having dosclassics.com going for so long.<br /><br />I of course would be happy to volunteer webspace, but I expect I'm still seen as only a minor player in the community, so most people would prefer someone who's been around for a bit longer.<br /><br />That conversion of the forum Grafix did some time back looked great, so with his help we won't even have to start from scratch, all the old topics could be taken across too.<br /><br />We will of course need the support of an admin, and I think Xtra is the only one who regularly pops by.  I think it would be best if the switchover to the new forum was done in one go rather than gradually (otherwise it'll be too difficult to transfer existing threads across), so we'd need an admin to close down this forum and put up a redirection message to the new address.<br /><br />So - Xtra, Grafix, are either of you prepared to host a replacement PCKF?  (Or is there someone else I'm forgetting about?)<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16912,
		"title": "Re: Matus of Stove",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-25T08:27:00.000Z",
		"content": "Hey, I'm here quite regularly, every day, as far as I know! However, I won't close down the forum and set messages redirecting to the new board -- unless Cho'gall gives permission to do that. And I doubt any other admin will participate in that either, it'd be pretty much taking over the board. I just e-mailed to Cho'gall about this topic, let's see what's going on.<br /><br />However, I can't seriously see how change of the forum can do so much change in everything. You guys seem like it's the end of the world if it doesn't change soon, or that it'll be like heaven of creativity and Keenishness when it changes. Of course I hope that but I really can't see thousand projects will pop up and finish themselves just because the forum changes, I can't see people being so inspired by it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />If you're going to switch the board before it officially happens, well, I don't know if I will join. I've said that I won't, but probably I will anyways, just because everyone else leaves this. I think you'd be trusted Malvineous, you seem like a responsible person and hosting and maintaining the Keen wiki has been excellent. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Not to mention you've probably edited it the most. There's no problem in the others, either... However, personally I think it should have a place of its own, all Keen, and not be part of some existing site or system such as dosclassics.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16913,
		"title": "Re: Matus of Stove",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-25T11:25:04.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Spambots? That's what moderators are for.[hr][/quote]<br />Right. I myself really enjoyed manually deleting 20 posts and 2 spambots every day. At least with SMF you can pick to delete the user AND all his posts at once. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img]  (Actually, I haven't had any spambots at all yet since I switched.)<br /><br />I'd like the new forum system to be linked to from www.pckf.com, with a link to the old forum of course, but that might take some time to discuss with the other mods and admins.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16914,
		"title": "Re: Matus of Stove",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-08-25T13:08:05.000Z",
		"content": "Oh, sorry KR, I didn't realise you were an admin - last time I looked you were a moderator.<br /><br />I agree that the forum should not be part of an existing site, however this is unrelated to who hosts it.  My server currently powers www.shikadi.net, but equally it could power www.pckf.com as well (actually it sits behind wiki.commanderkeen.org too, but there's only one script sitting there which redirects everything to the main wiki URL, as you'll see if you visit a URL like [url=http://wiki.commanderkeen.org/Vorticon]wiki.commanderkeen.org/Vorticon[/url])  I'm sure Xtra's hosting plan allows him to do the same, and I know Grafix's does.<br /><br />You're right in that moving to a different forum won't make a huge difference, but a new layout would be a breath of fresh air, and modern forum systems would make it just that bit easier to read posts (for example something I'd really like is for topics to be automatically marked read once you've opened them, because correctly marking things read is a bit of an art with ezBoard.)<br /><font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16915,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-08-25T16:52:54.000Z",
		"content": "You guys should think about how a new place would benefit the community or wouldn't. Personally I fear that another loss of previous posts and user accounts would give community a serious blow. On the other hand I hate the idea that we have to wait for Chogall to do anything. Let's face it; he won't do anything anyway. You all should just decide whatever to leave or stay and get over it. Seeing this kind of topics popping every three months is just sad. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16916,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-08-25T17:17:12.000Z",
		"content": "If anyone would host the new forum I would probably guess it would be Xtra.<br /><br />First off \"Beyond the Pogo\", the page Xtra has set up, is in my opinion VASTLY superior to ANY other Commander Keen fan page out there. It looks the best and has the most information on it. (Or at least used to before the wiki.)<br />Besides, he hosted B&amp;S before I got my own webspace. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] <br /><br />But that all depends on if Extra is even willing. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <br />It really doesn't matter though because, as was pointed out earlier in this thread, pretty much anyone would be willing to shell out the chash to make it happen.<br /><br />I always thought CC314 was a crappily made fanpage anyway. It looked terrible, was somewhat hard to find things and well... it didn't... look... Commander Keen at all. <br />That and, it was dead before I found this community anyway. (Actually I found this forum RIGHT after CC314 was shut down. The thread announcing it was still fresh.) To say that the people who ran this forum and CC314 years ago still have a say in what happens here is actually... pretty silly.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16917,
		"title": "Re: Status of Move?",
		"author_id": 1485983,
		"author_name": "KeegTech",
		"timestamp": "2007-08-25T18:55:58.000Z",
		"content": "Speaking of Beyond the Pogo...<br /><br />Is anybody else unable to download anything off of it?  It was always the best Download resource out there for Keen, and I know it busticated some weeks ago.  I assume it's being fixed...[img]http://i91.photobucket.com/albums/k284/KeegTech/WarholDopefishPNG2.png[/img]"
	},
	{
		"id": 16918,
		"title": "Re: Status of Move?",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2007-08-26T01:21:23.000Z",
		"content": "Oops, that should be fixed now.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 16919,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-26T01:50:18.000Z",
		"content": "[hr]<b>KeenRush</b> However, I can't seriously see how change of the forum can do so much change in everything. You guys seem like it's the end of the world if it doesn't change soon, or that it'll be like heaven of creativity and Keenishness when it changes. Of course I hope that but I really can't see thousand projects will pop up and finish themselves just because the forum changes, I can't see people being so inspired by it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br />[hr]I certainly don't expect a dramatic shift in people's attitudes as a direct result of moving to a different forum system. What I do expect is a new atmosphere of professionalism, stability and permanence.<br /><br />Being able to actually search the forums would be nice, for starters. As would a quote tag system that won't trash the post if you make one slip-up. Oh, and as Malvineous says, a proper thread-marking tool would make things much more comfortable. Simple things like this make the move worth it.<br /><br />[hr]<b>KeenRush</b> I think you'd be trusted Malvineous, you seem like a responsible person and hosting and maintaining the Keen wiki has been excellent.<br />[hr]I second that sentiment.<br /><br />[hr]<b>djaser</b> You guys should think about how a new place would benefit the community or wouldn't. Personally I fear that another loss of previous posts and user accounts would give community a serious blow.<br />[hr]Switching forums won't result in a loss of posts. The existing database can and will be copied across. The benefit is beyond doubt, it's just the political issues that pose an obstacle.<br /><br />[hr]<b>djaser</b> On the other hand I hate the idea that we have to wait for Chogall to do anything. Let's face it; he won't do anything anyway. You all should just decide whatever to leave or stay and get over it. Seeing this kind of topics popping every three months is just sad.<br />[hr]Agreed. Waiting for one person, who has outgrown the game, is pointless. If he personally drops in here and indicates he has an imminent plan, that he'll make the forum stand-alone (independent of CC314) and listen to input from the rest of us as to how we'd like it to be, I'll reconsider my stance.<br /><br />Until then, I find him irrelevant to the issue at hand. If the opinion and discussion within the community is overruled by one person it never has any contact with, what's the point of it?<br /><br />[hr]<b>Gal</b> I always thought CC314 was a crappily made fanpage anyway. It looked terrible, was somewhat hard to find things and well... it didn't... look... Commander Keen at all.<br />[hr]As were my thoughts. Although it was interesting to explore for a while, it's well and truly dead now. I no longer see any logic whatsoever in the phrase, \"This Commander Keen forum belongs to Cerebral Cortex 314, the #1 Commander Keen site.\"<br /><br />Beyond the Pogo has been the staple Keen site for a long time, and this forum has had nothing to do with CC314 for even longer. As far as I see it, waiting for Cho'gall to move the site is comparable to waiting for ID to release the Keen source code."
	},
	{
		"id": 16920,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-08-27T02:29:24.000Z",
		"content": "Personally, I was waiting for the gold status to be close to expiry to persue the move.<br /><br />However it's 65 days now until this place returns to the quagmire of adland.<br /><br />Yes I do agree that it should no longer be affiliated with cc314.  It just doesn't make sense, I haven't updated it in almost 3 years now.  In its defense though, cc314 was a very good site when it was first made.  Everything else was basically crap.  i.e. [url=http://www.fortunecity.com/skyscraper/joystick/56/index.htm]www.fortunecity.com/skysc.../index.htm[/url]<br /><br />Anyways.  I'm behind a move, I just don't want to have to be involved.  It's definately needed, and BtP is the obvious and best choice.<br /><br />I open myself now to criticism and all that stuff...--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16921,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-08-27T08:06:35.000Z",
		"content": "Although we should also face the fact that we don't have an active fan page anymore. Spatang hasn't updated in two years and I don't expect that to change. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16922,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-08-27T16:07:01.000Z",
		"content": "Yeah.<br />My page will be active once again after I get that garging rage/inspiration to redesign it. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-garg.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16923,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-27T16:15:56.000Z",
		"content": "Doh.<br /><br />I wanted to create a page for keeping some kind of community Newsletter, and other for fan stuff. However, with what has happened to my personal webpage (see the link in my signature), I guess that won't be possible.<br /><br />Never.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16924,
		"title": "Re: Status of Move?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-08-28T03:21:01.000Z",
		"content": "^^; Hey Flaose don't insult the Keen infinity page like that [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-crazy.gif[/img] <br /><br />i mean it's not great and others were more organized and comprehensive, but it has game music and even a (fake) interview with Keen himself! It reminds me of the old days where i searched through every keen fansite i could find, and every1 had more links to others.<br /><br />now there's dosclassics and the wiki lol [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Ever notice how Master Mind and Mortimer McMire coincide?"
	},
	{
		"id": 16925,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-08-28T09:27:30.000Z",
		"content": "Those annoying adds are something recent, it didn't have so many back in the day.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16926,
		"title": "my take",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-08-28T11:04:26.000Z",
		"content": "Things like this always pop up when I'm away... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />My personal vision of a new PCKF would be one running something like PunBB or SMF, although I would personally go for PunBB as I don't like the fact that SMF uses the bug-prone concept of \"mods\". (PunBB does at the moment too, but the beta version has support for plugins.)<br /><br />As for hosting, I think that DOSClassics would probably be the most appropriate site. Although I don't doubt Malvineous' ability as a sysadmin, his server has a tendency to be rather slow under load. I would have gone for my own host, as their architecture and support are excellent, but I suspect it would cost a fair bit more than hosting it elsewhere.<br /><br />There shouldn't be any worries about losing posts or users from the forum - I tested out the ezBoard-to-phpBB converter on this forum a while ago, and it worked almost perfectly. (Unfortunately the demo board with the converted posts is no longer online, as spambots were starting to noticably chew up my bandwidth.) We could then use a converter to move the posts from the phpBB database to the forum software of our choice.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 16927,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-28T13:52:34.000Z",
		"content": "[hr]MortimerInBlack: \"Ever notice how Master Mind and Mortimer McMire coincide?\"[hr]<br /><br />Master Mind? Who? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16928,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-08-28T22:09:38.000Z",
		"content": "I think it's his signature dude...<br /><br />Master Mind... I think it's a board game. Who knows.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16929,
		"title": "MM",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-08-29T03:51:09.000Z",
		"content": "You guys are reading too much into it... Master Mind and Mortimer McMire both have \"MM\" in common.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  <br /><br />I always appear to be some sort of pro-EzBoard zealot, but I'm not... I fully support a move to a newer forum, now that Gold is as good as gone. <br /><br />...You guys can blame me for it sticking around; I donated a couple years ago.  lol"
	},
	{
		"id": 16930,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-30T17:02:51.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Gal: I think it's his signature dude...[hr][/quote]<br />WTF? When will people learn to put a horizontal line at the start of their signature... ah, phpBB AUTOMATICALLY adds it without you having to do any extra effort. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-potter.gif[/img] ------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16931,
		"title": "Re: Status of Move?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-08-30T17:59:16.000Z",
		"content": "Actually, most other forums do. Just not ezBoard. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] ____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16932,
		"title": "Re: Status of Move?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-08-30T21:01:47.000Z",
		"content": "Gee, take it ez ShadowMaster. And yes, Master Mind is not anyone in particular, it's just that that is what Mortimer iz, hence the MM.<br />I proly shouldn't have capitalized it though, [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-oops.gif[/img]  (and it's not a board game that i know of)<br /><br />and heh, Molly has the same initials. I remember LevelLord or maybe sum1 else writing a fanfic in the forums where Billy's sis was named Becky, thus keeping the double initial trend.<br /><br />To get ontopic just for a brief moment, idk anything about phpBB or w.e else there is, but i don't mind a move as long as its an official one and everyone goes and all topics are transfered; and it would be great if Flaose, Chogall, eK and Ilsoap (am i 4getting any1?) made it happen.Ever notice how master mind and Mortimer McMire coincide?"
	},
	{
		"id": 16933,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-08-30T23:03:00.000Z",
		"content": "Unfortunately, only Xtra and Keen Rush could really be considered active admins.  Really, the thing is we need to 1. agree on a board, and 2. agree on a host.  It's that simple, and that complicated.<br /><br />After that, the move's simple.  The fact that there really isn't an active Keen webpage at the moment makes things a little difficult to choose a host, but I know Cho'gall's still willing to do so, and has registered cc314.com for that express purpose, though of course others have brought up the valid point of its death of more than two years.  Anyways, yes, please get back on topic so that something can actually be decided.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16934,
		"title": "Forearm Movie",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-08-30T23:30:56.000Z",
		"content": "When it comes to a host, it's only really a matter of bandwidth. IMKO, the board should be a stand-alone entity, linked directly from pckf.com. Thus the activity of any other page hosted on the server is irrelevant, except in regard to its expected permanence.<br /><br />NearlyFreeSpeech would be an ideal solution, with a lot of nifty features, including a PayPal donation system. That would make it completely self-sufficient, and not reliant on a private server.<br /><br />As grafix says though, it may also prove more expensive. Nonetheless, there are bandwidth buckets available, so if we can accurately gauge how much bandwidth we would need in a given time, large discounts are possible.<br /><br />So, what are the options regarding the forum system?<br /><br />phpBB (less likely)<br />Simple Machines<br />PunBB (most likely)<br /><br />Anyone care to post further pros/cons list for these boards, and/or add another to the list? Then we'll have something on which to base a decision."
	},
	{
		"id": 16935,
		"title": "once more",
		"author_id": 1486240,
		"author_name": "grafix5000",
		"timestamp": "2007-08-31T16:39:04.000Z",
		"content": "<b>Forum software:</b> Having looked around, I'd now say that [url=http://bbpress.org]bbPress[/url] is the ideal solution. It's written by some of the WordPress team, and it has the key advantages of being fast and very easy to extend - no more dodgy mods that break every time you upgrade! Additionally, it has Askimet spam protection built in. (Askimet is a service provided by WordPress.com that filters spam from blogs and forums. It's free for  small blogs and forums, and it works very well.) Although bbPress is still in beta, it's being used by a number of large services already, and I believe it could work very well.<br /><br />If people don't think bbPress is a good idea, I think we'd be best going for PunBB. It's a well-established forum solution with a range of themes and mods available, and it is both faster and more secure than phpBB. Unfortunately, the new plugin system they're introducing isn't quite of the calibre I was hoping for, but I'm sure it'd work much better than modding the code directly.<br /><br /><b>Hosting:</b> [url=http://https://www.nearlyfreespeech.net/]NearlyFreeSpeech[/url] are the company I host with, and they do have excellent support and facilities (as I mentioned before). They make it very easy for users to donate directly to their customer's hosting bills, meaning that we could implement a \"community chest\" feature similar to the one ezBoard provides. However, it's hard to tell whether they're a viable choice without knowing the amount of bandwidth these forums use - can any of the admins help out here?<br /><br />If NearlyFreeSpeech turns out not to be cost-effective, we could always ask xtra to host the forum on DOSClassics. My only worry is that if xtra somehow drops out of touch with the community or he stops paying his hosting bills, then the forum goes down the can. The advantage of NearlyFreeSpeech is that as long as <i>someone</i> is paying the bills, the site stays up - and that means that it could survive solely off of donations if the account holder were to disappear. It would also be much less effort to transfer the site to a new account holder if necessary.<br /><br />Any comments?"
	},
	{
		"id": 16936,
		"title": "wtf",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-08-31T17:06:29.000Z",
		"content": "Actually, scrap my previous comment. Having looked at the (exorbitant) pricing for Gold Community, I've concluded that NearlyFreeSpeech is definitely the best solution for the boards. Even on the most expensive bandwidth package, it's still way cheaper than ezBoard. In fact, it'd be more cost-effective than almost any other hosting solution (balancing the cost of random downtime and unhelpful support) unless the boards are consuming over 7GB of traffic a month.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 16937,
		"title": "Re: wtf",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-31T17:29:46.000Z",
		"content": "I've seen absurd publicity, but THIS...<br />[quote]<b><i>Quote:</i></b>[hr]Gold Community<br />Simply the best community platform available.<br /><br />The World's Leading Community Product, Gold gives your community powerful features and blistering ad-free performance. Buy &amp; build today ($9.95 for 3 Months* and $30.00 for 6 Months**)<br /><br />*Introductory Offer not available to all communities. Please check your purchase screen for eligibility.<br />**$30 price available for all communities that generate under 10,000 page views per month.[hr][/quote]<br />------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16938,
		"title": "Re: wtf",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-08-31T17:46:44.000Z",
		"content": "$9.95 for 3 months, and $30 for 6??! Isn't it supposed to be a *better* deal to buy more? Ha ha, stupid EZboard.-Genius314"
	},
	{
		"id": 16939,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-08-31T17:51:56.000Z",
		"content": "FYI, ezBoard says we average 54.596 MB of bandwidth/day.  So about 1650 MB/month.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16940,
		"title": "decided",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-08-31T19:00:04.000Z",
		"content": "For that bandwidth usage, hosting on NearlyFreeSpeech would cost a grand total of $2.50 a month. I think we have a winner here <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 16941,
		"title": "Re: decided",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-08-31T21:33:34.000Z",
		"content": "It's official.<br /><br />I CALL UPON THE LORDS OF DARKNESS TO RISE CHOGALL ALIVE AGAIN!!!<br />*nothing happens*<br />RISE FROM THE GROUND, CHOGALL!!!<br />*nothing happens*<br />Damn, not even necromancy works.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16942,
		"title": "Re: decided",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-01T00:20:09.000Z",
		"content": "I just sent Chogall e-mail about this NearlyFreeSpeech. Oh, and he has replied to the e-mail I sent a few days ago -- he's alive and been busy -- with other stuff, yet is still willing to continue paying this in case the Gold time runs out again -- however, I've pointed out that it really should be the time to move now or people'll split, and now there's discussion again about it, and I promised to do my best to help him with the move, the technical side. Not that it probably is problematic, these things are relatively easy to install these days, aren't they? But if not, then we'll have to ask more knowledgeable help. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  Now just hope something will happen soon...3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16943,
		"title": "Re: decided",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-09-01T02:34:57.000Z",
		"content": "[hr]($9.95 for 3 Months* and $30.00 for 6 Months**)<br />[hr]The hell? It actually says that? I don't know whether to laugh or cringe...<br /><br />[hr]<b>KeenRush</b> I promised to do my best to help him with the move, the technical side. Not that it probably is problematic, these things are relatively easy to install these days, aren't they? But if not, then we'll have to ask more knowledgeable help. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img]  <br />[hr]I vote we let grafix setup an NFS account with bbPress, and let the Gold Community expire. Is anyone else familiar with NFS and bbPress who can help out if necessary? Between the lot of us we have the capability to make this happen, regardless of whether Cho'gall has the time to help out. For anything else we need to know, that's what support forums are for.<br /><br />[hr]<b>KeenRush</b> Now just hope something will happen soon...<br />[hr]It can happen pretty much immediately. Though I won't be able to contribute until the middle of the month. Whatever I can do when I get back, I will."
	},
	{
		"id": 16944,
		"title": "Re: decided",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-01T10:06:22.000Z",
		"content": "Hmmm, you're right Spleen, I told that to Cho'gall, that grafix could help in it way better than I could, he actually knows something about software and settings. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  I only volunteered because he asked help from us 'insiders' -- of course he didn't say it couldn't be someone else.<br /><br />Yes, you're right that it could happen anytime, but I want to follow this particular board, and it'd be a bit senseless to set up two different boards as this is going to move...<br /><br />Anyways. I don't personally like that bbPress, it feels strange. Can there even be forum main page such as this one or every phpBB has? Or avatars and signatures? Is its great extending capabilities really that important to us? Well, I guess I can get used to it, but I don't like it yet.<br /><br />In a way this is exciting, we soon getting all new place up and running. Do you guys think there forum categories should stay the same or should there be changes? And don't suggest ten new misc sections, that won't happen. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16945,
		"title": "Re: decided",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-01T11:36:28.000Z",
		"content": "Initially, I didn't like the look of bbPress much either. However, it only takes a theme and a couple of plugins to make it look like a \"normal\" forum (eg ezBoard, phpBB, punBB etc.) The disadvantages of its small feature set are more than made up for by the fact that you can add them all in with plugins. If there are still any objections, I guess running the forum on PunBB wouldn't be too painful."
	},
	{
		"id": 16946,
		"title": "Re: decided",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-01T22:34:35.000Z",
		"content": "Why does nobody even try or suggest SMF, if it feels a lot easier to use and is more complete than phpBB/PunBB? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />Oh man, I'm nagging and annoying the hell out of you people right now, right? Sorry about that, it's just that I really felt the difference when I switched forum systems.<br /><br />Now about the move: I assume we'll be having the same forums as PCKF's, and all topics and posts will be moved to the new forum, right? Otherwise we'd be nowhere.<br /><br />While we're at it: a little site to go with the forums would be nice. Nothing big, just things like Keen mod/fangame management, linking to a forum topic and a download link or something.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16947,
		"title": "Re: decided",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-09-02T17:09:10.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I only volunteered because he asked help from us 'insiders'[hr][/quote] <br />What the hell is THAT supposed to mean? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]  -----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16948,
		"title": "Re: decided",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-02T19:30:11.000Z",
		"content": "The people who are on this forum's admin/mod e-mail list. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img]  Was too tired to explain with that so I just wrote that word. What were you thinking?3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16949,
		"title": "Re: decided",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-02T20:58:50.000Z",
		"content": "One slight issue: we can't convert the polls on this forum, as the ezBoard conversion utility doesn't support them. In light of this, wouldn't it make sense to get rid of the \"Keen Voting Booth\" and \"Miscellaneous Polls\" forums on the new PCKF and allow polls to be posted in any forum instead? At the moment, those two forums appear to attract little other than fairly pointless questions (like \"What is your favorite Keen creature?\").[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 16950,
		"title": "Re: decided",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-03T05:58:18.000Z",
		"content": "Yeah, you're right. I don't even know why it is like it is. That's a good thing to change.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16951,
		"title": "Re: decided",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-03T08:25:36.000Z",
		"content": "Well, there are <i>some</i> good polls (like \"need opinion on K64 art style\"), but those can just be created again over there.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16952,
		"title": "Re: decided",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-09-03T15:03:36.000Z",
		"content": "A lot of the polls are kind of pointless, yeah. I may have contributed to that a few times... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shucks.gif[/img] <br /><br />I think the best option is probably what was suggested, allow polls in any subforum and do away with the poll-specific ones. That way, the polls are always in the forum they're relevant to (modding polls in the modding section, etc.).<br /><br />ezBoard's poll feature is kind of crap anyway, in my opinion. I mean, there are some times when you need more than five options, but they never let you. Bah.------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 16953,
		"title": "Re: decided",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-09-03T16:18:18.000Z",
		"content": "KR, you are my hero! Thanks! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rasta.gif[/img]  <br /><br />Oh, and BTW, I hope somebody buys a n00bsticide tank with the new forum system too.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16954,
		"title": "Re: decided",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-09-03T17:00:05.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]ezBoard's poll feature is kind of crap anyway, in my opinion. I mean, there are some times when you need more than five options, but they never let you. Bah. [hr][/quote]<br />What's the use of that when only three people would vote?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16955,
		"title": "Re: decided",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-09-03T21:38:42.000Z",
		"content": "More people might vote if the polls were better, and mixed in with normal topics.  At the moment it's really easy to just ignore all the polls.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16956,
		"title": "Re: decided",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-09-04T06:12:56.000Z",
		"content": "Still I doubt you can make more than ten people vote.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16957,
		"title": "not quite decided",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-04T10:20:08.000Z",
		"content": "I'm currently in the process of testing out converting posts from the PCKF. Whilst doing so, I've realised that the existing ezBoard converter is fairly poor. Although it converts plain text posts OK, it does badly when BBCode or smilies are present in the post. It doesn't convert users particularly well either. A certain amount can be done to fix up the posts once they are converted, but there is still a lot of ezBoard cruft left over. I personally believe I could make a much better job of building a converter, but it would take a long time - and I'm fairly short on time right now. So, either:<br /><br /><b>a)</b> I convert the posts with the current converter. The archived posts will look messy for a while, but should eventually be neatened up. <i>or</i><br /><b>b)</b> We wait for me to write a better converter. This could take as long as a month, and I might end up not being able to complete it and simply going for option a).<br />Thoughts?<br /><br />(Also, we'll be running phpBB for a while if we go for option a). I'll have to clean up the posts before they can be converted to a better forum system.)"
	},
	{
		"id": 16958,
		"title": "Re: not quite decided",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-04T11:31:56.000Z",
		"content": "If you want a look at what the posts look like with the current converter, go to:<br /><br /><b>http colon slash slash <br />pckf dot nfshost dot com <br />slash phpBB2 slash viewforum.php?f=8</b><br /><br />I'd post a direct URL, but I'd like to delay the spambots and dodgy web crawlers as long as possible."
	},
	{
		"id": 16959,
		"title": "Re: not quite decided",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-09-04T12:46:38.000Z",
		"content": "Thats actually pretty cool. I don't mind losing some stuff in the process... It can't be nearly as bad as the crash that happened a few years ago. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] -Genius314"
	},
	{
		"id": 16960,
		"title": "Re: not quite decided",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-09-04T13:00:39.000Z",
		"content": "We can backup current stuff in different places. I did that with the whole CC314 site sometime ago using \"wget\", I don't know if I can restrict it to only one server.<br /><br />@grafix: Nice.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16961,
		"title": "Re: not quite decided",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-09-04T20:48:15.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<b>b)</b> We wait for me to write a better converter. This could take as long as a month, and I might end up not being able to complete it and simply going for option a).[hr][/quote]<br />Why don't you just do it open source. I mean... while I don't think I could make the program myself I know I could help with some functions and whatnot. I know a lot of others on this forum know PHP / C++ / Java / Whatever you are using and could help as well.<br /><br />I am all FOR having the converter program made so we can have it do exactly what we want it to do.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16962,
		"title": "Re: not quite decided",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-04T21:48:52.000Z",
		"content": "One problem is that the converter will have to be more specialized, and recognize the pics as actual emoticons. And as you probably know, not every emoticon has the same name on different forums (even on ez).<br /><br />Some other minor issues like that probably arise... You know, it doesn't really matter. Open-source it! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke2.gif[/img] ____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 16963,
		"title": "Re: not quite decided",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-09-04T22:08:06.000Z",
		"content": "Surely writing a converter couldn't be too hard if you made it with a bunch of regular expressions.  Things like smilies would be easy once you have a list of filenames and what they should be converted to, and the HTML code should be uniform enough that a regular expression could easily pick it apart.  I'd have a go at writing one if I had a little more time at the moment, so if this discussion is still going on in a week or two I'll try then.<br /><br />At any rate I think the converter should convert the forum into a more useful format like XML, since then you can write an XML import filter for any forum system you want, and the converter isn't tied to a particular platform - it becomes an \"ezBoard exporter\" and then you get hold of an importer for your particular forum system.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16964,
		"title": "jackalope?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-05T20:01:15.000Z",
		"content": "That was, in fact, pretty similar to the idea I had. I'd probably store the ezBoard data in a SQLite database as opposed to XML, as I'm not heavily acquainted with XML parsing.<br /><br />To be honest, writing an ezBoard screen-scraper isn't too tricky. Although the horrific HTML syntax that ezBoard spews out doesn't lend itself to being parsed by regular expressions or a standard XML parser, it can be done. It's also fairly easy to convert emoticons and BBCode (helpfully, they are both enclosed in &lt;<b></b>!--EZCODE--<b></b>&gt; comments).<br /><br />The main reason why it takes a lot of effort to write a proper ezBoard converter is that you need to tie up all the loose ends, as well as writing clean code. The current converter for phpBB is a quick and messy application, and just about does the job. A better converter would retrieve user data from ezBoard, allow the proper handling of signatures (which is not that hard either), and possibly even put the posts it retrieves in the right order! :P"
	},
	{
		"id": 16965,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-09-07T03:23:59.000Z",
		"content": "We already suffered a \"huge loss\" when EzBoard tripped all over itself over a year ago... the community bounced back, and most of the material that was available before the crash is still at hand; we could move onto a clean shiny new board and suffer only a minimal downtime, I think.  Why so much fuss/delay over conversion?"
	},
	{
		"id": 16966,
		"title": "Re: well...",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-09-07T04:00:09.000Z",
		"content": "I suppose it's a fair point - we get annoyed when someone posts to an old topic, so they're only there for reference - and as a reference, it doesn't really matter whether they're in a forum format or not.  We could always just mirror the whole ezBoard forum as static HTML and leave that as a reference, and start the new forum fresh.<br /><br />In some ways, I think I would prefer starting a fresh - I guess as long as the old data is archived *somewhere* so it's not lost forever then it doesn't bother me whether it's in the new forum or not.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16967,
		"title": "Re: well...",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-09-07T15:02:12.000Z",
		"content": "OK, just make sure to email me when the move is ready to be done. I still have content to rescue from the PCKF that I'm too lazy/busy right now to do.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16968,
		"title": "Re: well...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2007-09-07T19:18:14.000Z",
		"content": "Well, of course, won't this one still be around for a little while, even after the conversion? It's not gonna disappear the minute we move to another forum.-Genius314"
	},
	{
		"id": 16969,
		"title": "Re: well...",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-09-07T20:20:50.000Z",
		"content": "I'm all for getting something done as soon as possible (y'know, in the unlikely event that anyone cares what I think), and a static archive for most of the old topics would be fine as far as I'm concerned.------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 16970,
		"title": "Re: well...",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-22T06:14:41.000Z",
		"content": "So... how are we going to work the NFS thing? I can setup another account under my name if everybody agrees to it. Then we'll have a starting point, and from there we can work out the rest."
	},
	{
		"id": 16971,
		"title": "Re: well...",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-10-22T15:50:48.000Z",
		"content": "The moment someone (Who is of actual noteriety on this forum.) moves / makes a new forum I shall follow in their wake. Other than that I'm just chilling here.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16972,
		"title": "Re: well...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-10-23T03:55:46.000Z",
		"content": "I'd stick on any and all Keen forums that are active.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 16973,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-25T05:46:27.000Z",
		"content": "Who is it that registered pckf.com?--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16974,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-10-25T08:04:20.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The moment someone (Who is of actual noteriety on this forum.) moves / makes a new forum I shall follow in their wake. Other than that I'm just chilling here. [hr][/quote]<br />Agreed. I do want to keep my postcount though, because I think it looks sexy.-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16975,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-25T11:16:35.000Z",
		"content": "Hah, yeah, it's sad to go back to the bottom ranks again! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopekeen.gif[/img] <br />But I guess from 0 the only way is upwards... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-yorp.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16976,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-10-25T12:56:36.000Z",
		"content": "@Flaose: not sure, but Vitamin Zach or Zorath (don't remember which one because of the Zs) had something to do with dev.pckf.com and wiki.pckf.com IIRC.<br /><br />@KeenRush: I am happy as long as I keep my custom title.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16977,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-10-25T15:42:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Who is it that registered pckf.com?[hr][/quote] <br />I thought Grafix did the PCKF thing. Haven't seen him around lately though...-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16978,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-25T19:04:35.000Z",
		"content": "Yeah, I'd remember it was grafix, too. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img]  Can't be sure, but it's not Zorath anyways, that's for sure.<br /><br />@Shadow Master: Hmmm, good point, we have to make sure those who had custom titles here will get them there. It's about time I change mine, however.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16979,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-26T01:51:11.000Z",
		"content": "The whois record for pckf.com indicates \"Vitamin\" Zach Perkins. That makes things easy.<br /><br />I'll see about setting up an NFS account specifically for the PCKF in a few days. My weekend is going to be rather busy."
	},
	{
		"id": 16980,
		"title": "Re: Status of Move?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-10-26T04:00:58.000Z",
		"content": "when does EZ board gold status or w/e it is expire?--------<br />Dear Mother, I can't believe what happened today! I met one of the smartest people in the whole Universe! His IQ is three f...<br />Hold on, Mother. Something strange is happening...<br />6234yuweyudfhjgfklgmm,/.,"
	},
	{
		"id": 16981,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-26T06:30:10.000Z",
		"content": "4-5 days--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16982,
		"title": "Re: Status of Move?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-10-26T06:54:28.000Z",
		"content": "Spleen, can you set up an account that multiple people can log in to without getting access to your own stuff?  I think we need to make sure a few people have access, since as you say, if you're busy for the weekend (or on holidays) we don't want any problems to knock the forum offline until the sole admin gets back.<br /><br />If it's possible to create an entirely separate account under a general PCKF name that would be even better, so it's not under a specific person's name.<font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16983,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-26T07:18:05.000Z",
		"content": "[hr]<b>Flaose</b> 4-5 days<br />[hr]Woot, how's that for timing?<br /><br />[hr]<b>Malvineous</b> Spleen, can you set up an account that multiple people can log in to without getting access to your own stuff?<br /><br />If it's possible to create an entirely separate account under a general PCKF name that would be even better, so it's not under a specific person's name.<br />[hr]Yup, that be the plan. How many NFSers do we have around here?<br /><br />I'm working on creating a new account as generically as possible. It's best I put it under my name though, so there's actually someone physically representing it. I just need to create a new email address for it.<br /><br />I'm looking into setting up a PayPal donation system. It's possible to do this through NearlyFreeSpeech, but the funds cannot be withdrawn once deposited, so we'd have to be certain that this is the place we want to be (which indeed we pretty much are), and that we're not planning to use the money for other purposes besides bandwidth."
	},
	{
		"id": 16984,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-26T09:34:24.000Z",
		"content": "Hold your horses people, it's moving *very* soon (in a few days) officially, it'd be a bit pointless to start another one just now.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16985,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-26T09:47:54.000Z",
		"content": "Some communication would be nice...<br /><br />It had better be good."
	},
	{
		"id": 16986,
		"title": "Re: Status of Move?",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-10-26T09:48:12.000Z",
		"content": "oh so we are moving?<br /><br />eeeeek!\"God is love.\" 1 john 4:8<br />\"Love is not jealous.\" 1 corinthians 13:4<br />\"I, the Lord thy God, am a jealous god.\" exodus 20:5<br /><br />[img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 16987,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-26T09:59:43.000Z",
		"content": "Sorry, even the place wasn't known until today or so... I got to hear it only this morning. And besides, I'm not the one who's doing it, so I'm technically not responsible for informing anything -- not that there was anything to say. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img] <br /><br />KeenEmpire, yes...3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16988,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-26T10:07:58.000Z",
		"content": "[hr]<b>KeenRush</b> I got to hear it only this morning.<br />[hr]Don't worry, I wasn't aiming the comment at you.<br /><br />I just hope it gets done right, as was assured by way of the discussion in this thread. This sort of silent autocratic process is not to my liking."
	},
	{
		"id": 16989,
		"title": "Re: Status of Move?",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-10-26T10:55:48.000Z",
		"content": "Yeah I agree, it would've been nice to know what's going on - yet another reason why we should have more (active) community members at the helm.<br /><br />Maybe you should put that NFS account on standby Spleen, just on the offchance we move to Yuku or whatever it's called [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 16990,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-10-26T12:45:38.000Z",
		"content": "Now I'm confused. So WHO is moving us?-----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16991,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-10-26T13:06:08.000Z",
		"content": "???<br /><br />We are moving in the next few days? Oh. Oh. Oh.<br /><br />Nice to know. But I can't understand... who is moving it? Where is it moving? Where am I? Why there is no order in the complex number field?------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 16992,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-26T15:11:39.000Z",
		"content": "Andrew's putting aside a nice little spot on his server for us and setting up another phpBB.  So, it'll be similar to Keen: Modding, though I suppose we can modify it quite a bit to our liking.  Once it's there, well it can be modified to everyone's liking.<br /><br />Yeah, sorry for the sort of surprise this all is though...it was kind of sudden.<br /><br />So what we have: A completely free message board system (phpBB)<br />A stable server (Andrew Durdin's)<br /><br />What we don't have: An address (yet.  Soon though)--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16993,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-26T15:28:40.000Z",
		"content": "I see. <i>That</i> sounds like a good scenario. If Andy's putting it into place, we can be sure it'll be done properly. I am now quite looking forward to this.<br /><br />[hr]<b>Flaose</b> Once it's there, well it can be modified to everyone's liking.<br />[hr]We'll finally have a use for grafix's phpbb hacking project!<br /><br />[hr]<b>Flaose</b> What we don't have: An address (yet. Soon though)<br />[hr]Wouldn't we just be changing the redirect for pckf.com to the new URL? Or preferably, configuring the DNS to properly link into the durdin.net servers...<br /><br />Will it be configured to share usernames between the two forums? That would be so very neat."
	},
	{
		"id": 16994,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-10-26T15:30:54.000Z",
		"content": "I got nothin' specific to say--just general optimism and support.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 16995,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-26T15:40:53.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>Originally Posted by: Commander Spleen</i><br />Wouldn't we just be changing the redirect for pckf.com to the new URL? Or preferably, configuring the DNS to properly link into the durdin.net servers...[hr][/quote]<br />It'll be changing to pckf.com yeah, I just mean there's nothing to link to quite yet.  However configuring the DNS to link properly would be best, we'll have to talk to Vitamin Zach about that once the board is set up.<br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Originally Posted by: Commander Spleen</i><br />Will it be configured to share usernames between the two forums? That would be so very neat.[hr][/quote]<br />I know lots of people would like that (personally I don't care, heh) but I'm not sure how it's done.  Can light be shed on the subject?--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 16996,
		"title": "Re: Status of Move?",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-10-26T16:11:57.000Z",
		"content": "*High fives some random person in the face.*<br /><br />So you see? Doing ABSOLUTELY NOTHING does get things done! My theory is proven!<br /><br />It just is slower than what it would have been with more a proactive route.-----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 16997,
		"title": "Re: Status of Move?",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2007-10-26T17:16:03.000Z",
		"content": "Ah Andrew will be hosting this site? That is good news, hopefully the forum can be fused together in a satisfactionary  way. -----------------<br />[img]http://www.jamster.co.uk/s/jcw/img/logo_jamster_navi.gif[/img][img]http://www.jamster.co.uk/storage/view/335/0/cr/CrazyFrog___Axel_F_Falling.gif[/img]"
	},
	{
		"id": 16998,
		"title": "Re: Status of Move?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-10-26T20:06:57.000Z",
		"content": "Good idea, I (once again) didn't even think of that, it'd be cool if the same user accounts could work on both boards. No idea whether it's possible or not.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 16999,
		"title": "Re: Status of Move?",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-10-26T22:09:20.000Z",
		"content": "will the threads be moved?<br /><br />or do i have to start backing up\"God is love.\" 1 john 4:8<br />\"Love is not jealous.\" 1 corinthians 13:4<br />\"I, the Lord thy God, am a jealous god.\" exodus 20:5<br /><br />[img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 17000,
		"title": "Re: Status of Move?",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-27T00:20:21.000Z",
		"content": "A test transfer from ezBoard to phpbb took place a long while ago, so all the threads that have survived ezBoard will make their way across to the new board.<br /><br />Though it would be nice if we could somehow archive threads beyond a certain age to keep things as close to a new slate as possible without interrupting our currently active conversations."
	},
	{
		"id": 17001,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-27T16:04:00.000Z",
		"content": "Well, the forum now exists.  Just give us a day or two to begin to set things up before The Big Move.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 17002,
		"title": "Re: Status of Move?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-10-27T20:56:40.000Z",
		"content": "Do you still need a hand converting the posts and everything, or do you have that sorted now?"
	},
	{
		"id": 17007,
		"title": "Re: Status of Move?",
		"author_id": 1485694,
		"author_name": "jimmyjames",
		"timestamp": "2007-10-28T15:09:37.000Z",
		"content": "We're finally moving?______________________________________________________<br />So what if i ask dumb questions im only 12."
	},
	{
		"id": 17003,
		"title": "Re: Status of Move?",
		"author_id": 1486239,
		"author_name": "ElecDude33",
		"timestamp": "2007-10-28T16:13:40.000Z",
		"content": "Sweet. ------------------<br />[url=http://www.ericmushroomwilson.co.uk/] My website[/url]<br />[url=http://ericmushroom.livejournal.com/]My stupid journal thing[/url]"
	},
	{
		"id": 17008,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-28T16:18:21.000Z",
		"content": "grafix, yes I think a hand will be needed in converting.--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 17004,
		"title": "Re: Status of Move?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-10-28T18:10:14.000Z",
		"content": "Finally moving? Great! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  So is there going to be some sort of site around it, or just forums?<br /><br />Though, phpBB? Better install a hell of a lot of anti spambot security, then. In my experience phpBB is quite prone to spambots. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] ____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 17009,
		"title": "Re: Status of Move?",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-10-29T14:24:38.000Z",
		"content": "I can ask the admins of the forums I moderate (phpBB 2) for recommendations.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 17005,
		"title": "Re: Status of Move?",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-10-29T19:05:57.000Z",
		"content": "The registration protection Andy installed on K:M seems to have worked quite well - it asks a series of Keen-related questions, with the order of the answers and the questions themselves changed each time. Of course, there are plenty of other issues with phpBB as well; none of them are as significant as those present in the ezBoard software, so we can cope with them for a period of time whilst we review the alternatives.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 17010,
		"title": "Re: Status of Move?",
		"author_id": 1485565,
		"author_name": "memsys",
		"timestamp": "2007-10-30T19:56:02.000Z",
		"content": "FINALLY we are moving bye bye crappy ezboard [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br />i do hope all will be converted correct[url=http://profile.xfire.com/memsys][img]http://miniprofile.xfire.com/bg/bg/type/2/memsys.png[/img][/url]"
	},
	{
		"id": 17006,
		"title": "Re: Status of Move?",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-10-31T20:58:52.000Z",
		"content": "This forum is dying.  Slowly it is freezing over. Farewell friend of many years!\"God is love.\" 1 john 4:8<br />\"Love is not jealous.\" 1 corinthians 13:4<br />\"I, the Lord thy God, am a jealous god.\" exodus 20:5<br /><br />[img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 17011,
		"title": "Re: Status of Move?",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-10-31T21:40:37.000Z",
		"content": "Go there now: [url=http://pckf.keenmodding.org]pckf.keenmodding.org[/url]--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	}
]
