[
	{
		"id": 674,
		"title": "A death",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-05T20:06:17.000Z",
		"content": "I heard today from folks and sister that some young woman (a year younger than me, I guess) had died in an accident, a car had crashed in her bicycle. I couldn't connect the name with any face or anything after I heard it, but my sister thought she had heard the name and thought the girl had been in the same high school where she is now -- and where I had been before. And true enough, I decided to check my high school year book and look at the persons one year younger, and there was the name and face. It was strange seeing that face there, even if I certainly didn't know her, never said a word or anything.<br /><br />I don't know much about the actual accident, but it must've been horrible for her to see a car approaching and know that there's nothing she can do anymore. (In case she saw it. But it feels somehow more horrible if she didn't, I guess.) She had been in university for two days (since it just started), seemingly a bright girl with hopes and dreams for the future, all gone now.<br /><br />You guys probably get a good laugh about my sentimentality; I know (duh) millions of people (or perhaps a bit less) die every day, but it doesn't affect me most of the time, but for some reason this did.<br /><br />Anyways, we're too fragile... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-no.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18192,
		"title": "Re: A death",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-09-05T20:12:12.000Z",
		"content": "I feel sad when I hear about the deaths of people I am connected to in some way, no matter how small. I even felt sad when I heard about Joe Capricorn's dad dying, despite having only read a few of his posts."
	},
	{
		"id": 18193,
		"title": "Re: A death",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-09-05T21:18:32.000Z",
		"content": "i knew some1 who's mother died in a car accident when this some1 was fairly young. i agree that we're too fragile, and that it's always been that way. And for the record, i don't get a good laugh from your sentimentality.<br /><br />These things make me think--don't u think it'd be better to have universal buses than the way it is now? We would save so so much, like gas, space (no huge parking lots), time (cuz u can do other things while riding) and energy (no insurance hassels), and we'd get more exercise cuz u'd have to walk a block or two from drop off. And of course saving lives because hopefully no more drunk driving and hopefully driving would be held to a higher standard.<br /><br />and i couldn't believe it when i heard it, but my economics professor said that New York or some city was heading in that direction until the car companies bought out a lot of the busses and just dumped them--there r photos of huge piles of busses, which i haven't looked for yet. i would love to see the cost-benefit analysis of what it would take to change to that system nation-wide and how much we'd save in just 5 or 10 years after its implemented.<br /><br />i do drive, but i hope to move to a big city so that i won't have to. I can only drive smart and pray that it doesn't happen to me, and that i don't hurt any1 myself. My condolences, KR.Ever notice how master mind and Mortimer McMire coincide?"
	},
	{
		"id": 18194,
		"title": "Re: A death",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-05T21:31:02.000Z",
		"content": "I'd love that 'universal bus' idea, or something like that. It'd be perfect -- thus not gonna happen...3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18195,
		"title": "Re: A death",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-09-06T00:36:39.000Z",
		"content": "me2; i suppose there is still hope, though--hope that AI and a system to keep track of all nearby vehicles will be able to allow computers to control everything. Then THAT would save lives (still not as resource saving as universal busses, unless u combine them both)--that is, it will save a lot of ppl as long as it's mandatory.<br /><br />the only thing missing from my analogy is what it would take to make the transition from personal cars to a full bus system. I'm sure it's a heck of a lot of money and time, but i would not be surprised if the savings of this system more than make up for it. The only thing that really concerns me about it is the loss of the huge car companies and jobs and thus the economic damage. Still, we should still be able to convert a lot of those jobs to the busses themselves.<br /><br />Isn't there a country in Europe that already has this system where it's illegal to own a car? It was a small rich one, but i can't find it on wikipedia or google.Ever notice how master mind and Mortimer McMire coincide?"
	},
	{
		"id": 18196,
		"title": "Re: A death",
		"author_id": 1486917,
		"author_name": "Flaose",
		"timestamp": "2007-09-06T19:54:37.000Z",
		"content": "I'm sorry to hear that KR.  I find it so weird when somebody I know (at least by sight) dies.  It's like a huge void in my memory, as if the person suddenly ceases to exist whereas I imagine others continuing with their lives even I don't really know what they're up to.<br /><br />Which is true, in a sense, I suppose...--------------------<br />[url=http://www.classicgaming.com/cc314/]Cerebral Cortex 314[/url] - For All of your Commander Keen Needs.<br />[url=http://www.classicgaming.com/cc314/dave/joes.html]Eat at Joes[/url]"
	},
	{
		"id": 18197,
		"title": "Re: A death",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2007-09-06T20:28:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]These things make me think--don't u think it'd be better to have universal buses than the way it is now?[hr][/quote]<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-confused.gif[/img] <br /><br />I am laughing. Here how about this. YOU can ride the public transpotation and <b>I'LL</b> keep my Chevy Blazer and Plymouth Sundance. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  Also, yes. I feel MUCH safer riding next to a man who hasn't showered in a week while I no longer am at the responsibility of my own safty but now have that in the hands of a bus driver.<br /><br />[quote]<b><i>Quote:</i></b>[hr]and we'd get more exercise cuz u'd have to walk a block or two from drop off.[hr][/quote]<br />Oh yeah. That's EXACTLY what I fucking need. More walking. That'll REALLY help my physical condition. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-annoyed.gif[/img]:\"&gt;  Fuck that. I'll continue to use my car and park in the handicapped spots.<br /><br />[quote]<b><i>Quote:</i></b>[hr]hope that AI and a system to keep track of all nearby vehicles will be able to allow computers to control everything.[hr][/quote]<br />Or you know... you could use the most advanced AI system ever developed to keep track of vehicles. It's called LOOK AROUND. That's how we saved lives in the Marines at least. It worked pretty well for us.<br /><br />[quote]<b><i>Quote:</i></b>[hr]The only thing that really concerns me about it is the loss of the huge car companies and jobs and thus the economic damage.[hr][/quote]<br />You also have to keep in mind, if there IS a huge public transportation system that is implemented then you have factoies BUILDING the things, people to drive them and people to maintain them.<br /><br />[quote]<b><i>Quote:</i></b>[hr]Isn't there a country in Europe that already has this system where it's illegal to own a car? It was a small rich one, but i can't find it on wikipedia or google.[hr][/quote] <br />Yes it's called Rutos. Can't find it? Keep looking. It's somewhere west of Russia.<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-rolleyes.gif[/img] <br /><br />[quote]<b><i>Quote:</i></b>[hr]<b>KR:</b> Anyways, we're too fragile... [hr][/quote]<br />I BEG to disagree. You slam a 2 ton vehicle into a tree going 45 MPH and that tree is going to be MESSED up. You slam into someone on a BIKE with a 2 ton vehicle going 35 they are going to be dead. You hit a DEER with a pickup and you ruin your truck and you kill the deer. <br /><br />You sideline your Chevy Cavolier into a tree going 70 - 95 MPH and catch about 10 - 20 feet of air (Horisontally, not vertially.) before crashing into a telephone post and some trees, and crawl out with nothing but a rub burn on your chest from where the seat belt was while your car is a twisted wreck of red painted metal. (Personal experience.)<br /><br />Death is most of the time predictable but no one can say why it happens or why it didn't. And no I don't laugh at people who are sentimental.<br /><br />This reminds me of when I was a senior in High School. Some pretty popular kids (They were well known but I didn't talk to them much because they were a grade below me.) died in a car accident. They smoked on the weed then went driving and hit a tree at like 95. I think 3 kids died instantly. The driver was sued by the surviving families for 3 MILLION dollars. (Yes... this is true. He ows 3 million. If I were him I would just move to Canada and say \"screw it.\" But then again it didn't happen to me so...)<br /><br />Interesting words Mr. Rush. I doubt I would feel any connection or remorse if I didn't know the person, even if they were in one of my classes. I WOULD feel bad if say, I found out my buddy Chad died. I honestly don't know what I would feel like.<br /><br />I *DO* know that if my dad died I would probably go to Hershy Park. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-pig.gif[/img] -----------------------<br />The end of this post. You may stop reading now."
	},
	{
		"id": 18198,
		"title": "Re: A death",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2007-09-07T05:41:44.000Z",
		"content": "Why r u being this way, Galax? If u disagree u can say so, u don't have to say f it nor include your blatant sarcasm for half your post.Ever notice how master mind and Mortimer McMire coincide?"
	},
	{
		"id": 18199,
		"title": "Re: A death",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-09-07T11:04:49.000Z",
		"content": "Well, you certainly were really lucky, but not everyone is so. I've heard of lot deaths and difficult permanent injuries when people have crashed into trees or other stuff and flown through the windshield... Surviving so intact is very rare.<br /><br />And I'd say death is extremely unpredictable. It lurks everywhere. You slip in shower or stairs and crack your skull. Doesn't make me think we're not too fragile...3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 18200,
		"title": "Re: A death",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-09-07T11:36:22.000Z",
		"content": "We're so fragile, yet we do not take care of ourselves all that much sometimes. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img] <br /><br />Sorry to hear that. It's always bad if someone dies.____________<br />Don't see me as an ordinary man.<br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]<br />Oh, and [url=http://www.tengusoft.net/]Team[/url]."
	},
	{
		"id": 18201,
		"title": "A life",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-10-13T12:02:10.000Z",
		"content": "I've known a couple of people who have died in car accidents. In both instances it seemed no different to before, since they were both people with whom I'd not associated for some time. It was just as though they were among the innumerable people I've known but who have moved on out of my life and I never expect to see again. <br /><br />The funerals made it real to me, and made me appreciate just what each person had meant in my life, and indeed the lives of the vast circle of people who attended.<br /><br />It's interesting that these things happen so frequently to those who we would consider to have 'bright futures'. Smart, happy, undeniably present. Gives me reason to think they've just outgrown their lives here and have more important things to attend to, like those who move on from the PCKF.<br /><br />I had an interesting dream many years ago (and before the aforementioned deaths) in which a close friend, known as Donny, had died by some undisclosed means. I was attending a party with some friends, and thought it strange that it didn't bother me. I kind of shrugged and thought, \"Hmm, Donny's dead... that's weird.\"<br /><br />There's something that makes this particularly intriguing. Around the time KeenRush posted this, I was on my holiday to Queensland with Donny and his girlfriend, Caz. Caz had a dream just like mine, where Donny had died and she wasn't upset at all, just thought about how strange it was.<br /><br />Now it really <i>would</i> be weird.<br /><br />Now that I think about it, my beliefs work fairly well with that theme. I've experienced enough supernatural weirdness and uncanny coincidences to form a good basis for a belief that when people die it is just like if they'd simply moved out of your life like so many others do. As if this existence is a toy and they're done playing with it for now."
	}
]
