[
	{
		"id": 1177,
		"title": "Restraint",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-04-21T01:52:05.000Z",
		"content": "excluding me of course, have you ever offended others by posting (anti-american slogans, flame wars, policits, etc) &amp; knew you had to have restraint but wasn't showing it, recieved a few warnings by the mods &amp; admins telling you to stop it or leave, that's was the case with me a while back, but lately i have tried very hard to keep those sort of matter's to myself, cos the fact is that no one on this board cares about those sort of things, surely we may hate the leaders of some country, like i hate george bush but some of the people of one country actually can be nice people &amp; we shouldn't hold it against the people but actually hold it against the leaders of that nation<br /><br />anyway i think that's enough<br /><br />vote yes if think you can stop yourself from going too far<br />vote no if you think you can't stop yourself<br />or<br />vote don't know if you are not to sure[url=http://www.lot123.com.au/cgi-bin/auction/lot123.pl?refno=Rorie][img]http://www.lot123.com.au/i/banner01.gif[/img][/url]]<br /><br /><b>A cheaper alternative to ebay, plus earn points to use as cash on the site, Register with the link above &amp; include Rorie as the referer &amp; for each signup i will be adwarded 140 points you can do the same too, my apologizes lot123.com.au is only available to australian residents</b>"
	},
	{
		"id": 26151,
		"title": "Re: Restraint",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-04-21T13:04:57.000Z",
		"content": "Yeah I know what you mean. Sometimes I can be very mad at the government of some countries because the people that live there. But you know the government can't help it so I don't hold up against them. -----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 26152,
		"title": "Re: Restraint",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-04-21T13:11:02.000Z",
		"content": "To answer the poll question; yes, I think I can control myself enough. I do get angry to some posts or persons once in a while, but I guess I've managed to stay calm enough. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-wink.gif[/img] <br /><br />And yeah, there can be nice people even if the government sucks.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 26153,
		"title": "Re: Restraint",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-04-21T16:49:11.000Z",
		"content": "Well, I usually have myself under control, and I don't think I have offended anyone.<br />Of course I can't be sure; maybe I did offend people and they just didn't mention it afterwards.<br />Every government I know could be improved to some degree, but that's the way it is.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 26154,
		"title": "well..",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-04-21T21:55:14.000Z",
		"content": "Eh, I've made plenty of mistakes in the past (and present) but I wouldn't categorize any of them as \"going too far.\"  I think people who go to far are usually banned or otherwise removed from a community."
	},
	{
		"id": 26155,
		"title": "Re: well..",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-04-22T07:42:39.000Z",
		"content": "Bah! I've never insulted anyone!<br /><br />And anyone who says so is just an ignorant Amrtician pig!<br /><br />&lt;.&lt;<br /><br />&gt;.&gt;A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	}
]
