[
	{
		"id": 430,
		"title": "The Pogo Vorticon computer.",
		"author_id": 1486808,
		"author_name": "Galaxieretter",
		"timestamp": "2006-01-30T04:30:54.000Z",
		"content": "So... something came up and for one reason or another I typed in \"Vorticon\" into google. The first thing that came up was for a computer workstation. About to move on I noticed that the company that MADE the computer was called \"Pogo Linux.\"<br /><br />Hmm<br /><br />[url=http://www.unixreview.com/documents/s=1780/urm0111i/]So I followed the link.[/url]<br /><br />I went to Pogo Linux's website and poked around.<br /><br />[url=http://www.pogolinux.com/cgi-bin/systemconfigurator.cgi?system=Vorticon64]And I found this.[/url]<br /><br />Apparently the Vorticon is a line of computers they make...<br />Hmm... coincidence? I think not... What do you think?-----------------------<br />[url=http://Galaxie.Spatang.com][img]http://i34.photobucket.com/albums/d134/Galaxieretter/Blegdandsmeegdbanner60copy.gif[/img][/url]"
	},
	{
		"id": 12718,
		"title": "Re: The Pogo Vorticon computer.",
		"author_id": 1485602,
		"author_name": "LevelLord00",
		"timestamp": "2006-01-30T07:19:59.000Z",
		"content": "Well, no, not at all.<br /><br />You see, around about 1970 the Vorticons, wanting to cash in on the rapidly expanding martian ecconomy [Which had escelated after the death of the Garg overlord] However, these efforts failed miserably as stuffed toy vorticons were not currently in demand by the Yorp population.<br /><br />Having travelled light years to Earth and having spent millions of credits in order to set up a profitable base somewhere off the coast of Cuba, its understandable that the Vorticons were unwilling to simply accept defeat and back out.<br /><br />To this end, and realizing the pitiful state of Earth computers the Vorticons renamed their company [FormerlyCanid Toys] to Linux, and after an informative visit by several solicitors [a degenerate species not present on Vorticon VI] re-renamed to Pogo Linuz, in honour of the holy pogo stick.<br /><br />They immediately began production of highly advanced and exceedingly efficient Vorticonn computers.<br /><br />However several weeks later the business immediately went into recievership and was purchased by a mysterious corporation known only as Motlo Ltd. Oddly, on the same night as the aquisition a mysterious cloaked figure was seen lurking around the premises and one of the vortiocns turned up [badly injured] at a [very surprised] local vet. Almost comatose and babbling incoherently in Vorticon with only a few understandable fragments of english. Before he was brainwashed by the government the vet said that the only information the alien had given him was that he had been 'beaten around by the sky.' This was interpreted as a possible attack by hostile Garg forces.<br /><br />A proud member of the Spleen Extinction society<br /><br />[img]http://img.photobucket.com/albums/v410/Gannalev/rcwn.png[/img]<br /><br />\"No one should be here.\"<br />-Levellord"
	},
	{
		"id": 12719,
		"title": "Re: The Pogo Vorticon computer.",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-01-30T08:14:05.000Z",
		"content": "Whoaly garg! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  It must be some Keen fans working there, it can't be coincidence that they use two Keen related works 'pogo' and 'vorticon'. Awesome!<b>Eat your veggies!</b>"
	},
	{
		"id": 12720,
		"title": "Re: The Pogo Vorticon computer.",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-01-30T08:57:53.000Z",
		"content": "I noticed that a while back as well - but I didn't see the \"Pogo\" and \"Vorticon\" connection. Nice! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]"
	}
]
