[
	{
		"id": 884,
		"title": "I think i need help",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-02-24T04:37:23.000Z",
		"content": "okay, it all started back in 1993 i start a new school &amp; thought i was going to enjoy it, but during the 6 years i was there, i was bullied &amp; attacked by the students, of course i wasn't the perfect student ethier, i caused trouble also didn't pay much attention to school work spent most of all time in the dentention room for my actions, before being booted out in 1999 at age 15, on the 21 of october 1999 a day after then when i turned 16 i have spent most of my day at st.laurence &amp; of course it was a rough start but my behaviour got better, thanks to several medications (took years to find the right one) but it wasn't over then and just now i have been having nightmares getting even by delivering revenge like burn the school down, start a hostage siege, but i'm not like that seriously surely i was a bad student but breaking the law by arson or murder's not the way, not even revenge, i think i need help but i not know what to do, i just wish my nightmares would go away<br /><br />i would appreciate any advice you people would have[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 21973,
		"title": "Re: I think i need help",
		"author_id": 1485788,
		"author_name": "lemur821",
		"timestamp": "2006-02-24T06:37:12.000Z",
		"content": "IANAS (I Am Not A Shrink), but I would recommend visiting one. If you have thoughts and feelings that you aren't happy with and you don't know how to stop them yourself, then that's the person to talk to.<br /><br />EDIT: On a cheaper note, you already know what's bothering you, so you can at least begin to work through it on your own. You're having vengeful thoughts which you can't control and you don't like it. To me this says that you don't have effective coping strategies for dealing with strong feelings. Not with angry ones anyway. That's not your fault, but it's a very good thing to learn them. Personally, I find that when I have an upsetting thought and can't reason through it to a conclusion that I can accept then it helps to put it back on the shelf for a while and revisit it when I'm calmer. I've learned to put things temporarily out of my mind to avoid stewing over them. Sometimes it takes several tries to stop thinking about something. I'll have to push it back every time it tries to come up, and eventually I manage it. It took me a while to learn to do it. That's just one thing that I do. It may be something that would work for you, or it might not be, but it's an example of a coping strategy. The idea is to figure out the paths your thoughts are traveling down and to redirect them to a healthier place when you notice yourself doing it.________________<br />[img]http://img.photobucket.com/albums/v462/lemur821/toughyorp.png[/img]"
	},
	{
		"id": 21974,
		"title": "Re: I think i need help",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-02-25T10:54:25.000Z",
		"content": "Yeah, no revenge should be attempted. Yeah, I guess going to see some shrink/whatever might be good. Personally I wouldn't probably go but that's only because it'd take too much time spare time and I would get annoyed.<br />But yeah, hopefully you'll get rid of those nightmares sometime. I guess you just have to convince yourself somehow that you really don't want to do so. IANAS..3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21975,
		"title": "Re: I think i need help",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-02-25T18:55:07.000Z",
		"content": "You have except that by putting yourself in jail, you are giving them the pleasure of winning.<br /><br />I would suggest seeing a physcologist.  They can help better than anything I could do.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21976,
		"title": "Re: I think i need help",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-02-28T02:14:55.000Z",
		"content": "i am thinking of seeing a counseller that i have seen b4, maby he could help me? [url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 21977,
		"title": "Re: I think i need help",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-02-28T02:44:41.000Z",
		"content": "I'm fairly sure that yes, so go ahead.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 21978,
		"title": "Re: I think i need help",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-01T03:22:11.000Z",
		"content": "Agreed.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21979,
		"title": "Re: I think i need help",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-03-03T02:50:09.000Z",
		"content": "i will start seeing a shrink, consuller whatever u want 2 call it, from monday 6/3/06, so hopefully after 10 sessions, my nightmares will go away &amp; i won't do anything illegal in the future which is the way i'll be heading if this doesn't work[url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 21980,
		"title": "Re: I think i need help",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-04T17:09:11.000Z",
		"content": "3 months is a while away, no?<br /><br />Ah well, good luck man.  Best if wishes. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smoke.gif[/img] ~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21981,
		"title": "Re: I think i need help",
		"author_id": 1486364,
		"author_name": "Xtraverse",
		"timestamp": "2006-03-04T19:42:01.000Z",
		"content": "I think that would actually be 3 <i>days</i> away.  Not everyone uses american dates.[url=http://spatang.com/ck][img]http://spatang.com/ck/bannersm.jpg[/img][/url] [url=http://spatang.com/cosmo][img]http://spatang.com/cosmo/bannersm.jpg[/img][/url] [url=http://spatang.com/nukem][img]http://www.spatang.com/nukem/bannersm.jpg[/img][/url] [img]http://spatang.com/scrobblersig.php[/img]"
	},
	{
		"id": 21982,
		"title": "Re: I think i need help",
		"author_id": 1486279,
		"author_name": "LordOfGlobox",
		"timestamp": "2006-03-05T02:17:18.000Z",
		"content": "Ahh...<br /><br />That's wierd.<br /><br />People should start just saying March sixth.~~~~~~~~~~~~~~~~~~~~~~~<br />I've changed a lot since my last time on this forum..."
	},
	{
		"id": 21983,
		"title": "Re: I think i need help",
		"author_id": 1485645,
		"author_name": "Q90",
		"timestamp": "2006-03-16T02:53:35.000Z",
		"content": "What medication are you using?<br /><br />Edit: I'm glad to know you feel comfortable telling this to us."
	},
	{
		"id": 21984,
		"title": "Re: I think i need help",
		"author_id": 297417,
		"author_name": "rorie1983",
		"timestamp": "2006-03-16T04:10:07.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]What medication are you using?<br />Edit: I'm glad to know you feel comfortable telling this to us. [hr][/quote]<br /><br />zyprexa &amp; clonidine<br /><br />btw: it's nothing 2 do with medication, it's turned me from a violent person 2 a polite well behaved member of society<br /><br />i started conselling on the 6 of march &amp; my next appointment is on the 20 of march, so far everything is looking good<br /><br />but i still wished i could have listened 2 the teachers &amp; do the school work, cos if i had i wouldn't b the dumb person i am now,  [url=http://www.ironmaiden.com][img]http://i11.photobucket.com/albums/a199/rorie1983/ironmaiden.jpg[/img][/url]<br /><br />[url=http://simplythebest.net/fonts/fonts/font_downloads/iron_maiden.zip]Download the Iron Maiden font[/url]"
	},
	{
		"id": 21985,
		"title": "Re: I think i need help",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-03-16T20:11:11.000Z",
		"content": "The problem with revenge is that in general it never really accomplishes anything useful.<br /><br />First step in tacking problems is dividing them into 2 groups.<br />Things you can do something about.<br />Things you can't.<br /><br />If something falls in the second group, although it seems to be the worst of the 2, just (try and) forget about it, since there's no use worrying.<br />I guess your problem probably falls in that group, so your best option is (from my (I admit limited) perspective anyway) to try and forgive the idiots in your life for what they are, and get on with your life.<br />As for things you might have done wrong... everybody does that, it sucks, and since it's in the past there's nothing you can do about it anymore.<br />Just try to do better from now on.<br />And yes, I reached that conclusion more than once, I keep screwing up things myself. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <br /><br />If something falls in the first group, the problems you can influence somehow, the hard part is trying to figure out the most effective way to handle them.<br /><br />That's my 2 pence worth, but I'm not a professional advice giver, nor someone that has proven he knows what he's talking about. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	}
]
