[
	{
		"id": 45,
		"title": "Should Keen be ported to Xbox Live Arcade?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-02-23T16:59:18.000Z",
		"content": "Mostly just a question I'm asking about in curiosity...<br />Would it be fun if id Software (or Microsoft) ported Commander Keen (preferable the entire series, like what Keen Chronicles would've been) to Xbox Live Arcade?<br /><br />After I found out about the concept, I figured this would be neat.<br />[url=http://www.xboxic.com/news/177]Apparently[/url], the developer gets 70% of the sales, or if it lets Microsoft do the porting, 60%.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 2125,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-02-23T20:36:43.000Z",
		"content": "Well, of course they could port it to that too, but I would prefer more a port to PC to both Windows and Linux environments. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] 3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2126,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-02-23T21:53:47.000Z",
		"content": "Eww, no. I hate Xbox (and all other new games). [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-barf.gif[/img] <br />Besides, Keen belongs on PC.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 2127,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485755,
		"author_name": "Scizor CT",
		"timestamp": "2006-02-23T22:18:02.000Z",
		"content": "The Xbox systems essentially <i>are</i> PCs. ;p<br /><br />I wouldn't mind, personally. Any exposure Keen could get at this point would be a good thing."
	},
	{
		"id": 2128,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-02-28T13:33:45.000Z",
		"content": "My reasoning is like Scizor CT's, Keen on the Xbox could only improve the guy's popularity, let old fans remember, and maybe create new fans.<br />(Usually (always?) those downloadable games also have a free, downloadable demo to try before you buy.)<br /><br />I have this Keen - PC connection in my head as well, but in the end, does it really matter?<br />It's fun to have Keen as a PC icon, but again, more people playing would only be good if you ask me.<br />Also platform games would fit pretty decently on a console, obviously. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 2129,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2006-02-28T16:26:56.000Z",
		"content": "It'd be nice, but the game's horribly outdated and my experience with most people is that they are hungry for graphics (and have no respect for pixel art). So when ported to Xbox, the popularity wouldn't rise that much at all.<br /><br />Just an excuse to play Keen on TV. :P___________________<br />DaVince, Yet Another Amateur Game Creator! :P"
	},
	{
		"id": 2130,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-02-28T21:47:08.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]my experience with most people is that they are hungry for graphics (and have no respect for pixel art)[hr][/quote]<br /><br />Yeah, i know! No one cares at all. One sport game commercial only advertised with one thing - the fact that the people sweat! No \"This game is fun\" or anything. Just \"Oh, look, they sweat!\" [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dead.gif[/img] <br /><br />Besides, just one look at even the title turns people away. The only character i know of that lasted that had a play-on-words kinda name was Duke Nukem. I mean, Commander Keen does sound kind of dumb.<br /><br />And of course, people want only 3-D games. Even the great mario games are 3-D. Heck, even PACMAN is 3-D now. Stupid. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-shikadi.gif[/img] -Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 2131,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-02T01:16:41.000Z",
		"content": "Well, in my opinion they could have Keen on the consoles AND on PC. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  That would give him even more popularity.<br />I wouldn't like to buy a new console..<br /><br />\"The only character i know of that lasted that had a play-on-words kinda name was Duke Nukem. I mean, Commander Keen does sound kind of dumb.\"<br />[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  Not in my opinion. But hey, that was back in the good times when they gave the characters imaginative names instead of something \"futuristic\" and boring names they give them today.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2132,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-03-02T01:43:40.000Z",
		"content": "My first instinct is a single word response: \"No.\"  Ultimately, the level design and gameplay mechanics of an early 90's era game are too tired and trite to hold a modern audience's interest.  What it all comes down to is key-door, key-door, key-door.  I know that other modern games can be reduced to less, but I firmly believe the key-door process is too drawn out to hold most gamers' interests.<br /><br />The Commander Keen games, as they exist today, are the sort of \"Unlockable\" game a person would get in the updated, modern title.  See the original \"Prince of Persia\" unlockable in \"Prince of Persia: Sands of Time,\" or \"Wolfenstein 3d\" unlockable in \"Return to Castle Wolfenstein.\"<br /><br />What might work better, from a publishing point of view, would be to cram the entire early 90's era game library in a single package--the way SEGA has done with their \"Sonic Mega Collection\" packages.  Unfortunately, that applies more to Apogee, which could do a Keen-Cosmo-Duke-Word/Math-SecretAgent-CrystalCaves combination for around $40, easy.  And they'd walk away with 70% of that just for writing a front-end that loads the games.  <br /><br />But Keen as a standalone product?  I can't see it.  Maybe if it was bundled with a frontend which allowed the playing of mods, and even the creation of mods... but that's venturing into a grey area, and ID would squash that bug without question. [img]http://www.classicgaming.com/cc314/msgboard/posted-pics/XkyRauhKeenLogo.png[/img]"
	},
	{
		"id": 2133,
		"title": "Re: well...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-03-02T10:18:54.000Z",
		"content": "\"I know that other modern games can be reduced to less, but I firmly believe the key-door process is too drawn out to hold most gamers' interests.\"<br />Heh, it indeed is too drawn out to hold FPS gamers' interest -- it's way too complicated scheme.<br /><br />Hmmm, good idea, it'd be neat to have something like that -- Keens and Crystal Caves and Wacky Wheels etc in the same package.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2134,
		"title": "Re: well...",
		"author_id": 1485695,
		"author_name": "Genius314",
		"timestamp": "2006-03-02T13:48:31.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Heh, it indeed is too drawn out to hold FPS gamers' interest[hr][/quote]<br /><br />\"Shoot, Shoot, Hungry\"? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-dopefish.gif[/img] <br /><br />I think if Keen was ever remade, they should include the classics in it.-Genius314<br />[url=http://planetck.spatang.com]PlanetCK[/url]"
	},
	{
		"id": 2135,
		"title": "Re: well...",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-03-02T16:54:57.000Z",
		"content": "Although some of the Xbox Live Arcade games are brand new surround sound HD games, some are more-or-less recent, ported games like Zuma, the [url=http://en.wikipedia.org/wiki/Xbox_Live_Arcade]list[/url] also includes Joust, which, although I have very fond memories of it, isn't exactly a good example of modern gameplay, considering it's much older than Keen.<br />The game doesn't need to cost a whole lot either; the cheaper games cost only 400 [url=http://en.wikipedia.org/wiki/Microsoft_Points]Microsoft Points[/url], but I'm not sure if that is the absolute minimum it can go.<br />Of course even if, or rather especially if, the games would be dirt cheap, the question is if it would be worth it for the developer to port the thing.<br /><br />Anyway, my point is the fact that it's an old game doesn't automatically exclude it from XLA.<br />I (obviously) would rather see an Apogee Classics (or something) package as well, to make it more worth the while.Retodon8<br />You live, you die, you are remembered, you are forgotten. [url=http://keen.retodon8.net/][img]http://retodon8.net/Graphics/Keen_Yorp.gif[/img][/url]"
	},
	{
		"id": 2136,
		"title": "well...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2006-03-02T17:01:24.000Z",
		"content": "Joust is a game like Space Invaders or Asteroids--it's about survival.  You're given one screen-worth of space to work with, given a simple set of abilities, and just told to \"survive as long as possible.\"  It's a game based off of achieving a high score, and competing with/working with the second player.  A good team can last hours... fierce competitors will be on their final life before the first wave has passed.  :-)  It's an entirely different style of game."
	},
	{
		"id": 2137,
		"title": "Re: well...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2006-03-11T23:22:45.000Z",
		"content": "Hmm... I wouldn't mind; I've akways wished I could have had Keen on my cell phone, but X-Box; Sooweet!!!<br /><br />BTW, for all you doubters, my friends PC is a hacked up X-box with a copy of Windows XP Pro. X-boxes are just really powerfull PCs, which, when hacked up, have insain graphics (X-box 360).Tough Guys Wear Pink!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 2138,
		"title": "Re: well...",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2006-03-12T21:56:21.000Z",
		"content": "I assume he's running it on an old XBox - the Xbox 360 uses PowerPC processors (like old Macs) so it won't be able to run Windows XP without an emulator. The Xbox 360 is incredibly powerful (3 x 3.2GHz processors and 512MB memory... [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] ) but the Xbox is a piece of junk which was slow even when it was released.[url=http://toxicsheep.com]toxicsheep.com[/url] | [url=http://commanderkeen.org]coming up next...[/url]"
	},
	{
		"id": 2139,
		"title": "Re: well...",
		"author_id": 1486154,
		"author_name": "thenewmoonsidianX",
		"timestamp": "2006-03-13T00:03:59.000Z",
		"content": "I don't own an Xbox, but if 3D Realms (aka Apogee) were to compile a collection of all those classic PC games (Keen, Cosmo, the sidescrolling Duke Nukems, Monster Bash, etc.) onto a console CD, or even a PC CD made to run on newer computers, it'd be awesome.  <br /><br />The problem is that other collection games like Sonic Mega Collection and the Mega Man Collection were marketing successes (I assume) because most gamers still know about and recognize those characters, while those same gamers would probably say, \"Commander who?\"<br /><br />But it would be cool, as Xky said, if id or 3D Realms were to include a Keen game as an unlockable feature in another one of their games.  If they did that, I would buy it solely for the Keen game...[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 2140,
		"title": "Re: well...",
		"author_id": 1486128,
		"author_name": "najawa.e",
		"timestamp": "2006-03-15T00:13:50.000Z",
		"content": "Yeah... I meant that the X-box worked awesome, and it'd be cool if a 360 were hacked up, cause those graphics are insain.<br /><br />About X-box: Yeah, it may have been slow... but geez, it woops PS2 and GameCube any day, any week!<br /><br />X-box... for now.<br /><br />I don't care... just as long as it's Keen.<br /><br />They can screw it up, it may not be cannon, but it's Keen. It may be crap... but it beats Need4Speed anyday!Tough Guys Wear Pink!!!<br />[img]http://i15.photobucket.com/albums/a371/najawa/Modding/tough_guys_wear_pink.jpg[/img]<br />Visit My site at [url=http://www.najawa.com]www.najawa.com[/url]<br />[url=http://kevan.org/brain.cgi?Najawa]Click Here!!! Please!!![/url]<br />-- NAJAWA --"
	},
	{
		"id": 2141,
		"title": "Re: well...",
		"author_id": 989154,
		"author_name": "Djaser",
		"timestamp": "2006-03-16T13:15:27.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]The problem is that other collection games like Sonic Mega Collection and the Mega Man Collection were marketing successes (I assume) because most gamers still know about and recognize those characters, while those same gamers would probably say, \"Commander who?\"[hr][/quote]<br />I think Keen is as much populair as those characters among the older gamers, the newest generation doesn't probably know him anymore. I'm always surprised how many people still know Keen when I play it on my laptop, even when it's a modification they still recognise him. -----------------<br />[img]http://www.geocities.com/anthalerero/pic/banner_eurovision.jpg[/img]"
	},
	{
		"id": 2142,
		"title": "Re: well...",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-12T16:32:26.000Z",
		"content": "Pretty relevant is this [url=http://www.360monster.com/newspost.php?id=0000001327]link[/url].<br />If it does happen, I'll be sure to buy it.<br />Not sure about Doom, since I'm happily playing GZDoom (an enhanced Windows port) on my PC.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2143,
		"title": "Re: well...",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2006-10-12T20:31:27.000Z",
		"content": "Hah, I'll buy it even if I don't have an X-Box! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />Edit: That is, in case something happens.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 2144,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485755,
		"author_name": "Scizor CT",
		"timestamp": "2006-10-12T20:37:35.000Z",
		"content": "Hmm. Good news in the sense that Keen getting more exposure is a good thing. Bad news in the sense that Tom Hall will likely never get to touch the IP again as long as id keeps making money from it. Unless they make <i>so much</i> money that they decide to do another one and bring him onboard for it.<br /><br />Wishful thinking, I know."
	},
	{
		"id": 2145,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1485548,
		"author_name": "Apocalypse Gohan",
		"timestamp": "2006-10-13T09:33:53.000Z",
		"content": "If Keen is ported to Xbox Live Arcade, do you think they'll make new levels or a new keen game exclusive to xbox live to make you buy it?<br /><br />Also if they port keen to xbox live will they update the graphics?<br /><br />I would buy it just to get it on the pc somehow.[img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]"
	},
	{
		"id": 2146,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-10-13T12:21:29.000Z",
		"content": "So far most (all?) port have been pretty much identical to the originals.<br />Usually, on a widescreen TV, there's just a large border on the left and right so the game still has the original aspect ratio.<br />A higher resolution I guess, but graphics aren't usually redrawn, so it matters little.<br />New stuff: Menus featuring Xbox 360 stuff, support for controller and other hardware of course, Achievements... not much more.<br />With a lot of new stuff the game wouldn't be a port, but a remake, or a completely new game perhaps.<br />Anyway, if this does happen, I wouldn't expect new levels.<br />Doom didn't/doesn't.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2147,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1486906,
		"author_name": "MortimerInBlack",
		"timestamp": "2006-10-15T05:39:55.000Z",
		"content": "I dont understand your opinions at all. Keen getting more popularity is a BAD THING, because then ID will have a real reason to hold on to the rights. The only way I ever want Keen gaining popularity is after Tom Hall has it, and the only official Keen stuff that should ever come out anymore should be one's with Tom Hall in complete control, as any true Keener knows.<br />I was so glad that keen GBC was a dud, so that it never brought it bak to popularity. Why do you all want ID making official keen stuff anymore?- .... . / ..-  -. .. ...- . .-. ... . / .. ... / - --- .- ... - / .-."
	},
	{
		"id": 2148,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1486519,
		"author_name": "Damien SR",
		"timestamp": "2006-11-22T21:33:18.000Z",
		"content": "If Keen would be ported to a modern video game console, any respect people could possibly gain for Keen in the future would be lost.  Even if it was made obvious that it was a \"legenday 1990-1992 PC game\" people would tie Keen to \"obsolete graphics\" and \"old-fashioned gameplay\".<br /><br />It's be much better if the next release of a Keen game would be something for the public to respect.  Already, Keen GBC is giving the Keen name a bad reputation.<br /><br />Not that I'm against the idea of the old Keens being released, but if it's released for a video game console, gamers will think it's being released <i>as a modern game</i>, and as a modern game, it wouldn't be able to gain <b>any</b> respect."
	},
	{
		"id": 2149,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1215771,
		"author_name": "allstories",
		"timestamp": "2006-11-22T22:34:21.000Z",
		"content": "No they wouldn't. Not if it was released on XBox Live Arcade. I thought that it was implied that games downloaded from there are not full games. They released the original Doom to it IIRC.[center]<font color=\"MAROON\">TOUGH GUYS DON'T FOLLOW FADS</font>[/center]"
	},
	{
		"id": 2151,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 297693,
		"author_name": "Retodon8",
		"timestamp": "2006-11-25T23:25:00.000Z",
		"content": "MortimerInBlack has a point, Keen becoming popular now might mean id wouldn't let hem go, which wouldn't be the optimal situation.<br />Then again, thinking like this is just speculating really.<br />The closest thing to information I got was [url=http://forums.3drealms.com/vb/showthread.php?t=18503]Joe Siegler[/url] of Apogee/3DR/Dopefish saying:<br /><br />[quote]<b><i>Quote:</i></b>[hr]Money is not the issue. Besides, I doubt you could raise enough money to MAKE IT all about money.[hr][/quote]<br /><br />I don't know how much he knows about the whole situation, but I'm sure he knows more than the rest of us.<br />Again, Keen becoming more popular isn't automatically a bad thing.<br />If id won't ever give him up, won't ever make actually new, and good games themselves, or let others do that (I doubt either will happen in this reality), the original Keen games becoming popular is actually a nice thing to happen.<br /><br />As for the \"People will tie Keen to bad graphics\" comment, please do a little research before saying something like that.<br />Check [url=http://en.wikipedia.org/wiki/Xbox_Live_Arcade]Xbox Live Arcade[/url] on Wikipedia for instance, notice the other \"bad-looking\", even much worse looking games that have been released.<br />Mind you, it isn't just old games being release through there, it's also brand new, relatively simple/small, but original games.<br />They are a bit more indie than what you buy in the stores boxed, but that doesn't mean they aren't fun in their own right.Retodon8<br />Sheep happens! [url=http://keen.retodon8.net/][img]http://retodon8.net/Keen/Graphics/K1_nme_Yorp.gif[/img][/url]"
	},
	{
		"id": 2150,
		"title": "Re: Should Keen be ported to Xbox Live Arcade?",
		"author_id": 1486145,
		"author_name": "crystalcaves",
		"timestamp": "2007-05-31T12:09:42.000Z",
		"content": "i now play keen on my modded xbox more than i play xbox games. only thing is that many mods dont wanna load, on behalf of my not knowing how to use dosbox properly.<br />i get the same error messages on the box as the pc dosbox.<br /><br />can anyone offer any tips ?<br /><br />i would love to play all the mods right thru, on a tv."
	}
]
