[
	{
		"id": 324,
		"title": "Blood and Ink (Fanfic)",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-10T14:16:20.000Z",
		"content": "Okay everyone, I need your help on this; while I think my terribly poor writing style has improved enough that I can start something worth finnishing, I'll still need lots of criticism so I can improve on what I produce, otherwise I'm not going to get any better. So I want to hear feedback from people, both on errors I make, problems and plot suggestions, I wanna hear thos keyboards a-typing!<br /><br />That said, I begin my first proper fanfic:<br /><br /><br /><b>Blood and</b><br /><br />Part 1:[/b]<br /><br />Books are strange things; what they do in the world, once freed from the minds of their authors, is unknown and down to chance. Sometimes however fate plays particularly cruel tricks, much like in the case of Friedrich Engels, a well off Englishman who became rather upset about the living conditions of the workers at his factory. From this he produced his first book; '<i>The Condition of the Working Class in England in 1844</i>'; a modest tome, it suggested a better, more equitable way of doing things, one that Engels hoped would help him live up to his namesake, and improve life for all men.<br /><br />This book greatly impressed a certain Karl Marx, and the two men became great friends, indeed, without this friendship it is certain Marx would never have lived past thirty.<br /><br />To this date Russian Communism, a direct product of the writings of Marx, and Engels, is said to have killed several hundred million people, crippled a country and produced the psychotic mass murder and ankle biter Xky Rauh.<br /><br />Unintended consequences of the highest order, most certainly.<br /><br />And indeed, had not the aforesaid book been written, communism risen, fallen and produced a certain right hand man, other tragic consequences may also have been averted. But alas, things are as they are, and cannot be changed.<br /><br />* * *<br /><br />Sedna Heelicht put down his cup of Acris*, which was, to his disgust, stone cold. Evidently he'd forgotten about it too long. It was a chill night, and he really wanted something to warm him up. Of course there was always the Conetine**; he walked over to his old mahogany desk and opened the small drawer it was in.<br /><br />The bottle shattered on the floor unheeded, its volitile liquid leaving a fruity smell in the air. Sedna tottered forward in shock, slowly walking to the pedestal where the Book had been, just miniutes before. It was impossible, how could anyone have taken it? He was a trained Vortninja, with hearing sharp enough to tell when his fleas were shifting, and he'd locked the place tight, it was always locked.<br /><br />Yet, there, as if mocking him, was the empty pedestal, nothing disturbed except for the absence of the Book. Even the layer of dust was unstirred.<br /><br />But there was something else, leaning lazily against the pedestal's base, placed there by the thief in a balant act of mockery and belittlement. It was some sort of helmet, green and white and yellow, pockmarked and stained and bearing strange insriptions. Beside it was a single candybar.<br /><br />Sedna would have growled in rage had he the courage to do so against his mounting fear. Who had done this and why? What were they to do with the book, and if they had been so smart as to take it from under his nose, how could he stop them?<br /><br />Outside the wind howled around the lone figure, almost invisible in the dark, as he rushed away from the Vorticon settlement.<br /><br />* * *<br /><br />*A vorticon equivalent of coffee, made by roasting Acara nuts, grinding them to a powder and adding hot water and Meep milk.<br /><br />**An alcoholic beverage made, in the usual way by mashing something up and letting it ferment, in this case, rats.<br /><br /><br />[img]http://ic3.deviantart.com/fs18/f/2007/130/e/6/The_Bookbinder_by_Ziblink.png[/img]<br /><br /><i>Sedna Heelicht</i><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9651,
		"title": "Re: Blood and Ink (Fanfic)",
		"author_id": 297097,
		"author_name": "grafix",
		"timestamp": "2007-05-10T16:55:20.000Z",
		"content": "Interesting. I'm fairly sure Xky asked for people to quit taking the piss out of him, but hopefully he'll let it slide. (Or was it just about the \"Vorticon girlfriend\" joke? I forget.)"
	},
	{
		"id": 9652,
		"title": "Re: Blood and Ink (Fanfic)",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-05-10T16:57:52.000Z",
		"content": "LLa wrote:<br /><br />\"To this date Russian Communism, a direct product of the writings of Marx, and Engels, is said to have killed several hundred million people, crippled a country and produced the psychotic mass murder and ankle biter Xky Rauh.\"<br /><br />Xky Rauh won't like this, I'm sure.------------------<br /><b>SM:</b> <i>\"I could go and write a page about the Theory of Relativity (or whatever it's called), but, what is the point if I don't know what the Theory of Relativity is?\"</i><br /><br />[url=http://shadowm2006.sitesled.com/]My website[/url]"
	},
	{
		"id": 9653,
		"title": "meh",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-05-10T22:01:41.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]<i>ShadowMaster wrote:</i><br />Xky Rauh won't like this, I'm sure. [hr][/quote]<br />Meh. <br /><br />[quote]<b><i>Quote:</i></b>[hr]<i>Levelass wrote:</i><br />I want to hear feedback from people[hr][/quote]<br />Lemme see what I can do.  My first reaction is that you need to use less commas, and more periods.  You string together too many individual thoughts in one sentence.  Take this one, for example:<br /><br />[quote]<b><i>Quote:</i></b>[hr]<br />Sometimes however fate plays particularly cruel tricks, much like in the case of Friedrich Engels, a well off Englishman who became rather upset about the living conditions of the workers at his factory.[hr][/quote]<br />I think it should be more like this:<br /><br /><i>Sometimes, however, fate plays particularly cruel tricks.  Such was the case for Friedrich Engels, a well-off Englishman, who became rather upset about the living conditions of the workers at his factory.</i><br /><br />Split it into two sentences, for starters, because the first part is about Fate, the second about Engels.<br /><br />The next sentence is even longer:<br />[quote]<b><i>Quote:</i></b>[hr]<br />From this he produced his first book; 'The Condition of the Working Class in England in 1844'; a modest tome, it suggested a better, more equitable way of doing things, one that Engels hoped would help him live up to his namesake, and improve life for all men.[hr][/quote]<br />Too long, mostly because it communicates three different ideas.  You should consider splitting this into three new sentences, each with a bit more meat to it.<br /><br /><br />Really, I think there's a distinct difference between a right-hand man and a mercenary, just as there's a difference between a hero and a leader. <br /><br />Also, are you sure you're using [url=http://www.phrases.org.uk/meanings/ankle-biter.html]ankle[/url] [url=http://www.urbandictionary.com/define.php?term=ankle-biter]biter[/url] appropriately?  What characteristics about this Xky character are you trying to convey?"
	},
	{
		"id": 9654,
		"title": "Re: meh",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-05-11T13:28:27.000Z",
		"content": "Not that one; I must remember that different countries seem to use the same saying in different ways. I shall attempt to shorten my sentences in future.<br /><br />A right hand man is a mercenary paid well enough towork for one guy.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9655,
		"title": "!",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-05-11T13:55:09.000Z",
		"content": "...or loyal enough that he doesn't need money, at all.  :P"
	},
	{
		"id": 9656,
		"title": "Busy",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-06-03T23:40:50.000Z",
		"content": "Ah, busy busy, busy! (You know, I can't edit any of my posts in this thread; it says I've edited them, but the content never changes!)<br /><br /><b>Part 2:</b><br /><br />Billy Blaze (Christened William Joseph Blazkowicz II), ordinary 8-and-a-bit year old boy, living a normal life, in a normal street, somewhere in a normal state of earth's second greatest superpower. Despite his alarmingly high grades, a perfectly normal kid.<br /><br />Or so it seems.<br /><br />Billy made the final adjustments to his linear displacement cannon and stood back admiringly. Not that it was anything most people would admire; it was little more than a bunch of wires, scrawling randomly about a few hunks of plastic and metal, but the underlying mechanism had been completed; making it compact and sleek was easy enough, and totally irrelevant. Mortimer was into sleek and efficient, and he could have it.<br /><br />\"Billy! We have guests, will you come inside?\"<br /><br />Billy sighed and put down his sonic screwdriver, (A gift from an old friend of his.) turned out the lights and shut the door to his 'secret' backyard clubhouse. Great, just great; it'd be inside all afternoon bored as anything while his mother nattered away to another one of her insufferable friends. And he wouldn't even be able to distract himself; he'd been in hot water since the previous day when his brother's football helmet had gone missing. Of course, everyone knew he wore it now and then. (Hell, if they only knew how much.) and so he'd been blamed and given no chance to explain. (Not that he could as it was.) To think, after all he'd been through with it, his brother was the one to loose it, probably dropped it after getting concussed on the field. And to make things worse, his mother had slipped bleach instead of washing powder into the wash and turned his favorite purple shirt bright pink!<br /><br />He trudged recalcitrantly inside. (You get to use such long words when you have an IQ of 314.) to meet his mother. As expected she was with another woman, one of the mother set if Keen knew anything, and even worse sitting down on the couch and fiddling annoyingly was a young girl, about his age. Billy's heart sank.<br /><br />\"Billy, this is Marta, she just moved here, and doesn't have a lot of friends, so-\"<br /><br />Keen hated her as soon as he saw her; she had some kind of, almost a field of annoyance about her, just like his little sister, but more malevolent. They would not get along, they would fight in that lop sided way two people of opposite gender and low maturity do, especially at school. And it would definitely, absolutely, no matter what adults said, never be because of  repressed likings.<br /><br />\"- me and Charlene thought it would be great if you made her feel welcome!\"<br /><br />The sentence cut short Billy's introspection as a cold chill crept up his spine. Oh for the love of God, what was she thinking? Why did parents always have to do this?<br /><br />\"Awww Mom, you know I like to be by myself!\"<br /><br />\"I know, that's why you should make a friend.\"<br /><br />\"She's a <b>girl!</b>\"<br /><br />\"My,a ren't you a smart one today? Now that we've confirmed that fact, why don't you go show her your clubhouse?\"<br /><br />\"My CLUBHOUSE? Mom! That's secret!\"<br /><br />\"Sounds wonderful, well, we'll be out on the porch if you need us, have fun!\"<br /><br />Keen glared at this newest intrusion, and she stared back with a bored enthusiasm, as if eager to see how bad things could get. It was not going to be a good day.<br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/pikersu.jpg[/img]<br /><i>Billy and Marta.</i><br />[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9657,
		"title": "Re: Busy",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-06-04T06:42:25.000Z",
		"content": "\"And it would definitely, absolutely, no matter what adults said, be because of repressed likings.\"<br /><br />Man, this Keen is an insightful one.. unless there's supposed to be a \"never\" here.[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 9658,
		"title": "Re: Busy",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-06-04T12:11:40.000Z",
		"content": "Yeah, it probably should have 'never' in there. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img] <br /><br />Anyways, fun beginning of a story, and a nice drawing. Haha.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9659,
		"title": "Hehe",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-06-04T12:29:22.000Z",
		"content": "I'm too lazy right now to offer criticism. I shall in due time, however. For now, let it be said that it's well constructed and the snippets of humour (and references to the Doctor) laced throughout add to the atmosphere nicely.<br /><br />Marta reminds me of a yorp. I'm sure she'll get along with Spot quite well."
	},
	{
		"id": 9660,
		"title": "Lazy",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-06-24T16:00:08.000Z",
		"content": "Ah Spleen, always too lazy!<br /><br /><b>Part 3:</b><br /><br />Billy grumbled, but lead the way to his clubhouse nonetheless, under his mother's watchful eye. Once inside the rather cramped quarters he tried his best to point out things of interest.<br /><br />\"That's the T.V, that's the table, that's the paper, that's Spot, don't poke his eye.\"<br /><br />\"What's<b> that?</b>\"<br /><br />\"Aha! Got a good eye for technology I see! This is a Phototachyon Transciever; it's very complicated to explain, but basically it's an instantaneous interplanetary radio, capable of picking up any broadcast in tachyon format anywhere up to a radius of 400'000 light years!\"<br /><br />Marta sighed. \"Oh. Is that all, I made one of those.\"<br /><br />\"I highly doubt that.\"<br /><br />\"Whatever, where is anything <i>fun</i> around here?\"<br /><br />Billy sighed inwardly, there was no doubt about it, he'd have to use his <i>piece de resistance.</i> He held up his wristwatch computer.<br /><br />\"Behold!<i> Paddle War!</i> The ultimate game of skill and conquest!\"<br /><br />\"Isn't that just Pong?\"<br /><br />\"What? Are you mad? It's much more fun! You have no idea!\"<br /><br />\"It's so early 90s, is that all?\"<br /><br />Billy was mad despite himself; having one's lifetime of achievements in technical construction and programming brushed aside so blithely was bugging the heck out of him. Normally he wouldn't have done what he did, but in even the most selfless heart beats a little grain of pride and the desire to impress. He grabbed the corner of a dirty and disused canvas covering something large and bulky, it's shape hidden by the sheet, and jerked violently. The canvas came off in a flash revealing the ship beneath, for a second even Marta was silent.<br /><br />\"You want fun? How about my own personal interplanetary spaceship?\"<br /><br />\"Neat. Does it fly?\"<br /><br />\"Of course it flies, what did you expect it to do, kill bugs and remove pesky stains?\"<br /><br />\"Well, probably not as well as mine though.\"<br /><br />\"You... have a spaceship?\"<br /><br />\"Yeah. It's just... not working right now, it needs a few parts.\"<br /><br />\"Yeah... Well, mine's the genuine article lady.\"<br /><br />\"It's made of soup cans.\"<br /><br />\"At least mine works!\"<br /><br />\"Oh yeah? Prove it!\"<br /><br /><i>\"Fine! I will! Let's go somewhere!\"</i><br /><br /><br />[img]http://img.photobucket.com/albums/v499/Nevad/whoosh.jpg[/img]<br /><br />.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9661,
		"title": "Re: Lazy",
		"author_id": 1485753,
		"author_name": "KeenRush",
		"timestamp": "2007-06-26T10:07:07.000Z",
		"content": "Hah, that's a good one about Battle War. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-grin.gif[/img]  Cool drawing.3D Realms: \"Do you think there'll ever be a sequel to your game(s)?\"<br /><b>Tom Hall</b>: \"<i>If</i> I owned Keen, there sure would be. I <b>don't consider</b> that GBA game canon by any means.\""
	},
	{
		"id": 9662,
		"title": "Sadie",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-06-26T12:13:20.000Z",
		"content": "Hehe, Billy meets his match."
	},
	{
		"id": 9663,
		"title": "Re: Sadie",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-06-27T18:32:08.000Z",
		"content": "Finally read up on this. I need more! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] <br /><br />Hey, what about I put this story up where I'm keeping those old Tzen comics right now too, or something? Some content to add to one central place!<br /><br />Ok, some criticism: seems like you're still making huge sentences. Sometimes you're even using ; where you could easily put a . to end the sentence.<br /><br />The general structure seems fine, and I don't have much else to complain about (except the typos, but I forgive that).____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9664,
		"title": "Re: Sadie",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-06-28T09:30:56.000Z",
		"content": "Well, while we're in \"bag Levelass\" mood, I also find it a little annoying the way brackets are used as if they're an independent sentence, with a full stop and all, even though the sentence continues after the brackets:<br />[quote]<b><i>Quote:</i></b>[hr]Billy sighed and put down his sonic screwdriver, (A gift from an old friend of his.) turned out the lights and shut the door to his 'secret' backyard clubhouse.[hr][/quote]<br />While you're correct in that the meaning of the sentence is supposed to remain unchanged if you were to remove the sentence inside the brackets, the actual grammar and punctuation is supposed to follow more or less as if the brackets weren't there, so the above sentence should be more like this:<br /><br /><i>Billy sighed and put down his sonic screwdriver (a gift from an old friend of his), turned out the lights and shut the door to his 'secret' backyard clubhouse.</i><br /><br />Just a little thing that us pedantic people find slightly irritating [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 9665,
		"title": "Re: Sadie",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-06-28T10:59:35.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]I'll still need lots of criticism so I can improve on what I produce, otherwise I'm not going to get any better.[hr][/quote][quote]<b><i>Quote:</i></b>[hr]Well, while we're in \"bag Levelass\" mood,[hr][/quote]<br />She <i>wants</i> us to bag her. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9666,
		"title": "Re: Sadie",
		"author_id": 338828,
		"author_name": "Shadow Master",
		"timestamp": "2007-06-28T12:58:55.000Z",
		"content": "Malv, if you didn't notice it before, she writes that way in the wiki too. I was wondering if I should correct them.------------------------------<br />[url=http://shadowm2006.sitesled.com/]My website[/url]<br />[url=http://p072.ezboard.com/fpubliccommanderkeenforumfrm20.showMessage?topicID=12.topic]Get Windows/Linux native LModKeen 2 with integrated FIN2BMP![/url]. You know you want to.<br />[url=http://shadowm2006.sitesled.com/meta/projectpage.htm]The META engine for 2D games[/url]."
	},
	{
		"id": 9667,
		"title": "Re: Sadie",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-06-28T20:49:24.000Z",
		"content": "I have been [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img] <font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 9668,
		"title": "Re: Sadie",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-06-30T16:41:05.000Z",
		"content": "Good gracious! You mean brackets don't have to consist of complete sentences? My English teacher has utterly misled me! Does anyone have a snippet on proper bracket use?<br /><br />Man, this ruins all the writing I have ever done! No wonder nobody reads my stuff![img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9669,
		"title": "Re: Sadie",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-06-30T18:12:35.000Z",
		"content": "\"proper bracket use\" is pretending they're not there[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 9670,
		"title": "Re: Sadie",
		"author_id": 1485672,
		"author_name": "Malvineous",
		"timestamp": "2007-07-01T05:42:47.000Z",
		"content": "That's the problem with the way education is heading now - the teachers don't want to correct the students in case they scare them off and they stop trying...  At any rate, it seems your English teacher is partially correct - usage like this is accepted:<br /><br /><i>\"Mrs. Pennyfarthing (What? Yes, that was her name!) was my landlady.\"</i><br /><br />But that's more like an interruption to the sentence rather than additional information related to the sentence, not to mention it sounding like the style used in children's books from the 1950s.  [url=http://wsu.edu/~brians/errors/parentheses.html]This page[/url] seems to sum things up concisely.<br /><br />Interestingly enough: <i>In most writing, overuse of parentheses is usually a sign of a badly structured text.</i><font color=\"#EEF2EE\">[url=http://www.shikadi.net/keenwiki/]KeenWiki[/url] | [url=http://www.shikadi.net/moddingwiki/]ModdingWiki[/url]</font>"
	},
	{
		"id": 9671,
		"title": "Re: Sadie",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-02T12:00:28.000Z",
		"content": "Pete (that guy from whom I so gladly accepted a job offer) called back to tell me the job offer was declined.<br /><br />I think that's correct use too, unlike this:<br /><br />Pete (that guy from whom I so gladly accepted a job offer.) called back to tell me the job offer was declined.<br /><br />Strange how much a period in the wrong place can matter so much.<br />(That sounded kinda... eww!)____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9672,
		"title": "Staple",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-07-02T14:09:25.000Z",
		"content": "[hr]<b>DaVince</b> (That sounded kinda... eww!)<br />[hr][img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mortlol.gif[/img]  <br /><br />[hr]<b>DaVince</b> Pete (that guy from whom I so gladly accepted a job offer) called back to tell me the job offer was declined.<br />[hr]I'd have worded it more like this:<br /><br />[hr]Pete, from whom I had so gladly accepted a job offer, called back to tell me it was declined.<br />[hr]or:<br /><br />[hr]Pete called back to tell me the job offer, which I had so gladly accepted, had been declined.<br />[hr]<br />I prefer to use brackets for asides (especially when it's ironic), rather than essential information. The job offer is a key element of the topic at hand. The brackets make it seem like a small detail you almost forgot to mention.<br /><br />Thus, I would add to Malv's rule of thumb that the sentence should also make contextual sense if the brackets are removed (though there could be exceptions)."
	},
	{
		"id": 9673,
		"title": "Re: Staple",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-07-02T16:29:03.000Z",
		"content": "[quote]<b><i>Quote:</i></b>[hr]Interestingly enough: In most writing, overuse of parentheses is usually a sign of a badly structured text.[hr][/quote]<br /><br /><br />Aieeeee![img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9674,
		"title": "Re: Staple",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-07-02T21:31:56.000Z",
		"content": "I think we're having too much fun (with this).[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 9675,
		"title": "Re: Staple",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-03T00:11:53.000Z",
		"content": "Hey Levelass,<br /><br />How's it going with the next part? I have no patience when it comes to reading a good story. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-drool.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9676,
		"title": "Paperclip",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-07-10T17:20:42.000Z",
		"content": "Sorry, been busy lately, new semester and all that. Right, I think it's time I left Keen alone and went out to annoy Xky don't you?<br /><br />Yea, me too.<br /><br /><br />Part 4:<br /><br />Xky trudged up the steep hill and a reasonable pace, though not a very physical person, he was nonetheless very fit. And today he was in a good mood. There were just some days where everything went right. He took a deep breath of the morning air and enjoyed the warmth of the sun on his back as it rose behind him. His mood was improved no end by the long walk up what could easily be a small road, but was in fact the driveway to his house.(Well, one of them anyway.) It was delightfully situated atop the hillcrest, overlooking the city below and surrounded by several acres of immaculately kept gardens. 'If IBM knew how those gardens were kept so trim,' mused Xky, 'they'd probably offer him half the company, and he hadn't even invented the maintainence droids.'<br /><br />There was someone at his door, knocking politely, from their clothing and what they were carrying Xky quickly surmised who they were and what their purpose was. How had they got past the gates? The two young women were dressed smartly in formal clothing and carrying several slim magazines. One of them noticed his approach.<br /><br />\"Ah! Hello sir! Is this your house?\"<br /><br />\"Oh yes, nice isn't it?\"<br /><br />\"Very much so sir, this is the first time we've been able to stop by, but we've often admired it from the road.\"<br /><br />\"Oh yes, I chose the location especially. It had to be California.\"<br /><br />\"Oh? What makes you so enamored of our state?\"<br /><br />\"It's not bloody Russia that's what.\"<br /><br />\"Oh. Um, well then, we come to bring you the good news! Me and my associate Adis want-\"<br /><br /><b><i>\"You will not enter my abode!\"</i></b><br /><br /><br />Xky watched the two panicked witnesses flee down the pathway, tripping over shrubbery and flowerbeds in their rush to escape. He probably shouldn't have done that he mused, putting out a small fire that had started on the doorstep. Mortimer wouldn't want him exposing advanced technology to a bunch of doorknockers, but he really couldn't resist using the holographic distorter and pocket flamethrower. They might be back of course, but that's what the electric fence was for. Things just kept getting better! He opened the door and stepped inside.<br /><br />The familiar smell of failed cooking hit him as he walked down the hallway. True to form the kitchen was cluttered with dishes, a frying pan with something possibly eggs, that had been chipped out with a chisel, several mangled oranges and a juicer taken to bits, a torn open cereal box and last night's leftover's leftovers. Xky was glad this place quite literally ran itself, already the self cleaning kitchen was scrubbing away at the frying pan, eventually it might have to resort to high explosive.<br /><br />True to form Laurael was sitting in front of the tv surrounded by various plates of half eaten food in her pajamas apparently trying to eat three things at once while playing halo. (Very badly too.) Laur was a late riser, but she had singlehandedly invented the meal of brunchfast. She had the same attitude to cooking and eating as bulldozer drivers had to building; if you could recognize what it was, she wasn't eating it. She attempted to turn her head 270 degrees as Xky entered, falling over backwards into a plate of what may have once been bacon.<br /><br />\"Mmmf, hmmn-nn.\" Laur garbled, chewing wasn't one of her strong points. From what Xky could tell she'd meant to say 'You're back, late as usual.'<br /><br />\"Or early depending on your frame of reference.\"<br /><br />Laur swallwed. \"I'd say three days' absence is late, what are you <i>doing</i> down there?\"<br /><br />\"Oh we finished the calibration; the problems were the resonant frequencies; you understand that the negative feedback loops mean that the slightest physical or telementric abberation has exponential effects on performance and that the accuracy required to align all of the subtended units into a ringed pulse...\"<br /><br />Xky broke off at the look of utter incomprehension.<br /><br />\"We straightened all the computer cables; you see the zeroes can get through because they're round, but the ones get all stuck in sharp bends and that corrupts data. There was a lot to straighten out, you know how long it takes you to do your hair.\"<br /><br />\"Ah, of course. Cool.\"<br /><br />Xky understood the importance of keeping a contact with the Vorticon homeworld, and that it was almost impossible to hide a five and a half foot blue dog anywhere on earth (Aside from a few places where their contact was bound to get into trouble.) and of course you couldn't just lock her up in a cage somewhere but... well why not? Why his place? If he wasn't so busy he'd do something about the whole affair, there was bound to be some package twine and a tazer in the basement.<br /><br />Xky shook his head as he headed off for bed, stopping to grab a tv dinner from the fridge. He ate it quickly without warming, meals weren't important, not now. Hell, they were hardly important normally, sure he was a good cook (Or at least he could <i>actually</i> cook.) but there was always so much to do, this was an ambitious plan and so much could go wrong. He had a sick feeling in his stomach whenever he thought about it. (And even nibbling on a few blades of grass didn't help.) Nevermind, in a few days the danger period would pass, and nothing was going to stop him now, if there was one thing he was, it was loyal.<br /><br />Unheard by Xky Laurael snuck into the computer room, and after banging her head a few times on furniture, managed to get most of the kinks straightened out. There was a problem though, they were too long and kept curling up in corners. Finally he found a solution,  scissors and hairclips!<br /><br />.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9677,
		"title": "suggestion",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-07-11T01:52:45.000Z",
		"content": "Remember to make it clear who is speaking--the only reason I could attribute \"Oh.  You're back.  Late as usual.\"  to Laurel was because the entire previous paragraph had been about her--what made it confusing was the fact that the last -sentence- before the paragraph's end referred to -both- characters.  <br /><br />Some of your commas could stand to become semicolons; the first comma in each paragraph of Xky explaining the process to Laurel is a good example.  \"Oh, we finished the calibration; blah blah...\" and later, \"We straightened all the cables; blah blah blah.\"  I think you could stand to use a few more commas in your work, as well.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  Maybe it's just my own way of interpretting sentences, but I feel like you run your thoughts a bit on the long side, most of the time.<br /><br />I will admit, the first words out of the messy Vorticon's mouth surprised me--they made her seem very collected and intelligent.  Was that your intention?  You could avoid it by transcribing how the same dialogue might sound while speaking with one's mouth full, or using that bit of information as a leadup to the dialogue itself (which, in turn, would help clarify who was speaking first).  \"Laurel landed on her elbows, propping herself up and tilting her head to one side (to retain as much food as possible) as she spoke.\"  <br /><br />...Something like that, anyway.  Looking forward to more about Keen and his new friend.  :P"
	},
	{
		"id": 9678,
		"title": "Re: suggestion",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-07-11T15:34:27.000Z",
		"content": "That's the problem, I try to change, but my writing style is subbourn![img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	},
	{
		"id": 9679,
		"title": "Re: suggestion",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-11T17:29:29.000Z",
		"content": "*Stubborn<br /><br />Haha, this was unexpected. The \"me and my associate Adis want-\" part made me laugh. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-lol.gif[/img]  <br /><br />Nice character choice. I'm curious to see how things will be working out, and what disaster of small scale Laurael might cause. [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-cheeky.gif[/img]  ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9680,
		"title": "Re: suggestion",
		"author_id": 1486463,
		"author_name": "KeenEmpire",
		"timestamp": "2007-07-13T07:55:23.000Z",
		"content": "ooh, i like[quote]<b><i>Quote:</i></b>[hr]Just remember that this is the year of the elite devil.<br /><br />1337 + 666 = 2003[hr][/quote][img]http://img259.imageshack.us/img259/3852/sheepsmall0sf.jpg[/img] <br />[url=http://trailers.apple.com/trailers/independent/blacksheep/trailer/]trailers.apple.com/trailers/independent/blacksheep/trailer/[/url]"
	},
	{
		"id": 9681,
		"title": "say...",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-07-13T19:37:05.000Z",
		"content": "By the way--where's this chapter's picture?  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>"
	},
	{
		"id": 9682,
		"title": "Re: say...",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-14T10:00:51.000Z",
		"content": "Maybe she found it too daring to actually make a drawing of Xky? [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-mischief.gif[/img] ____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 9683,
		"title": "Re: say...",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-07-18T18:06:56.000Z",
		"content": "I drew a picture of Laurael tangled in computer cables but decided not to post it.[img]http://img.photobucket.com/albums/v499/Nevad/menbun.gif[/img]<br /><br />Awww! Feel the love!"
	}
]
