[
	{
		"id": 644,
		"title": "Keen 4 Mini-Mod Contest Results",
		"author_id": 360657,
		"author_name": "Commander Spleen",
		"timestamp": "2007-07-17T03:12:13.000Z",
		"content": "Over the past few months, Andy has been running a competition at Keen:Modding for Keen 4 mini-mods (a similar concept to the Keen:Vorticons one-level mod contest), in an attempt to get more people over the Keen 4 barrier.<br /><br />Alas, there were only three entries, but they're some wonderful examples of where Keen 4-6 modding can take us. All three happen to exemplify a different element of modding. Xky demonstrates some intriguing patchwork, Levellass presents us with a promising atmospheric environment, and ZXD has successfully tackled sound effects and music.<br /><br />Read about the competition and download the mods [url=http://www.keenmodding.org/viewtopic.php?t=924]here[/url]."
	},
	{
		"id": 16586,
		"title": "Re: Keen 4 Mini-Mod Contest Results",
		"author_id": 40038,
		"author_name": "DaVince21",
		"timestamp": "2007-07-17T16:31:57.000Z",
		"content": "Great to hear this, I shall download these immediately! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]   <br /><br />Congratulations on first place, Levelass! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-offended.gif[/img]   Well done, Xky and Zero Diamond! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-smile.gif[/img]  <br /><br />EDIT: Oh No, this is terrible! Xky's mod doesn't even want to start and Levelass's mod crashes as soon as I proceed to the main menu! [img]http://www.classicgaming.com/cc314/msgboard/emotikeen-sad.gif[/img]  The wizard mod crashed fairly soon too (when approaching one of those enemies, as stated in the forum post).____________<br />Don't think of me as an ordinary man.<br /><br />Even though I am an ordinary man.<br /><br />Ah, [url=http://DaVince.sitesled.com/]site.[/url]"
	},
	{
		"id": 16587,
		"title": "hehe",
		"author_id": 1296984,
		"author_name": "XkyRauh2001",
		"timestamp": "2007-07-17T18:44:40.000Z",
		"content": "I zipped up my entry as if it was an actual MOD-mod... just make a folder with a core copy of Keen4, and then unzip my entry into the folder--it will run fine from there.<br /><br />Levellass's entry works the same way.<br /><br />ZXD's game crashes because rather than spawning Slug poop, the Poison Slug (Necromancer) attempts to spawn a Wormouth... if you go to a level which has both Slugs and Wormouths in it by default, the Necromancers will work great.  <img src=\"https://groups.tapatalk-cdn.com/smilies/27135/1534636883.9457-smiley.gif?ttinline=true\"/>  This is something that can be fixed with a little TED5 work--and I'm sure it will be resolved by the time the final release comes around.<br /><br />Furthermore, ZXD has to get his Sound and Music Tutorial up and running--I know we're all eager to have a mod without \"Kick in the Pants\" playing.  :P"
	},
	{
		"id": 16588,
		"title": "Patch",
		"author_id": 1485832,
		"author_name": "Levelass",
		"timestamp": "2007-07-18T18:11:14.000Z",
		"content": "A simple sprite cache patch would fix that, it's what I made them for...<br /><br />(And why do I keep getting logged out of this forum? It's tedious!)"
	}
]
